[
    {
        "id": 1364,
        "chapter": 10,
        "verse": 1,
        "arabic_text": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ",
        "phonetic": "10.1 'Alif-Lām-Rā Tilka 'Āyātu Al-Kitābi Al-Ĥakīmi",
        "footnotes": {
            "english_saheeh": "[510]- See footnote to 2:1.\n[511]- The adjective \"wise\" expresses the qualities of will, purpose, discrimination and precision.",
            "english_hilali_khan": "(V.10:1) Al-Hakîm: showing lawful and unlawful things, explaining Allâh’s (Divine) Laws for mankind, leading them to eternal happiness by ordering them to follow the true Islâmic Monotheism, -worshipping none but Allâh Alone- that will guide them to Paradise and save them from Hell.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Alif, Lām, Rā.[510] These are the verses of the wise[511] Book.",
            "english_hilali_khan": "Alif-Lâm-Râ. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings]. These are the Verses of the Book (the Qur’ân) Al-Hakîm [1]",
            "english_rwwad": "Alif Lām Ra. These are the verses of the Book of wisdom."
        }
    },
    {
        "id": 1365,
        "chapter": 10,
        "verse": 2,
        "arabic_text": "أَكَانَ لِلنَّاسِ عَجَبًا أَنۡ أَوۡحَيۡنَآ إِلَىٰ رَجُلٖ مِّنۡهُمۡ أَنۡ أَنذِرِ ٱلنَّاسَ وَبَشِّرِ ٱلَّذِينَ ءَامَنُوٓاْ أَنَّ لَهُمۡ قَدَمَ صِدۡقٍ عِندَ رَبِّهِمۡۗ قَالَ ٱلۡكَٰفِرُونَ إِنَّ هَٰذَا لَسَٰحِرٞ مُّبِينٌ",
        "phonetic": "10.2 'Akāna Lilnnāsi `Ajabāan 'An 'Awĥaynā 'Ilá Rajulin Minhum 'An 'Andhiri An-Nāsa Wa Bashiri Al-Ladhīna 'Āmanū 'Anna Lahum Qadama Şidqin `Inda Rabbihim Qāla Al-Kāfirūna 'Inna Hādhā Lasāĥirun Mubīnun",
        "footnotes": {
            "english_saheeh": "[512]- i.e., a sure position due to their righteous deeds.",
            "english_hilali_khan": "(V.10:2) See the footnote of (V.4:163).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have the people been amazed that We revealed [revelation] to a man from among them, [saying], \"Warn mankind and give good tidings to those who believe that they will have a [firm] precedence of honor[512] with their Lord\"? [But] the disbelievers say, \"Indeed, this is an obvious magician.\"",
            "english_hilali_khan": "Is it a wonder for mankind that We have sent Our Revelation[2] to a man from among themselves (i.e. Prophet Muhammad صلى الله عليه وسلم) (saying): \"Warn mankind (of the coming torment in Hell), and give good news to those who believe (in the Oneness of Allâh and in His Prophet Muhammad صلى الله عليه وسلم) that they shall have with their Lord the rewards of their good deeds?\" (But) the disbelievers say: \"This is indeed an evident sorcerer (i.e. Prophet Muhammad صلى الله عليه وسلم and the Qur’ân)!",
            "english_rwwad": "Is it surprising to people that We have sent revelation to a man from among themselves to warn people and give glad tidings to those who believe, that they will have a noble position with their Lord? But the disbelievers say, “This man is a clear magician!”"
        }
    },
    {
        "id": 1366,
        "chapter": 10,
        "verse": 3,
        "arabic_text": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يُدَبِّرُ ٱلۡأَمۡرَۖ مَا مِن شَفِيعٍ إِلَّا مِنۢ بَعۡدِ إِذۡنِهِۦۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ فَٱعۡبُدُوهُۚ أَفَلَا تَذَكَّرُونَ",
        "phonetic": "10.3 'Inna Rabbakumu Allāhu Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Fī Sittati 'Ayyāmin Thumma Astawá `Alá Al-`Arshi Yudabbiru Al-'Amra Mā Min Shafī`in 'Illā Min Ba`di 'Idhnihi Dhalikumu Allāhu Rabbukum Fā`budūhu 'Afalā Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "[513]- See footnotes to 2:19 and 7:54.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord is Allāh, who created the heavens and the earth in six days and then established Himself above the Throne,[513] arranging the matter [of His creation]. There is no intercessor except after His permission. That is Allāh, your Lord, so worship Him. Then will you not remember?",
            "english_hilali_khan": "Surely, your Lord is Allâh Who created the heavens and the earth in six Days and then rose over (Istawâ ) the Throne (really in a manner that suits His Majesty), disposing the affair of all things. No intercessor (can plead with Him) except after His Leave. That is Allâh, your Lord; so worship Him (Alone). Then, will you not remember?",
            "english_rwwad": "Allah is your Lord Who created the heavens and earth in six Days, and then rose over the Throne, governing all affairs. None can intercede except by His permission. Such is Allah your Lord, so worship Him. Will you not then take heed?"
        }
    },
    {
        "id": 1367,
        "chapter": 10,
        "verse": 4,
        "arabic_text": "إِلَيۡهِ مَرۡجِعُكُمۡ جَمِيعٗاۖ وَعۡدَ ٱللَّهِ حَقًّاۚ إِنَّهُۥ يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ لِيَجۡزِيَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ بِٱلۡقِسۡطِۚ وَٱلَّذِينَ كَفَرُواْ لَهُمۡ شَرَابٞ مِّنۡ حَمِيمٖ وَعَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡفُرُونَ",
        "phonetic": "10.4 'Ilayhi Marji`ukum Jamī`āan Wa`da Allāhi Ĥaqqāan 'Innahu Yabda'u Al-Khalqa Thumma Yu`īduhu Liyajziya Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Bil-Qisţi Wa Al-Ladhīna Kafarū Lahum Sharābun Min Ĥamīmin Wa `Adhābun 'Alīmun Bimā Kānū Yakfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "To Him is your return all together. [It is] the promise of Allāh [which is] truth. Indeed, He begins the [process of] creation and then repeats it that He may reward those who have believed and done righteous deeds, in justice. But those who disbelieved will have a drink of scalding water and a painful punishment for what they used to deny.",
            "english_hilali_khan": "To Him is the return of all of you. The Promise of Allâh is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed (in the Oneness of Allâh - Islâmic Monotheism) and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.",
            "english_rwwad": "To Him is your return all together. Allah’s promise will surely come true. He originates the creation then brings it back, so that He may justly reward those who believe and do righteous deeds. But for those who disbelieve there will be a drink of scalding water and a painful punishment because of their disbelief."
        }
    },
    {
        "id": 1368,
        "chapter": 10,
        "verse": 5,
        "arabic_text": "هُوَ ٱلَّذِي جَعَلَ ٱلشَّمۡسَ ضِيَآءٗ وَٱلۡقَمَرَ نُورٗا وَقَدَّرَهُۥ مَنَازِلَ لِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ مَا خَلَقَ ٱللَّهُ ذَٰلِكَ إِلَّا بِٱلۡحَقِّۚ يُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ",
        "phonetic": "10.5 Huwa Al-Ladhī Ja`ala Ash-Shamsa Điyā'an Wa Al-Qamara Nūrāan Wa Qaddarahu Manāzila Lita`lamū `Adada As-Sinīna Wa Al-Ĥisāba Mā Khalaqa Allāhu Dhālika 'Illā Bil-Ĥaqqi Yufaşşilu Al-'Āyāti Liqawmin Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who made the sun a shining light and the moon a derived light and determined for it phases - that you may know the number of years and account [of time]. Allāh has not created this except in truth. He details the signs for a people who know.",
            "english_hilali_khan": "It is He Who made the sun a shining thing and the moon as a light and measured out for it stages that you might know the number of years and the reckoning. Allâh did not create this but in truth. He explains the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail for people who have knowledge.",
            "english_rwwad": "It is He Who made the sun a radiant light and the moon a reflected light, and precisely determined its phases, so that you may know the number of years and account [of time]. Allah has not created all of this except for a true purpose. He makes the signs clear for people who know."
        }
    },
    {
        "id": 1369,
        "chapter": 10,
        "verse": 6,
        "arabic_text": "إِنَّ فِي ٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَا خَلَقَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَّقُونَ",
        "phonetic": "10.6 'Inna Fī Akhtilāfi Al-Layli Wa An-Nahāri Wa Mā Khalaqa Allāhu Fī As-Samāwāti Wa Al-'Arđi La'āyātin Liqawmin Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, in the alternation of the night and the day and [in] what Allāh has created in the heavens and the earth are signs for a people who fear Allāh.",
            "english_hilali_khan": "Verily, in the alternation of the night and the day and in all that Allâh has created in the heavens and the earth are Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) for those people who keep their duty to Allâh, and fear Him much.",
            "english_rwwad": "Indeed, in the alternation of the night and day, and in what Allah has created in the heavens and earth, there are signs for people who fear Him."
        }
    },
    {
        "id": 1370,
        "chapter": 10,
        "verse": 7,
        "arabic_text": "إِنَّ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا وَرَضُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَٱطۡمَأَنُّواْ بِهَا وَٱلَّذِينَ هُمۡ عَنۡ ءَايَٰتِنَا غَٰفِلُونَ",
        "phonetic": "10.7 'Inna Al-Ladhīna Lā Yarjūna Liqā'anā Wa Rađū Bil-Ĥayāati Ad-Dunyā Wa Aţma'annū Bihā Wa Al-Ladhīna Hum `An 'Āyātinā Ghāfilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who do not expect the meeting with Us and are satisfied with the life of this world and feel secure therein and those who are heedless of Our signs -",
            "english_hilali_khan": "7. Verily, those who hope not for their meeting with Us, but are pleased and satisfied with the life of the present world, and those who are heedless of Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.),",
            "english_rwwad": "Those who do not expect to meet Us, and are pleased and content with the life of this world, and those who are heedless of Our signs,"
        }
    },
    {
        "id": 1371,
        "chapter": 10,
        "verse": 8,
        "arabic_text": "أُوْلَٰٓئِكَ مَأۡوَىٰهُمُ ٱلنَّارُ بِمَا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "10.8 'Ūlā'ika Ma'wāhumu An-Nāru Bimā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For those their refuge will be the Fire because of what they used to earn.",
            "english_hilali_khan": "Those, their abode will be the Fire, because of what they used to earn.",
            "english_rwwad": "their abode will be the Fire, for what they used to earn."
        }
    },
    {
        "id": 1372,
        "chapter": 10,
        "verse": 9,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ يَهۡدِيهِمۡ رَبُّهُم بِإِيمَٰنِهِمۡۖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ فِي جَنَّٰتِ ٱلنَّعِيمِ",
        "phonetic": "10.9 'Inna Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Yahdīhim Rabbuhum Bi'īmānihim Tajrī Min Taĥtihimu Al-'Anhāru Fī Jannāti An-Na`īmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:9) Who believe in the Oneness of Allâh along with the six articles of Faith, i.e. to believe in Allâh, His Angels, His Books, His Messengers, Day of Resurrection, and Al-Qadar (Divine Preordainments) - Islâmic Monotheism.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have believed and done righteous deeds - their Lord will guide them because of their faith. Beneath them rivers will flow in the Gardens of Pleasure.",
            "english_hilali_khan": "Verily, those who believe,[1] and do deeds of righteousness, their Lord will guide them through their Faith; under them will flow rivers in the Gardens of Delight (Paradise).",
            "english_rwwad": "As for those who believe and do righteous deeds, their Lord will guide them by virtue of their faith. Rivers will flow beneath them in the Gardens of Bliss."
        }
    },
    {
        "id": 1373,
        "chapter": 10,
        "verse": 10,
        "arabic_text": "دَعۡوَىٰهُمۡ فِيهَا سُبۡحَٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمۡ فِيهَا سَلَٰمٞۚ وَءَاخِرُ دَعۡوَىٰهُمۡ أَنِ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "10.10 Da`wāhum Fīhā Subĥānaka Al-Lahumma Wa Taĥīyatuhum Fīhā Salāmun Wa 'Ākhiru Da`wāhum 'Ani Al-Ĥamdu Lillāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Their call therein will be, \"Exalted are You, O Allāh,\" and their greeting therein will be, \"Peace.\" And the last of their call will be, \"Praise to Allāh, Lord of the worlds!\"",
            "english_hilali_khan": "Their way of request therein will be Subhânaka Allâhumma (Glory to You, O Allâh!) and Salâm (peace, safety from evil) will be their greetings therein (Paradise)! and the close of their request will be: Al-Hamdu Lillâhi Rabb-il-‘Âlamîn [All the praises and thanks be to Allâh, the Lord of ‘Âlamîn (mankind, jinn and all that exists)].",
            "english_rwwad": "Their prayer will be, “Glorify be to You, O Allah,” and their greeting will be, “Peace,” and the closing of their prayer will be, “All praise be to Allah, the Lord of the worlds.”"
        }
    },
    {
        "id": 1374,
        "chapter": 10,
        "verse": 11,
        "arabic_text": "۞ وَلَوۡ يُعَجِّلُ ٱللَّهُ لِلنَّاسِ ٱلشَّرَّ ٱسۡتِعۡجَالَهُم بِٱلۡخَيۡرِ لَقُضِيَ إِلَيۡهِمۡ أَجَلُهُمۡۖ فَنَذَرُ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ",
        "phonetic": "10.11 Wa Law Yu`ajjilu Allāhu Lilnnāsi Ash-Sharra Asti`jālahum Bil-Khayri Laquđiya 'Ilayhim 'Ajaluhum Fanadharu Al-Ladhīna Lā Yarjūna Liqā'anā Fī Ţughyānihim Ya`mahūna",
        "footnotes": {
            "english_saheeh": "[514]- In anger or in heedlessness.\n[515]- i.e., Allāh would have destroyed them on account of that.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if Allāh was to hasten for the people the evil [they invoke][514] as He hastens for them the good, their term would have been ended for them.[515] But We leave the ones who do not expect the meeting with Us, in their transgression, wandering blindly.",
            "english_hilali_khan": "And were Allâh to hasten for mankind the evil (they invoke for themselves and for their children. while in a state of anger) as He hastens for them the good (they invoke) then they would have been ruined. So We leave those who expect not their meeting with Us, in their trespasses, wandering blindly in distraction. (Tafsir At-Tabarî)",
            "english_rwwad": "If Allah were to hasten evil to the people, just as they seek to hasten good, they would have been ruined. But We leave those who do not expect to meet Us to wander blindly in their transgression."
        }
    },
    {
        "id": 1375,
        "chapter": 10,
        "verse": 12,
        "arabic_text": "وَإِذَا مَسَّ ٱلۡإِنسَٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦٓ أَوۡ قَاعِدًا أَوۡ قَآئِمٗا فَلَمَّا كَشَفۡنَا عَنۡهُ ضُرَّهُۥ مَرَّ كَأَن لَّمۡ يَدۡعُنَآ إِلَىٰ ضُرّٖ مَّسَّهُۥۚ كَذَٰلِكَ زُيِّنَ لِلۡمُسۡرِفِينَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "10.12 Wa 'Idhā Massa Al-'Insāna Ađ-Đurru Da`ānā Lijanbihi 'Aw Qā`idāan 'Aw Qā'imāan Falammā Kashafnā `Anhu Đurrahu Marra Ka'an Lam Yad`unā 'Ilá Đurrin Massahu Kadhālika Zuyyina Lilmusrifīna Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:12) Musrifûn Those who belied Allâh and His Prophets, and transgressed Allâh’s limits by committing all kinds of crimes and sins.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when affliction touches man, he calls upon Us, whether lying on his side or sitting or standing; but when We remove from him his affliction, he continues [in disobedience] as if he had never called upon Us to [remove] an affliction that touched him. Thus is made pleasing to the transgressors that which they have been doing.",
            "english_hilali_khan": "And when harm touches man, he invokes Us, lying on his side, or sitting or standing. But when We have removed his harm from him, he passes on as if he had never invoked Us for a harm that touched him! Thus it is made fair-seeming to the Musrifûn[2] that which they used to do.",
            "english_rwwad": "When hardship befalls man, he calls upon Us, whether lying on his side, sitting or standing. But when We remove his hardship, he turns a blind eye as though he had never called upon Us to remove his hardship. This is how the misdeeds of the transgressors are made appealing to them."
        }
    },
    {
        "id": 1376,
        "chapter": 10,
        "verse": 13,
        "arabic_text": "وَلَقَدۡ أَهۡلَكۡنَا ٱلۡقُرُونَ مِن قَبۡلِكُمۡ لَمَّا ظَلَمُواْ وَجَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ وَمَا كَانُواْ لِيُؤۡمِنُواْۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ",
        "phonetic": "10.13 Wa Laqad 'Ahlaknā Al-Qurūna Min Qablikum Lammā Žalamū Wa Jā'at/hum Rusuluhum Bil-Bayyināti Wa Mā Kānū Liyu'uminū Kadhālika Najzī Al-Qawma Al-Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had already destroyed generations before you when they wronged, and their messengers had come to them with clear proofs, but they were not to believe. Thus do We recompense the criminal people.",
            "english_hilali_khan": "And indeed, We destroyed generations before you when they did wrong, while their Messengers came to them with clear proofs, but they were not such as to believe! Thus do We requite the people who are Mujrimûn (disbelievers, polytheists, sinners, criminals).",
            "english_rwwad": "We destroyed the generations before you when they indulged in wrongdoing, and their messengers came to them with clear proofs, but they would not believe. This is how We recompense the wicked people."
        }
    },
    {
        "id": 1377,
        "chapter": 10,
        "verse": 14,
        "arabic_text": "ثُمَّ جَعَلۡنَٰكُمۡ خَلَٰٓئِفَ فِي ٱلۡأَرۡضِ مِنۢ بَعۡدِهِمۡ لِنَنظُرَ كَيۡفَ تَعۡمَلُونَ",
        "phonetic": "10.14 Thumma Ja`alnākum Khalā'ifa Fī Al-'Arđi Min Ba`dihim Linanžura Kayfa Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We made you successors in the land after them so that We may observe how you will do.",
            "english_hilali_khan": "Then We made you successors after them, generations after generations in the land, that We might see how you would work.",
            "english_rwwad": "Then We made you their successors in the land to see how you would behave."
        }
    },
    {
        "id": 1378,
        "chapter": 10,
        "verse": 15,
        "arabic_text": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَاتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا ٱئۡتِ بِقُرۡءَانٍ غَيۡرِ هَٰذَآ أَوۡ بَدِّلۡهُۚ قُلۡ مَا يَكُونُ لِيٓ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَآيِٕ نَفۡسِيٓۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۖ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ",
        "phonetic": "10.15 Wa 'Idhā Tutlá `Alayhim 'Āyātunā Bayyinātin Qāla Al-Ladhīna Lā Yarjūna Liqā'anā A'ti Biqur'ānin Ghayri Hādhā 'Aw Baddilhu Qul Mā Yakūnu Lī 'An 'Ubaddilahu Min Tilqā'i Nafsī 'In 'Attabi`u 'Illā Mā Yūĥá 'Ilayya 'Innī 'Akhāfu 'In `Aşaytu Rabbī `Adhāba Yawmin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Our verses are recited to them as clear evidences, those who do not expect the meeting with Us say, \"Bring us a Qur’ān other than this or change it.\" Say, [O Muḥammad], \"It is not for me to change it on my own accord. I only follow what is revealed to me. Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
            "english_hilali_khan": "And when Our clear Verses are recited unto them, those who hope not for their meeting with Us, say: \"Bring us a Qur’ân other than this, or change it.\" Say (O Muhammad صلى الله عليه وسلم): \"It is not for me to change it on my own accord; I only follow that which is revealed unto me. Verily, I fear the torment of the Great Day (i.e. the Day of Resurrection) if I were to disobey my Lord.\"",
            "english_rwwad": "When Our verses are recited to them clearly, those who do not expect to meet Us say, “Bring us a different Qur’an, or make changes in it.” Say, “It is not for me to change it on my own accord; I only follow what is revealed to me. If I were to disobey my Lord, I fear the punishment of a momentous Day.”"
        }
    },
    {
        "id": 1379,
        "chapter": 10,
        "verse": 16,
        "arabic_text": "قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ",
        "phonetic": "10.16 Qul Law Shā'a Allāhu Mā Talawtuhu `Alaykum Wa Lā 'Adrākum Bihi Faqad Labithtu Fīkum `Umurāan Min Qablihi 'Afalā Ta`qilūna",
        "footnotes": {
            "english_saheeh": "[516]- The Prophet (ﷺ) lived among his people forty years before receiving any revelation.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"If Allāh had willed, I would not have recited it to you, nor would He have made it known to you, for I had remained among you a lifetime before it.[516] Then will you not reason?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"If Allâh had so willed, I should not have recited it to you nor would He have made it known to you. Verily, I have stayed amongst you a life time before this. Have you then no sense?\"",
            "english_rwwad": "Say, “If Allah had willed, I would not have recited it to you, nor would He have made it known to you. I have spent a lifetime among you before this. Do you not then understand?”"
        }
    },
    {
        "id": 1380,
        "chapter": 10,
        "verse": 17,
        "arabic_text": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡمُجۡرِمُونَ",
        "phonetic": "10.17 Faman 'Ažlamu Mimmani Aftará `Alá Allāhi Kadhibāan 'Aw Kadhaba Bi'āyātihi 'Innahu Lā Yufliĥu Al-Mujrimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So who is more unjust than he who invents a lie about Allāh or denies His signs? Indeed, the criminals will not succeed.",
            "english_hilali_khan": "So who does more wrong than he who forges a lie against Allâh or denies His Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.)? Surely, the Mujrimûn (criminals, sinners, disbelievers and polytheists) will never be successful!",
            "english_rwwad": "Who does greater wrong than he who fabricates lies against Allah or rejects His verses? Indeed, the wicked will never succeed."
        }
    },
    {
        "id": 1381,
        "chapter": 10,
        "verse": 18,
        "arabic_text": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡ وَيَقُولُونَ هَٰٓؤُلَآءِ شُفَعَٰٓؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّـُٔونَ ٱللَّهَ بِمَا لَا يَعۡلَمُ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
        "phonetic": "10.18 Wa Ya`budūna Min Dūni Allāhi Mā Lā Yađurruhum Wa Lā Yanfa`uhum Wa Yaqūlūna Hā'uulā' Shufa`ā'uunā `Inda Allāhi Qul 'Atunabbi'ūna Allāha Bimā Lā Ya`lamu Fī As-Samāwāti Wa Lā Fī Al-'Arđi Subĥānahu Wa Ta`ālá `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they worship other than Allāh that which neither harms them nor benefits them, and they say, \"These are our intercessors with Allāh.\" Say, \"Do you inform Allāh of something He does not know in the heavens or on the earth?\" Exalted is He and high above what they associate with Him.",
            "english_hilali_khan": "And they worship besides Allâh things that harm them not, nor profit them, and they say: \"These are our intercessors with Allâh.\" Say: \"Do you inform Allâh of that which He knows not in the heavens and on the earth?\" Glorified and Exalted is He above all that which they associate as partners (with Him)!",
            "english_rwwad": "They worship besides Allah those who can neither harm nor benefit them, saying, “These are our intercessors with Allah.” Say, “Do you inform Allah of what He does not know in the heavens or the earth? Glorified and Exalted is He far above what they associate [with Him]!”"
        }
    },
    {
        "id": 1382,
        "chapter": 10,
        "verse": 19,
        "arabic_text": "وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ",
        "phonetic": "10.19 Wa Mā Kāna An-Nāsu 'Illā 'Ummatan Wāĥidatan Fākhtalafū Wa Lawlā Kalimatun Sabaqat Min Rabbika Laquđiya Baynahum Fīmā Fīhi Yakhtalifūna",
        "footnotes": {
            "english_saheeh": "[517]- Allāh's decree to allow time on earth for His creation or not to punish anyone before evidence has come to him.",
            "english_hilali_khan": "(V.10:19) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Every child is born on Al-Fitrah [true faith of Islâmic Monotheism (i.e. to worship none but Allâh Alone)], but his parents convert him to Judaism or Christianity or Magianism, as an animal gives birth to a perfect baby animal. Do you find it mutilated?\" (Sahih Al-Bukhari, Vol.2, Hadith No.467). [See also the Qur’ân, Verse 30:30]",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And mankind was not but one community [united in religion], but [then] they differed. And if not for a word[517] that preceded from your Lord, it would have been judged between them [immediately] concerning that over which they differ.",
            "english_hilali_khan": "Mankind were but one community (i.e. on one religion - Islâmic Monotheism), then they differed (later); and had not it been for a Word that went forth before from your Lord, it would have been settled between them regarding what they differed[1].",
            "english_rwwad": "The whole mankind was but a single community, then they differed. If it had not been for a prior decree from your Lord, a decisive judgment would have been passed between them concerning their differences."
        }
    },
    {
        "id": 1383,
        "chapter": 10,
        "verse": 20,
        "arabic_text": "وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ",
        "phonetic": "10.20 Wa Yaqūlūna Lawlā 'Unzila `Alayhi 'Āyatun Min Rabbihi Faqul 'Innamā Al-Ghaybu Lillāhi Fāntažirū 'Innī Ma`akum Mina Al-Muntažirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"Why is a sign not sent down to him from his Lord?\" So say, \"The unseen is only for Allāh [to administer], so wait; indeed, I am with you among those who wait.\"",
            "english_hilali_khan": "And they say: \"How is it that not a sign is sent down on him from his Lord?\" Say: \"The Unseen belongs to Allâh Alone, so wait you, verily, I am with you among those who wait (for Allâh’s Judgement).\"",
            "english_rwwad": "They say, “Why has no sign been sent down to him from his Lord?” Say [O Prophet], “The unseen belongs to Allah alone. Wait then; I too am waiting with you.”"
        }
    },
    {
        "id": 1384,
        "chapter": 10,
        "verse": 21,
        "arabic_text": "وَإِذَآ أَذَقۡنَا ٱلنَّاسَ رَحۡمَةٗ مِّنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُمۡ إِذَا لَهُم مَّكۡرٞ فِيٓ ءَايَاتِنَاۚ قُلِ ٱللَّهُ أَسۡرَعُ مَكۡرًاۚ إِنَّ رُسُلَنَا يَكۡتُبُونَ مَا تَمۡكُرُونَ",
        "phonetic": "10.21 Wa 'Idhā 'Adhaqnā An-Nāsa Raĥmatan Min Ba`di Đarrā'a Massat/hum 'Idhā Lahum Makrun Fī 'Āyātinā Quli Allāhu 'Asra`u Makrāan 'Inna Rusulanā Yaktubūna Mā Tamkurūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:21) See the footnote (B) of (V.6:61).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when We give the people a taste of mercy after adversity has touched them, at once they conspire against Our verses. Say, \"Allāh is swifter in strategy.\" Indeed, Our messengers [i.e., angels] record that which you conspire.",
            "english_hilali_khan": "And when We let mankind taste mercy after some adversity has afflicted them, behold! they take to plotting against Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.)! Say: \"Allâh is more Swift in planning!\" Certainly, Our Messengers (angels) record all of that which you plot.[1]",
            "english_rwwad": "When We give people a taste of mercy after being afflicted with adversity, they start plotting against Our verses. Say, “Allah is swifter in planning [retribution]. Our angel-messengers record whatever you plot.”"
        }
    },
    {
        "id": 1385,
        "chapter": 10,
        "verse": 22,
        "arabic_text": "هُوَ ٱلَّذِي يُسَيِّرُكُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِۖ حَتَّىٰٓ إِذَا كُنتُمۡ فِي ٱلۡفُلۡكِ وَجَرَيۡنَ بِهِم بِرِيحٖ طَيِّبَةٖ وَفَرِحُواْ بِهَا جَآءَتۡهَا رِيحٌ عَاصِفٞ وَجَآءَهُمُ ٱلۡمَوۡجُ مِن كُلِّ مَكَانٖ وَظَنُّوٓاْ أَنَّهُمۡ أُحِيطَ بِهِمۡ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ لَئِنۡ أَنجَيۡتَنَا مِنۡ هَٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
        "phonetic": "10.22 Huwa Al-Ladhī Yusayyirukum Fī Al-Barri Wa Al-Baĥri Ĥattá 'Idhā Kuntum Fī Al-Fulki Wa Jarayna Bihim Birīĥin Ţayyibatin Wa Fariĥū Bihā Jā'at/hā Rīĥun `Āşifun Wa Jā'ahumu Al-Mawju Min Kulli Makānin Wa Žannū 'Annahum 'Uĥīţa Bihim Da`aw Allāha Mukhlişīna Lahu Ad-Dīna La'in 'Anjaytanā Min Hadhihi Lanakūnanna Mina Ash-Shākirīna",
        "footnotes": {
            "english_saheeh": "[518]- The change in pronoun from the second to third person shows that the following description applies specifically to the disbelievers.",
            "english_hilali_khan": "(V.10:22): See the footnote of (V.17:67).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who enables you to travel on land and sea until, when you are in ships and they sail with them[518] by a good wind and they rejoice therein, there comes a storm wind and the waves come upon them from every place and they expect to be engulfed, they supplicate Allāh, sincere to Him in religion, \"If You should save us from this, we will surely be among the thankful.\"",
            "english_hilali_khan": "He it is Who enables you to travel through land and sea, till when you are in the ships, and they sail with them with a favourable wind, and they are glad therein, then comes a stormy wind and the waves come to them from all sides, and they think that they are encircled therein. Then they invoke Allâh, making their Faith pure for Him Alone, (saying): \"If You (Allâh) deliver us from this, we shall truly be of the grateful.\"[2]",
            "english_rwwad": "It is He Who enables you to travel through the land and sea, until when you are in the ships and they sail with those on board and rejoicing in a favorable wind, then suddenly a stormy wind comes, with waves crashing into them on all sides, and they feel that there is no escape. Then they cry out to Allah with sincere devotion to Him, “If You save us from this, we will surely be among those who are grateful.”"
        }
    },
    {
        "id": 1386,
        "chapter": 10,
        "verse": 23,
        "arabic_text": "فَلَمَّآ أَنجَىٰهُمۡ إِذَا هُمۡ يَبۡغُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّۗ يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّمَا بَغۡيُكُمۡ عَلَىٰٓ أَنفُسِكُمۖ مَّتَٰعَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ ثُمَّ إِلَيۡنَا مَرۡجِعُكُمۡ فَنُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "10.23 Falammā 'Anjāhum 'Idhā Hum Yabghūna Fī Al-'Arđi Bighayri Al-Ĥaqqi Yā 'Ayyuhā An-Nāsu 'Innamā Baghyukum `Alá 'Anfusikum Matā`a Al-Ĥayāati Ad-Dunyā Thumma 'Ilaynā Marji`ukum Fanunabbi'ukum Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[519]- By oppression and disobedience or by invoking others besides Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when He saves them, at once they commit injustice[519] upon the earth without right. O mankind, your injustice is only against yourselves, [being merely] the enjoyment of worldly life. Then to Us is your return, and We will inform you of what you used to do.",
            "english_hilali_khan": "But when He delivers them, behold! they rebel (disobey Allâh) in the earth wrongfully. O mankind! Your rebellion (disobedience to Allâh) is only against your ownselves, - a brief enjoyment of this worldly life, then (in the end) unto Us is your return, and We shall inform you of that which you used to do.",
            "english_rwwad": "However, when He saves them, they start transgressing in the land unjustly. O people, your transgression is against your own souls. Take your little enjoyment in this life; then to Us is your return, and We will inform you of what you used to do."
        }
    },
    {
        "id": 1387,
        "chapter": 10,
        "verse": 24,
        "arabic_text": "إِنَّمَا مَثَلُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ مِمَّا يَأۡكُلُ ٱلنَّاسُ وَٱلۡأَنۡعَٰمُ حَتَّىٰٓ إِذَآ أَخَذَتِ ٱلۡأَرۡضُ زُخۡرُفَهَا وَٱزَّيَّنَتۡ وَظَنَّ أَهۡلُهَآ أَنَّهُمۡ قَٰدِرُونَ عَلَيۡهَآ أَتَىٰهَآ أَمۡرُنَا لَيۡلًا أَوۡ نَهَارٗا فَجَعَلۡنَٰهَا حَصِيدٗا كَأَن لَّمۡ تَغۡنَ بِٱلۡأَمۡسِۚ كَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَتَفَكَّرُونَ",
        "phonetic": "10.24 'Innamā Mathalu Al-Ĥayāati Ad-Dunyā Kamā'in 'Anzalnāhu Mina As-Samā'i Fākhtalaţa Bihi Nabātu Al-'Arđi Mimmā Ya'kulu An-Nāsu Wa Al-'An`ām Ĥattá 'Idhā 'Akhadhati Al-'Arđu Zukhrufahā Wa Azzayyanat Wa Žanna 'Ahluhā 'Annahum Qādirūna `Alayhā 'Atāhā 'Amrunā Laylāan 'Aw Nahārāan Faja`alnāhā Ĥaşīdāan Ka'an Lam Taghna Bil-'Amsi Kadhālika Nufaşşilu Al-'Āyāti Liqawmin Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "[520]- Its vegetation having been cut down or uprooted, i.e., utterly destroyed.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The example of [this] worldly life is but like rain which We have sent down from the sky that the plants of the earth absorb - [those] from which men and livestock eat - until, when the earth has taken on its adornment and is beautified and its people suppose that they have capability over it, there comes to it Our command by night or by day, and We make it as a harvest,[520] as if it had not flourished yesterday. Thus do We explain in detail the signs for a people who give thought.",
            "english_hilali_khan": "Verily, the likeness of (this) worldly life is as the water (rain) which We send down from the sky; so by it arises the intermingled produce of the earth of which men and cattle eat: until when the earth is clad in its adornments and is beautified, and its people think that they have all the powers of disposal over it, Our Command reaches it by night or by day and We make it like a clean-mown harvest, as if it had not flourished yesterday! Thus do We explain the Ayât (proofs, evidence, verses, lessons, signs, revelations, laws, etc.) in detail for the people who reflect.",
            "english_rwwad": "The likeness of the life of this world is that of the rain that We send down from the sky, and it mixes with the plants of the earth, from which both humans and livestock eat. Then when the earth is in its splendor and its fairest appearance, and its owners feel that they have full control over it, Our command comes to it, by night or by day, and We reduce it to stubble, as if it had not flourished the day before. This is how We make the signs clear for people who reflect."
        }
    },
    {
        "id": 1388,
        "chapter": 10,
        "verse": 25,
        "arabic_text": "وَٱللَّهُ يَدۡعُوٓاْ إِلَىٰ دَارِ ٱلسَّلَٰمِ وَيَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
        "phonetic": "10.25 Wa Allāhu Yad`ū 'Ilá Dāri As-Salāmi Wa Yahdī Man Yashā'u 'Ilá Şirāţin Mustaqīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh invites to the Home of Peace [i.e., Paradise] and guides whom He wills to a straight path.",
            "english_hilali_khan": "Allâh calls to the Home of Peace (i.e. Paradise, by accepting Allâh’s religion of Islâmic Monotheism and by doing righteous good deeds and abstaining from polytheism and evil deeds) and guides whom He wills to the Straight Path.",
            "english_rwwad": "Allah invites to the Home of Peace and guides whom He wills to a straight path."
        }
    },
    {
        "id": 1389,
        "chapter": 10,
        "verse": 26,
        "arabic_text": "۞ لِّلَّذِينَ أَحۡسَنُواْ ٱلۡحُسۡنَىٰ وَزِيَادَةٞۖ وَلَا يَرۡهَقُ وُجُوهَهُمۡ قَتَرٞ وَلَا ذِلَّةٌۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ",
        "phonetic": "10.26 Lilladhīna 'Aĥsanū Al-Ĥusná Wa Ziyādatun Wa Lā Yarhaqu Wujūhahum Qatarun Wa Lā Dhillatun 'Ūlā'ika 'Aşĥābu Al-Jannati Hum Fīhā Khālidūna",
        "footnotes": {
            "english_saheeh": "[521]- In addition to the pleasures of Paradise, they will be able to see Allāh (subḥānahu wa taʿālā), as reported in an authentic ḥadīth narrated by Muslim.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For them who have done good is the best [reward] - and extra.[521] No darkness will cover their faces, nor humiliation. Those are companions of Paradise; they will abide therein eternally.",
            "english_hilali_khan": "For those who have done good is the best (reward, i.e. Paradise) and even more (i.e. having the honour of glancing at the Countenance of Allâh جل جلاله). Neither darkness nor dust nor any humiliating disgrace shall cover their faces. They are the dwellers of Paradise, they will abide therein forever.",
            "english_rwwad": "For those who do good there will be the best reward and more – neither gloom nor humiliation will cover their faces. It is they who are the people of Paradise, they will abide therein forever."
        }
    },
    {
        "id": 1390,
        "chapter": 10,
        "verse": 27,
        "arabic_text": "وَٱلَّذِينَ كَسَبُواْ ٱلسَّيِّـَٔاتِ جَزَآءُ سَيِّئَةِۭ بِمِثۡلِهَا وَتَرۡهَقُهُمۡ ذِلَّةٞۖ مَّا لَهُم مِّنَ ٱللَّهِ مِنۡ عَاصِمٖۖ كَأَنَّمَآ أُغۡشِيَتۡ وُجُوهُهُمۡ قِطَعٗا مِّنَ ٱلَّيۡلِ مُظۡلِمًاۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ",
        "phonetic": "10.27 Wa Al-Ladhīna Kasabū As-Sayyi'āti Jazā'u Sayyi'atin Bimithlihā Wa Tarhaquhum Dhillatun Mā Lahum Mina Allāhi Min `Āşimin Ka'annamā 'Ughshiyat Wujūhuhum Qiţa`āan Mina Al-Layli Mužlimāan 'Ūlā'ika 'Aşĥābu An-Nāri Hum Fīhā Khālidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they who have earned [blame for] evil doings - the recompense of an evil deed is its equivalent, and humiliation will cover them. They will have from Allāh no protector. It will be as if their faces are covered with pieces of the night - so dark [are they]. Those are the companions of the Fire; they will abide therein eternally.",
            "english_hilali_khan": "And those who have earned evil deeds, the recompense of an evil deed is the like thereof, and humiliating disgrace will cover them (their faces). No defender will they have from Allâh. Their faces will be covered as it were with pieces from the darkness of night. They are the dwellers of the Fire, they will abide therein forever.",
            "english_rwwad": "As for those who commit evil deeds, the recompense of an evil deed is the like thereof, and humiliation will cover them – there will be none to protect them from Allah – as if their faces were covered with patches of the darkest night. It is they who are the people of the Fire, they will abide therein forever."
        }
    },
    {
        "id": 1391,
        "chapter": 10,
        "verse": 28,
        "arabic_text": "وَيَوۡمَ نَحۡشُرُهُمۡ جَمِيعٗا ثُمَّ نَقُولُ لِلَّذِينَ أَشۡرَكُواْ مَكَانَكُمۡ أَنتُمۡ وَشُرَكَآؤُكُمۡۚ فَزَيَّلۡنَا بَيۡنَهُمۡۖ وَقَالَ شُرَكَآؤُهُم مَّا كُنتُمۡ إِيَّانَا تَعۡبُدُونَ",
        "phonetic": "10.28 Wa Yawma Naĥshuruhum Jamī`āan Thumma Naqūlu Lilladhīna 'Ashrakū Makānakum 'Antum Wa Shurakā'uukum Fazayyalnā Baynahum Wa Qāla Shurakā'uuhum Mā Kuntum 'Īyānā Ta`budūna",
        "footnotes": {
            "english_saheeh": "[522]- Those they had associated with Allāh.\n[523]- From the believers.\n[524]- The inanimate objects, such as idols, will not have been aware of their worship of them.  But those beings who consented to be worshipped will lie and deny it on the Day of Judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention, O Muḥammad], the Day We will gather them all together - then We will say to those who associated others with Allāh, \"[Remain in] your place, you and your 'partners.'\"[522] Then We will separate them,[523] and their \"partners\" will say, \"You did not used to worship us,[524]",
            "english_hilali_khan": "And the Day whereon We shall gather them all together, then We shall say to those who did set partners in worship with Us: \"Stop at your place! You and your partners (whom you had worshipped in the worldly life).\" then We shall separate them, and their (Allâh’s so-called) partners shall say: \"It was not us that you used to worship.\"",
            "english_rwwad": "On the Day when We gather them all together, then We will say to those who associated partners with Us, “Stay where you are, you and your [so-called] partners!” Then We will separate them, and their partners will say, “It was not us that you used to worship!"
        }
    },
    {
        "id": 1392,
        "chapter": 10,
        "verse": 29,
        "arabic_text": "فَكَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنَنَا وَبَيۡنَكُمۡ إِن كُنَّا عَنۡ عِبَادَتِكُمۡ لَغَٰفِلِينَ",
        "phonetic": "10.29 Fakafá Billāhi Shahīdāan Baynanā Wa Baynakum 'In Kunnā `An `Ibādatikum Laghāfilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And sufficient is Allāh as a witness between us and you that we were of your worship unaware.\"",
            "english_hilali_khan": "\"So sufficient is Allâh as a witness between us and you that we indeed knew nothing of your worship of us.\"",
            "english_rwwad": "Allah is sufficient as a Witness between us and you that we were completely unaware of your worship.”"
        }
    },
    {
        "id": 1393,
        "chapter": 10,
        "verse": 30,
        "arabic_text": "هُنَالِكَ تَبۡلُواْ كُلُّ نَفۡسٖ مَّآ أَسۡلَفَتۡۚ وَرُدُّوٓاْ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ",
        "phonetic": "10.30 Hunālika Tablū Kullu Nafsin Mā 'Aslafat Wa Ruddū 'Ilá Allāhi Mawlāhumu Al-Ĥaqqi Wa Đalla `Anhum Mā Kānū Yaftarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There, [on that Day], every soul will be put to trial for what it did previously, and they will be returned to Allāh, their master, the Truth, and lost from them is whatever they used to invent.",
            "english_hilali_khan": "There! Every person will know (exactly) what he had earned before and they will be brought back to Allâh, their rightful Maulâ (Lord), and their invented false deities will vanish from them.",
            "english_rwwad": "Thereupon, every soul will realize what it did in the past. They will be brought back to Allah, their True Guardian, and all [false gods] that they fabricated will vanish from them."
        }
    },
    {
        "id": 1394,
        "chapter": 10,
        "verse": 31,
        "arabic_text": "قُلۡ مَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أَمَّن يَمۡلِكُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَمَن يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَيُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّ وَمَن يُدَبِّرُ ٱلۡأَمۡرَۚ فَسَيَقُولُونَ ٱللَّهُۚ فَقُلۡ أَفَلَا تَتَّقُونَ",
        "phonetic": "10.31 Qul Man Yarzuqukum Mina As-Samā'i Wa Al-'Arđi 'Amman Yamliku As-Sam`a Wa Al-'Abşāra Wa Man Yukhriju Al-Ĥayya Mina Al-Mayyiti Wa Yukhriju Al-Mayyita Mina Al-Ĥayyi Wa Man Yudabbiru Al-'Amra Fasayaqūlūna Allāhu Faqul 'Afalā Tattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight and who brings the living out of the dead and brings the dead out of the living and who arranges [every] matter?\" They will say, \"Allāh,\" so say, \"Then will you not fear Him?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Who provides for you from the sky and the earth? Or who owns hearing and sight? And who brings out the living from the dead and brings out the dead from the living? And who disposes the affairs?\" They will say: \"Allâh.\" Say: \"Will you not then be afraid of Allâh’s punishment (for setting up rivals in worship with Allâh)?\"",
            "english_rwwad": "Say, “Who provides for you from the heaven and earth? Or who owns [your] hearing and sight? Who brings forth the living from the dead and the dead from the living? Who controls all things?” They will say, “Allah.” Say, “Do you not then fear Him?"
        }
    },
    {
        "id": 1395,
        "chapter": 10,
        "verse": 32,
        "arabic_text": "فَذَٰلِكُمُ ٱللَّهُ رَبُّكُمُ ٱلۡحَقُّۖ فَمَاذَا بَعۡدَ ٱلۡحَقِّ إِلَّا ٱلضَّلَٰلُۖ فَأَنَّىٰ تُصۡرَفُونَ",
        "phonetic": "10.32 Fadhalikumu Allāhu Rabbukumu Al-Ĥaqqu Famādhā Ba`da Al-Ĥaqqi 'Illā Ađ-Đalālu Fa'annā Tuşrafūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For that is Allāh, your Lord, the Truth. And what can be beyond truth except error? So how are you averted?",
            "english_hilali_khan": "Such is Allâh, your Lord in truth. So after the truth, what else can there be, save error? How then are you turned away?",
            "english_rwwad": "Such is Allah, your True Lord. What is beyond the truth except falsehood? So how could you be averted [from the truth]?”"
        }
    },
    {
        "id": 1396,
        "chapter": 10,
        "verse": 33,
        "arabic_text": "كَذَٰلِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ فَسَقُوٓاْ أَنَّهُمۡ لَا يُؤۡمِنُونَ",
        "phonetic": "10.33 Kadhālika Ĥaqqat Kalimatu Rabbika `Alá Al-Ladhīna Fasaqū 'Annahum Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Thus the word [i.e., decree] of your Lord has come into effect upon those who defiantly disobeyed - that they will not believe.",
            "english_hilali_khan": "Thus is the Word of your Lord justified against those who rebel (disobey Allâh) that they will not believe (in the Oneness of Allâh and in Muhammad صلى الله عليه وسلم as the Messenger of Allâh).",
            "english_rwwad": "Thus the decree of your Lord has come true against the wicked, that they will never believe."
        }
    },
    {
        "id": 1397,
        "chapter": 10,
        "verse": 34,
        "arabic_text": "قُلۡ هَلۡ مِن شُرَكَآئِكُم مَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥۚ قُلِ ٱللَّهُ يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥۖ فَأَنَّىٰ تُؤۡفَكُونَ",
        "phonetic": "10.34 Qul Hal Min Shurakā'ikum Man Yabda'u Al-Khalqa Thumma Yu`īduhu Quli Allāhu Yabda'u Al-Khalqa Thumma Yu`īduhu Fa'anná Tu'ufakūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Are there of your 'partners' any who begins creation and then repeats it?\" Say, \"Allāh begins creation and then repeats it, so how are you deluded?\"",
            "english_hilali_khan": "Say: \"Is there of your (Allâh’s called) partners one that originates the creation and then repeats it?\" Say: \"Allâh originates the creation and then He repeats it. Then how are you deluded away (from the truth)?\"",
            "english_rwwad": "Say, “Can any of your [so-called] partners originate creation then repeat it?” Say, “Allah originates creation then repeats it. How are you then deluded [from the truth]?”"
        }
    },
    {
        "id": 1398,
        "chapter": 10,
        "verse": 35,
        "arabic_text": "قُلۡ هَلۡ مِن شُرَكَآئِكُم مَّن يَهۡدِيٓ إِلَى ٱلۡحَقِّۚ قُلِ ٱللَّهُ يَهۡدِي لِلۡحَقِّۗ أَفَمَن يَهۡدِيٓ إِلَى ٱلۡحَقِّ أَحَقُّ أَن يُتَّبَعَ أَمَّن لَّا يَهِدِّيٓ إِلَّآ أَن يُهۡدَىٰۖ فَمَا لَكُمۡ كَيۡفَ تَحۡكُمُونَ",
        "phonetic": "10.35 Qul Hal Min Shurakā'ikum Man Yahdī 'Ilá Al-Ĥaqqi Quli Allāhu Yahdī Lilĥaqqi 'Afaman Yahdī 'Ilá Al-Ĥaqqi 'Aĥaqqu 'An Yuttaba`a 'Amman Lā Yahiddī 'Illā 'An Yuhdá Famā Lakum Kayfa Taĥkumūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Are there of your 'partners' any who guides to the truth?\" Say, \"Allāh guides to the truth. So is He who guides to the truth more worthy to be followed or he who guides not unless he is guided? Then what is [wrong] with you - how do you judge?\"",
            "english_hilali_khan": "Say: \"Is there of your (Allâh’s so-called) partners one that guides to the truth?\" Say: \"It is Allâh Who guides to the truth. Is then He Who guides to the truth more worthy to be followed, or he who finds not guidance (himself) unless he is guided? Then, what is the matter with you? How judge you?\"",
            "english_rwwad": "Say, “Can any of your [so-called] partners guide to the truth?” Say, “Allah guides to the truth.” Who is then more worthy to be followed: the One Who guides to the truth, or he who has no guidance unless he himself is guided? What is the matter with you, that you judge so?"
        }
    },
    {
        "id": 1399,
        "chapter": 10,
        "verse": 36,
        "arabic_text": "وَمَا يَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ إِنَّ ٱلظَّنَّ لَا يُغۡنِي مِنَ ٱلۡحَقِّ شَيۡـًٔاۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا يَفۡعَلُونَ",
        "phonetic": "10.36 Wa Mā Yattabi`u 'Aktharuhum 'Illā Žannāan 'Inna Až-Žanna Lā Yughnī Mina Al-Ĥaqqi Shay'āan 'Inna Allāha `Alīmun Bimā Yaf`alūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And most of them follow not except assumption. Indeed, assumption avails not against the truth at all. Indeed, Allāh is Knowing of what they do.",
            "english_hilali_khan": "And most of them follow nothing but conjecture. Certainly, conjecture can be of no avail against the truth. Surely, Allâh is All-Aware of what they do.",
            "english_rwwad": "Most of them follow nothing but assumptions. However, assumptions are of no avail against the truth. Indeed, Allah is All-Knowing of what they do."
        }
    },
    {
        "id": 1400,
        "chapter": 10,
        "verse": 37,
        "arabic_text": "وَمَا كَانَ هَٰذَا ٱلۡقُرۡءَانُ أَن يُفۡتَرَىٰ مِن دُونِ ٱللَّهِ وَلَٰكِن تَصۡدِيقَ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَتَفۡصِيلَ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "10.37 Wa Mā Kāna Hādhā Al-Qur'ānu 'An Yuftará Min Dūni Allāhi Wa Lakin Taşdīqa Al-Ladhī Bayna Yadayhi Wa Tafşīla Al-Kitābi Lā Rayba Fīhi Min Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[525]- This phrase refers back to the Qur’ān.",
            "english_hilali_khan": "(V.10:37) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"There was no Prophet among the Prophets but was given miracles because of which people had security or had belief, but what I have been given is the Divine Revelation which Allâh has revealed to me. So I hope that my followers will be more than those of any other Prophet on the Day of Resurrection.\" (Sahih Al-Bukhari, Vol.9, Hadith No.379).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it was not [possible] for this Qur’ān to be produced by other than Allāh, but [it is] a confirmation of what was before it and a detailed explanation of the [former] Scripture, about which there is no doubt,[525] from the Lord of the worlds.",
            "english_hilali_khan": "And this Qur’ân is not such as could ever be produced by other than Allâh (Lord of the heavens and the earth), but it is a confirmation of (the revelation)[1] which was before it [i.e. the Taurât (Torah), and the Injeel (Gospel)], and a full explanation of the Book (i.e. laws, decreed for mankind) - wherein there is no doubt - from the Lord of the ‘Âlamîn (mankind, jinn, and all that exists).",
            "english_rwwad": "This Qur’an could not possibly have been produced by anyone other than Allah. It is a confirmation of what came before it and an explanation of the Scripture, and is undoubtedly from the Lord of the worlds."
        }
    },
    {
        "id": 1401,
        "chapter": 10,
        "verse": 38,
        "arabic_text": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِسُورَةٖ مِّثۡلِهِۦ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "10.38 'Am Yaqūlūna Aftarāhu Qul Fa'tū Bisūratin Mithlihi Wa Ad`ū Mani Astaţa`tum Min Dūni Allāhi 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or do they say [about the Prophet (ﷺ)], \"He invented it?\" Say, \"Then bring forth a sūrah like it and call upon [for assistance] whomever you can besides Allāh, if you should be truthful.\"",
            "english_hilali_khan": "Or do they say: \"He (Muhammad صلى الله عليه وسلم) has forged it?\" Say: \"Bring then a Sûrah (chapter) like unto it, and call upon whomsoever you can besides Allâh, if you are truthful!\"",
            "english_rwwad": "Or do they say, “He fabricated it?” Say, “Produce then one Chapter like it, and call upon whoever you can other than Allah, if you are truthful!”"
        }
    },
    {
        "id": 1402,
        "chapter": 10,
        "verse": 39,
        "arabic_text": "بَلۡ كَذَّبُواْ بِمَا لَمۡ يُحِيطُواْ بِعِلۡمِهِۦ وَلَمَّا يَأۡتِهِمۡ تَأۡوِيلُهُۥۚ كَذَٰلِكَ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلظَّٰلِمِينَ",
        "phonetic": "10.39 Bal Kadhabū Bimā Lam Yuĥīţū Bi`ilmihi Wa Lammā Ya'tihim Ta'wīluhu Kadhālika Kadhaba Al-Ladhīna Min Qablihim Fānžur Kayfa Kāna `Āqibatu Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Rather, they have denied that which they encompass not in knowledge and whose interpretation has not yet come to them. Thus did those before them deny. Then observe how was the end of the wrongdoers.",
            "english_hilali_khan": "Nay, they have belied the knowledge whereof they could not comprehend and what has not yet been fulfilled (i.e. their punishment). Thus those before them did belie. Then see what was the end of the Zâlimûn (polytheists and wrong-doers)!",
            "english_rwwad": "But they rejected that which they did not comprehend, and its warning has not yet been fulfilled against them. Similarly, those who came before them refused to believe. Then see how was the end of the wrongdoers!"
        }
    },
    {
        "id": 1403,
        "chapter": 10,
        "verse": 40,
        "arabic_text": "وَمِنۡهُم مَّن يُؤۡمِنُ بِهِۦ وَمِنۡهُم مَّن لَّا يُؤۡمِنُ بِهِۦۚ وَرَبُّكَ أَعۡلَمُ بِٱلۡمُفۡسِدِينَ",
        "phonetic": "10.40 Wa Minhum Man Yu'uminu Bihi Wa Minhum Man Lā Yu'uminu Bihi Wa Rabbuka 'A`lamu Bil-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of them are those who believe in it, and of them are those who do not believe in it. And your Lord is most knowing of the corrupters.",
            "english_hilali_khan": "And of them there are some who believe therein; and of them there are some who believe not therein, and your Lord is All-Aware of the Mufsidûn (evil-doers, liars).",
            "english_rwwad": "There are some among them who will believe in it and others will not. And your Lord knows best those who spread corruption."
        }
    },
    {
        "id": 1404,
        "chapter": 10,
        "verse": 41,
        "arabic_text": "وَإِن كَذَّبُوكَ فَقُل لِّي عَمَلِي وَلَكُمۡ عَمَلُكُمۡۖ أَنتُم بَرِيٓـُٔونَ مِمَّآ أَعۡمَلُ وَأَنَا۠ بَرِيٓءٞ مِّمَّا تَعۡمَلُونَ",
        "phonetic": "10.41 Wa 'In Kadhabūka Faqul Lī `Amalī Wa Lakum `Amalukum 'Antum Barī'ūna Mimmā 'A`malu Wa 'Anā Barī'un Mimmā Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if they deny you, [O Muḥammad], then say, \"For me are my deeds, and for you are your deeds. You are disassociated from what I do, and I am disassociated from what you do.\"",
            "english_hilali_khan": "And if they belie you, say: \"For me are my deeds and for you are your deeds! You are innocent of what I do, and I am innocent of what you do!\"",
            "english_rwwad": "If they reject you, then say, “My deeds are mine and your deeds are yours. You are not responsible for what I do, nor am I responsible for what you do.”"
        }
    },
    {
        "id": 1405,
        "chapter": 10,
        "verse": 42,
        "arabic_text": "وَمِنۡهُم مَّن يَسۡتَمِعُونَ إِلَيۡكَۚ أَفَأَنتَ تُسۡمِعُ ٱلصُّمَّ وَلَوۡ كَانُواْ لَا يَعۡقِلُونَ",
        "phonetic": "10.42 Wa Minhum Man Yastami`ūna 'Ilayka 'Afa'anta Tusmi`u Aş-Şumma Wa Law Kānū Lā Ya`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them are those who listen to you. But can you cause the deaf to hear [i.e., benefit from this hearing], although they will not use reason?",
            "english_hilali_khan": "And among them are some who listen to you, but can you make the deaf to hear - even though they apprehend not?",
            "english_rwwad": "Among them are some who listen to you, but can you make the deaf hear, even though they have no understanding?"
        }
    },
    {
        "id": 1406,
        "chapter": 10,
        "verse": 43,
        "arabic_text": "وَمِنۡهُم مَّن يَنظُرُ إِلَيۡكَۚ أَفَأَنتَ تَهۡدِي ٱلۡعُمۡيَ وَلَوۡ كَانُواْ لَا يُبۡصِرُونَ",
        "phonetic": "10.43 Wa Minhum Man Yanžuru 'Ilayka 'Afa'anta Tahdī Al-`Umya Wa Law Kānū Lā Yubşirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them are those who look at you. But can you guide the blind although they will not [attempt to] see?",
            "english_hilali_khan": "And among them are some who look at you, but can you guide the blind - even though they see not?",
            "english_rwwad": "And among them are some who look at you, but can you guide the blind even though they have no sight?"
        }
    },
    {
        "id": 1407,
        "chapter": 10,
        "verse": 44,
        "arabic_text": "إِنَّ ٱللَّهَ لَا يَظۡلِمُ ٱلنَّاسَ شَيۡـٔٗا وَلَٰكِنَّ ٱلنَّاسَ أَنفُسَهُمۡ يَظۡلِمُونَ",
        "phonetic": "10.44 'Inna Allāha Lā Yažlimu An-Nāsa Shay'āan Wa Lakinna An-Nāsa 'Anfusahum Yažlimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Allāh does not wrong the people at all, but it is the people who are wronging themselves.",
            "english_hilali_khan": "Truly! Allâh wrongs not mankind in aught; but mankind wrong themselves.",
            "english_rwwad": "Allah does not wrong people in the least, but it is people who wrong themselves."
        }
    },
    {
        "id": 1408,
        "chapter": 10,
        "verse": 45,
        "arabic_text": "وَيَوۡمَ يَحۡشُرُهُمۡ كَأَن لَّمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّنَ ٱلنَّهَارِ يَتَعَارَفُونَ بَيۡنَهُمۡۚ قَدۡ خَسِرَ ٱلَّذِينَ كَذَّبُواْ بِلِقَآءِ ٱللَّهِ وَمَا كَانُواْ مُهۡتَدِينَ",
        "phonetic": "10.45 Wa Yawma Yaĥshuruhum Ka'an Lam Yalbathū 'Illā Sā`atan Mina An-Nahāri Yata`ārafūna Baynahum Qad Khasira Al-Ladhīna Kadhabū Biliqā'i Allāhi Wa Mā Kānū Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And on the Day when He will gather them, [it will be] as if they had not remained [in the world] but an hour of the day, [and] they will know each other. Those will have lost who denied the meeting with Allāh and were not guided.",
            "english_hilali_khan": "And on the Day when He shall gather (resurrect) them together, (it will be) as if they had not stayed (in the life of this world and graves) but an hour of a day. They will recognise each other. Ruined indeed will be those who denied the Meeting with Allâh, and were not guided.",
            "english_rwwad": "On the Day when He will gather them, it will be as if they had not stayed [in this world] except for an hour of a day, they will recognize one another. Those who denied the meeting of Allah will be losers, for they did not follow guidance."
        }
    },
    {
        "id": 1409,
        "chapter": 10,
        "verse": 46,
        "arabic_text": "وَإِمَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِلَيۡنَا مَرۡجِعُهُمۡ ثُمَّ ٱللَّهُ شَهِيدٌ عَلَىٰ مَا يَفۡعَلُونَ",
        "phonetic": "10.46 Wa 'Immā Nuriyannaka Ba`đa Al-Ladhī Na`iduhum 'Aw Natawaffayannaka Fa'ilaynā Marji`uhum Thumma Allāhu Shahīdun `Alá Mā Yaf`alūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whether We show you some of what We promise them, [O Muḥammad], or We take you in death, to Us is their return; then, [either way], Allāh is a witness concerning what they are doing.",
            "english_hilali_khan": "Whether We show you (in your lifetime, O Muhammad صلى الله عليه وسلم) some of what We promise them (the torment), or We cause you to die - still unto Us is their return, and moreover, Allâh is Witness over what they used to do.",
            "english_rwwad": "Whether We show you [O Prophet] some of that [punishment] of which We warn them, or We cause you to die, to Us is their return, and Allah is a Witness to all what they do."
        }
    },
    {
        "id": 1410,
        "chapter": 10,
        "verse": 47,
        "arabic_text": "وَلِكُلِّ أُمَّةٖ رَّسُولٞۖ فَإِذَا جَآءَ رَسُولُهُمۡ قُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ",
        "phonetic": "10.47 Wa Likulli 'Ummatin Rasūlun Fa'idhā Jā'a Rasūluhum Quđiya Baynahum Bil-Qisţi Wa Hum Lā Yužlamūna",
        "footnotes": {
            "english_saheeh": "[526]- To witness on the Day of Judgement.  Another meaning is \"Once a messenger has come [to them in this world]...\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And for every nation is a messenger. So when their messenger comes,[526] it will be judged between them in justice, and they will not be wronged.",
            "english_hilali_khan": "And for every Ummah (a community or a nation) there is a Messenger; when their Messenger comes, the matter will be judged between them with justice, and they will not be wronged.",
            "english_rwwad": "For every people there is a messenger. When their messenger comes, it will be judged between them with justice, and they will not be wronged."
        }
    },
    {
        "id": 1411,
        "chapter": 10,
        "verse": 48,
        "arabic_text": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "10.48 Wa Yaqūlūna Matá Hādhā Al-Wa`du 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"When is [the fulfillment of] this promise, if you should be truthful?\"",
            "english_hilali_khan": "And they say: \"When will be this promise (the torment or the Day of Resurrection), if you speak the truth?\"",
            "english_rwwad": "They say, “When will this warning come to pass, if you are truthful?”"
        }
    },
    {
        "id": 1412,
        "chapter": 10,
        "verse": 49,
        "arabic_text": "قُل لَّآ أَمۡلِكُ لِنَفۡسِي ضَرّٗا وَلَا نَفۡعًا إِلَّا مَا شَآءَ ٱللَّهُۗ لِكُلِّ أُمَّةٍ أَجَلٌۚ إِذَا جَآءَ أَجَلُهُمۡ فَلَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ",
        "phonetic": "10.49 Qul Lā 'Amliku Linafsī Đarrāan Wa Lā Naf`āan 'Illā Mā Shā'a Allāhu Likulli 'Ummatin 'Ajalun 'Idhā Jā'a 'Ajaluhum Falā Yasta'khirūna Sā`atan Wa Lā Yastaqdimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"I possess not for myself any harm or benefit except what Allāh should will. For every nation is a [specified] term. When their time has come, then they will not remain behind an hour, nor will they precede [it].\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I have no power over any harm or profit to myself except what Allâh may will. For every Ummah (a community or a nation), there is a term appointed; when their term comes, neither can they delay it nor can they advance it an hour (or a moment).\" (Tafsir Al-Qurtubî).",
            "english_rwwad": "Say, “I have no power to harm or benefit myself, except by the Will of Allah.” For every people there is an appointed term; when their time comes, they can neither delay it for a moment, nor can they bring it forward."
        }
    },
    {
        "id": 1413,
        "chapter": 10,
        "verse": 50,
        "arabic_text": "قُلۡ أَرَءَيۡتُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُهُۥ بَيَٰتًا أَوۡ نَهَارٗا مَّاذَا يَسۡتَعۡجِلُ مِنۡهُ ٱلۡمُجۡرِمُونَ",
        "phonetic": "10.50 Qul 'Ara'aytum 'In 'Atākum `Adhābuhu Bayātāan 'Aw Nahārāan Mādhā Yasta`jilu Minhu Al-Mujrimūna",
        "footnotes": {
            "english_saheeh": "[527]- \"Impatience\" refers to the disbelievers' ridicule of the Prophet (ﷺ) by telling him to produce Allāh's punishment as proof of his truthfulness.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you considered: if His punishment should come to you by night or by day - for which [aspect] of it would the criminals be impatient?\"[527]",
            "english_hilali_khan": "Say: \"Tell me, if His torment should come to you by night or by day, which portion thereof would the Mujrimûn (disbelievers, polytheists, sinners, criminals) hasten on ?\"",
            "english_rwwad": "Say, “What do you think, if His punishment were to overtake you by night or by day, what part of it would the wicked seek to hasten?"
        }
    },
    {
        "id": 1414,
        "chapter": 10,
        "verse": 51,
        "arabic_text": "أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦٓۚ ءَآلۡـَٰٔنَ وَقَدۡ كُنتُم بِهِۦ تَسۡتَعۡجِلُونَ",
        "phonetic": "10.51 'Athumma 'Idhā Mā Waqa`a 'Āmantum Bihi 'Āl'āna Wa Qad Kuntum Bihi Tasta`jilūna",
        "footnotes": {
            "english_saheeh": "[528]- i.e., when it is too late to benefit from belief.\n[529]- Challenging those who warned of it to bring it on immediately.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then is it that when it has [actually] occurred you will believe in it? Now?[528] And you were [once] for it impatient.[529]",
            "english_hilali_khan": "Is it then that when it has actually befallen, you will believe in it? What! Now (you believe)? And you used (aforetime) to hasten it on!\"",
            "english_rwwad": "Will you believe in it only after it befalls you? Now! While you used to seek its hastening?”"
        }
    },
    {
        "id": 1415,
        "chapter": 10,
        "verse": 52,
        "arabic_text": "ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُواْ ذُوقُواْ عَذَابَ ٱلۡخُلۡدِ هَلۡ تُجۡزَوۡنَ إِلَّا بِمَا كُنتُمۡ تَكۡسِبُونَ",
        "phonetic": "10.52 Thumma Qīla Lilladhīna Žalamū Dhūqū `Adhāba Al-Khuldi Hal Tujzawna 'Illā Bimā Kuntum Taksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then it will be said to those who had wronged, \"Taste the punishment of eternity; are you being recompensed except for what you used to earn?\"",
            "english_hilali_khan": "Then it will be said to them who wronged themselves: \"Taste you the everlasting torment! Are you recompensed (aught) save what you used to earn?\"",
            "english_rwwad": "Then the wrongdoers will be told, “Taste the everlasting punishment! Are you being recompensed except for what you used to earn?”"
        }
    },
    {
        "id": 1416,
        "chapter": 10,
        "verse": 53,
        "arabic_text": "۞ وَيَسۡتَنۢبِـُٔونَكَ أَحَقٌّ هُوَۖ قُلۡ إِي وَرَبِّيٓ إِنَّهُۥ لَحَقّٞۖ وَمَآ أَنتُم بِمُعۡجِزِينَ",
        "phonetic": "10.53 Wa Yastanbi'ūnaka 'Aĥaqqun Huwa Qul 'Ī Wa Rabbī 'Innahu Laĥaqqun Wa Mā 'Antum Bimu`jizīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they ask information of you, [O Muḥammad], \"Is it true?\" Say, \"Yes, by my Lord. Indeed, it is truth; and you will not cause failure [to Allāh].\"",
            "english_hilali_khan": "And they ask you (O Muhammad صلى الله عليه وسلم) to inform them (saying): \"Is it true (i.e. the torment and the establishment of the Hour - the Day of Resurrection)?\" Say: \"Yes! By my Lord! It is the very truth! and you cannot escape it!\"",
            "english_rwwad": "They ask you, “Is it true?” Say, “Yes, by my Lord. It is certainly true, and you cannot escape it.”"
        }
    },
    {
        "id": 1417,
        "chapter": 10,
        "verse": 54,
        "arabic_text": "وَلَوۡ أَنَّ لِكُلِّ نَفۡسٖ ظَلَمَتۡ مَا فِي ٱلۡأَرۡضِ لَٱفۡتَدَتۡ بِهِۦۗ وَأَسَرُّواْ ٱلنَّدَامَةَ لَمَّا رَأَوُاْ ٱلۡعَذَابَۖ وَقُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ",
        "phonetic": "10.54 Wa Law 'Anna Likulli Nafsin Žalamat Mā Fī Al-'Arđi Lāftadat Bihi Wa 'Asarrū An-Nadāmata Lammā Ra'aw Al-`Adhāba Wa Quđiya Baynahum Bil-Qisţi Wa Hum Lā Yužlamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:54) See the footnote of (V.3:91).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if each soul that wronged had everything on earth, it would offer it in ransom. And they will confide regret when they see the punishment; and they will be judged in justice, and they will not be wronged.",
            "english_hilali_khan": "And if every person who had wronged (by disbelieving in Allâh and by worshipping others besides Allâh) possessed all that is on the earth and sought to ransom himself therewith (it will not be accepted), and they would feel in their hearts regret when they see the torment, and they will be judged with justice, and no wrong will be done unto them.[1]",
            "english_rwwad": "If every wrongdoer were to possess all that is on earth, he would surely offer it to ransom himself. They will hide their remorse when they see the punishment. They will be judged in all fairness, and they will not be wronged."
        }
    },
    {
        "id": 1418,
        "chapter": 10,
        "verse": 55,
        "arabic_text": "أَلَآ إِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ أَلَآ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "10.55 'Alā 'Inna Lillāhi Mā Fī As-Samāwāti Wa Al-'Arđi 'Alā 'Inna Wa`da Allāhi Ĥaqqun Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Unquestionably, to Allāh belongs whatever is in the heavens and the earth. Unquestionably, the promise of Allāh is truth, but most of them do not know.",
            "english_hilali_khan": "No doubt, surely, all that is in the heavens and the earth belongs to Allâh. No doubt, surely, Allâh’s Promise is true. But most of them know not.",
            "english_rwwad": "Indeed, to Allah belongs all that is in the heavens and earth. Allah’s promise is certainly true, but most of them do not know."
        }
    },
    {
        "id": 1419,
        "chapter": 10,
        "verse": 56,
        "arabic_text": "هُوَ يُحۡيِۦ وَيُمِيتُ وَإِلَيۡهِ تُرۡجَعُونَ",
        "phonetic": "10.56 Huwa Yuĥyī Wa Yumītu Wa 'Ilayhi Turja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He gives life and causes death, and to Him you will be returned.",
            "english_hilali_khan": "It is He Who gives life, and causes death, and to Him you (all) shall return.",
            "english_rwwad": "It is He Who gives life and causes death, and to Him you will all be returned."
        }
    },
    {
        "id": 1420,
        "chapter": 10,
        "verse": 57,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَتۡكُم مَّوۡعِظَةٞ مِّن رَّبِّكُمۡ وَشِفَآءٞ لِّمَا فِي ٱلصُّدُورِ وَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ",
        "phonetic": "10.57 Yā 'Ayyuhā An-Nāsu Qad Jā'atkum Maw`ižatun Min Rabbikum Wa Shifā'un Limā Fī Aş-Şudūri Wa Hudáan Wa Raĥmatun Lilmu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O mankind, there has come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers.",
            "english_hilali_khan": "O mankind! There has come to you a good advice from your Lord (i.e. the Qur’ân, enjoining all that is good and forbidding all that is evil), and a healing for that (disease of ignorance, doubt, hypocrisy and differences) which is in your breasts, - a guidance and a mercy (explaining lawful and unlawful things) for the believers.",
            "english_rwwad": "O mankind, there has come to you an exhortation from your Lord, a cure for [illness] of the hearts, a guidance and mercy for the believers."
        }
    },
    {
        "id": 1421,
        "chapter": 10,
        "verse": 58,
        "arabic_text": "قُلۡ بِفَضۡلِ ٱللَّهِ وَبِرَحۡمَتِهِۦ فَبِذَٰلِكَ فَلۡيَفۡرَحُواْ هُوَ خَيۡرٞ مِّمَّا يَجۡمَعُونَ",
        "phonetic": "10.58 Qul Bifađli Allāhi Wa Biraĥmatihi Fabidhālika Falyafraĥū Huwa Khayrun Mimmā Yajma`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"In the bounty of Allāh and in His mercy - in that let them rejoice; it is better than what they accumulate.\"",
            "english_hilali_khan": "Say: \"In the Bounty of Allâh, and in His Mercy (i.e. Islâm and the Qur’ân); - therein let them rejoice.\" That is better than what (the wealth) they amass.",
            "english_rwwad": "Say, “By Allah’s grace and His mercy let them therefore rejoice. It is much better than what they accumulate.”"
        }
    },
    {
        "id": 1422,
        "chapter": 10,
        "verse": 59,
        "arabic_text": "قُلۡ أَرَءَيۡتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزۡقٖ فَجَعَلۡتُم مِّنۡهُ حَرَامٗا وَحَلَٰلٗا قُلۡ ءَآللَّهُ أَذِنَ لَكُمۡۖ أَمۡ عَلَى ٱللَّهِ تَفۡتَرُونَ",
        "phonetic": "10.59 Qul 'Ara'aytum Mā 'Anzala Allāhu Lakum Min Rizqin Faja`altum Minhu Ĥarāmāan Wa Ĥalālāan Qul 'Ālllahu 'Adhina Lakum 'Am `Alá Allāhi Taftarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you seen what Allāh has sent down to you of provision of which you have made [some] lawful and [some] unlawful?\" Say, \"Has Allāh permitted you [to do so], or do you invent [something] about Allāh?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم to these polytheists): \"Tell me, what provision Allâh has sent down to you! And you have made of it lawful and unlawful.\" Say (O Muhammad صلى الله عليه وسلم): \"Has Allâh permitted you (to do so), or do you invent a lie against Allâh?\"",
            "english_rwwad": "Say [to the pagans], “What do you think about the provision that Allah has sent down to you, of which you made some unlawful and some lawful.” Say, “Has Allah given you permission or are you fabricating lies against Allah?”"
        }
    },
    {
        "id": 1423,
        "chapter": 10,
        "verse": 60,
        "arabic_text": "وَمَا ظَنُّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ يَوۡمَ ٱلۡقِيَٰمَةِۗ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ",
        "phonetic": "10.60 Wa Mā Žannu Al-Ladhīna Yaftarūna `Alá Allāhi Al-Kadhiba Yawma Al-Qiyāmati 'Inna Allāha Ladhū Fađlin `Alá An-Nāsi Wa Lakinna 'Aktharahum Lā Yashkurūna",
        "footnotes": {
            "english_saheeh": "[530]- i.e., what do they think He will do with them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And what will be the supposition of those who invent falsehood about Allāh on the Day of Resurrection?[530] Indeed, Allāh is the possessor of bounty for the people, but most of them are not grateful.",
            "english_hilali_khan": "And what think those who invent a lie against Allâh, on the Day of Resurrection? [i.e. Do they think that they will be forgiven and excused! Nay, they will have an eternal punishment in the Fire of Hell]. Truly, Allâh is full of Bounty to mankind, but most of them are ungrateful.",
            "english_rwwad": "What do those who fabricate lies against Allah think of it on the Day of Judgment? Indeed, Allah is bountiful to people, yet most of them are ungrateful."
        }
    },
    {
        "id": 1424,
        "chapter": 10,
        "verse": 61,
        "arabic_text": "وَمَا تَكُونُ فِي شَأۡنٖ وَمَا تَتۡلُواْ مِنۡهُ مِن قُرۡءَانٖ وَلَا تَعۡمَلُونَ مِنۡ عَمَلٍ إِلَّا كُنَّا عَلَيۡكُمۡ شُهُودًا إِذۡ تُفِيضُونَ فِيهِۚ وَمَا يَعۡزُبُ عَن رَّبِّكَ مِن مِّثۡقَالِ ذَرَّةٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ وَلَآ أَصۡغَرَ مِن ذَٰلِكَ وَلَآ أَكۡبَرَ إِلَّا فِي كِتَٰبٖ مُّبِينٍ",
        "phonetic": "10.61 Wa Mā Takūnu Fī Sha'nin Wa Mā Tatlū Minhu Min Qur'ānin Wa Lā Ta`malūna Min `Amalin 'Illā Kunnā `Alaykum Shuhūdāan 'Idh Tufīđūna Fīhi Wa Mā Ya`zubu `An Rabbika Min Mithqāli Dharratin Fī Al-'Arđi Wa Lā Fī As-Samā'i Wa Lā 'Aşghara Min Dhālika Wa Lā 'Akbara 'Illā Fī Kitābin Mubīnin",
        "footnotes": {
            "english_saheeh": "[531]- Or \"the weight of a small ant.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And, [O Muḥammad], you are not [engaged] in any matter and do not recite any of the Qur’ān and you [people] do not do any deed except that We are witness over you when you are involved in it. And not absent from your Lord is any [part] of an atom's weight[531] within the earth or within the heaven or [anything] smaller than that or greater but that it is in a clear register.",
            "english_hilali_khan": "Neither you (O Muhammad صلى الله عليه وسلم) do any deed nor recite any portion of the Qur’ân, - nor you (mankind) do any deed (good or evil) but We are Witness thereof, when you are doing it. And nothing is hidden from your Lord (so much as) the weight of an atom (or small ant) on the earth or in the heaven. Not what is less than that or what is greater than that but is (written) in a Clear Record. (Tafsir At-Tabarî).",
            "english_rwwad": "Whatever matter you [O Prophet] may be engaged in, and whatever portion of the Qur’an you may recite, and whatever deed you [O people] may do, except that We are a Witness over you when you are engaged in it. Nothing is hidden from your Lord, not even an atom’s weight on earth nor in heaven, nor anything smaller or greater than that, except that it is [written] in a clear Record."
        }
    },
    {
        "id": 1425,
        "chapter": 10,
        "verse": 62,
        "arabic_text": "أَلَآ إِنَّ أَوۡلِيَآءَ ٱللَّهِ لَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ",
        "phonetic": "10.62 'Alā 'Inna 'Awliyā'a Allāhi Lā Khawfun `Alayhim Wa Lā Hum Yaĥzanūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:62) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"When the funeral is ready and the men carry it on their shoulders, if the deceased was righteous, it will say: ‘Present me (hurriedly),’ and if he was not righteous, it will say: ‘Woe to it (me)! Where are they taking it (me)?’ Its voice is heard by everything except man, and if he heard it, he would fall unconscious.\" (Sahih Al-Bukhari, Vol.2,Hadith No.400).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Unquestionably, [for] the allies of Allāh there will be no fear concerning them, nor will they grieve -",
            "english_hilali_khan": "No doubt! Verily, the Auliyâ’ of Allâh [i.e. those who believe in the Oneness of Allâh and fear Allâh much (abstain from all kinds of sins and evil deeds which he has forbidden), and love Allâh much (perform all kinds of good deeds which He has ordained)], no fear shall come upon them nor shall they grieve.[1]",
            "english_rwwad": "Indeed, the allies of Allah will have no fear, nor will they grieve."
        }
    },
    {
        "id": 1426,
        "chapter": 10,
        "verse": 63,
        "arabic_text": "ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ",
        "phonetic": "10.63 Al-Ladhīna 'Āmanū Wa Kānū Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who believed and were fearing Allāh.",
            "english_hilali_khan": "Those who believed (in the Oneness of Allâh - Islâmic Monotheism), and used to fear Allâh much (by abstaining from evil deeds and sins and by doing righteous deeds).",
            "english_rwwad": "Those who believe and fear Allah."
        }
    },
    {
        "id": 1427,
        "chapter": 10,
        "verse": 64,
        "arabic_text": "لَهُمُ ٱلۡبُشۡرَىٰ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۚ لَا تَبۡدِيلَ لِكَلِمَٰتِ ٱللَّهِۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "10.64 Lahumu Al-Bushrá Fī Al-Ĥayāati Ad-Dunyā Wa Fī Al-'Ākhirati Lā Tabdīla Likalimāti Allāhi Dhālika Huwa Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:64)\na) Narrated Abu Hurairah رضي الله عنه: I heard Allâh’s Messenger صلى الله عليه وسلم saying: \"Nothing is left of النبوة An-Nubuwwah (Prophethood) except Al-Mubashshirât.\" They asked, \"What is Al-Mubashshirât?\" He replied, \"The true good dreams (that convey glad tidings).\". (Sahih Al-Bukhari, Vol.9,Hadith No.119). b) Narrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said: \"The (good) dream of a faithful believer is a part of the forty-six parts of An-Nubuwwah (Prophethood).\" (Sahih Al-Bukhari, Vol.9,Hadith No. 117).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For them are good tidings in the worldly life and in the Hereafter. No change is there in the words [i.e., decrees] of Allāh. That is what is the great attainment.",
            "english_hilali_khan": "For them are glad tidings, in the life of the present world[2] (i.e. through a righteous dream seen by the person himself or shown to others), and in the Hereafter. No change can there be in the Words of Allâh. This is indeed the supreme success.",
            "english_rwwad": "For them are glad tidings in the life of this world and in the Hereafter; there is no change in Allah’s words. That is the supreme triumph."
        }
    },
    {
        "id": 1428,
        "chapter": 10,
        "verse": 65,
        "arabic_text": "وَلَا يَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِيعًاۚ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
        "phonetic": "10.65 Wa Lā Yaĥzunka Qawluhum 'Inna Al-`Izzata Lillāhi Jamī`āan Huwa As-Samī`u Al-`Alīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And let not their speech grieve you. Indeed, honor [due to power] belongs to Allāh entirely. He is the Hearing, the Knowing.",
            "english_hilali_khan": "And let not their speech grieve you (O Muhammad صلى الله عليه وسلم), for all power and honour belong to Allâh. He is the All-Hearer, the All-Knower.",
            "english_rwwad": "Do not let their words grieve you. Indeed, all power belongs to Allah. He is the All-Hearing, the All-Knowing."
        }
    },
    {
        "id": 1429,
        "chapter": 10,
        "verse": 66,
        "arabic_text": "أَلَآ إِنَّ لِلَّهِ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِۗ وَمَا يَتَّبِعُ ٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ شُرَكَآءَۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا يَخۡرُصُونَ",
        "phonetic": "10.66 'Alā 'Inna Lillāhi Man Fī As-Samāwāti Wa Man Fī Al-'Arđi Wa Mā Yattabi`u Al-Ladhīna Yad`ūna Min Dūni Allāhi Shurakā'a 'In Yattabi`ūna 'Illā Až-Žanna Wa 'In Hum 'Illā Yakhruşūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Unquestionably, to Allāh belongs whoever is in the heavens and whoever is on the earth. And those who invoke other than Allāh do not [actually] follow [His] \"partners.\" They follow not except assumption, and they are not but misjudging.",
            "english_hilali_khan": "No doubt! Verily, to Allâh belongs whosoever is in the heavens and whosoever is in the earth. And those who worship and invoke others besides Allâh, in fact they follow not (Allâh’s so-called) partners, they follow only a conjecture and they only invent lies.",
            "english_rwwad": "Indeed, to Allah belongs all those who are in the heavens and all those who are on earth. Those who invoke [so-called] partners besides Allah follow nothing but conjecture and they do nothing but lie."
        }
    },
    {
        "id": 1430,
        "chapter": 10,
        "verse": 67,
        "arabic_text": "هُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِتَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَسۡمَعُونَ",
        "phonetic": "10.67 Huwa Al-Ladhī Ja`ala Lakumu Al-Layla Litaskunū Fīhi Wa An-Nahāra Mubşirāan 'Inna Fī Dhālika La'āyātin Liqawmin Yasma`ūna",
        "footnotes": {
            "english_saheeh": "[532]- i.e., making things visible.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who made for you the night to rest therein and the day, giving sight.[532] Indeed in that are signs for a people who listen.",
            "english_hilali_khan": "He it is Who has appointed for you the night that you may rest therein, and the day to make things visible (to you). Verily, in this are Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) for a people who listen (i.e. those who think deeply).",
            "english_rwwad": "It is He Who made the night for you to rest therein and the day bright. Indeed, there are signs in this for people who listen."
        }
    },
    {
        "id": 1431,
        "chapter": 10,
        "verse": 68,
        "arabic_text": "قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ هُوَ ٱلۡغَنِيُّۖ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ إِنۡ عِندَكُم مِّن سُلۡطَٰنِۭ بِهَٰذَآۚ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ",
        "phonetic": "10.68 Qālū Attakhadha Allāhu Waladāan Subĥānahu Huwa Al-Ghanīyu Lahu Mā Fī As-Samāwāti Wa Mā Fī Al-'Arđi 'In `Indakum Min Sulţānin Bihadhā 'Ataqūlūna `Alá Allāhi Mā Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[533]- The Christians and others.\n[534]- Or \"evidence.\"",
            "english_hilali_khan": "(V.10:68) See the footnote of (V.6:101)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They[533] have said, \"Allāh has taken a son.\" Exalted is He; He is the [one] Free of need. To Him belongs whatever is in the heavens and whatever is in the earth. You have no authority[534] for this [claim]. Do you say about Allāh that which you do not know?",
            "english_hilali_khan": "They (Jews, Christians and pagans) say: \"Allâh has begotten a son (children).\" Glory is to Him! He is Rich (Free of all needs). His is all that is in the heavens and all that is in the earth. No warrant you have for this. Do you say against Allâh what you know not.[3]",
            "english_rwwad": "They say, “Allah has taken a son.” Glory be to Him! He is the Self-Sufficient. To Him belongs all that is in the heavens and all that is on earth. You have no proof for this. Do you say about Allah something that you do not know?"
        }
    },
    {
        "id": 1432,
        "chapter": 10,
        "verse": 69,
        "arabic_text": "قُلۡ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ",
        "phonetic": "10.69 Qul 'Inna Al-Ladhīna Yaftarūna `Alá Allāhi Al-Kadhiba Lā Yufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, those who invent falsehood about Allāh will not succeed.\"",
            "english_hilali_khan": "Say: \"Verily, those who invent a lie against Allâh will never be successful\" -",
            "english_rwwad": "Say, “Those who fabricate lies against Allah will never succeed.”"
        }
    },
    {
        "id": 1433,
        "chapter": 10,
        "verse": 70,
        "arabic_text": "مَتَٰعٞ فِي ٱلدُّنۡيَا ثُمَّ إِلَيۡنَا مَرۡجِعُهُمۡ ثُمَّ نُذِيقُهُمُ ٱلۡعَذَابَ ٱلشَّدِيدَ بِمَا كَانُواْ يَكۡفُرُونَ",
        "phonetic": "10.70 Matā`un Fī Ad-Dunyā Thumma 'Ilaynā Marji`uhum Thumma Nudhīquhumu Al-`Adhāba Ash-Shadīda Bimā Kānū Yakfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[For them is brief] enjoyment in this world; then to Us is their return; then We will make them taste the severe punishment because they used to disbelieve.",
            "english_hilali_khan": "(A brief) enjoyment in this world! - and then unto Us will be their return, then We shall make them taste the severest torment because they used to disbelieve [in Allâh, belie His Messengers, deny and challenge His Ayât (proofs, signs, verses, etc.)].",
            "english_rwwad": "A short enjoyment in this life, then to Us is their return, then We will make them taste the severe punishment because of their disbelief."
        }
    },
    {
        "id": 1434,
        "chapter": 10,
        "verse": 71,
        "arabic_text": "۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ نُوحٍ إِذۡ قَالَ لِقَوۡمِهِۦ يَٰقَوۡمِ إِن كَانَ كَبُرَ عَلَيۡكُم مَّقَامِي وَتَذۡكِيرِي بِـَٔايَٰتِ ٱللَّهِ فَعَلَى ٱللَّهِ تَوَكَّلۡتُ فَأَجۡمِعُوٓاْ أَمۡرَكُمۡ وَشُرَكَآءَكُمۡ ثُمَّ لَا يَكُنۡ أَمۡرُكُمۡ عَلَيۡكُمۡ غُمَّةٗ ثُمَّ ٱقۡضُوٓاْ إِلَيَّ وَلَا تُنظِرُونِ",
        "phonetic": "10.71 Wa Atlu `Alayhim Naba'a Nūĥin 'Idh Qāla Liqawmihi Yā Qawmi 'In Kāna Kabura `Alaykum Maqāmī Wa Tadhkīrī Bi'āyā Ti Allāhi Fa`alá Allāhi Tawakkaltu Fa'ajmi`ū 'Amrakum Wa Shurakā'akum Thumma Lā Yakun 'Amrukum `Alaykum Ghummatan Thumma Aqđū 'Ilayya Wa Lā Tunžirūni",
        "footnotes": {
            "english_saheeh": "[535]- i.e., Do not let it be a source of doubt or anxiety to you but let it be clear, open and defined.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And recite to them the news of Noah, when he said to his people, \"O my people, if my residence and my reminding of the signs of Allāh has become burdensome upon you - then I have relied upon Allāh. So resolve upon your plan and [call upon] your associates. Then let not your plan be obscure to you.[535] Then carry it out upon me and do not give me respite.",
            "english_hilali_khan": "And recite to them the news of Nûh (Noah). When he said to his people: \"O my people, if my stay (with you), and my reminding (you) of the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh is hard on you, then I put my trust in Allâh. So devise your plot, you and your partners, and let not your plot be in doubt for you. Then pass your sentence on me and give me no respite.",
            "english_rwwad": "Relate to them the story of Noah when he said to his people, “O my People, if my presence among you and my reminding you of Allah’s signs have become unbearable to you, then in Allah I have put my trust. So gather all your schemes, you and your [so-called] partners, leaving no room for uncertainty, then carry it out against me, and give me no respite."
        }
    },
    {
        "id": 1435,
        "chapter": 10,
        "verse": 72,
        "arabic_text": "فَإِن تَوَلَّيۡتُمۡ فَمَا سَأَلۡتُكُم مِّنۡ أَجۡرٍۖ إِنۡ أَجۡرِيَ إِلَّا عَلَى ٱللَّهِۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ",
        "phonetic": "10.72 Fa'in Tawallaytum Famā Sa'altukum Min 'Ajrin 'In 'Ajrī 'Illā `Alá Allāhi Wa 'Umirtu 'An 'Akūna Mina Al-Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you turn away [from my advice] - then no payment have I asked of you. My reward is only from Allāh, and I have been commanded to be of the Muslims [i.e., those who submit to Allāh].\"",
            "english_hilali_khan": "\"But if you turn away [from accepting my doctrine of Islâmic Monotheism, i.e. to worship none but Allâh], then no reward have I asked of you; my reward is only from Allâh, and I have been commanded to be of the Muslims (i.e. those who submit to Allâh’s Will).\"",
            "english_rwwad": "But if you turn away, then I have not asked you for any reward. My reward is only with Allah, and I have been commanded to be among those who submit to Allah [as Muslims].”"
        }
    },
    {
        "id": 1436,
        "chapter": 10,
        "verse": 73,
        "arabic_text": "فَكَذَّبُوهُ فَنَجَّيۡنَٰهُ وَمَن مَّعَهُۥ فِي ٱلۡفُلۡكِ وَجَعَلۡنَٰهُمۡ خَلَٰٓئِفَ وَأَغۡرَقۡنَا ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُنذَرِينَ",
        "phonetic": "10.73 Fakadhabūhu Fanajjaynāhu Wa Man Ma`ahu Fī Al-Fulki Wa Ja`alnāhum Khalā'ifa Wa 'Aghraqnā Al-Ladhīna Kadhabū Bi'āyātinā Fānžur Kayfa Kāna `Āqibatu Al-Mundharīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they denied him, so We saved him and those with him in the ship and made them successors, and We drowned those who denied Our signs. Then see how was the end of those who were warned.",
            "english_hilali_khan": "They denied him, but We delivered him, and those with him in the ship, and We made them generations replacing one after another, while We drowned those who belied Our Ayât (proofs, evidence, lessons, signs, revelations, etc.). Then see what was the end of those who were warned.",
            "english_rwwad": "But they rejected him, so We saved him and those who were with him in the Ark, and made them successors; and We drowned those who rejected Our signs. Then see how was the end of those who were warned."
        }
    },
    {
        "id": 1437,
        "chapter": 10,
        "verse": 74,
        "arabic_text": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِۦ رُسُلًا إِلَىٰ قَوۡمِهِمۡ فَجَآءُوهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ بِهِۦ مِن قَبۡلُۚ كَذَٰلِكَ نَطۡبَعُ عَلَىٰ قُلُوبِ ٱلۡمُعۡتَدِينَ",
        "phonetic": "10.74 Thumma Ba`athnā Min Ba`dihi Rusulāan 'Ilá Qawmihim Fajā'ūhum Bil-Bayyināti Famā Kānū Liyu'uminū Bimā Kadhabū Bihi Min Qablu Kadhālika Naţba`u `Alá Qulūbi Al-Mu`tadīna",
        "footnotes": {
            "english_saheeh": "[536]- i.e., the succeeding generations were persistent in disbelief.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We sent after him messengers to their peoples, and they came to them with clear proofs. But they were not to believe in that which they had denied before.[536] Thus We seal over the hearts of the transgressors.",
            "english_hilali_khan": "Then after him We sent Messengers to their people. They brought them clear proofs, but they would not believe what they had already rejected beforehand. Thus We seal the hearts of the transgressors (those who disbelieve in the Oneness of Allâh and disobey Him).",
            "english_rwwad": "Then We sent after him messengers to their [own] peoples; they came to them with clear proofs, but they would not believe in what they had already rejected beforehand. This is how We seal the hearts of the transgressors."
        }
    },
    {
        "id": 1438,
        "chapter": 10,
        "verse": 75,
        "arabic_text": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ وَهَٰرُونَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ بِـَٔايَٰتِنَا فَٱسۡتَكۡبَرُواْ وَكَانُواْ قَوۡمٗا مُّجۡرِمِينَ",
        "phonetic": "10.75 Thumma Ba`athnā Min Ba`dihim Mūsá Wa Hārūna 'Ilá Fir`awna Wa Mala'ihi Bi'āyātinā Fāstakbarū Wa Kānū Qawmāan Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We sent after them Moses and Aaron to Pharaoh and his establishment with Our signs, but they behaved arrogantly and were a criminal people.",
            "english_hilali_khan": "Then after them We sent Mûsâ (Moses) and Hârûn (Aaron) to Fir‘aun (Pharaoh) and his chiefs with Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.). But they behaved arrogantly and were Mujrimûn (disbelievers, sinners, polytheists, criminals) folk.",
            "english_rwwad": "Then We sent after them Moses and Aaron with Our signs to Pharaoh and his chiefs, but they showed arrogance and were wicked people."
        }
    },
    {
        "id": 1439,
        "chapter": 10,
        "verse": 76,
        "arabic_text": "فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُوٓاْ إِنَّ هَٰذَا لَسِحۡرٞ مُّبِينٞ",
        "phonetic": "10.76 Falammā Jā'ahumu Al-Ĥaqqu Min `Indinā Qālū 'Inna Hādhā Lasiĥrun Mubīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when there came to them the truth from Us, they said, \"Indeed, this is obvious magic.\"",
            "english_hilali_khan": "So when came to them the truth from Us, they said: \"This is indeed clear magic.\"",
            "english_rwwad": "So when the truth came to them from Us, they said, “This is indeed a clear magic!”"
        }
    },
    {
        "id": 1440,
        "chapter": 10,
        "verse": 77,
        "arabic_text": "قَالَ مُوسَىٰٓ أَتَقُولُونَ لِلۡحَقِّ لَمَّا جَآءَكُمۡۖ أَسِحۡرٌ هَٰذَا وَلَا يُفۡلِحُ ٱلسَّٰحِرُونَ",
        "phonetic": "10.77 Qāla Mūsá 'Ataqūlūna Lilĥaqqi Lammā Jā'akum 'Asiĥrun Hādhā Wa Lā Yufliĥu As-Sāĥirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Moses said, \"Do you say [thus] about the truth when it has come to you? Is this magic? But magicians will not succeed.\"",
            "english_hilali_khan": "Mûsâ (Moses) said: \"Say you (this) about the truth when it has come to you? Is this magic? But the magicians will never be successful.\"",
            "english_rwwad": "Moses said, “Do you say this about the truth after it has come to you? Can this be magic? But magicians will never succeed.”"
        }
    },
    {
        "id": 1441,
        "chapter": 10,
        "verse": 78,
        "arabic_text": "قَالُوٓاْ أَجِئۡتَنَا لِتَلۡفِتَنَا عَمَّا وَجَدۡنَا عَلَيۡهِ ءَابَآءَنَا وَتَكُونَ لَكُمَا ٱلۡكِبۡرِيَآءُ فِي ٱلۡأَرۡضِ وَمَا نَحۡنُ لَكُمَا بِمُؤۡمِنِينَ",
        "phonetic": "10.78 Qālū 'Aji'tanā Litalfitanā `Ammā Wajadnā `Alayhi 'Ābā'anā Wa Takūna Lakumā Al-Kibriyā'u Fī Al-'Arđi Wa Mā Naĥnu Lakumā Bimu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"Have you come to us to turn us away from that upon which we found our fathers and so that you two may have grandeur in the land? And we are not believers in you.\"",
            "english_hilali_khan": "They said: \"Have you come to us to turn us away from that (Faith) we found our fathers following, and that you two may have greatness in the land? We are not going to believe you two!\"",
            "english_rwwad": "They said, “Have you come to turn us away from what we found our forefathers following, so that you two might become supreme in the land? We will never believe in you!”"
        }
    },
    {
        "id": 1442,
        "chapter": 10,
        "verse": 79,
        "arabic_text": "وَقَالَ فِرۡعَوۡنُ ٱئۡتُونِي بِكُلِّ سَٰحِرٍ عَلِيمٖ",
        "phonetic": "10.79 Wa Qāla Fir`awnu A'tūnī Bikulli Sāĥirin `Alīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Pharaoh said, \"Bring to me every learned magician.\"",
            "english_hilali_khan": "And Fir‘aun (Pharaoh) said: \"Bring me every well-versed sorcerer.\"",
            "english_rwwad": "Pharaoh said, “Bring me all learned magicians.”"
        }
    },
    {
        "id": 1443,
        "chapter": 10,
        "verse": 80,
        "arabic_text": "فَلَمَّا جَآءَ ٱلسَّحَرَةُ قَالَ لَهُم مُّوسَىٰٓ أَلۡقُواْ مَآ أَنتُم مُّلۡقُونَ",
        "phonetic": "10.80 Falammā Jā'a As-Saĥaratu Qāla Lahum Mūsá 'Alqū Mā 'Antum Mulqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when the magicians came, Moses said to them, \"Throw down whatever you will throw.\"",
            "english_hilali_khan": "And when the sorcerers came, Mûsâ (Moses) said to them: \"Cast down what you want to cast!\"",
            "english_rwwad": "When the magicians came, Moses said to them, “Cast whatever you have to cast.”"
        }
    },
    {
        "id": 1444,
        "chapter": 10,
        "verse": 81,
        "arabic_text": "فَلَمَّآ أَلۡقَوۡاْ قَالَ مُوسَىٰ مَا جِئۡتُم بِهِ ٱلسِّحۡرُۖ إِنَّ ٱللَّهَ سَيُبۡطِلُهُۥٓ إِنَّ ٱللَّهَ لَا يُصۡلِحُ عَمَلَ ٱلۡمُفۡسِدِينَ",
        "phonetic": "10.81 Falammā 'Alqaw Qāla Mūsá Mā Ji'tum Bihi As-Siĥru 'Inna Allāha Sayubţiluhu 'Inna Allāha Lā Yuşliĥu `Amala Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they had thrown, Moses said, \"What you have brought is [only] magic. Indeed, Allāh will expose its worthlessness. Indeed, Allāh does not amend the work of corrupters.",
            "english_hilali_khan": "Then when they had cast down, Mûsâ (Moses) said: \"What you have brought is sorcery; Allâh will surely make it of no effect. Verily, Allâh does not set right the work of Al-Mufsidûn (the evil-doers, corrupters).",
            "english_rwwad": "When they did, Moses said, “All what you have brought is mere magic; Allah will surely make it useless, for Allah does not let the work of the mischief-makers to thrive."
        }
    },
    {
        "id": 1445,
        "chapter": 10,
        "verse": 82,
        "arabic_text": "وَيُحِقُّ ٱللَّهُ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ",
        "phonetic": "10.82 Wa Yuĥiqqu Allāhu Al-Ĥaqqa Bikalimātihi Wa Law Kariha Al-Mujrimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh will establish the truth by His words, even if the criminals dislike it.\"",
            "english_hilali_khan": "\"And Allâh will establish and make apparent the truth by His Words, however much the Mujrimûn (criminals, disbelievers, polytheists, sinners) may hate it.\"",
            "english_rwwad": "And Allah establishes the truth by His Words, even though the wicked abhor it.”"
        }
    },
    {
        "id": 1446,
        "chapter": 10,
        "verse": 83,
        "arabic_text": "فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٞ مِّن قَوۡمِهِۦ عَلَىٰ خَوۡفٖ مِّن فِرۡعَوۡنَ وَمَلَإِيْهِمۡ أَن يَفۡتِنَهُمۡۚ وَإِنَّ فِرۡعَوۡنَ لَعَالٖ فِي ٱلۡأَرۡضِ وَإِنَّهُۥ لَمِنَ ٱلۡمُسۡرِفِينَ",
        "phonetic": "10.83 Famā 'Āmana Limūsá 'Illā Dhurrīyatun Min Qawmihi `Alá Khawfin Min Fir`awna Wa Mala'ihim 'An Yaftinahum Wa 'Inna Fir`awna La`ālin Fī Al-'Arđi Wa 'Innahu Lamina Al-Musrifīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But no one believed Moses, except [some] offspring [i.e., youths] among his people, for fear of Pharaoh and his establishment that they would persecute them. And indeed, Pharaoh was haughty within the land, and indeed, he was of the transgressors.",
            "english_hilali_khan": "But none believed in Mûsâ (Moses) except the offspring of his people, because of the fear of Fir‘aun (Pharaoh) and his chiefs, lest they should persecute them; and verily, Fir‘aun (Pharaoh) was an arrogant tyrant on the earth, he was indeed one of the Musrifûn (polytheists, sinners and transgressors, those who give up the truth and follow the evil, and commit all kinds of great sins).",
            "english_rwwad": "But none believed in Moses except few youth of his own people, despite their fear that Pharaoh and their own chiefs might persecute them. Pharaoh was indeed a tyrant in the land and he was truly one of the transgressors."
        }
    },
    {
        "id": 1447,
        "chapter": 10,
        "verse": 84,
        "arabic_text": "وَقَالَ مُوسَىٰ يَٰقَوۡمِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ فَعَلَيۡهِ تَوَكَّلُوٓاْ إِن كُنتُم مُّسۡلِمِينَ",
        "phonetic": "10.84 Wa Qāla Mūsá Yā Qawmi 'In Kuntum 'Āmantum Billāhi Fa`alayhi Tawakkalū 'In Kuntum Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Moses said, \"O my people, if you have believed in Allāh, then rely upon Him, if you should be Muslims [i.e., submitting to Him].\"",
            "english_hilali_khan": "And Mûsâ (Moses) said: \"O my people! If you have believed in Allâh, then put your trust in Him if you are Muslims (those who submit to Allâh’s Will).\"",
            "english_rwwad": "Moses said, “O my people, if you have faith in Allah, then put your trust in Him, if you have truly submitted.”"
        }
    },
    {
        "id": 1448,
        "chapter": 10,
        "verse": 85,
        "arabic_text": "فَقَالُواْ عَلَى ٱللَّهِ تَوَكَّلۡنَا رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلۡقَوۡمِ ٱلظَّٰلِمِينَ",
        "phonetic": "10.85 Faqālū `Alá Allāhi Tawakkalnā Rabbanā Lā Taj`alnā Fitnatan Lilqawmi Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they said, \"Upon Allāh do we rely. Our Lord, make us not [objects of] trial for the wrongdoing people",
            "english_hilali_khan": "They said: \"In Allâh we put our trust. Our Lord! Make us not a trial for the folk who are Zâlimûn (polytheists and wrong-doers) (i.e. do not make them overpower us).",
            "english_rwwad": "They said, “In Allah we put our trust. Our Lord, do not subject us to the persecution of the oppressive people,"
        }
    },
    {
        "id": 1449,
        "chapter": 10,
        "verse": 86,
        "arabic_text": "وَنَجِّنَا بِرَحۡمَتِكَ مِنَ ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ",
        "phonetic": "10.86 Wa Najjinā Biraĥmatika Mina Al-Qawmi Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And save us by Your mercy from the disbelieving people.\"",
            "english_hilali_khan": "\"And save us by Your Mercy from the disbelieving folk.\"",
            "english_rwwad": "and save us by Your mercy from the disbelieving people.”"
        }
    },
    {
        "id": 1450,
        "chapter": 10,
        "verse": 87,
        "arabic_text": "وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰ وَأَخِيهِ أَن تَبَوَّءَا لِقَوۡمِكُمَا بِمِصۡرَ بُيُوتٗا وَٱجۡعَلُواْ بُيُوتَكُمۡ قِبۡلَةٗ وَأَقِيمُواْ ٱلصَّلَوٰةَۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "10.87 Wa 'Awĥaynā 'Ilá Mūsá Wa 'Akhīhi 'An Tabawwa'ā Liqawmikumā Bimişra Buyūtāan Wa Aj`alū Buyūtakum Qiblatan Wa 'Aqīmū Aş-Şalāata Wa Bashiri Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[537]- In order that they might pray therein unseen by their enemy.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We inspired to Moses and his brother, \"Settle your people in Egypt in houses and make your houses [facing the] qiblah[537] and establish prayer and give good tidings to the believers.\"",
            "english_hilali_khan": "And We revealed to Mûsâ (Moses) and his brother (saying): \"Provide dwellings for your people in Egypt, and make your dwellings as places for your worship, and perform As-Salât (Iqâmat-as-Salât ), and give glad tidings to the believers.\"",
            "english_rwwad": "We inspired Moses and his brother, “Provide houses for your people in Egypt, and make your houses face the qiblah direction, establish prayer, and give glad tidings to the believers.”"
        }
    },
    {
        "id": 1451,
        "chapter": 10,
        "verse": 88,
        "arabic_text": "وَقَالَ مُوسَىٰ رَبَّنَآ إِنَّكَ ءَاتَيۡتَ فِرۡعَوۡنَ وَمَلَأَهُۥ زِينَةٗ وَأَمۡوَٰلٗا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا رَبَّنَا لِيُضِلُّواْ عَن سَبِيلِكَۖ رَبَّنَا ٱطۡمِسۡ عَلَىٰٓ أَمۡوَٰلِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا يُؤۡمِنُواْ حَتَّىٰ يَرَوُاْ ٱلۡعَذَابَ ٱلۡأَلِيمَ",
        "phonetic": "10.88 Wa Qāla Mūsá Rabbanā 'Innaka 'Ātayta Fir`awna Wa Mala'ahu Zīnatan Wa 'Amwālāan Fī Al-Ĥayāati Ad-Dunyā Rabbanā Liyuđillū `An Sabīlika Rabbanā Aţmis `Alá 'Amwālihim Wa Ashdud `Alá Qulūbihim Falā Yu'uminū Ĥattá Yaraw Al-`Adhāba Al-'Alīma",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Moses said, \"Our Lord, indeed You have given Pharaoh and his establishment splendor and wealth in the worldly life, our Lord, that they may lead [men] astray from Your way. Our Lord, obliterate their wealth and harden their hearts so that they will not believe until they see the painful punishment.\"",
            "english_hilali_khan": "And Mûsâ (Moses) said: \"Our Lord! You have indeed bestowed on Fir‘aun (Pharaoh) and his chiefs splendour and wealth in the life of this world, our Lord! that they may lead men astray from Your Path. Our Lord! Destroy their wealth, and harden their hearts, so that they will not believe until they see the painful torment.\"",
            "english_rwwad": "Moses said, “Our Lord, You have given Pharaoh and his chiefs splendor and wealth in the life of this world. Our Lord, they may lead people astray from Your way. Our Lord, destroy their wealth and harden their hearts, so that they will not believe until they see the painful punishment.”"
        }
    },
    {
        "id": 1452,
        "chapter": 10,
        "verse": 89,
        "arabic_text": "قَالَ قَدۡ أُجِيبَت دَّعۡوَتُكُمَا فَٱسۡتَقِيمَا وَلَا تَتَّبِعَآنِّ سَبِيلَ ٱلَّذِينَ لَا يَعۡلَمُونَ",
        "phonetic": "10.89 Qāla Qad 'Ujībat Da`watukumā Fāstaqīmā Wa Lā Tattabi`āni Sabīla Al-Ladhīna Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[538]- Literally, \"the supplication of both of you,\" i.e., that of Moses and of Aaron, who joined by saying, \"Āmeen\" (\"O Allāh, respond\").",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"Your supplication has been answered.\"[538] So remain on a right course and follow not the way of those who do not know.\"",
            "english_hilali_khan": "Allâh said: \"Verily, the invocation of you both is accepted. So you both keep to the Straight Way (i.e. keep on doing good deeds and preaching Allâh’s Message with patience), and follow not the path of those who know not (the truth i.e. to believe in the Oneness of Allâh, and also to believe in the Reward of Allâh: Paradise).\"",
            "english_rwwad": "Allah said [to Moses and Aaron], “Your prayer is answered, so be steadfast on the straight path, and do not follow the way of those who do not know.”"
        }
    },
    {
        "id": 1453,
        "chapter": 10,
        "verse": 90,
        "arabic_text": "۞ وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتۡبَعَهُمۡ فِرۡعَوۡنُ وَجُنُودُهُۥ بَغۡيٗا وَعَدۡوًاۖ حَتَّىٰٓ إِذَآ أَدۡرَكَهُ ٱلۡغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱلَّذِيٓ ءَامَنَتۡ بِهِۦ بَنُوٓاْ إِسۡرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِينَ",
        "phonetic": "10.90 Wa Jāwaznā Bibanī 'Isrā'īla Al-Baĥra Fa'atba`ahum Fir`awnu Wa Junūduhu Baghyāan Wa`adwan Ĥattá 'Idhā 'Adrakahu Al-Gharaqu Qāla 'Āmantu 'Annahu Lā 'Ilāha 'Illā Al-Ladhī 'Āmanat Bihi Banū 'Isrā'īla Wa 'Anā Mina Al-Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We took the Children of Israel across the sea, and Pharaoh and his soldiers pursued them in tyranny and enmity until, when drowning overtook him, he said, \"I believe that there is no deity except that in whom the Children of Israel believe, and I am of the Muslims.\"",
            "english_hilali_khan": "And We took the Children of Israel across the sea, and Fir‘aun (Pharaoh) with his hosts followed them in oppression and enmity, till when drowning overtook him, he said: \"I believe that none has the right to be worshipped but He (Allâh) in Whom the Children of Israel believe, and I am one of the Muslims (those who submit to Allâh’s Will).\"",
            "english_rwwad": "We led the Children of Israel across the sea, then Pharaoh and his soldiers pursued them out of transgression and tyranny, until when he was drowning, he said, “I believe that none has the right to be worshiped except He in whom the Children of Israel believe, and I am one of those who submit to Allah.”"
        }
    },
    {
        "id": 1454,
        "chapter": 10,
        "verse": 91,
        "arabic_text": "ءَآلۡـَٰٔنَ وَقَدۡ عَصَيۡتَ قَبۡلُ وَكُنتَ مِنَ ٱلۡمُفۡسِدِينَ",
        "phonetic": "10.91 'Āl'āna Wa Qad `Aşayta Qablu Wa Kunta Mina Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Now? And you had disobeyed [Him] before and were of the corrupters?",
            "english_hilali_khan": "Now (you believe) while you refused to believe before and you were one of the Mufsidûn (evil-doers, the corrupters).",
            "english_rwwad": "[He was told], “Now [you believe]? You had always been disobedient, and were one of the mischief-makers!"
        }
    },
    {
        "id": 1455,
        "chapter": 10,
        "verse": 92,
        "arabic_text": "فَٱلۡيَوۡمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَايَةٗۚ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ عَنۡ ءَايَٰتِنَا لَغَٰفِلُونَ",
        "phonetic": "10.92 Fālyawma Nunajjīka Bibadanika Litakūna Liman Khalfaka 'Āyatan Wa 'Inna Kathīrāan Mina An-Nāsi `An 'Āyātinā Laghāfilūna",
        "footnotes": {
            "english_saheeh": "[539]- i.e., his dead body will be preserved and not destroyed.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So today We will save you in body[539] that you may be to those who succeed you a sign. And indeed, many among the people, of Our signs, are heedless.",
            "english_hilali_khan": "So this day We shall deliver your (dead) body (out from the sea) that you may be a sign to those who come after you! And verily, many among mankind are heedless of Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.).",
            "english_rwwad": "So today We will preserve your body, so that you will be an example for those who come after you, yet most people are heedless of Our signs.”"
        }
    },
    {
        "id": 1456,
        "chapter": 10,
        "verse": 93,
        "arabic_text": "وَلَقَدۡ بَوَّأۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ مُبَوَّأَ صِدۡقٖ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ فَمَا ٱخۡتَلَفُواْ حَتَّىٰ جَآءَهُمُ ٱلۡعِلۡمُۚ إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ",
        "phonetic": "10.93 Wa Laqad Bawwa'nā Banī 'Isrā'īla Mubawwa'a Şidqin Wa Razaqnāhum Mina Aţ-Ţayyibāti Famā Akhtalafū Ĥattá Jā'ahumu Al-`Ilmu 'Inna Rabbaka Yaqđī Baynahum Yawma Al-Qiyāmati Fīmā Kānū Fīhi Yakhtalifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly settled the Children of Israel in an agreeable settlement and provided them with good things. And they did not differ until [after] knowledge had come to them. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
            "english_hilali_khan": "And indeed We settled the Children of Israel in an honourable dwelling place (Shâm and Misr), and provided them with good things, and they differed not until the knowledge came to them. Verily, Allâh will judge between them on the Day of Resurrection in that in which they used to differ.",
            "english_rwwad": "We settled the Children of Israel in a blessed land, and provided good things for their sustenance. They did not differ until after knowledge had come to them. Your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ."
        }
    },
    {
        "id": 1457,
        "chapter": 10,
        "verse": 94,
        "arabic_text": "فَإِن كُنتَ فِي شَكّٖ مِّمَّآ أَنزَلۡنَآ إِلَيۡكَ فَسۡـَٔلِ ٱلَّذِينَ يَقۡرَءُونَ ٱلۡكِتَٰبَ مِن قَبۡلِكَۚ لَقَدۡ جَآءَكَ ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ",
        "phonetic": "10.94 Fa'in Kunta Fī Shakkin Mimmā 'Anzalnā 'Ilayka Fās'ali Al-Ladhīna Yaqra'ūna Al-Kitāba Min Qablika Laqad Jā'aka Al-Ĥaqqu Min Rabbika Falā Takūnanna Mina Al-Mumtarīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.10:94): See (V.2:76), (V.7:157) and their footnotes.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So if you are in doubt, [O Muḥammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you. The truth has certainly come to you from your Lord, so never be among the doubters.",
            "english_hilali_khan": "So if you (O Muhammad صلى الله عليه وسلم) are in doubt concerning that which We have revealed unto you, [i.e. that your name is written in the Taurât (Torah) and the Injeel (Gospel)], then ask those who are reading the Book [the Taurât (Torah) and the Injeel (Gospel)] before you. Verily, the truth has come to you from your Lord. So be not of those who doubt (it).[1]",
            "english_rwwad": "If you are in doubt about what We have sent down to you [O Prophet], then ask those who read the Scripture before you. The truth has surely come to you from your Lord, so never be of those who doubt,"
        }
    },
    {
        "id": 1458,
        "chapter": 10,
        "verse": 95,
        "arabic_text": "وَلَا تَكُونَنَّ مِنَ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِ فَتَكُونَ مِنَ ٱلۡخَٰسِرِينَ",
        "phonetic": "10.95 Wa Lā Takūnanna Mina Al-Ladhīna Kadhabū Bi'āyāti Allāhi Fatakūna Mina Al-Khāsirīna",
        "footnotes": {
            "english_saheeh": "[540]- Among the interpretations of the last two verses is that they were meant to stir the Prophet (ﷺ) to declare and confirm his certainty, which he did.  Another is that although the words are addressed to the Prophet (ﷺ), they are directed to all people.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And never be of those who deny the signs of Allāh and [thus] be among the losers.[540]",
            "english_hilali_khan": "And be not one of those who belie the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh, for then you shall be one of the losers.",
            "english_rwwad": "and never be of those who reject the signs of Allah, for then you would be among the losers."
        }
    },
    {
        "id": 1459,
        "chapter": 10,
        "verse": 96,
        "arabic_text": "إِنَّ ٱلَّذِينَ حَقَّتۡ عَلَيۡهِمۡ كَلِمَتُ رَبِّكَ لَا يُؤۡمِنُونَ",
        "phonetic": "10.96 'Inna Al-Ladhīna Ĥaqqat `Alayhim Kalimatu Rabbika Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those upon whom the word [i.e., decree] of your Lord has come into effect will not believe,",
            "english_hilali_khan": "Truly! Those, against whom the Word (Wrath) of your Lord has been justified, will not believe.",
            "english_rwwad": "Indeed, those upon whom the decree of Allah is passed will not believe,"
        }
    },
    {
        "id": 1460,
        "chapter": 10,
        "verse": 97,
        "arabic_text": "وَلَوۡ جَآءَتۡهُمۡ كُلُّ ءَايَةٍ حَتَّىٰ يَرَوُاْ ٱلۡعَذَابَ ٱلۡأَلِيمَ",
        "phonetic": "10.97 Wa Law Jā'at/hum Kullu 'Āyatin Ĥattá Yaraw Al-`Adhāba Al-'Alīma",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Even if every sign should come to them, until they see the painful punishment.",
            "english_hilali_khan": "Even if every sign should come to them, until they see the painful torment.",
            "english_rwwad": "even if every sign were to come to them, until they see the painful punishment."
        }
    },
    {
        "id": 1461,
        "chapter": 10,
        "verse": 98,
        "arabic_text": "فَلَوۡلَا كَانَتۡ قَرۡيَةٌ ءَامَنَتۡ فَنَفَعَهَآ إِيمَٰنُهَآ إِلَّا قَوۡمَ يُونُسَ لَمَّآ ءَامَنُواْ كَشَفۡنَا عَنۡهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَتَّعۡنَٰهُمۡ إِلَىٰ حِينٖ",
        "phonetic": "10.98 Falawlā Kānat Qaryatun 'Āmanat Fanafa`ahā 'Īmānuhā 'Illā Qawma Yūnis Lammā 'Āmanū Kashafnā `Anhum `Adhāba Al-Khizyi Fī Al-Ĥayāati Ad-Dunyā Wa Matta`nāhum 'Ilá Ĥīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then has there not been a [single] city that believed so its faith benefited it except the people of Jonah? When they believed, We removed from them the punishment of disgrace in worldly life and gave them enjoyment [i.e., provision] for a time.",
            "english_hilali_khan": "Was there any town (community) that believed (after seeing the punishment), and its Faith (at that moment) saved it (from the punishment)? (The answer is none) - except the people of Yûnus (Jonah); when they believed, We removed from them the torment of disgrace in the life of the (present) world, and permitted them to enjoy for a while.",
            "english_rwwad": "There had never been any town that believed [after seeing the punishment] and benefited from its faith except the people of Jonah. When they believed, We removed from them the punishment of disgrace in the life of this world, and let them enjoy themselves for a while."
        }
    },
    {
        "id": 1462,
        "chapter": 10,
        "verse": 99,
        "arabic_text": "وَلَوۡ شَآءَ رَبُّكَ لَأٓمَنَ مَن فِي ٱلۡأَرۡضِ كُلُّهُمۡ جَمِيعًاۚ أَفَأَنتَ تُكۡرِهُ ٱلنَّاسَ حَتَّىٰ يَكُونُواْ مُؤۡمِنِينَ",
        "phonetic": "10.99 Wa Law Shā'a Rabbuka La'āmana Man Fī Al-'Arđi Kulluhum Jamī`āan 'Afa'anta Tukrihu An-Nāsa Ĥattá Yakūnū Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And had your Lord willed, those on earth would have believed - all of them entirely. Then, [O Muḥammad], would you compel the people in order that they become believers?",
            "english_hilali_khan": "And had your Lord willed, those on earth would have believed, all of them together. So, will you (O Muhammad صلى الله عليه وسلم) then compel mankind, until they become believers.",
            "english_rwwad": "Had your Lord willed, all those on earth would have believed altogether. Will you then compel people to become believers?"
        }
    },
    {
        "id": 1463,
        "chapter": 10,
        "verse": 100,
        "arabic_text": "وَمَا كَانَ لِنَفۡسٍ أَن تُؤۡمِنَ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَيَجۡعَلُ ٱلرِّجۡسَ عَلَى ٱلَّذِينَ لَا يَعۡقِلُونَ",
        "phonetic": "10.100 Wa Mā Kāna Linafsin 'An Tu'umina 'Illā Bi'idhni Allāhi Wa Yaj`alu Ar-Rijsa `Alá Al-Ladhīna Lā Ya`qilūna",
        "footnotes": {
            "english_saheeh": "[541]- Among its meanings are filth, wrath, punishment, disbelief, confusion and error.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is not for a soul [i.e., anyone] to believe except by permission of Allāh, and He will place defilement[541] upon those who will not use reason.",
            "english_hilali_khan": "It is not for any person to believe, except by the Leave of Allâh, and He will put the wrath on those who are heedless.",
            "english_rwwad": "No soul can believe except by Allah’s will, and He will bring disgrace upon those who do not use their intellect."
        }
    },
    {
        "id": 1464,
        "chapter": 10,
        "verse": 101,
        "arabic_text": "قُلِ ٱنظُرُواْ مَاذَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَا تُغۡنِي ٱلۡأٓيَٰتُ وَٱلنُّذُرُ عَن قَوۡمٖ لَّا يُؤۡمِنُونَ",
        "phonetic": "10.101 Qul Anžurū Mādhā Fī As-Samāwāti Wa Al-'Arđi Wa Mā Tughnī Al-'Āyātu Wa An-Nudhuru `An Qawmin Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Observe what is in the heavens and the earth.\" But of no avail will be signs or warners to a people who do not believe.",
            "english_hilali_khan": "Say: \"Behold all that is in the heavens and the earth,\" but neither Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) nor warners benefit those who believe not.",
            "english_rwwad": "Say, “Look at what is in the heavens and earth.” But the signs and warnings are of no avail to those who do not believe."
        }
    },
    {
        "id": 1465,
        "chapter": 10,
        "verse": 102,
        "arabic_text": "فَهَلۡ يَنتَظِرُونَ إِلَّا مِثۡلَ أَيَّامِ ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلِهِمۡۚ قُلۡ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ",
        "phonetic": "10.102 Fahal Yantažirūna 'Illā Mithla 'Ayyāmi Al-Ladhīna Khalaw Min Qablihim Qul Fāntažirū 'Innī Ma`akum Mina Al-Muntažirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So do they wait except for like [what occurred in] the days of those who passed on before them? Say, \"Then wait; indeed, I am with you among those who wait.\"",
            "english_hilali_khan": "Then do they wait for (anything) save for (a destruction) like that of the days of the men who passed away before them? Say: \"Wait then, I am (too) with you among those who wait.\"",
            "english_rwwad": "Are they waiting except for the same punishment that befell those who came before them? Say, “Then wait. I too am waiting with you.”"
        }
    },
    {
        "id": 1466,
        "chapter": 10,
        "verse": 103,
        "arabic_text": "ثُمَّ نُنَجِّي رُسُلَنَا وَٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ حَقًّا عَلَيۡنَا نُنجِ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "10.103 Thumma Nunajjī Rusulanā Wa Al-Ladhīna 'Āmanū Kadhālika Ĥaqqāan `Alaynā Nunji Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[542]- From Allāh's punishment.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We will save Our messengers and those who have believed. Thus, it is an obligation upon Us that We save the believers.[542]",
            "english_hilali_khan": "Then (in the end) We save Our Messengers and those who believe! Thus it is incumbent upon Us to save the believers.",
            "english_rwwad": "Then We will save Our messengers and those who believe. For We took it upon Us to save the believers."
        }
    },
    {
        "id": 1467,
        "chapter": 10,
        "verse": 104,
        "arabic_text": "قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِي شَكّٖ مِّن دِينِي فَلَآ أَعۡبُدُ ٱلَّذِينَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ وَلَٰكِنۡ أَعۡبُدُ ٱللَّهَ ٱلَّذِي يَتَوَفَّىٰكُمۡۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "10.104 Qul Yā 'Ayyuhā An-Nāsu 'In Kuntum Fī Shakkin Min Dīnī Falā 'A`budu Al-Ladhīna Ta`budūna Min Dūni Allāhi Wa Lakin 'A`budu Allāha Al-Ladhī Yatawaffākum Wa 'Umirtu 'An 'Akūna Mina Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"O people, if you are in doubt as to my religion - then I do not worship those which you worship besides Allāh; but I worship Allāh, who causes your death. And I have been commanded to be of the believers",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"O you mankind! If you are in doubt as to my religion (Islâm), then (know that) I will never worship those whom you worship besides Allâh. But I worship Allâh Who causes you to die, and I am commanded to be one of the believers.",
            "english_rwwad": "Say, [O Prophet], “O people, if you are in doubt about my religion, then I do not worship those whom you worship besides Allah. But I worship Allah, Who causes you to die, and I have been commanded to be one of the believers."
        }
    },
    {
        "id": 1468,
        "chapter": 10,
        "verse": 105,
        "arabic_text": "وَأَنۡ أَقِمۡ وَجۡهَكَ لِلدِّينِ حَنِيفٗا وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "10.105 Wa 'An 'Aqim Wajhaka Lilddīni Ĥanīfāan Wa Lā Takūnanna Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [commanded], 'Direct your face [i.e., self] toward the religion, inclining to truth, and never be of those who associate others with Allāh;",
            "english_hilali_khan": "\"And (it is revealed to me): Direct your face (O Muhammad صلى الله عليه وسلم) entirely towards the religion Hanîf (Islâmic Monotheism, i.e. to worship none but Allâh Alone), and never be one of the Mushrikûn (those who ascribe partners to Allâh, polytheists, idolaters, disbelievers in the Oneness of Allâh, and those who worship others along with Allâh).",
            "english_rwwad": "And be steadfast and exclusively devoted to true faith, and never be of those who associate partners with Allah."
        }
    },
    {
        "id": 1469,
        "chapter": 10,
        "verse": 106,
        "arabic_text": "وَلَا تَدۡعُ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَۖ فَإِن فَعَلۡتَ فَإِنَّكَ إِذٗا مِّنَ ٱلظَّٰلِمِينَ",
        "phonetic": "10.106 Wa Lā Tad`u Min Dūni Allāhi Mā Lā Yanfa`uka Wa Lā Yađurruka Fa'in Fa`alta Fa'innaka 'Idhāan Mina Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "[543]- i.e., worship.\n[544]- See footnote to 10:95.",
            "english_hilali_khan": " (V.10:106) See the footnote of (V.2:165).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not invoke[543] besides Allāh that which neither benefits you nor harms you, for if you did, then indeed you would be of the wrongdoers.'\"[544]",
            "english_hilali_khan": "\"And invoke not besides Allâh, any such that will neither profit you nor harm you, but if (in case) you did so, you shall certainly be one of the Zâlimûn (polytheists and wrong-doers).[1]\"",
            "english_rwwad": "Do not supplicate besides Allah that can neither benefit nor harm you, for if you do so, you will be one of the wrongdoers."
        }
    },
    {
        "id": 1470,
        "chapter": 10,
        "verse": 107,
        "arabic_text": "وَإِن يَمۡسَسۡكَ ٱللَّهُ بِضُرّٖ فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَۖ وَإِن يُرِدۡكَ بِخَيۡرٖ فَلَا رَآدَّ لِفَضۡلِهِۦۚ يُصِيبُ بِهِۦ مَن يَشَآءُ مِنۡ عِبَادِهِۦۚ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ",
        "phonetic": "10.107 Wa 'In Yamsaska Allāhu Biđurrin Falā Kāshifa Lahu 'Illā Huwa Wa 'In Yuridka Bikhayrin Falā Rādda Lifađlihi Yuşību Bihi Man Yashā'u Min `Ibādihi Wa Huwa Al-Ghafūru Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if Allāh should touch you with adversity, there is no remover of it except Him; and if He intends for you good, then there is no repeller of His bounty. He causes it to reach whom He wills of His servants. And He is the Forgiving, the Merciful.",
            "english_hilali_khan": "And if Allâh touches you with harm, there is none who can remove it but He, and if He intends any good for you, there is none who can repel His Favour which He causes it to reach whomsoever of His slaves He wills. And He is the Oft-Forgiving, the Most Merciful.",
            "english_rwwad": "If Allah afflicts you with harm, none can remove it except Him; if He wants good for you, none can withhold His bounty. He grants it to whom He wills of His slaves, and He is the All-Forgiving, the Most Merciful.”"
        }
    },
    {
        "id": 1471,
        "chapter": 10,
        "verse": 108,
        "arabic_text": "قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُمُ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۖ وَمَآ أَنَا۠ عَلَيۡكُم بِوَكِيلٖ",
        "phonetic": "10.108 Qul Yā 'Ayyuhā An-Nāsu Qad Jā'akumu Al-Ĥaqqu Min Rabbikum Famani Ahtadá Fa'innamā Yahtadī Linafsihi Wa Man Đalla Fa'innamā Yađillu `Alayhā Wa Mā 'Anā `Alaykum Biwakīlin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"O mankind, the truth has come to you from your Lord, so whoever is guided is only guided for [the benefit of] his soul, and whoever goes astray only goes astray [in violation] against it. And I am not over you a manager.\"",
            "english_hilali_khan": "Say: \"O you mankind! Now truth (i.e. the Qur’ân and Prophet Muhammad صلى الله عليه وسلم) has come to you from your Lord. So whosoever receives guidance, he does so for the good of his own self; and whosoever goes astray, he does so to his own loss; and I am not (set) over you as a Wakîl (disposer of affairs to oblige you for guidance).\"",
            "english_rwwad": "Say, “O people, the truth has come to you from your Lord. So whoever accepts guidance, it is only for his own good; and whoever goes astray, it is only for his own loss. I am not a keeper over you.”"
        }
    },
    {
        "id": 1472,
        "chapter": 10,
        "verse": 109,
        "arabic_text": "وَٱتَّبِعۡ مَا يُوحَىٰٓ إِلَيۡكَ وَٱصۡبِرۡ حَتَّىٰ يَحۡكُمَ ٱللَّهُۚ وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَ",
        "phonetic": "10.109 Wa Attabi` Mā Yūĥá 'Ilayka Wa Aşbir Ĥattá Yaĥkuma Allāhu Wa Huwa Khayru Al-Ĥākimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And follow what is revealed to you, [O Muḥammad], and be patient until Allāh will judge. And He is the best of judges.",
            "english_hilali_khan": "And (O Muhammad صلى الله عليه وسلم), follow the revelation sent unto you, and be patient till Allâh gives judgement. And He is the Best of judges.",
            "english_rwwad": "Follow what is revealed to you, and be patient until Allah passes His judgment, for He is the Best of Judges."
        }
    }
]