[
    {
        "id": 6216,
        "chapter": 111,
        "verse": 1,
        "arabic_text": "تَبَّتۡ يَدَآ أَبِي لَهَبٖ وَتَبَّ",
        "phonetic": "111.1 Tabbat Yadā 'Abī Lahabin Wa Tabba",
        "footnotes": {
            "english_saheeh": "[2008]- Abū Lahab (the Prophet's uncle) , who was an enemy of Islām.",
            "english_hilali_khan": "(V.111:1) Narrated Ibn ‘Abbâs رضي الله عنهما : \"When the Verse, ‘And warn your tribe (O Muhammad صلى الله عليه وسلم) of near kindred.’ (V.26:214) was revealed, Allâh’s Messenger صلى الله عليه وسلم went out, and when he had ascended As-Safâ mountain, he shouted, ‘Yâ Sabâhâh !’* The people said, ‘What is that?’ Then they gathered around him, whereupon he said, ‘Do you see? If I inform you that cavalrymen are proceeding up the side of this mountain, will you believe me?’ They said, ‘We have never heard you telling a lie.’ Then he said, ‘I am a plain warner to you of a coming severe punishment.’ Abû Lahab said, ‘May you perish! You gathered us only for this reason?’ Then Abu Lahab went away. So [Sûrat Al-Masad] ‘Perish the hands of Abu Lahab!’ was revealed. (V.111:1). (Sahih Al-Bukhari, Vol. 6, Hadith No.495).\n* \"Yâ Sabâhâh!\" is an Arabic expression used when one appeals for help or draws the attention of others to some danger.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "May the hands of Abū Lahab be ruined, and ruined is he.[2008] ",
            "english_hilali_khan": "Perish the two hands of Abû Lahab (an uncle of the Prophet) and perish he![1]",
            "english_rwwad": "May the hands of Abu Lahab perish, and may he perish!"
        }
    },
    {
        "id": 6217,
        "chapter": 111,
        "verse": 2,
        "arabic_text": "مَآ أَغۡنَىٰ عَنۡهُ مَالُهُۥ وَمَا كَسَبَ",
        "phonetic": "111.2 Mā 'Aghná `Anhu Māluhu Wa Mā Kasaba",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "His wealth will not avail him or that which he gained. ",
            "english_hilali_khan": "His wealth and his children will not benefit him!",
            "english_rwwad": "Neither his wealth nor his worldly gains will avail him."
        }
    },
    {
        "id": 6218,
        "chapter": 111,
        "verse": 3,
        "arabic_text": "سَيَصۡلَىٰ نَارٗا ذَاتَ لَهَبٖ",
        "phonetic": "111.3 Sayaşlá Nārāan Dhāta Lahabin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He will [enter to] burn in a Fire of [blazing] flame ",
            "english_hilali_khan": "He will be burnt in a Fire of blazing flames!",
            "english_rwwad": "He will burn in a Flaming Fire,"
        }
    },
    {
        "id": 6219,
        "chapter": 111,
        "verse": 4,
        "arabic_text": "وَٱمۡرَأَتُهُۥ حَمَّالَةَ ٱلۡحَطَبِ",
        "phonetic": "111.4 Wa Amra'atuhu Ĥammālata Al-Ĥaţabi",
        "footnotes": {
            "english_saheeh": "[2009]- She used to put thorns in the Prophet's path and slander him (ﷺ) . The word \"firewood\" was used by the Arabs to allude to slander and backbiting.",
            "english_hilali_khan": "(V.111:4) ‘And his wife too, who carries wood.’ Mujâhid said, ‘Carries the wood’ means that she used to slander (the Prophet صلى الله عليه وسلم) and goes about with calumnies.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And his wife [as well] - the carrier of firewood.[2009] ",
            "english_hilali_khan": "And his wife, too, who carries wood (thorns of Sa‘dân which she used to put on the way of the Prophet صلى الله عليه وسلم, or use to slander him).[2]",
            "english_rwwad": "and so will his wife, the carrier of firewood,"
        }
    },
    {
        "id": 6220,
        "chapter": 111,
        "verse": 5,
        "arabic_text": "فِي جِيدِهَا حَبۡلٞ مِّن مَّسَدِۭ",
        "phonetic": "111.5 Fī Jīdihā Ĥablun Min Masadin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.111:5) \"In her neck is a twisted rope of palm fibre, [i.e. the chain which is in the Fire (of Hell)].\" (Sahih Al-Bukhari, Vol. 6, Chapter 356, Page 469).\n[Imâm Qurtubî says in the Tafsîr of the (V.17:45)]:\nNarrated Sa‘îd bin Jubâir رضي الله عنه : \"When Sûrah No.111 Al-Masad was revealed, the wife of Abu Lahab came looking out for the Prophet صلى الله عليه وسلم while Abu Bakr رضي الله عنه was sitting beside him. Abu Bakr said to the Prophet صلى الله عليه وسلم : ‘I wish if you get aside (or go away) as she is coming, to us, she may harm you’. The Prophet said: ‘There will be a screen set between me and her’. So she did not see him صلى الله عليه وسلم. She said to Abu Bakr: ‘Your companion is saying poetry against me.’ Abu Bakr said: ‘By Allâh he does not say poetry.’ She said: ‘Do you believe that’. Then she left. Abu Bakr said, ‘O Allâh’s Messenger! She did not see you’. The Prophet صلى الله عليه وسلم said: ‘An angel was screening me from her.’\" [This Hadith is quoted in Musnad Abû Ya‘lâ]\nIt is said that if the Verse [(17: 45) The Qur’an] is recited by a real believer (of Islâmic Monotheism) he will be screened from a disbeliever. (Allâh knows best). (Tafsîr Al-Qurtubî, Vol.10, Page 269).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Around her neck is a rope of [twisted] fiber. ",
            "english_hilali_khan": "In her neck is a twisted rope of Masad (palm fibre).[3]",
            "english_rwwad": "around her neck will be a rope of palm fiber."
        }
    }
]