[
    {
        "id": 6221,
        "chapter": 112,
        "verse": 1,
        "arabic_text": "قُلۡ هُوَ ٱللَّهُ أَحَدٌ",
        "phonetic": "112.1 Qul Huwa Allāhu 'Aĥadun",
        "footnotes": {
            "english_saheeh": "[2011]- Alone, without another, indivisible with absolute and permanent unity and distinct from all else. The one and only true deity, unique in His essence, attributes and deeds.",
            "english_hilali_khan": "(V.112:1) See Tauhîd in the Glossary (Appendix).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"He is Allāh, [who is] One,[2011] ",
            "english_hilali_khan": "1. Say (O Muhammad صلى الله عليه وسلم): \"He is Allâh, (the) One.[1]",
            "english_rwwad": "Say: He is Allah, the One;"
        }
    },
    {
        "id": 6222,
        "chapter": 112,
        "verse": 2,
        "arabic_text": "ٱللَّهُ ٱلصَّمَدُ",
        "phonetic": "112.2 Allāhu Aş-Şamadu",
        "footnotes": {
            "english_saheeh": "[2012]- He who is absolute, perfect, complete, essential, self-sufficient and sufficient to meet the needs of all creation; the one eternally and constantly required and sought, depended upon by all existence and to whom all matters will ultimately return.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh, the Eternal Refuge.[2012] ",
            "english_hilali_khan": "\"Allâh-us-Samad (السيد الذي يصمد إليه في الحاجات) [Allâh the Self-Sufficient Master, Whom all creatures need, (He neither eats nor drinks)].",
            "english_rwwad": "Allah, the Eternal Refuge."
        }
    },
    {
        "id": 6223,
        "chapter": 112,
        "verse": 3,
        "arabic_text": "لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ",
        "phonetic": "112.3 Lam Yalid Wa Lam Yūlad",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.112:3)\nA) Narrated Mu‘âdh bin Jabal رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"O Mu‘âdh! Do you know what Allâh’s Right upon His slaves is?\" I said, \"Allâh and His Messenger know better.\" The Prophet صلى الله عليه وسلم said, \"To worship Him (Allâh) Alone and to join none in worship with Him (Allâh). Do you know what their right upon Him is?\" I replied, \"Allâh and His Messenger know better.\" The Prophet صلى الله عليه وسلم said, \"Not to punish them (if they did so).\" [Sahih Al-Bukhari, Vol.9, Hadith No.470].\nB) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: A man heard another man reciting: ‘Say (O Muhammad): \"He is Allâh, (the) One.\" (112:1) And he recited it repeatedly. When it was morning, he went to the Prophet صلى الله عليه وسلم and informed him about that as if he considered that the recitation of that Sûrah by itself was not enough. Allâh’s Messenger صلى الله عليه وسلم said, \"By Him in Whose Hand my soul is, it is equal to one-third of the Our’ân.\" [Sahih Al-Bukhari, Vol.9, Hadith No.471].\nC) Narrated ‘Âishah رضي الله عنها: The Prophet صلى الله عليه وسلم sent (an army unit) under the command of a man who used to lead his companions in the prayers and would finish his recitation with (the Sûrah 112): ‘Say (O Muhammad): \"He is Allâh, (the) One.’\" (112:1). When they returned (from the battle), they mentioned that to the Prophet صلى الله عليه وسلم. He said (to them), \"Ask him why he does so.\" They asked him and he said, \"I do so because it mentions the Qualities of the Most Gracious and I love to recite it (in my prayer).\" The Prophet صلى الله عليه وسلم said (to them). \"Tell him that Allâh loves him.\" [Sahih Al Bukhari, Vol.9, Hadith No. 472].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He neither begets nor is born, ",
            "english_hilali_khan": "\"He begets not, nor was He begotten.[2]",
            "english_rwwad": "He neither begets nor is He begotten,"
        }
    },
    {
        "id": 6224,
        "chapter": 112,
        "verse": 4,
        "arabic_text": "وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ",
        "phonetic": "112.4 Walam Yakun Lahu Kufūan 'Aĥadun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Nor is there to Him any equivalent.\" ",
            "english_hilali_khan": "\"And there is none co-equal or comparable unto Him.\"",
            "english_rwwad": "and there is none comparable to Him.”"
        }
    }
]