[
    {
        "id": 1901,
        "chapter": 16,
        "verse": 1,
        "arabic_text": "أَتَىٰٓ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
        "phonetic": "16.1 'Atá 'Amru Allāhi Falā Tasta`jilūhu Subĥānahu Wa Ta`ālá `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "[690]- Literally, \"has come,\" indicating the certainty and nearness of the Last Hour.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The command of Allāh is coming,[690] so be not impatient for it. Exalted is He and high above what they associate with Him.",
            "english_hilali_khan": "The Event (the Hour or the punishment of disbelievers and polytheists or the Islâmic laws or commandments) ordained by Allâh will come to pass, so seek not to hasten it. Glorified and Exalted be He above all that they associate as partners with Him.",
            "english_rwwad": "Allah’s decree is coming, so do not seek to hasten it. Glorified and Exalted is He far above what they associate with Him!"
        }
    },
    {
        "id": 1902,
        "chapter": 16,
        "verse": 2,
        "arabic_text": "يُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ بِٱلرُّوحِ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦٓ أَنۡ أَنذِرُوٓاْ أَنَّهُۥ لَآ إِلَٰهَ إِلَّآ أَنَا۠ فَٱتَّقُونِ",
        "phonetic": "16.2 Yunazzilu Al-Malā'ikata Bir-Rūĥi Min 'Amrihi `Alá Man Yashā'u Min `Ibādihi 'An 'Andhirū 'Annahu Lā 'Ilāha 'Illā 'Anā Fa Attaqūni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He sends down the angels, with the inspiration [i.e., revelation] of His command, upon whom He wills of His servants, [telling them], \"Warn that there is no deity except Me; so fear Me.\"",
            "english_hilali_khan": "He sends down the angels with the Rûh (revelation) of His Command to whom of His slaves He wills (saying): \"Warn mankind that Lâ ilâha illâ Ana (none has the right to be worshipped but I), so fear Me (by abstaining from sins and evil deeds).",
            "english_rwwad": "He sends down the angels with revelation by His command to whom He wills of His slaves, [saying], “Warn that none has the right to be worshiped except Me, so fear Me.”"
        }
    },
    {
        "id": 1903,
        "chapter": 16,
        "verse": 3,
        "arabic_text": "خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ تَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
        "phonetic": "16.3 Khalaqa As-Samāwāti Wa Al-'Arđa Bil-Ĥaqqi Ta`ālá `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He created the heavens and earth in truth. High is He above what they associate with Him.",
            "english_hilali_khan": "He has created the heavens and the earth with truth. High is He, Exalted above all that they associate as partners with Him.",
            "english_rwwad": "He created the heavens and earth for a true purpose. Exalted is He far above what they associate with Him!"
        }
    },
    {
        "id": 1904,
        "chapter": 16,
        "verse": 4,
        "arabic_text": "خَلَقَ ٱلۡإِنسَٰنَ مِن نُّطۡفَةٖ فَإِذَا هُوَ خَصِيمٞ مُّبِينٞ",
        "phonetic": "16.4 Khalaqa Al-'Insāna Min Nuţfatin Fa'idhā Huwa Khaşīmun Mubīnun",
        "footnotes": {
            "english_saheeh": "[691]- As soon as he becomes strong and independent.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He created man from a sperm-drop; then at once[691] he is a clear adversary.",
            "english_hilali_khan": "He has created man from Nutfah (mixed drops of male and female sexual discharge), then behold, this same (man) becomes an open opponent.",
            "english_rwwad": "He created man from a sperm-drop, then he becomes a clear adversary."
        }
    },
    {
        "id": 1905,
        "chapter": 16,
        "verse": 5,
        "arabic_text": "وَٱلۡأَنۡعَٰمَ خَلَقَهَاۖ لَكُمۡ فِيهَا دِفۡءٞ وَمَنَٰفِعُ وَمِنۡهَا تَأۡكُلُونَ",
        "phonetic": "16.5 Wa Al-'An`āma Khalaqahā Lakum Fīhā Dif'un Wa Manāfi`u Wa Minhā Ta'kulūna",
        "footnotes": {
            "english_saheeh": "[692]- i.e., in clothing, tents, furnishings, etc.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the grazing livestock He has created for you; in them is warmth[692] and [numerous] benefits, and from them you eat.",
            "english_hilali_khan": "And the cattle, He has created them for you; in them there is warmth (warm clothing), and numerous benefits, and of them you eat.",
            "english_rwwad": "And He has created the livestock for you as a source of warmth and other benefits, and from them you eat."
        }
    },
    {
        "id": 1906,
        "chapter": 16,
        "verse": 6,
        "arabic_text": "وَلَكُمۡ فِيهَا جَمَالٌ حِينَ تُرِيحُونَ وَحِينَ تَسۡرَحُونَ",
        "phonetic": "16.6 Wa Lakum Fīhā Jamālun Ĥīna Turīĥūna Wa Ĥīna Tasraĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And for you in them is [the enjoyment of] beauty when you bring them in [for the evening] and when you send them out [to pasture].",
            "english_hilali_khan": "And wherein is beauty for you, when you bring them home in the evening, and as you lead them forth to pasture in the morning.",
            "english_rwwad": "There is beauty for you in them when you bring them home to rest and when you take them out to graze."
        }
    },
    {
        "id": 1907,
        "chapter": 16,
        "verse": 7,
        "arabic_text": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ",
        "phonetic": "16.7 Wa Taĥmilu 'Athqālakum 'Ilá Baladin Lam Takūnū Bālighīhi 'Illā Bishiqqi Al-'Anfusi 'Inna Rabbakum Lara'ūfun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they carry your loads to a land you could not have reached except with difficulty to yourselves. Indeed, your Lord is Kind and Merciful.",
            "english_hilali_khan": "7. And they carry your loads to a land that you could not reach except with great trouble to yourselves. Truly, your Lord is full of Kindness, Most Merciful.",
            "english_rwwad": "And they carry your heavy loads to lands that you could not reach without great hardship. Indeed, your Lord is Most Gracious, Most Merciful."
        }
    },
    {
        "id": 1908,
        "chapter": 16,
        "verse": 8,
        "arabic_text": "وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ",
        "phonetic": "16.8 Wa Al-Khayla Wa Al-Bighāla Wa Al-Ĥamīra Litarkabūhā Wa Zīnatan Wa Yakhluqu Mā Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [He created] the horses, mules and donkeys for you to ride and [as] adornment. And He creates that which you do not know.",
            "english_hilali_khan": "And (He has created) horses, mules and donkeys, for you to ride and as an adornment. And He creates (other) things of which you have no knowledge.",
            "english_rwwad": "And horses, mules and donkeys for you to ride and for adornment, and He creates other things that you do not know."
        }
    },
    {
        "id": 1909,
        "chapter": 16,
        "verse": 9,
        "arabic_text": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ",
        "phonetic": "16.9 Wa `Alá Allāhi Qaşdu As-Sabīli Wa Minhā Jā'irun Wa Law Shā'a Lahadākum 'Ajma`īna",
        "footnotes": {
            "english_saheeh": "[693]- Allāh (subḥānahu wa taʿālā) has taken it upon Himself to guide man to the right path.  The meaning has also been interpreted as \"To Allāh...\"",
            "english_hilali_khan": "(V.16:9) i.e. Islâmic Monotheism for mankind i.e. to show them legal and illegal, good and evil things; so whosoever accepts the guidance, it will be for his own benefit and whosoever goes astray, it will be for his own destruction.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And upon Allāh[693] is the direction of the [right] way, and among them [i.e., the various paths] are those deviating. And if He willed, He could have guided you all.",
            "english_hilali_khan": "And upon Allâh is the responsibility to explain the Straight Path[1]. But there are ways that turn aside (such as Paganism, Judaism and Christianity). And had He willed, He would have guided you all (mankind).",
            "english_rwwad": "It is upon Allah to show the straight path, while other ways are deviant. If He had willed, He could have guided you all."
        }
    },
    {
        "id": 1910,
        "chapter": 16,
        "verse": 10,
        "arabic_text": "هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ",
        "phonetic": "16.10 Huwa Al-Ladhī 'Anzala Mina As-Samā'i Mā'an Lakum Minhu Sharābun Wa Minhu Shajarun Fīhi Tusīmūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who sends down rain from the sky; from it is drink and from it is foliage in which you pasture [animals].",
            "english_hilali_khan": "He it is Who sends down water (rain) from the sky; from it you drink and from it (grows) the vegetation on which you send your cattle to pasture.",
            "english_rwwad": "It is He Who sends down rain from the sky, from it you drink, and by it plants thrive on which you pasture your livestock."
        }
    },
    {
        "id": 1911,
        "chapter": 16,
        "verse": 11,
        "arabic_text": "يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ",
        "phonetic": "16.11 Yunbitu Lakum Bihi Az-Zar`a Wa Az-Zaytūna Wa An-Nakhīla Wa Al-'A`nāba Wa Min Kulli Ath-Thamarāti 'Inna Fī Dhālika La'āyatan Liqawmin Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He causes to grow for you thereby the crops, olives, palm trees, grapevines, and of all the fruits. Indeed in that is a sign for a people who give thought.",
            "english_hilali_khan": "With it He causes to grow for you the crops, the olives, the date-palms, the grapes, and every kind of fruit. Verily! In this is indeed an evident proof and a manifest sign for people who give thought.",
            "english_rwwad": "He causes to grow therewith crops, olives, palm trees, grapevines and all kinds of fruits for you. Indeed, there is a sign in this for people who reflect."
        }
    },
    {
        "id": 1912,
        "chapter": 16,
        "verse": 12,
        "arabic_text": "وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ",
        "phonetic": "16.12 Wa Sakhkhara Lakumu Al-Layla Wa An-Nahāra Wa Ash-Shamsa Wa Al-Qamara Wa An-Nujūmu Musakhkharātun Bi'amrihi 'Inna Fī Dhālika La'āyātin Liqawmin Ya`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He has subjected for you the night and day and the sun and moon, and the stars are subjected by His command. Indeed in that are signs for a people who reason.",
            "english_hilali_khan": "And He has subjected to you the night and the day, and the sun and the moon; and the stars are subjected by His Command. Surely, in this are proofs for people who understand.",
            "english_rwwad": "And He has subjected for you the night and day, the sun and moon, and the stars are made subservient by His command. Indeed, there are signs in this for people of understanding."
        }
    },
    {
        "id": 1913,
        "chapter": 16,
        "verse": 13,
        "arabic_text": "وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ",
        "phonetic": "16.13 Wa Mā Dhara'a Lakum Fī Al-'Arđi Mukhtalifāan 'Alwānuhu 'Inna Fī Dhālika La'āyatan Liqawmin Yadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [He has subjected] whatever He multiplied for you on the earth of varying colors. Indeed in that is a sign for a people who remember.",
            "english_hilali_khan": "And whatsoever He has created for you on the earth of varying colours [and qualities from vegetation and fruits (botanical life) and from animals (zoological life)] Verily! In this is a sign for people who remember.",
            "english_rwwad": "And He has created for you various kinds of things on earth. Indeed, there are signs in this for people who take heed."
        }
    },
    {
        "id": 1914,
        "chapter": 16,
        "verse": 14,
        "arabic_text": "وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ",
        "phonetic": "16.14 Wa Huwa Al-Ladhī Sakhkhara Al-Baĥra Lita'kulū Minhu Laĥmāan Ţarīyāan Wa Tastakhrijū Minhu Ĥilyatan Talbasūnahā Wa Tará Al-Fulka Mawākhira Fīhi Wa Litabtaghū Min Fađlihi Wa La`allakum Tashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who subjected the sea for you to eat from it tender meat and to extract from it ornaments which you wear. And you see the ships plowing through it, and [He subjected it] that you may seek of His bounty; and perhaps you will be grateful.",
            "english_hilali_khan": "And He it is Who has subjected the sea (to you), that you eat thereof fresh tender meat (i.e. fish), and that you bring forth out of it ornaments to wear. And you see the ships ploughing through it, that you may seek (thus) of His Bounty (by transporting the goods from place to place) and that you may be grateful.",
            "english_rwwad": "It is He Who has subjected the sea, so that you may eat from it tender meat and extract ornaments to wear. And you see the ships cleaving their way through its waves, so that you may seek His bounty and so that you may give thanks."
        }
    },
    {
        "id": 1915,
        "chapter": 16,
        "verse": 15,
        "arabic_text": "وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ",
        "phonetic": "16.15 Wa 'Alqá Fī Al-'Arđi Rawāsiya 'An Tamīda Bikum Wa 'Anhārāan Wa Subulāan Lla`allakum Tahtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He has cast into the earth firmly set mountains, lest it shift with you, and [made] rivers and roads, that you may be guided,",
            "english_hilali_khan": "And He has affixed into the earth mountains standing firm, lest it should shake with you; and rivers and roads, that you may guide yourselves.",
            "english_rwwad": "And He has placed into the earth firm mountains, so it does not tremor with you, and there are rivers and pathways so that you may find your way,"
        }
    },
    {
        "id": 1916,
        "chapter": 16,
        "verse": 16,
        "arabic_text": "وَعَلَٰمَٰتٖۚ وَبِٱلنَّجۡمِ هُمۡ يَهۡتَدُونَ",
        "phonetic": "16.16 Wa `Alāmātin Wa Bin-Najmi Hum Yahtadūna",
        "footnotes": {
            "english_saheeh": "[694]- Through the desert or the sea at night.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And landmarks. And by the stars they are [also] guided.[694]",
            "english_hilali_khan": "And landmarks (signposts during the day) and by the stars (during the night), they (mankind) guide themselves.",
            "english_rwwad": "and landmarks and the stars by which they find their way."
        }
    },
    {
        "id": 1917,
        "chapter": 16,
        "verse": 17,
        "arabic_text": "أَفَمَن يَخۡلُقُ كَمَن لَّا يَخۡلُقُۚ أَفَلَا تَذَكَّرُونَ",
        "phonetic": "16.17 'Afaman Yakhluqu Kaman Lā Yakhluqu 'Afalā Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then is He who creates like one who does not create? So will you not be reminded?",
            "english_hilali_khan": "Is then He, Who creates as one who creates not? Will you not then remember?",
            "english_rwwad": "Is then He Who creates equal to one who cannot create? Will you not then take heed?"
        }
    },
    {
        "id": 1918,
        "chapter": 16,
        "verse": 18,
        "arabic_text": "وَإِن تَعُدُّواْ نِعۡمَةَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱللَّهَ لَغَفُورٞ رَّحِيمٞ",
        "phonetic": "16.18 Wa 'In Ta`uddū Ni`mata Allāhi Lā Tuĥşūhā 'Inna Allāha Laghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you should count the favors of Allāh, you could not enumerate them. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "And if you would count the favours of Allâh, never could you be able to count them. Truly! Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "If you try to count Allah’s favors, you will not be able to enumerate them. Indeed, Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1919,
        "chapter": 16,
        "verse": 19,
        "arabic_text": "وَٱللَّهُ يَعۡلَمُ مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ",
        "phonetic": "16.19 Wa Allāhu Ya`lamu Mā Tusirrūna Wa Mā Tu`linūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh knows what you conceal and what you declare.",
            "english_hilali_khan": "And Allâh knows what you conceal and what you reveal.",
            "english_rwwad": "Allah knows all that you conceal and all that you reveal."
        }
    },
    {
        "id": 1920,
        "chapter": 16,
        "verse": 20,
        "arabic_text": "وَٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ لَا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ",
        "phonetic": "16.20 Wa Al-Ladhīna Yad`ūna Min Dūni Allāhi Lā Yakhluqūna Shay'āan Wa Hum Yukhlaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:20) Al-Mushrikûn: i.e. polytheists, pagans, idolaters, disbelievers in the Oneness of Allâh, those who worship others along with Allâh, and also those who set up rivals with (or partners to) Allâh.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those they invoke other than Allāh create nothing, and they [themselves] are created.",
            "english_hilali_khan": "Those whom they (Al-Mushrikûn[1]) invoke besides Allâh have not created anything, but are themselves created.",
            "english_rwwad": "But those whom they invoke besides Allah do not create anything, rather, they themselves are created."
        }
    },
    {
        "id": 1921,
        "chapter": 16,
        "verse": 21,
        "arabic_text": "أَمۡوَٰتٌ غَيۡرُ أَحۡيَآءٖۖ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ",
        "phonetic": "16.21 'Amwātun Ghayru 'Aĥyā'in Wa Mā Yash`urūna 'Ayyāna Yub`athūna",
        "footnotes": {
            "english_saheeh": "[695]- i.e., inanimate or without understanding.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They are [in fact] dead,[695] not alive, and they do not perceive when they will be resurrected.",
            "english_hilali_khan": "(They are) dead, not alive; and they know not when they will be raised up.",
            "english_rwwad": "They are dead, not living; not even knowing when they will be resurrected."
        }
    },
    {
        "id": 1922,
        "chapter": 16,
        "verse": 22,
        "arabic_text": "إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۚ فَٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ قُلُوبُهُم مُّنكِرَةٞ وَهُم مُّسۡتَكۡبِرُونَ",
        "phonetic": "16.22 'Ilahukum 'Ilahun Wāĥidun Fa-Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati Qulūbuhum Munkiratun Wa Hum Mustakbirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Your god is one God. But those who do not believe in the Hereafter - their hearts are disapproving, and they are arrogant.",
            "english_hilali_khan": "Your Ilâh[2] (God) is One Ilâh (God - Allâh, none has the right to be worshipped but He). But for those who believe not in the Hereafter, their hearts deny (the faith in the Oneness of Allâh), and they are proud.[3]",
            "english_rwwad": "Your God is One God. But those who do not believe in the Hereafter, their hearts refuse to know, and they are arrogant."
        }
    },
    {
        "id": 1923,
        "chapter": 16,
        "verse": 23,
        "arabic_text": "لَا جَرَمَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡتَكۡبِرِينَ",
        "phonetic": "16.23 Lā Jarama 'Anna Allāha Ya`lamu Mā Yusirrūna Wa Mā Yu`linūna 'Innahu Lā Yuĥibbu Al-Mustakbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Assuredly, Allāh knows what they conceal and what they declare. Indeed, He does not like the arrogant.",
            "english_hilali_khan": "Certainly, Allâh knows what they conceal and what they reveal. Truly, He likes not the proud.",
            "english_rwwad": "Undoubtedly, Allah knows what they conceal and what they reveal. Indeed, He does not like those who are arrogant."
        }
    },
    {
        "id": 1924,
        "chapter": 16,
        "verse": 24,
        "arabic_text": "وَإِذَا قِيلَ لَهُم مَّاذَآ أَنزَلَ رَبُّكُمۡ قَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ",
        "phonetic": "16.24 Wa 'Idhā Qīla Lahum Mādhā 'Anzala Rabbukum Qālū 'Asāţīru Al-'Awwalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when it is said to them, \"What has your Lord sent down?\" they say, \"Legends of the former peoples,\"",
            "english_hilali_khan": "And when it is said to them: \"What is it that your Lord has sent down (unto Muhammad صلى الله عليه و سلم)?\" They say: \"Tales of the men of old!\"",
            "english_rwwad": "When it is said to them, “What has your Lord sent down?” They say, “Ancient fables!”"
        }
    },
    {
        "id": 1925,
        "chapter": 16,
        "verse": 25,
        "arabic_text": "لِيَحۡمِلُوٓاْ أَوۡزَارَهُمۡ كَامِلَةٗ يَوۡمَ ٱلۡقِيَٰمَةِ وَمِنۡ أَوۡزَارِ ٱلَّذِينَ يُضِلُّونَهُم بِغَيۡرِ عِلۡمٍۗ أَلَا سَآءَ مَا يَزِرُونَ",
        "phonetic": "16.25 Liyaĥmilū 'Awzārahum Kāmilatan Yawma Al-Qiyāmati Wa Min 'Awzāri Al-Ladhīna Yuđillūnahum Bighayri `Ilmin 'Alā Sā'a Mā Yazirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That they may bear their own burdens [i.e., sins] in full on the Day of Resurrection and some of the burdens of those whom they misguide without [i.e., by lack of] knowledge. Unquestionably, evil is that which they bear.",
            "english_hilali_khan": "They may bear their own burdens in full on the Day of Resurrection, and also of the burdens of those whom they misled without knowledge. Evil indeed is that which they shall bear!",
            "english_rwwad": "They will bear their burdens in full on the Day of Resurrection and some burdens of those whom they misled without knowledge. How terrible is what they will bear!"
        }
    },
    {
        "id": 1926,
        "chapter": 16,
        "verse": 26,
        "arabic_text": "قَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَأَتَى ٱللَّهُ بُنۡيَٰنَهُم مِّنَ ٱلۡقَوَاعِدِ فَخَرَّ عَلَيۡهِمُ ٱلسَّقۡفُ مِن فَوۡقِهِمۡ وَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ",
        "phonetic": "16.26 Qad Makara Al-Ladhīna Min Qablihim Fa'atá Allāhu Bunyānahum Mina Al-Qawā`idi Fakharra `Alayhimu As-Saqfu Min Fawqihim Wa 'Atāhumu Al-`Adhābu Min Ĥaythu Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "[696]- i.e., Allāh caused their plan to fail and exposed their plot.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those before them had already plotted, but Allāh came at [i.e., uprooted] their building from the foundations, so the roof fell upon them from above them,[696] and the punishment came to them from where they did not perceive.",
            "english_hilali_khan": "Those before them indeed plotted, but Allâh struck at the foundation of their building, and then the roof fell down upon them, from above them, and the torment overtook them from directions they did not perceive.",
            "english_rwwad": "Those who came before them plotted, so Allah uprooted their buildings from their foundations and the roof fell down on top of them, and the punishment came on them from where they could not imagine."
        }
    },
    {
        "id": 1927,
        "chapter": 16,
        "verse": 27,
        "arabic_text": "ثُمَّ يَوۡمَ ٱلۡقِيَٰمَةِ يُخۡزِيهِمۡ وَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تُشَٰٓقُّونَ فِيهِمۡۚ قَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ إِنَّ ٱلۡخِزۡيَ ٱلۡيَوۡمَ وَٱلسُّوٓءَ عَلَى ٱلۡكَٰفِرِينَ",
        "phonetic": "16.27 Thumma Yawma Al-Qiyāmati Yukhzīhim Wa Yaqūlu 'Ayna Shurakā'iya Al-Ladhīna Kuntum Tushāqqūna Fīhim Qāla Al-Ladhīna 'Ūtū Al-`Ilma 'Inna Al-Khizya Al-Yawma Wa As-Sū'a `Alá Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then on the Day of Resurrection He will disgrace them and say, \"Where are My 'partners' for whom you used to oppose [the believers]?\" Those who were given knowledge will say, \"Indeed disgrace, this Day, and evil are upon the disbelievers\" -",
            "english_hilali_khan": "Then, on the Day of Resurrection, He will disgrace them and will say: \"Where are My (so called) partners concerning whom you used to disagree and dispute (with the believers, by defying and disobeying Allâh)?\" Those who have been given the knowledge (about the Torment of Allâh for the disbelievers) will say: \"Verily! Disgrace and misery this Day are upon the disbelievers.",
            "english_rwwad": "Then on the Day of Resurrection He will disgrace them and will say, “Where are My [so-called] partners for whose sake you used to oppose [the truth]?” Those who were given knowledge will say, “Today disgrace and misery will befall the disbelievers.”"
        }
    },
    {
        "id": 1928,
        "chapter": 16,
        "verse": 28,
        "arabic_text": "ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ ظَالِمِيٓ أَنفُسِهِمۡۖ فَأَلۡقَوُاْ ٱلسَّلَمَ مَا كُنَّا نَعۡمَلُ مِن سُوٓءِۭۚ بَلَىٰٓۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "16.28 Al-Ladhīna Tatawaffāhumu Al-Malā'ikatu Žālimī 'Anfusihim Fa'alqaw As-Salama Mā Kunnā Na`malu Min Sū'in Balá 'Inna Allāha `Alīmun Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[697]- i.e., having made punishment due to them for their numerous sins and crimes.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ones whom the angels take in death [while] wronging themselves,[697] and [who] then offer submission, [saying], \"We were not doing any evil.\" But, yes! Indeed, Allāh is Knowing of what you used to do.",
            "english_hilali_khan": "\"Those whose lives the angels take while they are doing wrong to themselves (by disbelief and by associating partners in worship with Allâh and by committing all kinds of crimes and evil deeds).\" Then, they will make (false) submission (saying): \"We used not to do any evil.\" (The angels will reply): \"Yes! Truly, Allâh is All-Knower of what you used to do.",
            "english_rwwad": "Those whose souls are seized by the angels while they wrong themselves, who will then offer submission, “We did not do anything evil.” “Yes indeed you did! Allah knows well what you used to do."
        }
    },
    {
        "id": 1929,
        "chapter": 16,
        "verse": 29,
        "arabic_text": "فَٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ",
        "phonetic": "16.29 Fādkhulū 'Abwāba Jahannama Khālidīna Fīhā Falabi'sa Mathwá Al-Mutakabbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:29) See the footnote of (V.2:31)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So enter the gates of Hell to abide eternally therein, and how wretched is the residence of the arrogant.",
            "english_hilali_khan": "\"So enter the gates of Hell, to abide therein,[1] and indeed, what an evil abode will be for the arrogant.\"",
            "english_rwwad": "So enter the gates of Hell, abiding therein forever. What a terrible abode for those who were arrogant!”"
        }
    },
    {
        "id": 1930,
        "chapter": 16,
        "verse": 30,
        "arabic_text": "۞ وَقِيلَ لِلَّذِينَ ٱتَّقَوۡاْ مَاذَآ أَنزَلَ رَبُّكُمۡۚ قَالُواْ خَيۡرٗاۗ لِّلَّذِينَ أَحۡسَنُواْ فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٞۚ وَلَدَارُ ٱلۡأٓخِرَةِ خَيۡرٞۚ وَلَنِعۡمَ دَارُ ٱلۡمُتَّقِينَ",
        "phonetic": "16.30 Wa Qīla Lilladhīna Attaqaw Mādhā 'Anzala Rabbukum Qālū Khayrāan Lilladhīna 'Aĥsanū Fī Hadhihi Ad-Dunyā Ĥasanatun Wa Ladāru Al-'Ākhirati Khayrun Wa Lani`ma Dāru Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it will be said to those who feared Allāh, \"What did your Lord send down?\" They will say, \"[That which is] good.\" For those who do good in this world is good; and the home of the Hereafter is better. And how excellent is the home of the righteous -",
            "english_hilali_khan": "\"What is it that your Lord has sent down?\" They say: \"That which is good.\" For those who do good in this world, there is good, and the home of the Hereafter will be better. And excellent indeed will be the home (i.e. Paradise) of the Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "And it will be said to those who fear Allah, “What has your Lord sent down?” They will say, “All that is good.” For those who do good in this world, there is a good reward; and the home of the Hereafter is far better. What an excellent home for those who fear Allah!"
        }
    },
    {
        "id": 1931,
        "chapter": 16,
        "verse": 31,
        "arabic_text": "جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ لَهُمۡ فِيهَا مَا يَشَآءُونَۚ كَذَٰلِكَ يَجۡزِي ٱللَّهُ ٱلۡمُتَّقِينَ",
        "phonetic": "16.31 Jannātu `Adnin Yadkhulūnahā Tajrī Min Taĥtihā Al-'Anhāru Lahum Fīhā Mā Yashā'ūna Kadhālika Yajzī Allāhu Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Gardens of perpetual residence, which they will enter, beneath which rivers flow. They will have therein whatever they wish. Thus does Allāh reward the righteous -",
            "english_hilali_khan": "‘Adn (Eden) Paradise (Gardens of Eternity) which they will enter, under which rivers flow, they will have therein all that they wish. Thus Allâh rewards the Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "They will enter Gardens of Eternity, under which rivers flow. They will have therein whatever they wish. This is how Allah rewards those who fear Allah,"
        }
    },
    {
        "id": 1932,
        "chapter": 16,
        "verse": 32,
        "arabic_text": "ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ طَيِّبِينَ يَقُولُونَ سَلَٰمٌ عَلَيۡكُمُ ٱدۡخُلُواْ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "16.32 Al-Ladhīna Tatawaffāhumu Al-Malā'ikatu Ţayyibīna Yaqūlūna Salāmun `Alaykumu Adkhulū Al-Jannata Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ones whom the angels take in death, [being] good and pure; [the angels] will say, \"Peace be upon you. Enter Paradise for what you used to do.\"",
            "english_hilali_khan": "Those whose lives the angels take while they are in a pious state (i.e. pure from all evil, and worshipping none but Allâh Alone) saying (to them): Salâmun ‘Alaikum (peace be on you) enter you Paradise, because of that (the good) which you used to do (in the world).\"",
            "english_rwwad": "those whose souls the angels take while they are in a state of purity, saying, “Peace be upon you; enter Paradise for what you used to do.”"
        }
    },
    {
        "id": 1933,
        "chapter": 16,
        "verse": 33,
        "arabic_text": "هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ أَمۡرُ رَبِّكَۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ",
        "phonetic": "16.33 Hal Yanžurūna 'Illā 'An Ta'tiyahumu Al-Malā'ikatu 'Aw Ya'tiya 'Amru Rabbika Kadhālika Fa`ala Al-Ladhīna Min Qablihim Wa Mā Žalamahumu Allāhu Wa Lakin Kānū 'Anfusahum Yažlimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they [i.e., the disbelievers] await except that the angels should come to them or there comes the command of your Lord? Thus did those do before them. And Allāh wronged them not, but they had been wronging themselves.",
            "english_hilali_khan": "Do they (the disbelievers and polytheists) await but that the angels should come to them [to take away their souls (at death)], or there should come the command (i.e. the torment or the Day of Resurrection) of your Lord? Thus did those before them. And Allâh wronged them not, but they used to wrong themselves.",
            "english_rwwad": "Are they [the disbelievers] waiting for the angels to come to them or for the command of your Lord to come? Those who came before them did the same. It was not Allah Who wronged them, but it was they who wronged themselves."
        }
    },
    {
        "id": 1934,
        "chapter": 16,
        "verse": 34,
        "arabic_text": "فَأَصَابَهُمۡ سَيِّـَٔاتُ مَا عَمِلُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
        "phonetic": "16.34 Fa'aşābahum Sayyi'ātu Mā `Amilū Wa Ĥāqa Bihim Mā Kānū Bihi Yastahzi'ūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they were struck by the evil consequences of what they did and were enveloped by what they used to ridicule.",
            "english_hilali_khan": "Then, the evil results of their deeds overtook them, and that at which they used to mock at surrounded them.",
            "english_rwwad": "They were afflicted by the evil consequences of their deeds, and they were overwhelmed by what they used to ridicule."
        }
    },
    {
        "id": 1935,
        "chapter": 16,
        "verse": 35,
        "arabic_text": "وَقَالَ ٱلَّذِينَ أَشۡرَكُواْ لَوۡ شَآءَ ٱللَّهُ مَا عَبَدۡنَا مِن دُونِهِۦ مِن شَيۡءٖ نَّحۡنُ وَلَآ ءَابَآؤُنَا وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَيۡءٖۚ كَذَٰلِكَ فَعَلَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ",
        "phonetic": "16.35 Wa Qāla Al-Ladhīna 'Ashrakū Law Shā'a Allāhu Mā `Abadnā Min Dūnihi Min Shay'in Naĥnu Wa Lā 'Ābā'uunā Wa Lā Ĥarramnā Min Dūnihi Min Shay'in Kadhālika Fa`ala Al-Ladhīna Min Qablihim Fahal `Alá Ar-Rusuli 'Illā Al-Balāghu Al-Mubīnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who associate others with Allāh say, \"If Allāh had willed, we would not have worshipped anything other than Him, neither we nor our fathers, nor would we have forbidden anything through other than Him.\" Thus did those do before them. So is there upon the messengers except [the duty of] clear notification?",
            "english_hilali_khan": "And those who joined others in worship with Allâh said: \"If Allâh had so willed, neither we nor our fathers would have worshipped aught but Him, nor would we have forbidden anything without (Command from) Him.\" So did those before them. Then! Are the Messengers charged with anything but to convey clearly the Message?",
            "english_rwwad": "Those who associate partners with Allah say, “If Allah had willed, neither we nor our forefathers would have worshiped anything besides Him, nor would we have prohibited anything without His command.” Those who came before them did the same. Is the duty of the messengers except to convey the message clearly?"
        }
    },
    {
        "id": 1936,
        "chapter": 16,
        "verse": 36,
        "arabic_text": "وَلَقَدۡ بَعَثۡنَا فِي كُلِّ أُمَّةٖ رَّسُولًا أَنِ ٱعۡبُدُواْ ٱللَّهَ وَٱجۡتَنِبُواْ ٱلطَّٰغُوتَۖ فَمِنۡهُم مَّنۡ هَدَى ٱللَّهُ وَمِنۡهُم مَّنۡ حَقَّتۡ عَلَيۡهِ ٱلضَّلَٰلَةُۚ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ",
        "phonetic": "16.36 Wa Laqad Ba`athnā Fī Kulli 'Ummatin Rasūlāan 'Ani Au`budū Allāha Wa Ajtanibū Aţ-Ţāghūta Faminhum Man Hadá Allāhu Wa Minhum Man Ĥaqqat `Alayhi Ađ-Đalālatu Fasīrū Fī Al-'Arđi Fānžurū Kayfa Kāna `Āqibatu Al-Mukadhibīna",
        "footnotes": {
            "english_saheeh": "[698]- False objects of worship.",
            "english_hilali_khan": "(V.16:36) Tâghut: See the footnote of (V.2:256).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We certainly sent into every nation a messenger, [saying], \"Worship Allāh and avoid ṭāghūt.\"[698] And among them were those whom Allāh guided, and among them were those upon whom error was [deservedly] decreed. So proceed [i.e., travel] through the earth and observe how was the end of the deniers.",
            "english_hilali_khan": "And verily, We have sent among every Ummah (community, nation) a Messenger (proclaiming): \"Worship Allâh (Alone), and avoid (or keep away from) Tâghût[1] (all false deities i.e. do not worship Tâghût besides Allâh).\" Then of them were some whom Allâh guided and of them were some upon whom the straying was justified. So travel through the land and see what was the end of those who denied (the truth).",
            "english_rwwad": "Indeed, We sent to every community a messenger, [saying], “Worship Allah and shun false gods.” Among them were some whom Allah guided, while others were destined to stray. So travel through the land and see how was the end of the deniers!"
        }
    },
    {
        "id": 1937,
        "chapter": 16,
        "verse": 37,
        "arabic_text": "إِن تَحۡرِصۡ عَلَىٰ هُدَىٰهُمۡ فَإِنَّ ٱللَّهَ لَا يَهۡدِي مَن يُضِلُّۖ وَمَا لَهُم مِّن نَّٰصِرِينَ",
        "phonetic": "16.37 'In Taĥriş `Alá Hudāhum Fa'inna Allāha Lā Yahdī Man Yuđillu Wa Mā Lahum Min Nāşirīna",
        "footnotes": {
            "english_saheeh": "[699]- As a result of their choice to reject guidance.",
            "english_hilali_khan": " (V.16:37) Narrated Abû Hurairah رضي الله عنه: I heard Allâh’s Messenger صلى الله عليه وسلم saying, \"My example and the example of the people is that of a man who made a fire, and when it lighted what was around it, moths and other insects started falling into the fire. The man tried (his best) to prevent them, (from falling in the fire) but they overpowered him and rushed into the fire.\" The Prophet صلى الله عليه وسلم added; \"Now, similarly, I take hold of the knots at your waist (belts) to prevent you from falling into the fire, but you insist on falling into it.\"* (Sahih Al-Bukhari, Vol.8, Hadith No.490).\n* The fire symbolizes the unlawful deeds which the Prophet صلى الله عليه وسلم warned the people of.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Even] if you should strive for their guidance, [O Muḥammad], indeed, Allāh does not guide those He sends astray,[699] and they will have no helpers.",
            "english_hilali_khan": "If you (O Muhammad صلى الله عليه و سلم) covet for their guidance,[2] then verily Allâh guides not those whom He makes to go astray (or none can guide him whom Allâh sends astray). And they will have no helpers.",
            "english_rwwad": "Even though you are keen to guide them, but Allah does not guide those whom He causes to stray, and they will have no helpers."
        }
    },
    {
        "id": 1938,
        "chapter": 16,
        "verse": 38,
        "arabic_text": "وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَا يَبۡعَثُ ٱللَّهُ مَن يَمُوتُۚ بَلَىٰ وَعۡدًا عَلَيۡهِ حَقّٗا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
        "phonetic": "16.38 Wa 'Aqsamū Billāhi Jahda 'Aymānihim Lā Yab`athu Allāhu Man Yamūtu Balá Wa`dāan `Alayhi Ĥaqqāan Wa Lakinna 'Akthara An-Nāsi Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they swear by Allāh their strongest oaths [that] Allāh will not resurrect one who dies. But yes - [it is] a true promise [binding] upon Him, but most of the people do not know.",
            "english_hilali_khan": "And they swear by Allâh their strongest oaths, that Allâh will not raise up him who dies. Yes, (He will raise them up), - a promise (binding) upon Him in truth, but most of mankind know not.",
            "english_rwwad": "They swear by Allah their solemn oaths that Allah will not resurrect those who die. Yes He will! It is a true promise upon Him, but most people do not know –"
        }
    },
    {
        "id": 1939,
        "chapter": 16,
        "verse": 39,
        "arabic_text": "لِيُبَيِّنَ لَهُمُ ٱلَّذِي يَخۡتَلِفُونَ فِيهِ وَلِيَعۡلَمَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ كَانُواْ كَٰذِبِينَ",
        "phonetic": "16.39 Liyubayyina Lahumu Al-Ladhī Yakhtalifūna Fīhi Wa Liya`lama Al-Ladhīna Kafarū 'Annahum Kānū Kādhibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It is] so He will make clear to them [the truth of] that wherein they differ and so those who have disbelieved may know that they were liars.",
            "english_hilali_khan": "In order that He may make manifest to them the truth of that wherein they differ, and that those who disbelieved (in Resurrection, and in the Oneness of Allâh) may know that they were liars.",
            "english_rwwad": "so that He may make clear to them that over which they differ, and so that the disbelievers may realize that they were liars."
        }
    },
    {
        "id": 1940,
        "chapter": 16,
        "verse": 40,
        "arabic_text": "إِنَّمَا قَوۡلُنَا لِشَيۡءٍ إِذَآ أَرَدۡنَٰهُ أَن نَّقُولَ لَهُۥ كُن فَيَكُونُ",
        "phonetic": "16.40 'Innamā Qawlunā Lishay'in 'Idhā 'Aradnāhu 'An Naqūla Lahu Kun Fayakūnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:40) See the footnote of (V.51:30)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Our word to a thing when We intend it is but that We say to it, \"Be,\" and it is.",
            "english_hilali_khan": "Verily! Our Word unto a thing when We intend it, is only that We say unto it: \"Be!\" - and it is.[3]",
            "english_rwwad": "When We intend something, We only say to it, “Be!”, and it is."
        }
    },
    {
        "id": 1941,
        "chapter": 16,
        "verse": 41,
        "arabic_text": "وَٱلَّذِينَ هَاجَرُواْ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُواْ لَنُبَوِّئَنَّهُمۡ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَلَأَجۡرُ ٱلۡأٓخِرَةِ أَكۡبَرُۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
        "phonetic": "16.41 Wa Al-Ladhīna Hājarū Fī Allāhi Min Ba`di Mā Žulimū Lanubawwi'annahum Fī Ad-Dunyā Ĥasanatan Wa La'ajru Al-'Ākhirati 'Akbaru Law Kānū Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who emigrated for [the cause of] Allāh after they had been wronged - We will surely settle them in this world in a good place; but the reward of the Hereafter is greater, if only they could know.",
            "english_hilali_khan": "And as for those who emigrated for the Cause of Allâh, after they had been wronged, We will certainly give them goodly residence in this world, but indeed the reward of the Hereafter will be greater; if they but knew!",
            "english_rwwad": "Those who migrated for the sake of Allah after being oppressed, We will surely give them good in this world. But the reward of the Hereafter is greater, if only they knew,"
        }
    },
    {
        "id": 1942,
        "chapter": 16,
        "verse": 42,
        "arabic_text": "ٱلَّذِينَ صَبَرُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ",
        "phonetic": "16.42 Al-Ladhīna Şabarū Wa `Alá Rabbihim Yatawakkalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[They are] those who endured patiently and upon their Lord relied.",
            "english_hilali_khan": "(They are) those who remained patient (in this world for Allâh’s sake), and put their trust in their Lord (Allâh Alone).",
            "english_rwwad": "those who endured patiently and put their trust in their Lord."
        }
    },
    {
        "id": 1943,
        "chapter": 16,
        "verse": 43,
        "arabic_text": "وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ",
        "phonetic": "16.43 Wa Mā 'Arsalnā Min Qablika 'Illā Rijālāan Nūĥī 'Ilayhim Fās'alū 'Ahla Adh-Dhikri 'In Kuntum Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message [i.e., former scriptures] if you do not know.",
            "english_hilali_khan": "And We sent not (as Our Messengers) before you (O Muhammad صلى الله عليه و سلم) any but men, whom We sent revelation, (to preach and invite mankind to believe in the Oneness of Allâh). So ask (you, O pagans of Makkah) of those who know the Scripture [learned men of the Taurât (Torah) and the Injeel (Gospel)], if you know not.",
            "english_rwwad": "We did not send before you except men to whom We sent revelation. Ask the people of knowledge, if you do not know."
        }
    },
    {
        "id": 1944,
        "chapter": 16,
        "verse": 44,
        "arabic_text": "بِٱلۡبَيِّنَٰتِ وَٱلزُّبُرِۗ وَأَنزَلۡنَآ إِلَيۡكَ ٱلذِّكۡرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيۡهِمۡ وَلَعَلَّهُمۡ يَتَفَكَّرُونَ",
        "phonetic": "16.44 Bil-Bayyināti Wa Az-Zuburi Wa 'Anzalnā 'Ilayka Adh-Dhikra Litubayyina Lilnnāsi Mā Nuzzila 'Ilayhim Wa La`allahum Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[We sent them] with clear proofs and written ordinances. And We revealed to you the message [i.e., the Qur’ān] that you may make clear to the people what was sent down to them and that they might give thought.",
            "english_hilali_khan": "With clear signs and Books (We sent the Messengers). And We have also sent down unto you (O Muhammad صلى الله عليه و سلم) the Dhikr [reminder and the advice (i.e. the Qur’ân)], that you may explain clearly to men what is sent down to them, and that they may give thought.",
            "english_rwwad": "[We sent them] with clear proofs and scriptures, and We have sent down to you [O Prophet] the Reminder to explain to people what has been sent down to them, and so that they may reflect."
        }
    },
    {
        "id": 1945,
        "chapter": 16,
        "verse": 45,
        "arabic_text": "أَفَأَمِنَ ٱلَّذِينَ مَكَرُواْ ٱلسَّيِّـَٔاتِ أَن يَخۡسِفَ ٱللَّهُ بِهِمُ ٱلۡأَرۡضَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ",
        "phonetic": "16.45 'Afa'amina Al-Ladhīna Makarū As-Sayyi'āti 'An Yakhsifa Allāhu Bihimu Al-'Arđa 'Aw Ya'tiyahumu Al-`Adhābu Min Ĥaythu Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, do those who have planned evil deeds feel secure that Allāh will not cause the earth to swallow them or that the punishment will not come upon them from where they do not perceive?",
            "english_hilali_khan": "Do then those who devise evil plots feel secure that Allâh will not sink them into the earth, or that the torment will not seize them from directions they perceive not?",
            "english_rwwad": "Do those who devise evil plots feel secure that Allah will not make them sink into the earth or that the punishment will not come upon them from where they do not expect?"
        }
    },
    {
        "id": 1946,
        "chapter": 16,
        "verse": 46,
        "arabic_text": "أَوۡ يَأۡخُذَهُمۡ فِي تَقَلُّبِهِمۡ فَمَا هُم بِمُعۡجِزِينَ",
        "phonetic": "16.46 'Aw Ya'khudhahum Fī Taqallubihim Famā Hum Bimu`jizīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or that He would not seize them during their [usual] activity, and they could not cause failure [i.e., escape from Him]?",
            "english_hilali_khan": "Or that He may catch them in the midst of their going to and fro (in their jobs), so that there be no escape for them (from Allâh’s punishment)?",
            "english_rwwad": "Or that He may seize them while they are going about, and they will have no escape?"
        }
    },
    {
        "id": 1947,
        "chapter": 16,
        "verse": 47,
        "arabic_text": "أَوۡ يَأۡخُذَهُمۡ عَلَىٰ تَخَوُّفٖ فَإِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٌ",
        "phonetic": "16.47 'Aw Ya'khudhahum `Alá Takhawwufin Fa'inna Rabbakum Lara'ūfun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[700]- i.e., being aware of what is about to strike them after having seen those near them succumb.\n[701]- Postponing deserved punishment and giving opportunities for repentance.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or that He would not seize them gradually [in a state of dread]?[700] But indeed, your Lord is Kind and Merciful.[701]",
            "english_hilali_khan": "Or that He may catch them with gradual wasting (of their wealth and health). Truly! Your Lord is indeed full of Kindness, Most Merciful?",
            "english_rwwad": "Or that He will seize them when they are in a state of fear? But your Lord is indeed Ever Gracious, Most Merciful."
        }
    },
    {
        "id": 1948,
        "chapter": 16,
        "verse": 48,
        "arabic_text": "أَوَلَمۡ يَرَوۡاْ إِلَىٰ مَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ يَتَفَيَّؤُاْ ظِلَٰلُهُۥ عَنِ ٱلۡيَمِينِ وَٱلشَّمَآئِلِ سُجَّدٗا لِّلَّهِ وَهُمۡ دَٰخِرُونَ",
        "phonetic": "16.48 'Awalam Yaraw 'Ilá Mā Khalaqa Allāhu Min Shay'in Yatafayya'u Žilāluhu `Ani Al-Yamīni Wa Ash-Shamā'ili Sujjadāan Lillāhi Wa Hum Dākhirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have they not considered what things Allāh has created? Their shadows incline to the right and to the left, prostrating to Allāh, while they [i.e., those creations] are humble.",
            "english_hilali_khan": "Have they not observed things that Allâh has created: (how) their shadows incline to the right and to the left, making prostration unto Allâh, and they are lowly?",
            "english_rwwad": "Do they not see the things that Allah has created, how their shadows incline to the right and left, prostrating to Allah in all humility?"
        }
    },
    {
        "id": 1949,
        "chapter": 16,
        "verse": 49,
        "arabic_text": "وَلِلَّهِۤ يَسۡجُدُۤ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ مِن دَآبَّةٖ وَٱلۡمَلَٰٓئِكَةُ وَهُمۡ لَا يَسۡتَكۡبِرُونَ",
        "phonetic": "16.49 Wa Lillahi Yasjudu Mā Fī As-Samāwāti Wa Mā Fī Al-'Arđi Min Dābbatin Wa Al-Malā'ikatu Wa Hum Lā Yastakbirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Allāh prostrates whatever is in the heavens and whatever is on the earth of creatures, and the angels [as well], and they are not arrogant.",
            "english_hilali_khan": "And to Allâh prostrate all that is in the heavens and all that is in the earth, of the moving (living) creatures and the angels, and they are not proud [i.e. they worship their Lord (Allâh) with humility].",
            "english_rwwad": "To Allah prostrates all that is in the heavens and on earth of living things, and so do the angels; and they do not show arrogance."
        }
    },
    {
        "id": 1950,
        "chapter": 16,
        "verse": 50,
        "arabic_text": "يَخَافُونَ رَبَّهُم مِّن فَوۡقِهِمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ۩",
        "phonetic": "16.50 Yakhāfūna Rabbahum Min Fawqihim Wa Yaf`alūna Mā Yu'umarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They fear their Lord above them, and they do what they are commanded.",
            "english_hilali_khan": "They fear their Lord above them, and they do what they are commanded.",
            "english_rwwad": "They fear their Lord above them, and they do what they are commanded."
        }
    },
    {
        "id": 1951,
        "chapter": 16,
        "verse": 51,
        "arabic_text": "۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيۡنِ ٱثۡنَيۡنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ فَإِيَّٰيَ فَٱرۡهَبُونِ",
        "phonetic": "16.51 Wa Qāla Allāhu Lā Tattakhidhū 'Ilahayni Athnayni 'Innamā Huwa 'Ilahun Wāĥidun Fa'īyāya Fārhabūni",
        "footnotes": {
            "english_saheeh": "[702]- Meaning more than one.",
            "english_hilali_khan": "[1] (V.16:51) Ilâh: He Who has all the right to be worshipped.\n[2] (V.16:51) Narrated ‘Ubâdah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"If anyone testifies that Lâ ilâha illallâh (none has the right to be worshipped but Allâh Alone) Who has no partners, and that Muhammad صلى الله عليه وسلم is His slave and His Messenger, and that ‘Îsâ (Jesus) عليه السلام is Allâh’s slave and His Messenger and His Word (\"Be!\" - and he was) which He bestowed on Maryam (Mary) and a spirit (Rûh ) created by Him, and that Paradise is the truth, and Hell is the truth, Allâh will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junadah, the subnarrator said, \" ‘Ubâdah added,\n‘Such a person can enter Paradise through any of its eight gates he likes.’ \") (Sahih Al-Bukhari, Vol. 4, Hadith No. 644).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has said, \"Do not take for yourselves two[702] deities. He [i.e., Allāh] is but one God, so fear only Me.\"",
            "english_hilali_khan": "And Allâh said (O mankind!): \"Take not ilâhain (two gods in worship). Verily, He (Allâh) is (the) only One Ilâh[1] (God). Then, fear Me (Allâh جل جلاله) much [and Me (Alone), i.e. be away from all kinds of sins and evil deeds that Allâh has forbidden and do all that Allâh has ordained and worship none but Allâh][2].",
            "english_rwwad": "Allah said, “Do not take two gods. He is only One God, so fear Me alone.”"
        }
    },
    {
        "id": 1952,
        "chapter": 16,
        "verse": 52,
        "arabic_text": "وَلَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَهُ ٱلدِّينُ وَاصِبًاۚ أَفَغَيۡرَ ٱللَّهِ تَتَّقُونَ",
        "phonetic": "16.52 Wa Lahu Mā Fī As-Samāwāti Wa Al-'Arđi Wa Lahu Ad-Dīnu Wa Aşibāan 'Afaghayra Allāhi Tattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Him belongs whatever is in the heavens and the earth, and to Him is [due] worship constantly. Then is it other than Allāh that you fear?",
            "english_hilali_khan": "To Him belongs all that is in the heavens and (all that is in) the earth and Ad-Dîn Wâsiba is His [(i.e. perpetual sincere obedience to Allâh is obligatory). None has the right to be worshipped but Allâh)]. Will you then fear any other than Allâh?",
            "english_rwwad": "To Him belongs all that is in the heavens and earth, and constant devotion is to Him alone. Will you then fear anyone other than Allah?"
        }
    },
    {
        "id": 1953,
        "chapter": 16,
        "verse": 53,
        "arabic_text": "وَمَا بِكُم مِّن نِّعۡمَةٖ فَمِنَ ٱللَّهِۖ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَيۡهِ تَجۡـَٔرُونَ",
        "phonetic": "16.53 Wa Mā Bikum Min Ni`matin Famina Allāhi Thumma 'Idhā Massakumu Ađ-Đurru Fa'ilayhi Taj'arūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whatever you have of favor - it is from Allāh. Then when adversity touches you, to Him you cry for help.",
            "english_hilali_khan": "And whatever of blessings and good things you have, it is from Allâh. Then, when harm touches you, unto Him you cry aloud for help.",
            "english_rwwad": "Whatever blessing you have, it is from Allah. Then when you are afflicted with hardship, to Him alone you cry out for help."
        }
    },
    {
        "id": 1954,
        "chapter": 16,
        "verse": 54,
        "arabic_text": "ثُمَّ إِذَا كَشَفَ ٱلضُّرَّ عَنكُمۡ إِذَا فَرِيقٞ مِّنكُم بِرَبِّهِمۡ يُشۡرِكُونَ",
        "phonetic": "16.54 Thumma 'Idhā Kashafa Ađ-Đurra `Ankum 'Idhā Farīqun Minkum Birabbihim Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then when He removes the adversity from you, at once a party of you associates others with their Lord",
            "english_hilali_khan": "Then, when He has removed the harm from you, behold! some of you associate others in worship with their Lord (Allâh).",
            "english_rwwad": "Then as soon as He removes the hardship from you, some of you associate partners with their Lord,"
        }
    },
    {
        "id": 1955,
        "chapter": 16,
        "verse": 55,
        "arabic_text": "لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡۚ فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ",
        "phonetic": "16.55 Liyakfurū Bimā 'Ātaynāhum Fatamatta`ū Fasawfa Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they will deny what We have given them. Then enjoy yourselves, for you are going to know.",
            "english_hilali_khan": "So (as a result of that) they deny (with ungratefulness) that (Allâh’s Favours) which We have bestowed on them! Then enjoy yourselves (your short stay), but you will come to know (with regrets).",
            "english_rwwad": "showing their ingratitude for what We have given them. Then enjoy yourselves now, but you will soon come to know."
        }
    },
    {
        "id": 1956,
        "chapter": 16,
        "verse": 56,
        "arabic_text": "وَيَجۡعَلُونَ لِمَا لَا يَعۡلَمُونَ نَصِيبٗا مِّمَّا رَزَقۡنَٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ",
        "phonetic": "16.56 Wa Yaj`alūna Limā Lā Ya`lamūna Naşībāan Mimmā Razaqnāhum Ta-Allāhi Latus'alunna `Ammā Kuntum Taftarūna",
        "footnotes": {
            "english_saheeh": "[703]- i.e., that of which they have no knowledge; rather, they have mere assumption based upon tradition or the claims of misguided men.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they assign to what they do not know[703] [i.e., false deities] a portion of that which We have provided them. By Allāh, you will surely be questioned about what you used to invent.",
            "english_hilali_khan": "And they assign a portion of that which We have provided them unto what they know not (false deities). By Allâh, you shall certainly be questioned about (all) that you used to fabricate.",
            "english_rwwad": "They assign a portion of what We have provided for them to those [idols] who know nothing. By Allah, you will surely be called to account for what you used to fabricate."
        }
    },
    {
        "id": 1957,
        "chapter": 16,
        "verse": 57,
        "arabic_text": "وَيَجۡعَلُونَ لِلَّهِ ٱلۡبَنَٰتِ سُبۡحَٰنَهُۥ وَلَهُم مَّا يَشۡتَهُونَ",
        "phonetic": "16.57 Wa Yaj`alūna Lillāhi Al-Banāti Subĥānahu Wa Lahum Mā Yashtahūna",
        "footnotes": {
            "english_saheeh": "[704]- By claiming that the angels are His daughters.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they attribute to Allāh daughters[704] - exalted is He - and for them is what they desire [i.e., sons].",
            "english_hilali_khan": "And they assign daughters unto Allâh! - Glorified (and Exalted) is He above all that they associate with Him! And unto themselves what they desire;",
            "english_rwwad": "To Allah they ascribe daughters – glory be to Him – but for themselves they choose what they desire [sons]."
        }
    },
    {
        "id": 1958,
        "chapter": 16,
        "verse": 58,
        "arabic_text": "وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدّٗا وَهُوَ كَظِيمٞ",
        "phonetic": "16.58 Wa 'Idhā Bushira 'Aĥaduhum Bil-'Unthá Žalla Wajhuhu Muswaddāan Wa Huwa Kažīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when one of them is informed of [the birth of] a female, his face becomes dark, and he suppresses grief.",
            "english_hilali_khan": "And when the news of (the birth of) a female (child) is brought to any of them, his face becomes dark, and he is filled with inward grief!",
            "english_rwwad": "When one of them is given the good news of a female baby, his face darkens while suppressing his anguish."
        }
    },
    {
        "id": 1959,
        "chapter": 16,
        "verse": 59,
        "arabic_text": "يَتَوَٰرَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوٓءِ مَا بُشِّرَ بِهِۦٓۚ أَيُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ يَدُسُّهُۥ فِي ٱلتُّرَابِۗ أَلَا سَآءَ مَا يَحۡكُمُونَ",
        "phonetic": "16.59 Yatawārá Mina Al-Qawmi Min Sū'i Mā Bushira Bihi 'Ayumsikuhu `Alá Hūnin 'Am Yadussuhu Fī At-Turābi 'Alā Sā'a Mā Yaĥkumūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": " (V.16:59) Narrated Al-Mughirah: The Prophet صلى الله عليه وسلم used to forbid (1) Qîl and Qâl (sinful and useless talk like backbiting, or that you talk too much about others); (2) asking too many questions (in disputed religious matters); (3) and wasting one’s wealth (by extravagance) (4) and to be undutiful to one’s mother (5) and to bury the daughters alive (6) and to prevent your favours (benevolence) to others (i.e. not to pay the rights of others: Zakât, charity). (7) and to beg of men or to ask others for something (except when it is unavoidable). (Sahih Al-Bukhari, Vol.9, Hadith No.395).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He hides himself from the people because of the ill of which he has been informed. Should he keep it in humiliation or bury it in the ground? Unquestionably, evil is what they decide.",
            "english_hilali_khan": "He hides himself from the people because of the evil of that whereof he has been informed. Shall he keep her with dishonour or bury her in the earth[1]? Certainly, evil is their decision.",
            "english_rwwad": "He hides away from people because of the bad news he was given. Should he keep her in disgrace, or bury her in the dust? How terrible is their judgment!"
        }
    },
    {
        "id": 1960,
        "chapter": 16,
        "verse": 60,
        "arabic_text": "لِلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
        "phonetic": "16.60 Lilladhīna Lā Yu'uminūna Bil-'Ākhirati Mathalu As-Saw'i Wa Lillahi Al-Mathalu Al-'A`lá Wa Huwa Al-`Azīzu Al-Ĥakīmu",
        "footnotes": {
            "english_saheeh": "[705]- Such as that described in the previous two verses.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For those who do not believe in the Hereafter is the description [i.e., an attribute] of evil;[705] and for Allāh is the highest attribute. And He is Exalted in Might, the Wise.",
            "english_hilali_khan": "For those who believe not in the Hereafter is an evil description, and for Allâh is the highest description. And He is the All-Mighty, the All-Wise.",
            "english_rwwad": "Those who do not believe in the Hereafter have evil attributes, and Allah has the highest attributes, for He is the All-Mighty, the All-Wise."
        }
    },
    {
        "id": 1961,
        "chapter": 16,
        "verse": 61,
        "arabic_text": "وَلَوۡ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلۡمِهِم مَّا تَرَكَ عَلَيۡهَا مِن دَآبَّةٖ وَلَٰكِن يُؤَخِّرُهُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۖ فَإِذَا جَآءَ أَجَلُهُمۡ لَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ",
        "phonetic": "16.61 Wa Law Yu'uākhidhu Allāhu An-Nāsa Bižulmihim Mā Taraka `Alayhā Min Dābbatin Wa Lakin Yu'uakhkhiruhum 'Ilá 'Ajalin Musammáan Fa'idhā Jā'a 'Ajaluhum Lā Yasta'khirūna Sā`atan Wa Lā Yastaqdimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if Allāh were to impose blame on the people for their wrongdoing, He would not have left upon it [i.e., the earth] any creature, but He defers them for a specified term. And when their term has come, they will not remain behind an hour, nor will they precede [it].",
            "english_hilali_khan": "And if Allâh were to seize mankind for their wrong-doing, He would not leave on it (the earth) a single moving (living) creature, but He postpones them for an appointed term and when their term comes, neither can they delay nor can they advance it an hour (or a moment).",
            "english_rwwad": "If Allah were to take people to task for their wrongdoing, He would not leave a single living being on earth, but He gives them respite for an appointed time. When their time comes, they cannot delay it for a moment nor can they bring it forward."
        }
    },
    {
        "id": 1962,
        "chapter": 16,
        "verse": 62,
        "arabic_text": "وَيَجۡعَلُونَ لِلَّهِ مَا يَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ",
        "phonetic": "16.62 Wa Yaj`alūna Lillāhi Mā Yakrahūna Wa Taşifu 'Alsinatuhumu Al-Kadhiba 'Anna Lahumu Al-Ĥusná Lā Jarama 'Anna Lahumu An-Nāra Wa 'Annahum Mufraţūna",
        "footnotes": {
            "english_saheeh": "[706]- Another meaning is \"...and they will be made to precede [all others thereto].\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they attribute to Allāh that which they dislike [i.e., daughters], and their tongues assert the lie that they will have the best [from Him]. Assuredly, they will have the Fire, and they will be [therein] neglected.[706]",
            "english_hilali_khan": "They assign to Allâh that which they dislike (for themselves), and their tongues assert the falsehood that the better things will be theirs. No doubt for them is the Fire, and they will be the first to be hastened on into it, and left there neglected. (Tafsir Al-Qurtubî)",
            "english_rwwad": "They attribute to Allah what they dislike for themselves, and their tongues make false claim that they will have the best [reward]. Without a doubt for them there will be the Fire, and they will be neglected."
        }
    },
    {
        "id": 1963,
        "chapter": 16,
        "verse": 63,
        "arabic_text": "تَٱللَّهِ لَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَهُوَ وَلِيُّهُمُ ٱلۡيَوۡمَ وَلَهُمۡ عَذَابٌ أَلِيمٞ",
        "phonetic": "16.63 Ta-Allāhi Laqad 'Arsalnā 'Ilá 'Umamin Min Qablika Fazayyana Lahumu Ash-Shayţānu 'A`mālahum Fahuwa Walīyuhumu Al-Yawma Wa Lahum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "By Allāh, We did certainly send [messengers] to nations before you, but Satan made their deeds attractive to them. And he is their [i.e., the disbelievers] ally today [as well], and they will have a painful punishment.",
            "english_hilali_khan": "By Allâh, We indeed sent (Messengers) to the nations before you (O Muhammad صلى الله عليه و سلم), but Shaitân (Satan) made their deeds fair-seeming to them. So he (Satan) is their Wali (helper) today (i.e. in this world), and theirs will be a painful torment.",
            "english_rwwad": "By Allah, We sent [messengers] to nations before you, but Satan made their deeds appealing to them. He is their ally today, and for them there will be a painful punishment."
        }
    },
    {
        "id": 1964,
        "chapter": 16,
        "verse": 64,
        "arabic_text": "وَمَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ إِلَّا لِتُبَيِّنَ لَهُمُ ٱلَّذِي ٱخۡتَلَفُواْ فِيهِ وَهُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "16.64 Wa Mā 'Anzalnā `Alayka Al-Kitāba 'Illā Litubayyina Lahumu Al-Ladhī Akhtalafū Fīhi Wa Hudáan Wa Raĥmatan Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have not revealed to you the Book, [O Muḥammad], except for you to make clear to them that wherein they have differed and as guidance and mercy for a people who believe.",
            "english_hilali_khan": "And We have not sent down the Book (the Qur’an) to you (O Muhammad صلى الله عليه و سلم), except that you may explain clearly unto them those things in which they differ, and (as) a guidance and a mercy for a folk who believe.",
            "english_rwwad": "We have only sent down to you the Book so that you may make clear to them what they differed about, and as a guidance and mercy for people who believe."
        }
    },
    {
        "id": 1965,
        "chapter": 16,
        "verse": 65,
        "arabic_text": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ",
        "phonetic": "16.65 Wa Allāhu 'Anzala Mina As-Samā'i Mā'an Fa'aĥyā Bihi Al-'Arđa Ba`da Mawtihā 'Inna Fī Dhālika La'āyatan Liqawmin Yasma`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has sent down rain from the sky and given life thereby to the earth after its lifelessness. Indeed in that is a sign for a people who listen.",
            "english_hilali_khan": "And Allâh sends down water (rain) from the sky, then He revives the earth therewith after its death. Verily, in this is a sign (clear proof) for people who listen (obey Allâh).",
            "english_rwwad": "Allah sends down rain from the sky and revive thereby the earth after its death. Indeed, there is a sign in this for people who listen."
        }
    },
    {
        "id": 1966,
        "chapter": 16,
        "verse": 66,
        "arabic_text": "وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ",
        "phonetic": "16.66 Wa 'Inna Lakum Fī Al-'An`ām La`ibratan Nusqīkum Mimmā Fī Buţūnihi Min Bayni Farthin Wa Damin Labanāan Khālişāan Sā'ighāan Lilshāribīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, for you in grazing livestock is a lesson. We give you drink from what is in their bellies - between excretion and blood - pure milk, palatable to drinkers.",
            "english_hilali_khan": "And verily! In the cattle, there is a lesson for you. We give you to drink of that which is in their bellies, from between excretions and blood, pure milk; palatable to the drinkers.",
            "english_rwwad": "And there is surely a lesson for you in livestock. We give you drink from what is in their bellies – produced between excretion and blood – pure and pleasant milk for those who drink."
        }
    },
    {
        "id": 1967,
        "chapter": 16,
        "verse": 67,
        "arabic_text": "وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ",
        "phonetic": "16.67 Wa Min Thamarāti An-Nakhīli Wa Al-'A`nābi Tattakhidhūna Minhu Sakarāan Wa Rizqāan Ĥasanāan 'Inna Fī Dhālika La'āyatan Liqawmin Ya`qilūna",
        "footnotes": {
            "english_saheeh": "[707]- This verse was revealed before the prohibition of intoxicants.  It alludes to the fact that there are both evil and good possibilities in certain things.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And from the fruits of the palm trees and grapevines you take intoxicant and good provision.[707] Indeed in that is a sign for a people who reason.",
            "english_hilali_khan": "And from the fruits of date-palms and grapes, you derive strong drink and a goodly provision. Verily, therein is indeed a sign for people who have wisdom.",
            "english_rwwad": "And from the fruits of palm trees and grapevines you make intoxicants and good provision. Indeed, there is a sign in this for people of understanding."
        }
    },
    {
        "id": 1968,
        "chapter": 16,
        "verse": 68,
        "arabic_text": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ",
        "phonetic": "16.68 Wa 'Awĥá Rabbuka 'Ilá An-Naĥli 'Ani Attakhidhī Mina Al-Jibāli Buyūtāan Wa Mina Ash-Shajari Wa Mimmā Ya`rishūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord inspired to the bee, \"Take for yourself among the mountains, houses [i.e., hives], and among the trees and [in] that which they construct.",
            "english_hilali_khan": "And your Lord inspired the bees, saying: \"Take you habitations in the mountains and in the trees and in what they erect.",
            "english_rwwad": "Your Lord inspired the bees, “Make homes in the mountains, the trees, and in the trellises that people put up,"
        }
    },
    {
        "id": 1969,
        "chapter": 16,
        "verse": 69,
        "arabic_text": "ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ",
        "phonetic": "16.69 Thumma Kulī Min Kulli Ath-Thamarāti Fāslukī Subula Rabbiki Dhululāan Yakhruju Min Buţūnihā Sharābun Mukhtalifun 'Alwānuhu Fīhi Shifā'un Lilnnāsi 'Inna Fī Dhālika La'āyatan Liqawmin Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "[708]- i.e., delicious substances found by the bee.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then eat from all the fruits[708] and follow the ways of your Lord laid down [for you].\" There emerges from their bellies a drink, varying in colors, in which there is healing for people. Indeed in that is a sign for a people who give thought.",
            "english_hilali_khan": "\"Then, eat of all fruits, and follow the ways of your Lord made easy (for you).\" There comes forth from their bellies, a drink of varying colour wherein is healing for men. Verily, in this is indeed a sign for people who think.",
            "english_rwwad": "Then feed on every kind of fruit and follow the ways that your Lord made easy for you.” There comes out from their bellies a drink of various colors, in which there is healing for people. Indeed, there is a sign in this for people who reflect."
        }
    },
    {
        "id": 1970,
        "chapter": 16,
        "verse": 70,
        "arabic_text": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡـًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ",
        "phonetic": "16.70 Wa Allāhu Khalaqakum Thumma Yatawaffākum Wa Minkum Man Yuraddu 'Ilá 'Ardhali Al-`Umuri Likay Lā Ya`lama Ba`da `Ilmin Shay'āan 'Inna Allāha `Alīmun Qadīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh created you; then He will take you in death. And among you is he who is reversed to the most decrepit [old] age so that he will not know, after [having had] knowledge, a thing. Indeed, Allāh is Knowing and Competent.",
            "english_hilali_khan": "And Allâh has created you and then He will cause you to die; and of you there are some who are sent back to senility, so that they know nothing after having known (much). Truly! Allâh is All-Knowing, All-Powerful.",
            "english_rwwad": "Allah has created you, then He causes you to die. Among you are some who are left to reach the most decrepit age, so that they may know nothing after having known much. Indeed, Allah is All-Knowing, Most Capable."
        }
    },
    {
        "id": 1971,
        "chapter": 16,
        "verse": 71,
        "arabic_text": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ",
        "phonetic": "16.71 Wa Allāhu Fađđala Ba`đakum `Alá Ba`đin Fī Ar-Rizqi Famā Al-Ladhīna Fuđđilū Birāddī Rizqihim `Alá Mā Malakat 'Aymānuhum Fahum Fīhi Sawā'un 'Afabini`mati Allāhi Yajĥadūna",
        "footnotes": {
            "english_saheeh": "[709]- The argument presented in this verse is that if they cannot consider their own possessions equal to themselves, then how can they consider Allāh's creations as being equal to Him?",
            "english_hilali_khan": "(V.16:71):\na) This example Allâh has set forth for the polytheists (pagans) who associate false deities with Allâh, that they would not agree to share their wealth and properties with their slaves, then how do they agree to share false deities with Allâh in His worship?\nb) Allâh’s Statement: \"And Allah ...\" (V.16:71). Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Prophet Ibrâhîm (Abraham) عليه السلام emigrated with Sârah and entered a village where there was a king from amongst the kings or a tyrant from amongst the tyrants. (The king) was told that Ibrâhîm (Abraham) had entered (the village) accompanied by a woman who was one of the most charming women. So, the king sent for Ibrâhîm (Abraham) and asked, ‘O Ibrâhîm (Abraham)! Who is this lady accompanying you?’ Ibrâhîm (Abraham) replied, ‘She is my sister (i.e., in religion).’ Then Ibrâhîm (Abraham) returned to her and said, ‘Do not contradict my statement, for I have informed them that you are my sister. By Allâh, there are not true believers on the earth except you and I.’ Then Ibrâhîm (Abraham) sent her to the king. When the king got to her, she got up and performed ablution, offered Salât (prayer) and said, ‘O Allâh! If I have believed in You and Your Messenger, and have guarded my private parts from everybody except my husband, then please do not let this disbeliever overpower me.’ On that the king fell in a state of unconsciousness (or had an epileptic fit) and started moving his legs. Seeing the condition of the king, Sârah said, ‘O Allâh! If he should die, the people will say that I have killed him.’ The king regained his power, and proceeded towards her but she got up again and performed ablution, offered Salât (prayer) and said, ‘O Allâh! If I have believed in You and Your Messenger and have kept my private parts safe from all except my husband, then please do not let this disbeliever overpower me.’ The king again fell in a state of unconsciousness (or had epileptic fit) and started moving his legs. On seeing that state of the king, Sârah said, ‘O Allâh! If he should die, the people will say that I have killed him.’ The king got either two or three attacks, and after recovering from the last attack he said, ‘By Allâh! You have sent a Satan to me. Take her to Ibrâhîm (Abraham) and give her Agar (Hagar).’ So she came back to Ibrâhîm (Abraham) and said, ‘Allâh humiliated the disbeliever and gave us a slave-girl for service.’ \" (Sahih Al Bukhari, Vol.3. Hadith No 420).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has favored some of you over others in provision. But those who were favored [i.e., given more] would not hand over their provision to those whom their right hands possess [i.e., slaves] so they would be equal to them therein.[709] Then is it the favor of Allāh they reject?",
            "english_hilali_khan": "And Allâh has preferred some of you above others in wealth and properties. Then, those who are preferred will by no means hand over their wealth and properties to those (slaves) whom their right hands possess, so that they may be equal with them in respect thereof[1]. Do they then deny the Favour of Allâh?",
            "english_rwwad": "Allah has favored some of you over others in provision. Those who are favored will not share their provision with their slaves, so that they may become equal to them. Do they then deny the favors of Allah?"
        }
    },
    {
        "id": 1972,
        "chapter": 16,
        "verse": 72,
        "arabic_text": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ",
        "phonetic": "16.72 Wa Allāhu Ja`ala Lakum Min 'Anfusikum 'Azwājāan Wa Ja`ala Lakum Min 'Azwājikum Banīna Wa Ĥafadatan Wa Razaqakum Mina Aţ-Ţayyibāti 'Afabiālbāţili Yu'uminūna Wa Bini`mati Allāhi Hum Yakfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has made for you from yourselves mates and has made for you from your mates sons and grandchildren and has provided for you from the good things. Then in falsehood do they believe and in the favor of Allāh they disbelieve?",
            "english_hilali_khan": "And Allâh has made for you Azwâj (mates or wives) of your own kind, and has made for you, from your wives, sons and grandsons, and has bestowed on you good provision. Do they then believe in false deities and deny the Favour of Allâh (by not worshipping Allâh Alone).",
            "english_rwwad": "Allah has made for you spouses of your own kind, and has given you through your spouses children and grandchildren, and has given you provision from good things. Do they still believe in falsehood and deny the favors of Allah?"
        }
    },
    {
        "id": 1973,
        "chapter": 16,
        "verse": 73,
        "arabic_text": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَمۡلِكُ لَهُمۡ رِزۡقٗا مِّنَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ شَيۡـٔٗا وَلَا يَسۡتَطِيعُونَ",
        "phonetic": "16.73 Wa Ya`budūna Min Dūni Allāhi Mā Lā Yamliku Lahum Rizqāan Mina As-Samāwāti Wa Al-'Arđi Shay'āan Wa Lā Yastaţī`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they worship besides Allāh that which does not possess for them [the power of] provision from the heavens and the earth at all, and [in fact], they are unable.",
            "english_hilali_khan": "And they worship others besides Allâh - such as do not and cannot own any provision for them from the heavens or the earth.",
            "english_rwwad": "They worship besides Allah those who have nothing to provide for them from the heavens and earth, nor are they capable of doing so."
        }
    },
    {
        "id": 1974,
        "chapter": 16,
        "verse": 74,
        "arabic_text": "فَلَا تَضۡرِبُواْ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ",
        "phonetic": "16.74 Falā Tađribū Lillāhi Al-'Amthāla 'Inna Allāha Ya`lamu Wa 'Antum Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[710]- As there is nothing comparable to Him.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So do not assert similarities to Allāh.[710] Indeed, Allāh knows and you do not know.",
            "english_hilali_khan": "So put not forward similitudes for Allâh (as there is nothing similar to Him, nor He resembles anything). Truly! Allâh knows and you know not.",
            "english_rwwad": "So do not make comparisons to Allah. Indeed, Allah knows and you do not know."
        }
    },
    {
        "id": 1975,
        "chapter": 16,
        "verse": 75,
        "arabic_text": "۞ ضَرَبَ ٱللَّهُ مَثَلًا عَبۡدٗا مَّمۡلُوكٗا لَّا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَمَن رَّزَقۡنَٰهُ مِنَّا رِزۡقًا حَسَنٗا فَهُوَ يُنفِقُ مِنۡهُ سِرّٗا وَجَهۡرًاۖ هَلۡ يَسۡتَوُۥنَۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "16.75 Đaraba Allāhu Mathalāan `Abdāan Mamlūkāan Lā Yaqdiru `Alá Shay'in Wa Man Razaqnāhu Minnā Rizqāan Ĥasanāan Fahuwa Yunfiqu Minhu Sirrāan Wa Jahrāan Hal Yastawūna Al-Ĥamdu Lillāhi Bal 'Aktharuhum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh presents an example: a slave [who is] owned and unable to do a thing and he to whom We have provided from Us good provision, so he spends from it secretly and publicly. Can they be equal? Praise to Allāh! But most of them do not know.",
            "english_hilali_khan": "Allâh puts forward the example of (two men - a believer and a disbeliever); a slave (disbeliever) under the possession of another, he has no power of any sort, and (the other), a man (believer) on whom We have bestowed a good provision from Us, and he spends thereof secretly and openly. Can they be equal? (By no means). All the praises and thanks are to Allâh. Nay! (But) most of them know not.",
            "english_rwwad": "Allah makes a comparison of a bonded slave who has no power over anything and a [free] person whom We granted good provision from Us, and he spends from it secretly and openly. Are they equal? All praise be to Allah. But most of them do not know."
        }
    },
    {
        "id": 1976,
        "chapter": 16,
        "verse": 76,
        "arabic_text": "وَضَرَبَ ٱللَّهُ مَثَلٗا رَّجُلَيۡنِ أَحَدُهُمَآ أَبۡكَمُ لَا يَقۡدِرُ عَلَىٰ شَيۡءٖ وَهُوَ كَلٌّ عَلَىٰ مَوۡلَىٰهُ أَيۡنَمَا يُوَجِّههُّ لَا يَأۡتِ بِخَيۡرٍ هَلۡ يَسۡتَوِي هُوَ وَمَن يَأۡمُرُ بِٱلۡعَدۡلِ وَهُوَ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
        "phonetic": "16.76 Wa Đaraba Allāhu Mathalāan Rajulayni 'Aĥaduhumā 'Abkamu Lā Yaqdiru `Alá Shay'in Wa Huwa Kallun `Alá Mawlāhu 'Aynamā Yuwajjhhhu Lā Ya'ti Bikhayrin Hal Yastawī Huwa Wa Man Ya'muru Bil-`Adli Wa Huwa `Alá Şirāţin Mustaqīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh presents an example of two men, one of them dumb and unable to do a thing, while he is a burden to his guardian. Wherever he directs him, he brings no good. Is he equal to one who commands justice, while he is on a straight path?",
            "english_hilali_khan": "And Allâh puts forward (another) example of two men, one of them dumb, who has no power over anything (disbeliever), and he is a burden on his master; whichever way he directs him, he brings no good. Is such a man equal to one (believer in the Islâmic Monotheism) who commands justice, and is himself on the Straight Path?",
            "english_rwwad": "And Allah makes a comparison of two men, one of them is dumb and unable to do anything, and he is a burden to his master; wherever he directs him, he brings no good. Is he equal to the one who enjoins justice and follows a straight path?"
        }
    },
    {
        "id": 1977,
        "chapter": 16,
        "verse": 77,
        "arabic_text": "وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَآ أَمۡرُ ٱلسَّاعَةِ إِلَّا كَلَمۡحِ ٱلۡبَصَرِ أَوۡ هُوَ أَقۡرَبُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
        "phonetic": "16.77 Wa Lillahi Ghaybu As-Samāwāti Wa Al-'Arđi Wa Mā 'Amru As-Sā`ati 'Illā Kalamĥi Al-Başari 'Aw Huwa 'Aqrabu 'Inna Allāha `Alá Kulli Shay'in Qadīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Allāh belongs the unseen [aspects] of the heavens and the earth. And the command for the Hour is not but as a glance of the eye or even nearer. Indeed, Allāh is over all things competent.",
            "english_hilali_khan": "And to Allâh belongs the Unseen of the heavens and the earth. And the matter of the Hour is not but as a twinkling of the eye, or even nearer. Truly! Allâh is Able to do all things.",
            "english_rwwad": "To Allah belongs the unseen [aspects] of the heavens and earth; and the coming of the Hour is no more than the blink of an eye or even quicker, for Allah is Most Capable of all things."
        }
    },
    {
        "id": 1978,
        "chapter": 16,
        "verse": 78,
        "arabic_text": "وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَٰتِكُمۡ لَا تَعۡلَمُونَ شَيۡـٔٗا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ",
        "phonetic": "16.78 Wa Allāhu 'Akhrajakum Min Buţūni 'Ummahātikum Lā Ta`lamūna Shay'āan Wa Ja`ala Lakumu As-Sam`a Wa Al-'Abşāra Wa Al-'Af'idata La`allakum Tashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has extracted you from the wombs of your mothers not knowing a thing, and He made for you hearing and vision and hearts [i.e., intellect] that perhaps you would be grateful.",
            "english_hilali_khan": "And Allâh has brought you out from the wombs of your mothers while you know nothing. And He gave you hearing, sight, and hearts that you might give thanks (to Allâh).",
            "english_rwwad": "Allah brought you out from your mothers’ wombs not knowing anything, and He gave you hearing, sight and intellect, so that you may be grateful."
        }
    },
    {
        "id": 1979,
        "chapter": 16,
        "verse": 79,
        "arabic_text": "أَلَمۡ يَرَوۡاْ إِلَى ٱلطَّيۡرِ مُسَخَّرَٰتٖ فِي جَوِّ ٱلسَّمَآءِ مَا يُمۡسِكُهُنَّ إِلَّا ٱللَّهُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "16.79 'Alam Yaraw 'Ilá Aţ-Ţayri Musakhkharātin Fī Jawwi As-Samā'i Mā Yumsikuhunna 'Illā Allāhu 'Inna Fī Dhālika La'āyātin Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not see the birds controlled in the atmosphere of the sky? None holds them up except Allāh. Indeed in that are signs for a people who believe.",
            "english_hilali_khan": "Do they not see the birds held (flying) in the midst of the sky? None holds them but Allâh [none gave them the ability to fly but Allâh]. Verily, in this are clear Ayât (proofs and signs) for people who believe (in the Oneness of Allâh).",
            "english_rwwad": "Do they not see the birds enabled to fly in the open air? None holds them up except Allah. Indeed, there are signs in this for people who believe."
        }
    },
    {
        "id": 1980,
        "chapter": 16,
        "verse": 80,
        "arabic_text": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ",
        "phonetic": "16.80 Wa Allāhu Ja`ala Lakum Min Buyūtikum Sakanāan Wa Ja`ala Lakum Min Julūdi Al-'An`āmi Buyūtāan Tastakhiffūnahā Yawma Ža`nikum Wa Yawma 'Iqāmatikum Wa Min 'Aşwāfihā Wa 'Awbārihā Wa 'Ash`ārihā 'Athāthāan Wa Matā`āan 'Ilá Ĥīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has made for you from your homes a place of rest and made for you from the hides of the animals tents which you find light on your day of travel and your day of encampment; and from their wool, fur and hair is furnishing and enjoyment [i.e., provision] for a time.",
            "english_hilali_khan": "And Allâh has made for you in your homes an abode, and made for you out of the hides of the cattle (tents for) dwelling, which you find so light (and handy) when you travel and when you stay (in your travels); and of their wool, fur, and hair (sheep wool, camel fur, and goat hair), furnishings and articles of convenience (e.g. carpets, blankets), comfort for a while.",
            "english_rwwad": "Allah has made your houses a place of rest for you, and He has given you tents made from the hides of livestock which you find light to handle when you travel and when you camp. And out of their wool, fur and hair [He has given you] furnishings and enjoyment for a while."
        }
    },
    {
        "id": 1981,
        "chapter": 16,
        "verse": 81,
        "arabic_text": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ",
        "phonetic": "16.81 Wa Allāhu Ja`ala Lakum Mimmā Khalaqa Žilālāan Wa Ja`ala Lakum Mina Al-Jibāli 'Aknānāan Wa Ja`ala Lakum Sarābīla Taqīkumu Al-Ĥarra Wa Sarābīla Taqīkum Ba'sakum Kadhālika Yutimmu Ni`matahu `Alaykum La`allakum Tuslimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh has made for you, from that which He has created, shadows [i.e., shade] and has made for you from the mountains, shelters and has made for you garments which protect you from the heat and garments [i.e., coats of mail] which protect you from your [enemy in] battle. Thus does He complete His favor upon you that you might submit [to Him].",
            "english_hilali_khan": "And Allâh has made for you out of that which He has created shades, and has made for you places of refuge in the mountains, and has made for you garments to protect you from the heat (and cold), and coats of mail to protect you from your (mutual) violence. Thus does He perfect His Favour unto you, that you may submit yourselves to His Will (in Islâm).",
            "english_rwwad": "Allah has made for you shade out of what He has created, and has made for you shelter in the mountains. He has also made for you garments protecting you from heat [and cold], and garments [of armor] protecting you in battle. This is how He perfects His favors upon you, so that you may submit to Him."
        }
    },
    {
        "id": 1982,
        "chapter": 16,
        "verse": 82,
        "arabic_text": "فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ",
        "phonetic": "16.82 Fa'in Tawallaw Fa'innamā `Alayka Al-Balāghu Al-Mubīnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they turn away, [O Muḥammad] - then only upon you is [responsibility for] clear notification.",
            "english_hilali_khan": "Then, if they turn away, your duty (O Muhammad صلى الله عليه و سلم) is only to convey (the Message) in a clear way.",
            "english_rwwad": "But if they turn away, your duty is only to convey the message clearly."
        }
    },
    {
        "id": 1983,
        "chapter": 16,
        "verse": 83,
        "arabic_text": "يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ",
        "phonetic": "16.83 Ya`rifūna Ni`mata Allāhi Thumma Yunkirūnahā Wa 'Aktharuhumu Al-Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They recognize the favor of Allāh; then they deny it. And most of them are disbelievers.",
            "english_hilali_khan": "They recognise the Grace of Allâh, yet they deny it (by worshipping others besides Allâh) and most of them are disbelievers (deny the Prophethood of Muhammad صلى الله عليه و سلم).",
            "english_rwwad": "They know Allah’s favors, yet they deny them, and most of them are ungrateful."
        }
    },
    {
        "id": 1984,
        "chapter": 16,
        "verse": 84,
        "arabic_text": "وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ",
        "phonetic": "16.84 Wa Yawma Nab`athu Min Kulli 'Ummatin Shahīdāan Thumma Lā Yu'udhanu Lilladhīna Kafarū Wa Lā Hum Yusta`tabūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] the Day when We will resurrect from every nation a witness [i.e., their prophet]. Then it will not be permitted to the disbelievers [to apologize or make excuses], nor will they be asked to appease [Allāh].",
            "english_hilali_khan": "And (remember) the Day when We shall raise up from each nation a witness (their Messenger), then, those who disbelieved will not be given leave (to put forward excuses), nor will they be allowed (to return to the world) to repent and ask for Allâh’s Forgiveness (of their sins).",
            "english_rwwad": "On the Day when We raise up a witness from every community, no excuse will be accepted from the disbelievers, nor will they be allowed to make amends."
        }
    },
    {
        "id": 1985,
        "chapter": 16,
        "verse": 85,
        "arabic_text": "وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ",
        "phonetic": "16.85 Wa 'Idhā Ra'á Al-Ladhīna Žalamū Al-`Adhāba Falā Yukhaffafu `Anhum Wa Lā Hum Yunžarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when those who wronged see the punishment, it will not be lightened for them, nor will they be reprieved.",
            "english_hilali_khan": "And when those who did wrong (the disbelievers) will see the torment, then it will not be lightened unto them, nor will they be given respite.",
            "english_rwwad": "When the wrongdoers face the punishment, it will not be lightened for them, nor will they be given any respite."
        }
    },
    {
        "id": 1986,
        "chapter": 16,
        "verse": 86,
        "arabic_text": "وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ",
        "phonetic": "16.86 Wa 'Idhā Ra'á Al-Ladhīna 'Ashrakū Shurakā'ahum Qālū Rabbanā Hā'uulā' Shurakā'uunā Al-Ladhīna Kunnā Nad`ū Min Dūnika Fa'alqaw 'Ilayhimu Al-Qawla 'Innakum Lakādhibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when those who associated others with Allāh see their \"partners,\" they will say, \"Our Lord, these are our partners [to You] whom we used to invoke [in worship] besides You.\" But they will throw at them the statement, \"Indeed, you are liars.\"",
            "english_hilali_khan": "And when those who associated partners with Allâh see their (Allâh’s so-called) partners, they will say: \"Our Lord! These are our partners whom we used to invoke besides you.\" But they will throw back their word at them (and say): \"Surely! You indeed are liars!\"",
            "english_rwwad": "When those who associated partners with Allah see their [so-called] partners, they will say, “Our Lord, these are our partners whom we used to worship besides You.” But they will counter them with the statement, “You are indeed liars.”"
        }
    },
    {
        "id": 1987,
        "chapter": 16,
        "verse": 87,
        "arabic_text": "وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ",
        "phonetic": "16.87 Wa 'Alqaw 'Ilá Allāhi Yawma'idhin As-Salama Wa Đalla `Anhum Mā Kānū Yaftarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they will impart to Allāh that Day [their] submission, and lost from them is what they used to invent.",
            "english_hilali_khan": "And they will offer (their full) submission to Allâh (Alone) on that Day, and their invented false deities [all that they used to invoke besides Allâh, e.g. idols, saints, priests, monks, angels, jinn, Jibrîl (Gabriel), Messengers] will vanish from them.",
            "english_rwwad": "On that Day they will offer submission to Allah, and all what they used to fabricate will vanish from them."
        }
    },
    {
        "id": 1988,
        "chapter": 16,
        "verse": 88,
        "arabic_text": "ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ",
        "phonetic": "16.88 Al-Ladhīna Kafarū Wa Şaddū `An Sabīli Allāhi Zidnāhum `Adhābāan Fawqa Al-`Adhābi Bimā Kānū Yufsidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who disbelieved and averted [others] from the way of Allāh - We will increase them in punishment over [their] punishment for what corruption they were causing.",
            "english_hilali_khan": "Those who disbelieved and hinder (men) from the Path of Allâh, for them We will add torment to the torment because they used to spread corruption [by disobeying Allâh themselves, as well as ordering others (mankind) to do so].",
            "english_rwwad": "Those who disbelieve and prevent others from the way of Allah, We will add punishment to their punishment for the corruption they used to spread."
        }
    },
    {
        "id": 1989,
        "chapter": 16,
        "verse": 89,
        "arabic_text": "وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ",
        "phonetic": "16.89 Wa Yawma Nab`athu Fī Kulli 'Ummatin Shahīdāan `Alayhim Min 'Anfusihim Wa Ji'nā Bika Shahīdāan `Alá Hā'uulā' Wa Nazzalnā `Alayka Al-Kitāba Tibyānāan Likulli Shay'in Wa Hudáan Wa Raĥmatan Wa Bushrá Lilmuslimīna",
        "footnotes": {
            "english_saheeh": "[711]- Those who have submitted themselves to Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] the Day when We will resurrect among every nation a witness over them from themselves [i.e., their prophet]. And We will bring you, [O Muḥammad], as a witness over these [i.e., your nation]. And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims.[711]",
            "english_hilali_khan": "And (remember) the Day when We shall raise up from every nation a witness against them from amongst themselves. And We shall bring you (O Muhammad صلى الله عليه و سلم) as a witness against these. And We have sent down to you the Book (the Qur’an) as an exposition of everything, a guidance, a mercy, and glad tidings for those who have submitted themselves (to Allâh as Muslims).",
            "english_rwwad": "On the Day when We raise up against every community a witness from among themselves, We will bring you [O Prophet] as a witness against these [people]. We have sent down to you the Book as an explanation of everything, and as a guidance, mercy and glad tidings for the Muslims."
        }
    },
    {
        "id": 1990,
        "chapter": 16,
        "verse": 90,
        "arabic_text": "۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ",
        "phonetic": "16.90 'Inna Allāha Ya'muru Bil-`Adli Wa Al-'Iĥsāni Wa 'Ītā'i Dhī Al-Qurbá Wa Yanhá `Ani Al-Faĥshā'i Wa Al-Munkari Wa Al-Baghyi Ya`ižukum La`allakum Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:90) Degree of kinship: First of all, your parents, then your offspring, then your brothers and sisters, then your paternal uncles and aunts (from your father’s side), then your maternal uncles and aunts (from your mother’s side), and then other relatives.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Allāh orders justice and good conduct and giving [help] to relatives and forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded.",
            "english_hilali_khan": "Verily, Allâh enjoins Al-‘Adl (i.e. justice and worshipping none but Allâh Alone - Islâmic Monotheism) and Al-Ihsân [i.e. to be patient in performing your duties to Allâh, totally for Allâh’s sake and in accordance with the Sunnah (legal ways) of the Prophet صلى الله عليه وسلم in a perfect manner], and giving (help) to kith and kin[1] (i.e. all that Allâh has ordered you to give them e.g., wealth, visiting, looking after them, or any other kind of help), and forbids Al-Fahshâ’ (i.e all evil deeds, e.g. illegal sexual acts, disobedience of parents, polytheism, to tell lies, to give false witness, to kill a life without right), and Al-Munkar (i.e all that is prohibited by Islâmic law: polytheism of every kind, disbelief and every kind of evil deeds), and Al-Baghy (i.e. all kinds of oppression). He admonishes you, that you may take heed.",
            "english_rwwad": "Allah enjoins justice, kindness, and giving relatives [their dues], and He forbids shameful acts, evil deeds and oppression. He exhorts you, so that you may take heed."
        }
    },
    {
        "id": 1991,
        "chapter": 16,
        "verse": 91,
        "arabic_text": "وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ",
        "phonetic": "16.91 Wa 'Awfū Bi`ahdi Allāhi 'Idhā `Āhadtum Wa Lā Tanquđū Al-'Aymāna Ba`da Tawkīdihā Wa Qad Ja`altumu Allāha `Alaykum Kafīlāan 'Inna Allāha Ya`lamu Mā Taf`alūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And fulfill the covenant of Allāh when you have taken it, [O believers], and do not break oaths after their confirmation while you have made Allāh, over you, a security [i.e., witness]. Indeed, Allāh knows what you do.",
            "english_hilali_khan": "And fulfil the Covenant of Allâh (Bai‘ah: pledge for Islâm) when you have covenanted, and break not the oaths after you have confirmed them - and indeed you have appointed Allâh your surety. Verily! Allâh knows what you do.",
            "english_rwwad": "Fulfill the covenant of Allah when you pledge, and do not break oaths after confirming them, having made Allah your witness, for Allah knows all that you do."
        }
    },
    {
        "id": 1992,
        "chapter": 16,
        "verse": 92,
        "arabic_text": "وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ",
        "phonetic": "16.92 Wa Lā Takūnū Kāllatī Naqađat Ghazlahā Min Ba`di Qūwatin 'Ankāthāan Tattakhidhūna 'Aymānakum Dakhalāan Baynakum 'An Takūna 'Ummatun Hiya 'Arbá Min 'Ummatin 'Innamā Yablūkumu Allāhu Bihi Wa Layubayyinanna Lakum Yawma Al-Qiyāmati Mā Kuntum Fīhi Takhtalifūna",
        "footnotes": {
            "english_saheeh": "[712]- i.e., do not swear falsely or break a treaty or contract merely for a worldly advantage.",
            "english_hilali_khan": "(V.16:92) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not be like she who untwisted her spun thread after it was strong [by] taking your oaths as [means of] deceit between you because one community is more plentiful [in number or wealth] than another community.[712] Allāh only tries you thereby. And He will surely make clear to you on the Day of Resurrection that over which you used to differ.",
            "english_hilali_khan": "And be not like her who undoes the thread which she has spun, after it has become strong, by taking your oaths as a means of deception among yourselves, lest a nation should be more numerous than another nation. Allâh only tests you by this [i.e who obeys Allâh and fulfils Allâh’s Covenant and who disobeys Allâh and breaks Allâh’s Covenant]. And on the Day of Resurrection, He will certainly make clear to you that wherein you used to differ [i.e. a believer confesses and believes in the Oneness of Allâh and in the Prophethood of Prophet Muhammad صلى الله عليه و سلم which the disbeliever denies and that is their difference amongst them in the life of this world][2].",
            "english_rwwad": "Do not be like the woman who unravels her yarn after spinning it firmly, by taking your oaths as a means of deceit between yourselves so that one party might gain advantage over the other. Allah only puts you to test thereby, and on the Day of Resurrection He will surely make clear to you all that over which you used to differ."
        }
    },
    {
        "id": 1993,
        "chapter": 16,
        "verse": 93,
        "arabic_text": "وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "16.93 Wa Law Shā'a Allāhu Laja`alakum 'Ummatan Wāĥidatan Wa Lakin Yuđillu Man Yashā'u Wa Yahdī Man Yashā'u Wa Latus'alunna `Ammā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[713]- According to His knowledge of each soul's preference.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if Allāh had willed, He could have made you [of] one religion, but He sends astray whom He wills and guides whom He wills.[713] And you will surely be questioned about what you used to do.",
            "english_hilali_khan": "And had Allâh willed, He could have made you (all) one nation, but He sends astray whom He wills and guides whom He wills. But you shall certainly be called to account for what you used to do.",
            "english_rwwad": "If Allah had willed, He would have made all of you a single community [of believers], but He causes to stray whom He wills and guides whom He wills, and you will surely be questioned about what you used to do."
        }
    },
    {
        "id": 1994,
        "chapter": 16,
        "verse": 94,
        "arabic_text": "وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ",
        "phonetic": "16.94 Wa Lā Tattakhidhū 'Aymānakum Dakhalāan Baynakum Fatazilla Qadamun Ba`da Thubūtihā Wa Tadhūqū As-Sū'a Bimā Şadadtum `An Sabīli Allāhi Wa Lakum `Adhābun `Ažīmun",
        "footnotes": {
            "english_saheeh": "[714]- Referring to those who would be dissuaded from Islām as a result of a Muslim's deceit and treachery.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not take your oaths as [means of] deceit between you, lest a foot slip after it was [once] firm, and you would taste evil [in this world] for what [people] you diverted from the way of Allāh,[714] and you would have [in the Hereafter] a great punishment.",
            "english_hilali_khan": "And make not your oaths a means of deception among yourselves, lest a foot should slip after being firmly planted, and you may have to taste the evil (punishment in this world) of having hindered (men) from the Path of Allâh (i.e. Belief in the Oneness of Allâh and His Messenger, Muhammad صلى الله عليه و سلم), and yours will be a great torment (i.e. the Fire of Hell in the Hereafter).",
            "english_rwwad": "Do not take your oaths as a means of deceit between yourselves, lest some feet will slip after they have been firm, and you will taste the evil consequences of preventing people from the way of Allah, and for you there will be a great punishment."
        }
    },
    {
        "id": 1995,
        "chapter": 16,
        "verse": 95,
        "arabic_text": "وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ",
        "phonetic": "16.95 Wa Lā Tashtarū Bi`ahdi Allāhi Thamanāan Qalīlāan 'Innamā `Inda Allāhi Huwa Khayrun Lakum 'In Kuntum Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not exchange the covenant of Allāh for a small price. Indeed, what is with Allāh is best for you, if only you could know.",
            "english_hilali_khan": "And purchase not a small gain at the cost of Allâh’s Covenant. Verily! What is with Allâh is better for you if you did but know.",
            "english_rwwad": "Do not trade the covenant of Allah for a small price. Indeed, what is with Allah is best for you, if only you knew."
        }
    },
    {
        "id": 1996,
        "chapter": 16,
        "verse": 96,
        "arabic_text": "مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "16.96 Mā `Indakum Yanfadu Wa Mā `Inda Allāhi Bāqin Wa Lanajziyanna Al-Ladhīna Şabarū 'Ajrahum Bi'aĥsani Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:96) See the footnote of (V.9:121).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whatever you have will end, but what Allāh has is lasting. And We will surely give those who were patient their reward according to the best of what they used to do.",
            "english_hilali_khan": "Whatever is with you, will be exhausted, and whatever is with Allâh (of good deeds) will remain. And those who are patient, We will certainly pay them a reward in proportion to the best of what they used to do[1].",
            "english_rwwad": "Whatever you have will come to an end, but whatever Allah has will last forever. And We will surely grant those who remain steadfast their reward according to the best of their deeds."
        }
    },
    {
        "id": 1997,
        "chapter": 16,
        "verse": 97,
        "arabic_text": "مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "16.97 Man `Amila Şāliĥāan Min Dhakarin 'Aw 'Unthá Wa Huwa Mu'uminun Falanuĥyiyannahu Ĥayāatan Ţayyibatan Wa Lanajziyannahum 'Ajrahum Bi'aĥsani Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever does righteousness, whether male or female, while he is a believer - We will surely cause him to live a good life, and We will surely give them their reward [in the Hereafter] according to the best of what they used to do.",
            "english_hilali_khan": "Whoever works righteousness - whether male or female - while he (or she) is a true believer (of Islâmic Monotheism) verily, to him We will give a good life (in this world with respect, contentment and lawful provision), and We shall pay them certainly a reward in proportion to the best of what they used to do (i.e. Paradise in the Hereafter).",
            "english_rwwad": "Whoever does righteous deeds, male or female, while being a believer, We will surely grant him a good life, and We will surely reward them according to the best of their deeds."
        }
    },
    {
        "id": 1998,
        "chapter": 16,
        "verse": 98,
        "arabic_text": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ",
        "phonetic": "16.98 Fa'idhā Qara'ta Al-Qur'āna Fāsta`idh Billāhi Mina Ash-Shayţāni Ar-Rajīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when you recite the Qur’ān, [first] seek refuge in Allāh from Satan, the expelled [from His mercy].",
            "english_hilali_khan": "So when you want to recite the Qur’ân, seek refuge with Allâh from Shaitân (Satan), the outcast (the cursed one).",
            "english_rwwad": "When you recite the Qur’an, seek refuge with Allah from the accursed Satan."
        }
    },
    {
        "id": 1999,
        "chapter": 16,
        "verse": 99,
        "arabic_text": "إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ",
        "phonetic": "16.99 'Innahu Laysa Lahu Sulţānun `Alá Al-Ladhīna 'Āmanū Wa `Alá Rabbihim Yatawakkalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, there is for him no authority over those who have believed and rely upon their Lord.",
            "english_hilali_khan": "Verily! He has no power over those who believe and put their trust only in their Lord (Allâh).",
            "english_rwwad": "Indeed, he has no power over those who believe and put their trust in their Lord."
        }
    },
    {
        "id": 2000,
        "chapter": 16,
        "verse": 100,
        "arabic_text": "إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ",
        "phonetic": "16.100 'Innamā Sulţānuhu `Alá Al-Ladhīna Yatawallawnahu Wa Al-Ladhīna Hum Bihi Mushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "His authority is only over those who take him as an ally and those who through him associate others with Allāh.",
            "english_hilali_khan": "His power is only over those who obey and follow him (Satan), and those who join partners with Him (Allâh i.e. those who are Mushrikûn i.e. polytheists. See Verse 6:121).",
            "english_rwwad": "He only has power over those who take him as their patron, and under his influence, associate partners with Allah."
        }
    },
    {
        "id": 2001,
        "chapter": 16,
        "verse": 101,
        "arabic_text": "وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۭۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "16.101 Wa 'Idhā Baddalnā 'Āyatan Makāna 'Āyatin Wa Allāhu 'A`lamu Bimā Yunazzilu Qālū 'Innamā 'Anta Muftarin Bal 'Aktharuhum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when We substitute a verse in place of a verse - and Allāh is most knowing of what He sends down - they say, \"You, [O Muḥammad], are but an inventor [of lies].\" But most of them do not know.",
            "english_hilali_khan": "And when We change a Verse (of the Qur’ân,) in place of another - and Allâh knows best what He sends down - they (the disbelievers) say: \"You (O Muhammad صلى الله عليه و سلم) are but a Muftari! (forger, liar).\" Nay, but most of them know not.",
            "english_rwwad": "When We replace one verse with another – and Allah knows best what He sends down – they say, “You are just making it up.” In fact, most of them have no knowledge."
        }
    },
    {
        "id": 2002,
        "chapter": 16,
        "verse": 102,
        "arabic_text": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ",
        "phonetic": "16.102 Qul Nazzalahu Rūĥu Al-Qudusi Min Rabbika Bil-Ĥaqqi Liyuthabbita Al-Ladhīna 'Āmanū Wa Hudáan Wa Bushrá Lilmuslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"The Pure Spirit [i.e., Gabriel] has brought it down from your Lord in truth to make firm those who believe and as guidance and good tidings to the Muslims.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم) Ruh-ul-Qudus [Jibrîl (Gabriel)] has brought it (the Qur’ân) down from your Lord with truth, that it may make firm and strengthen (the Faith of) those who believe, and as a guidance and glad tidings to those who have submitted (to Allâh as Muslims).",
            "english_rwwad": "Say, “This has been brought down by the Holy Spirit from your Lord with the truth, to strengthen those who believe, and as guidance and glad tidings to the Muslims.”"
        }
    },
    {
        "id": 2003,
        "chapter": 16,
        "verse": 103,
        "arabic_text": "وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٞۗ لِّسَانُ ٱلَّذِي يُلۡحِدُونَ إِلَيۡهِ أَعۡجَمِيّٞ وَهَٰذَا لِسَانٌ عَرَبِيّٞ مُّبِينٌ",
        "phonetic": "16.103 Wa Laqad Na`lamu 'Annahum Yaqūlūna 'Innamā Yu`allimuhu Basharun Lisānu Al-Ladhī Yulĥidūna 'Ilayhi 'A`jamīyun Wa Hadhā Lisānun `Arabīyun Mubīnun",
        "footnotes": {
            "english_saheeh": "[715]- Having seen the Prophet (ﷺ) speaking with a foreign man on occasion, the Quraysh accused him of repeating the man's words.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We certainly know that they say, \"It is only a human being who teaches him [i.e., the Prophet (ﷺ)].\" The tongue of the one they refer to is foreign,[715] and this [recitation, i.e., Qur’ān] is [in] a clear Arabic language.",
            "english_hilali_khan": "And indeed We know that they (polytheists and pagans) say: \"It is only a human being who teaches him (Muhammad صلى الله عليه و سلم).\" The tongue of the man they refer to is foreign, while this (the Qur’ân) is a clear Arabic tongue.",
            "english_rwwad": "We surely know that they say, “It is only a human being who teaches him.” But the language they refer to is foreign, whereas this is eloquent Arabic language."
        }
    },
    {
        "id": 2004,
        "chapter": 16,
        "verse": 104,
        "arabic_text": "إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِ لَا يَهۡدِيهِمُ ٱللَّهُ وَلَهُمۡ عَذَابٌ أَلِيمٌ",
        "phonetic": "16.104 'Inna Al-Ladhīna Lā Yu'uminūna Bi'āyāti Allāhi Lā Yahdīhimu Allāhu Wa Lahum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who do not believe in the verses of Allāh - Allāh will not guide them, and for them is a painful punishment.",
            "english_hilali_khan": "Verily! Those who believe not in the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh, Allâh will not guide them and theirs will be a painful torment.",
            "english_rwwad": "Those who do not believe in the verses of Allah, Allah will not guide them, and for them there will be a painful punishment."
        }
    },
    {
        "id": 2005,
        "chapter": 16,
        "verse": 105,
        "arabic_text": "إِنَّمَا يَفۡتَرِي ٱلۡكَذِبَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِـَٔايَٰتِ ٱللَّهِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰذِبُونَ",
        "phonetic": "16.105 'Innamā Yaftarī Al-Kadhiba Al-Ladhīna Lā Yu'uminūna Bi'āyāti Allāhi Wa 'Ūlā'ika Humu Al-Kādhibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They only invent falsehood who do not believe in the verses of Allāh, and it is those who are the liars.",
            "english_hilali_khan": "It is only those who believe not in the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh, who fabricate falsehood, and it is they who are liars.",
            "english_rwwad": "No one fabricates lies except those who do not believe in the verses of Allah; it is they who are the liars."
        }
    },
    {
        "id": 2006,
        "chapter": 16,
        "verse": 106,
        "arabic_text": "مَن كَفَرَ بِٱللَّهِ مِنۢ بَعۡدِ إِيمَٰنِهِۦٓ إِلَّا مَنۡ أُكۡرِهَ وَقَلۡبُهُۥ مُطۡمَئِنُّۢ بِٱلۡإِيمَٰنِ وَلَٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرٗا فَعَلَيۡهِمۡ غَضَبٞ مِّنَ ٱللَّهِ وَلَهُمۡ عَذَابٌ عَظِيمٞ",
        "phonetic": "16.106 Man Kafara Billāhi Min Ba`di 'Īmānihi 'Illā Man 'Ukriha Wa Qalbuhu Muţma'innun Bil-'Īmāni Wa Lakin Man Sharaĥa Bil-Kufri Şadrāan Fa`alayhim Ghađabun Mina Allāhi Wa Lahum `Adhābun `Ažīmun",
        "footnotes": {
            "english_saheeh": "[716]- Based upon the conclusion of this verse, the omitted phrase concerning the apostate is understood to be \"...has earned the wrath of Allāh...\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever disbelieves in [i.e., denies] Allāh after his belief...[716] except for one who is forced [to renounce his religion] while his heart is secure in faith. But those who [willingly] open their breasts to disbelief, upon them is wrath from Allāh, and for them is a great punishment;",
            "english_hilali_khan": "Whoever disbelieved in Allâh after his belief, except him who is forced thereto and whose heart is at rest with Faith; but such as open their breasts to disbelief, on them is wrath from Allâh, and theirs will be a great torment.",
            "english_rwwad": "Whoever disbelieves in Allah after having believed – except one who is compelled while his heart is firm in faith – but those who embrace disbelief willingly, upon them will be the wrath of Allah, and for them there will be a great punishment."
        }
    },
    {
        "id": 2007,
        "chapter": 16,
        "verse": 107,
        "arabic_text": "ذَٰلِكَ بِأَنَّهُمُ ٱسۡتَحَبُّواْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَأَنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ",
        "phonetic": "16.107 Dhālika Bi'annahumu Astaĥabbū Al-Ĥayāata Ad-Dunyā `Alá Al-'Ākhirati Wa 'Anna Allāha Lā Yahdī Al-Qawma Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is because they preferred the worldly life over the Hereafter and that Allāh does not guide the disbelieving people.",
            "english_hilali_khan": "That is because they loved and preferred the life of this world over that of the Hereafter. And Allâh guides not the people who disbelieve.",
            "english_rwwad": "That is because they prefer the life of this world to the Hereafter, and Allah does not guide the disbelieving people."
        }
    },
    {
        "id": 2008,
        "chapter": 16,
        "verse": 108,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ",
        "phonetic": "16.108 'Ūlā'ika Al-Ladhīna Ţaba`a Allāhu `Alá Qulūbihim Wa Sam`ihim Wa 'Abşārihim Wa 'Ūlā'ika Humu Al-Ghāfilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those are the ones over whose hearts and hearing and vision Allāh has sealed, and it is those who are the heedless.",
            "english_hilali_khan": "They are those upon whose hearts, hearing (ears) and sight (eyes) Allâh has set a seal. And they are the heedless!",
            "english_rwwad": "These are the ones whose hearts, hearing and sight are sealed up by Allah; it is they who are the heedless."
        }
    },
    {
        "id": 2009,
        "chapter": 16,
        "verse": 109,
        "arabic_text": "لَا جَرَمَ أَنَّهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "16.109 Lā Jarama 'Annahum Fī Al-'Ākhirati Humu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Assuredly, it is they, in the Hereafter, who will be the losers.",
            "english_hilali_khan": "No doubt, in the Hereafter, they will be the losers.",
            "english_rwwad": "No doubt that it is they who will be the greatest losers in the Hereafter."
        }
    },
    {
        "id": 2010,
        "chapter": 16,
        "verse": 110,
        "arabic_text": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ هَاجَرُواْ مِنۢ بَعۡدِ مَا فُتِنُواْ ثُمَّ جَٰهَدُواْ وَصَبَرُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ",
        "phonetic": "16.110 Thumma 'Inna Rabbaka Lilladhīna Hājarū Min Ba`di Mā Futinū Thumma Jāhadū Wa Şabarū 'Inna Rabbaka Min Ba`dihā Laghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, indeed your Lord, to those who emigrated after they had been compelled [to say words of disbelief] and thereafter fought [for the cause of Allāh] and were patient - indeed, your Lord, after that, is Forgiving and Merciful",
            "english_hilali_khan": "Then, verily! Your Lord - for those who emigrated after they had been put to trials and thereafter strove hard and fought (for the Cause of Allâh) and were patient, verily, your Lord afterward is, Oft-Forgiving, Most Merciful.",
            "english_rwwad": "As for those who emigrated after being persecuted, then strove [for the cause of Allah], and were patient – indeed, your Lord is after that All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 2011,
        "chapter": 16,
        "verse": 111,
        "arabic_text": "۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ",
        "phonetic": "16.111 Yawma Ta'tī Kullu Nafsin Tujādilu `An Nafsihā Wa Tuwaffá Kullu Nafsin Mā `Amilat Wa Hum Lā Yužlamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day when every soul will come disputing [i.e., pleading] for itself, and every soul will be fully compensated for what it did, and they will not be wronged [i.e., treated unjustly].",
            "english_hilali_khan": "(Remember) the Day when every person will come up pleading for himself, and every one will be paid in full for what he did (good or evil, belief or disbelief in the life of this world) and they will not be dealt with unjustly.",
            "english_rwwad": "On the Day when each soul will come pleading for itself, and each soul will be paid in full for what it did, and none will be wronged."
        }
    },
    {
        "id": 2012,
        "chapter": 16,
        "verse": 112,
        "arabic_text": "وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ",
        "phonetic": "16.112 Wa Đaraba Allāhu Mathalāan Qaryatan Kānat 'Āminatan Muţma'innatan Ya'tīhā Rizquhā Raghadāan Min Kulli Makānin Fakafarat Bi'an`umi Allāhi Fa'adhāqahā Allāhu Libāsa Al-Jū`i Wa Al-Khawfi Bimā Kānū Yaşna`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:112) Narrated Ibn ‘Abbâs رضي الله عنهما The Prophet صلى الله عليه وسلم said, \"I was shown the Hell-fire and that the majority of its dwellers were women who were disbelievers or ungrateful.\" He was asked, \"Do they disbelieve in Allâh?\" (or are they ungrateful to Allâh?) He replied, \"They are ungrateful to their husbands and are ungrateful for the favours and the good (charitable deeds) done to them. If you have always been good (benevolent) to one of them for a period of time and then she sees something in you (not of her liking), she will say, ‘I have never seen any good from you.’ \" (Sahih Al-Bukhari, Vol.1, Hadith No.28).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh presents an example: a city [i.e., Makkah] which was safe and secure, its provision coming to it in abundance from every location, but it denied the favors of Allāh. So Allāh made it taste the envelopment of hunger and fear for what they had been doing.",
            "english_hilali_khan": "And Allâh puts forward the example of a township (Makkah), that dwelt secure and well-content: its provision coming to it in abundance from every place, but it (its people) denied the Favours of Allâh (with ungratefulness). So Allâh made it taste extreme of hunger (famine) and fear, because of that (evil, i.e. denying Prophet Muhammad صلى الله عليه و سلم) which they (its people) used to do[1].",
            "english_rwwad": "Allah presents an example of a town which was safe and secure, receiving its provision in abundance from all directions. Yet its people showed ingratitude to Allah’s favors, so Allah made them taste the overwhelming hunger and fear for what they used to do."
        }
    },
    {
        "id": 2013,
        "chapter": 16,
        "verse": 113,
        "arabic_text": "وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ",
        "phonetic": "16.113 Wa Laqad Jā'ahum Rasūlun Minhum Fakadhabūhu Fa'akhadhahumu Al-`Adhābu Wa Hum Žālimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there had certainly come to them a Messenger from among themselves, but they denied him; so punishment overtook them while they were wrongdoers.",
            "english_hilali_khan": "And verily, there had come unto them a Messenger (Muhammad صلى الله عليه و سلم) from among themselves, but they denied him, so the torment overtook them while they were Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "There came to them a messenger from among themselves, but they rejected him, so the punishment seized them while they were wrongdoers."
        }
    },
    {
        "id": 2014,
        "chapter": 16,
        "verse": 114,
        "arabic_text": "فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ",
        "phonetic": "16.114 Fakulū Mimmā Razaqakumu Allāhu Ĥalālāan Ţayyibāan Wa Ashkurū Ni`mata Allāhi 'In Kuntum 'Īyāhu Ta`budūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:114) The meat of cattle beast which Allâh has made lawful to you (Muslims) and are slaughtered according to Islâmic way.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then eat of what Allāh has provided for you [which is] lawful and good. And be grateful for the favor of Allāh, if it is [indeed] Him that you worship.",
            "english_hilali_khan": "So eat of the lawful and good food[2] which Allâh has provided for you. And be grateful for the Favour of Allâh, if it is He Whom you worship.",
            "english_rwwad": "So eat from the lawful and good things that Allah has provided for you, and be grateful for Allah’s blessings, if it is Him that you worship."
        }
    },
    {
        "id": 2015,
        "chapter": 16,
        "verse": 115,
        "arabic_text": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ",
        "phonetic": "16.115 'Innamā Ĥarrama `Alaykumu Al-Maytata Wa Ad-Dama Wa Laĥma Al-Khinzīri Wa Mā 'Uhilla Lighayri Allāhi Bihi Famani Ađţurra Ghayra Bāghin Wa Lā `Ādin Fa'inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[717]- Those not slaughtered or hunted expressly for food.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He has only forbidden to you dead animals,[717] blood, the flesh of swine, and that which has been dedicated to other than Allāh. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit] - then indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "He has forbidden you only Al-Maitah (meat of a dead animal), blood, the flesh of swine, and any animal which is slaughtered as a sacrifice for others than Allâh (or has been slaughtered for idols or on which Allâh’s Name has not been mentioned while slaughtering). But if one is forced by necessity, without wilful disobedience, and not transgressing, - then, Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "He has only forbidden to you carrion, blood, flesh of swine, and what is slaughtered to other than Allah. But if one is compelled by necessity – neither driven by desire nor exceeding the need – then Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 2016,
        "chapter": 16,
        "verse": 116,
        "arabic_text": "وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ",
        "phonetic": "16.116 Wa Lā Taqūlū Limā Taşifu 'Alsinatukumu Al-Kadhiba Hādhā Ĥalālun Wa Hadhā Ĥarāmun Litaftarū `Alá Allāhi Al-Kadhiba 'Inna Al-Ladhīna Yaftarūna `Alá Allāhi Al-Kadhiba Lā Yufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not say about what your tongues assert of untruth, \"This is lawful and this is unlawful,\" to invent falsehood about Allāh. Indeed, those who invent falsehood about Allāh will not succeed.",
            "english_hilali_khan": "And say not concerning that which your tongues put forth falsely: \"This is lawful and this is forbidden,\" so as to invent lies against Allâh. Verily, those who invent lies against Allâh will never prosper.",
            "english_rwwad": "Do not falsely say what your tongues declare, “This is lawful and this is unlawful,” thus fabricating lies against Allah. Those who fabricate lies against Allah will never succeed."
        }
    },
    {
        "id": 2017,
        "chapter": 16,
        "verse": 117,
        "arabic_text": "مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ",
        "phonetic": "16.117 Matā`un Qalīlun Wa Lahum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It is but] a brief enjoyment, and they will have a painful punishment.",
            "english_hilali_khan": "A passing brief enjoyment (will be theirs), but they will have a painful torment.",
            "english_rwwad": "It is only a brief enjoyment, then for them there will be a painful punishment."
        }
    },
    {
        "id": 2018,
        "chapter": 16,
        "verse": 118,
        "arabic_text": "وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ",
        "phonetic": "16.118 Wa `Alá Al-Ladhīna Hādū Ĥarramnā Mā Qaşaşnā `Alayka Min Qablu Wa Mā Žalamnāhum Wa Lakin Kānū 'Anfusahum Yažlimūna",
        "footnotes": {
            "english_saheeh": "[718]- See 6:146.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to those who are Jews We have prohibited that which We related to you before.[718] And We did not wrong them [thereby], but they were wronging themselves.",
            "english_hilali_khan": "And unto those who are Jews, We have forbidden such things as We have mentioned to you (O Muhammad صلى الله عليه و سلم) before [see Verse 6:146]. And We wronged them not, but they used to wrong themselves.",
            "english_rwwad": "We have already related to you what We prohibited to the Jews. We did not wrong them, but it was they who wronged themselves."
        }
    },
    {
        "id": 2019,
        "chapter": 16,
        "verse": 119,
        "arabic_text": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِينَ عَمِلُواْ ٱلسُّوٓءَ بِجَهَٰلَةٖ ثُمَّ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٌ",
        "phonetic": "16.119 Thumma 'Inna Rabbaka Lilladhīna `Amilū As-Sū'a Bijahālatin Thumma Tābū Min Ba`di Dhālika Wa 'Aşlaĥū 'Inna Rabbaka Min Ba`dihā Laghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, indeed your Lord, to those who have done wrong out of ignorance and then repent after that and correct themselves - indeed, your Lord, thereafter, is Forgiving and Merciful.",
            "english_hilali_khan": "Then, verily! Your Lord - for those who do evil (commit sins and are disobedient to Allâh) in ignorance and afterward repent and do righteous deeds, verily, your Lord thereafter, (to such) is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "As for those who commit evil out of ignorance then repent after that and mend their ways, then your Lord is indeed All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 2020,
        "chapter": 16,
        "verse": 120,
        "arabic_text": "إِنَّ إِبۡرَٰهِيمَ كَانَ أُمَّةٗ قَانِتٗا لِّلَّهِ حَنِيفٗا وَلَمۡ يَكُ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "16.120 'Inna 'Ibrāhīma Kāna 'Ummatan Qānitāan Lillāhi Ĥanīfāan Wa Lam Yaku Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "[719]- i.e., embodying all the excellent qualities which make one an example to be followed.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Abraham was a [comprehensive] leader,[719] devoutly obedient to Allāh, inclining toward truth, and he was not of those who associate others with Allāh.",
            "english_hilali_khan": "Verily, Ibrâhîm (Abraham) was an Ummah (a leader having all the good righteous qualities), or a nation, obedient to Allâh, Hanîf (i.e. to worship none but Allâh), and he was not one of those who were Al-Mushrikûn (polytheists, idolaters, disbelievers in the Oneness of Allâh, and those who joined partners with Allâh).",
            "english_rwwad": "Abraham was an exemplary leader, devoted to Allah and inclined to true faith, and he was not one of those who associate partners with Allah."
        }
    },
    {
        "id": 2021,
        "chapter": 16,
        "verse": 121,
        "arabic_text": "شَاكِرٗا لِّأَنۡعُمِهِۚ ٱجۡتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
        "phonetic": "16.121 Shākirāan Li'n`umihi Ajtabāhu Wa Hadāhu 'Ilá Şirāţin Mustaqīm",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:121) (A) Ibrâhîim (Abraham) was neither a Jew nor a Christian, but he was a true Muslim Hanîf (Islâmic Monotheism - to worship none but Allâh Alone) and he joined none in worship with Allâh. [The Qur’an, Verse 3: 67]\n(B) See the footnote (B) of (V.16:71).\n(C) Narrated Abu Hurairah رضي الله عنه: Ibrâhîm (Abraham) عليه السلام did not tell a lie except on three occasions. Twice for the sake of Allâh عز وجل when he said, \"I am sick,\" and he said, \"(I have not done this but) the big idol has done it.\"* The (third was) that while Ibrâhîm (Abraham) and Sârah (his wife) were going (on a journey) they passed by (the territory of) a tyrant from among the tyrants. Someone said to the tyrant, \"This man (i.e. Ibrâhîm (Abraham) عليه السلام) is accompanied by a very charming lady.\" So, he sent for Ibrâhîm (Abraham) and asked him about Sârah saying, \"Who is this lady?\" Ibrâhîm (Abraham) said, \"She is my sister.\" Ibrâhîm (Abraham) went to Sârah and said, ‘O Sârah! There are no believers on the surface of the earth except you and I. This man asked me about you and I have told him that you are my sister, so don’t contradict my statement.\" The tyrant then called Sârah and when she went to him, he tried to take hold of her with his hand, but (his hand got stiff and) he was confounded. He asked Sârah, \"Pray to Allâh for me, and I shall not harm you.\" So Sârah asked Allâh to cure him and he got cured. He tried to take hold of her for the second time, but (his hand got as stiff as or stiffer than before and) was more confounded. He again requested Sârah, \"Pray to Allâh for me, and I will not harm you,\" Sârah asked Allâh again and he became right. He then called one of his guards (who had brought her) and said, \"You have not brought me a human being but have brought me a devil.\" The tyrant then gave Hâjar as a girl-servant to Sârah. Sârah came back [to Ibrâhîm (Abraham)] while he was praying. Ibrâhîm (Abraham), gesturing with his hand, asked, \"What has happened?\" She replied \"Allâh has spoiled the evil plot of the infidel (or immoral person) and gave me Hâjar for service\". (Abu Hurairah then addressed his listeners saying, \"That (Hâjar) was your mother, O Banî Mâ’-is-Samâ’ (i.e. the Arabs).\" (Sahih Al-Bukhari, Vol.4, Hadith No.578)\n* The idolaters invited Ibrâhîm (Abraham) to join them in their celebrations outside the city, but he refused, claiming that he was sick. When he was left alone, he came to their idols and broke them into pieces. When the idolaters questioned him, he claimed that he had not destroyed their idols but the chief idol had, which Ibrâhîm (Abraham) left undisturbed and on whose shoulder he had put an axe to lay the accusation on it.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He was] grateful for His favors. He [i.e., Allāh] chose him and guided him to a straight path.",
            "english_hilali_khan": "(He was) thankful for His (Allâh’s) Favours. He (Allâh) chose him (as an intimate friend) and guided him to a Straight Path (Islâmic Monotheism - neither Judaism nor Christianity[1]).",
            "english_rwwad": "He was grateful for His favors; He chose him and guided him to a straight path."
        }
    },
    {
        "id": 2022,
        "chapter": 16,
        "verse": 122,
        "arabic_text": "وَءَاتَيۡنَٰهُ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَإِنَّهُۥ فِي ٱلۡأٓخِرَةِ لَمِنَ ٱلصَّٰلِحِينَ",
        "phonetic": "16.122 Wa 'Ātaynāhu Fī Ad-Dunyā Ĥasanatan Wa 'Innahu Fī Al-'Ākhirati Lamina Aş-Şāliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We gave him good in this world, and indeed, in the Hereafter he will be among the righteous.",
            "english_hilali_khan": "And We gave him good in this world, and in the Hereafter he shall be of the righteous.",
            "english_rwwad": "We gave him good in this world, and in the Hereafter, he will surely be among the righteous."
        }
    },
    {
        "id": 2023,
        "chapter": 16,
        "verse": 123,
        "arabic_text": "ثُمَّ أَوۡحَيۡنَآ إِلَيۡكَ أَنِ ٱتَّبِعۡ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "16.123 Thumma 'Awĥaynā 'Ilayka 'Ani Attabi` Millata 'Ibrāhīma Ĥanīfāan Wa Mā Kāna Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:123) See the footnote of (V.2:135).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We revealed to you, [O Muḥammad], to follow the religion of Abraham, inclining toward truth; and he was not of those who associate with Allāh.",
            "english_hilali_khan": "Then, We have sent the revelation to you (O Muhammad صلى الله عليه و سلم saying): \"Follow the religion of Ibrâhîm (Abraham) Hanif (Islâmic Monotheism[2] - to worship none but Allâh) and he was not of the Mushrikûn (polytheists, idolaters and disbelievers).",
            "english_rwwad": "Then We revealed to you [O Prophet] to follow the religion of Abraham, inclining to true faith, and he was not one of those who associate partners with Allah."
        }
    },
    {
        "id": 2024,
        "chapter": 16,
        "verse": 124,
        "arabic_text": "إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ وَإِنَّ رَبَّكَ لَيَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ",
        "phonetic": "16.124 'Innamā Ju`ila As-Sabtu `Alá Al-Ladhīna Akhtalafū Fīhi Wa 'Inna Rabbaka Layaĥkumu Baynahum Yawma Al-Qiyāmati Fīmā Kānū Fīhi Yakhtalifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The sabbath was only appointed for those who differed over it. And indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
            "english_hilali_khan": "The Sabbath was only prescribed for those who differed concerning it, and verily, your Lord will judge between them on the Day of Resurrection about that wherein they used to differ.",
            "english_rwwad": "The Sabbath was only ordained for those who differed about it. Your Lord will surely judge between them on the Day of Resurrection concerning that over which they used to differ."
        }
    },
    {
        "id": 2025,
        "chapter": 16,
        "verse": 125,
        "arabic_text": "ٱدۡعُ إِلَىٰ سَبِيلِ رَبِّكَ بِٱلۡحِكۡمَةِ وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ وَجَٰدِلۡهُم بِٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِمَن ضَلَّ عَن سَبِيلِهِۦ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ",
        "phonetic": "16.125 Ad`u 'Ilá Sabīli Rabbika Bil-Ĥikmati Wa Al-Maw`ižati Al-Ĥasanati Wa Jādilhum Bi-Atī Hiya 'Aĥsanu 'Inna Rabbaka Huwa 'A`lamu Biman Đalla `An Sabīlihi Wa Huwa 'A`lamu Bil-Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best. Indeed, your Lord is most knowing of who has strayed from His way, and He is most knowing of who is [rightly] guided.",
            "english_hilali_khan": "Invite (mankind, O Muhammad صلى الله عليه و سلم) to the Way of your Lord (i.e. Islâm) with wisdom (i.e. with the Divine Revelation and the Qur’ân) and fair preaching, and argue with them in a way that is better. Truly, your Lord knows best who has gone astray from His Path, and He is the Best Aware of those who are guided.",
            "english_rwwad": "Call to the way of your Lord with wisdom and goodly exhortation, and reason with them in the best manner. Your Lord knows best who has strayed from His way and knows best those who are rightly guided."
        }
    },
    {
        "id": 2026,
        "chapter": 16,
        "verse": 126,
        "arabic_text": "وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُواْ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَئِن صَبَرۡتُمۡ لَهُوَ خَيۡرٞ لِّلصَّٰبِرِينَ",
        "phonetic": "16.126 Wa 'In `Āqabtum Fa`āqibū Bimithli Mā `Ūqibtum Bihi Wa La'in Şabartum Lahuwa Khayrun Lilşşābirīna",
        "footnotes": {
            "english_saheeh": "[720]- Not exceeding it.",
            "english_hilali_khan": "(V.16:126)\na) The Statement of Allâh: \"Only those who are patient shall receive their rewards in full, without reckoning\" (V.39:10)\nNarrated Abu Mûsâ رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"None is more patient than Allâh against the harmful saying He hears from the people, they ascribe a son (or offspring) to Him, yet He gives them health and (supplies them with) provision.\" (Sahih Al-Bukhari, Vol.8, Hadith No.121)\nb) Narrated ‘Abdullâh رضي الله عنه: The Prophet صلى الله عليه وسلم divided and distributed something as he used to do with some of his distributions. A man from the Ansâr said, \"By Allâh! in this division the pleasure of Allâh has not been intended.\" I said, \"I will definitely tell this to the Prophet صلى الله عليه وسلم. \" So I went to him while he was sitting with his companions and told him of it secretly. That was hard upon the Prophet صلى الله عليه وسلم and the colour of his face changed, and he became so angry that I wished I had not told him. The Prophet صلى الله عليه وسلم then said, \"Mûsâ (Moses) was harmed with more than this, yet he remained patient.\" (Sahih Al Bukhari, Vol.8, Hadith No.122)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you punish [an enemy, O believers], punish with an equivalent of that with which you were harmed.[720] But if you are patient - it is better for those who are patient.",
            "english_hilali_khan": "And if you punish (your enemy, O you believers in the Oneness of Allâh), then punish them with the like of that with which you were afflicted. But if you endure patiently, verily, it is better for As-Sâbirûn (the patient).[3]",
            "english_rwwad": "If you retaliate, let your retaliation be the like of what you suffered. But if you bear with patience, it is surely best for those who are steadfast."
        }
    },
    {
        "id": 2027,
        "chapter": 16,
        "verse": 127,
        "arabic_text": "وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُ فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ",
        "phonetic": "16.127 Wa Aşbir Wa Mā Şabruka 'Illā Billāhi Wa Lā Taĥzan `Alayhim Wa Lā Taku Fī Đayqin Mimmā Yamkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And be patient, [O Muḥammad], and your patience is not but through Allāh. And do not grieve over them and do not be in distress over what they conspire.",
            "english_hilali_khan": "And endure you patiently (O Muhammad صلى الله عليه و سلم), your patience is not but from Allâh. And grieve not over them (polytheists and pagans), and be not distressed because of what they plot.",
            "english_rwwad": "And be patient, for your patience comes only from Allah; do not grieve over them, nor be distressed by their evil plots."
        }
    },
    {
        "id": 2028,
        "chapter": 16,
        "verse": 128,
        "arabic_text": "إِنَّ ٱللَّهَ مَعَ ٱلَّذِينَ ٱتَّقَواْ وَّٱلَّذِينَ هُم مُّحۡسِنُونَ",
        "phonetic": "16.128 'Inna Allāha Ma`a Al-Ladhīna Attaqaw Wa Al-Ladhīna Hum Muĥsinūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.16:128) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"The deeds of anyone of you will not save you [from the (Hell) Fire].\" They said, \"Even you (will not be saved by your deeds), O Allâh’s Messenger?\" He said, \"No, even I (will not be saved) unless and until Allâh bestows His Mercy on me and protects me with His Grace. Therefore, do good deeds properly, sincerely and moderately, and worship Allâh in the forenoon and in the afternoon and during a part of the night, and always adopt a middle, moderate, regular course whereby you will reach your target (Paradise).\" (Sahih Al-Bukhari, Vol. 8, Hadith No.470)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Allāh is with those who fear Him and those who are doers of good.",
            "english_hilali_khan": "Truly, Allâh is with those who fear Him (keep their duty unto Him),[4] and those who are Muhsinûn (good-doers. See the footenote of V.9:120).",
            "english_rwwad": "Indeed, Allah is with those who fear Him and those who do good."
        }
    }
]