[
    {
        "id": 3159,
        "chapter": 27,
        "verse": 1,
        "arabic_text": "طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ",
        "phonetic": "27.1 Ţā-Sīn Tilka 'Āyātu Al-Qur'āni Wa Kitābin Mubīnin",
        "footnotes": {
            "english_saheeh": "[1071]- See footnote to 2:1.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Ṭā, Seen.[1071] These are the verses of the Qur’ān [i.e., recitation] and a clear Book",
            "english_hilali_khan": "Tâ-Sîn. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings].",
            "english_rwwad": "Tā Sīn. These are the verses of the Qur’an and a clear book;"
        }
    },
    {
        "id": 3160,
        "chapter": 27,
        "verse": 2,
        "arabic_text": "هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ",
        "phonetic": "27.2 Hudáan Wa Bushrá Lilmu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "As guidance and good tidings for the believers",
            "english_hilali_khan": "A guide (to the Right Path) and glad tidings for the believers [who believe in the Oneness of Allâh (i.e. Islâmic Monotheism)].",
            "english_rwwad": "a guidance and glad tidings for the believers,"
        }
    },
    {
        "id": 3161,
        "chapter": 27,
        "verse": 3,
        "arabic_text": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ",
        "phonetic": "27.3 Al-Ladhīna Yuqīmūna Aş-Şalāata Wa Yu'utūna Az-Zakāata Wa Hum Bil-'Ākhirati Hum Yūqinūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who establish prayer and give zakāh, and of the Hereafter they are certain [in faith].",
            "english_hilali_khan": "Those who perform As-Salât (Iqâmat-as-Salât) and give Zakât and they believe with certainty in the Hereafter (resurrection, recompense of their good and bad deeds, Paradise and Hell).",
            "english_rwwad": "those who establish prayer and give zakah, and who firmly believe in the Hereafter."
        }
    },
    {
        "id": 3162,
        "chapter": 27,
        "verse": 4,
        "arabic_text": "إِنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ زَيَّنَّا لَهُمۡ أَعۡمَٰلَهُمۡ فَهُمۡ يَعۡمَهُونَ",
        "phonetic": "27.4 'Inna Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati Zayyannā Lahum 'A`mālahum Fahum Ya`mahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, for those who do not believe in the Hereafter, We have made pleasing to them their deeds, so they wander blindly.",
            "english_hilali_khan": "Verily, those who believe not in the Hereafter, We have made their deeds fair-seeming to them, so that they wander about blindly.",
            "english_rwwad": "As for those who do not believe in the Hereafter, We have made their deeds appealing to them, so they wander blindly."
        }
    },
    {
        "id": 3163,
        "chapter": 27,
        "verse": 5,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ لَهُمۡ سُوٓءُ ٱلۡعَذَابِ وَهُمۡ فِي ٱلۡأٓخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ",
        "phonetic": "27.5 'Ūlā'ika Al-Ladhīna Lahum Sū'u Al-`Adhābi Wa Hum Fī Al-'Ākhirati Humu Al-'Akhsarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those are the ones for whom there will be the worst of punishment, and in the Hereafter they are the greatest losers.",
            "english_hilali_khan": "They are those for whom there will be an evil torment (in this world). And in the Hereafter they will be the greatest losers.",
            "english_rwwad": "Such are those who will have a terrible punishment, and it is they who will be the greatest losers in the Hereafter."
        }
    },
    {
        "id": 3164,
        "chapter": 27,
        "verse": 6,
        "arabic_text": "وَإِنَّكَ لَتُلَقَّى ٱلۡقُرۡءَانَ مِن لَّدُنۡ حَكِيمٍ عَلِيمٍ",
        "phonetic": "27.6 Wa 'Innaka Latulaqqá Al-Qur'āna Min Ladun Ĥakīmin `Alīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, [O Muḥammad], you receive the Qur’ān from one Wise and Knowing.",
            "english_hilali_khan": "And verily, you (O Muhammad صلى الله عليه وسلم) are being taught the Qur’ân from One, All-Wise, All-Knowing.",
            "english_rwwad": "Indeed, you are receiving the Qur’an from the All-Wise, All-Knowing."
        }
    },
    {
        "id": 3165,
        "chapter": 27,
        "verse": 7,
        "arabic_text": "إِذۡ قَالَ مُوسَىٰ لِأَهۡلِهِۦٓ إِنِّيٓ ءَانَسۡتُ نَارٗا سَـَٔاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ ءَاتِيكُم بِشِهَابٖ قَبَسٖ لَّعَلَّكُمۡ تَصۡطَلُونَ",
        "phonetic": "27.7 'Idh Qāla Mūsá Li'hlihi 'Innī 'Ānastu Nārāan Sa'ātīkum Minhā Bikhabarin 'Aw 'Ātīkum Bishihābin Qabasin La`allakum Taşţalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Mention] when Moses said to his family, \"Indeed, I have perceived a fire. I will bring you from there information or will bring you a burning torch that you may warm yourselves.\"",
            "english_hilali_khan": "(Remember) when Mûsâ (Moses) said to his household: \"Verily I have seen a fire; I will bring you from there some information, or I will bring you a burning brand, that you may warm yourselves.\"",
            "english_rwwad": "[Remember] when Moses said to his family, “I have spotted a fire. I will bring you some news from there, or bring you a burning brand so that you may warm yourselves.”"
        }
    },
    {
        "id": 3166,
        "chapter": 27,
        "verse": 8,
        "arabic_text": "فَلَمَّا جَآءَهَا نُودِيَ أَنۢ بُورِكَ مَن فِي ٱلنَّارِ وَمَنۡ حَوۡلَهَا وَسُبۡحَٰنَ ٱللَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "27.8 Falammā Jā'ahā Nūdiya 'An Būrika Man Fī An-Nāri Wa Man Ĥawlahā Wa Subĥāna Allāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when he came to it, he was called, \"Blessed is whoever is at the fire and whoever is around it. And exalted is Allāh, Lord of the worlds.",
            "english_hilali_khan": "But when he came to it, he was called: \"Blessed is whosoever is in the fire, and whosoever is round about it! And glorified be Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "When he came to it, he was called, “Blessed is He Who is at the fire and those who are around it. Glory be to Allah, the Lord of the worlds."
        }
    },
    {
        "id": 3167,
        "chapter": 27,
        "verse": 9,
        "arabic_text": "يَٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
        "phonetic": "27.9 Yā Mūsá 'Innahu 'Anā Allāhu Al-`Azīzu Al-Ĥakīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Moses, indeed it is I - Allāh, the Exalted in Might, the Wise.\"",
            "english_hilali_khan": "\"O Mûsâ (Moses)! Verily it is I, Allâh, the All-Mighty, the All-Wise.",
            "english_rwwad": "O Moses, verily this is Me – Allah, the All-Mighty, the All-Wise."
        }
    },
    {
        "id": 3168,
        "chapter": 27,
        "verse": 10,
        "arabic_text": "وَأَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰ لَا تَخَفۡ إِنِّي لَا يَخَافُ لَدَيَّ ٱلۡمُرۡسَلُونَ",
        "phonetic": "27.10 Wa 'Alqi `Aşāka Falammā Ra'āhā Tahtazzu Ka'annahā Jānnun Wallá Mudbirāan Wa Lam Yu`aqqib Yā Mūsá Lā Takhaf 'Innī Lā Yakhāfu Ladayya Al-Mursalūna",
        "footnotes": {
            "english_saheeh": "[1072]- Or \"did not look back.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [he was told], \"Throw down your staff.\" But when he saw it writhing as if it were a snake, he turned in flight and did not return.[1072] [Allāh said], \"O Moses, fear not. Indeed, in My presence the messengers do not fear.",
            "english_hilali_khan": "\"And throw down your stick!\" But when he saw it moving as if it were a snake, he turned in flight, and did not look back. (It was said:) \"O Mûsâ (Moses)! Fear not: verily the Messengers fear not in front of Me.",
            "english_rwwad": "Throw down your staff!” But when he saw it slithering as if it were a snake, he turned and ran away without looking back. “O Moses, do not be afraid! Indeed, the messengers should have no fear in My presence,"
        }
    },
    {
        "id": 3169,
        "chapter": 27,
        "verse": 11,
        "arabic_text": "إِلَّا مَن ظَلَمَ ثُمَّ بَدَّلَ حُسۡنَۢا بَعۡدَ سُوٓءٖ فَإِنِّي غَفُورٞ رَّحِيمٞ",
        "phonetic": "27.11 'Illā Man Žalama Thumma Baddala Ĥusnāan Ba`da Sū'in Fa'innī Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Otherwise, he who wrongs, then substitutes good after evil - indeed, I am Forgiving and Merciful.",
            "english_hilali_khan": "\"Except him who has done wrong and afterwards has changed evil for good; then surely, I am Oft-Forgiving, Most Merciful.",
            "english_rwwad": "except he who does wrong, then substitutes good for evil, then I am indeed All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 3170,
        "chapter": 27,
        "verse": 12,
        "arabic_text": "وَأَدۡخِلۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖۖ فِي تِسۡعِ ءَايَٰتٍ إِلَىٰ فِرۡعَوۡنَ وَقَوۡمِهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ",
        "phonetic": "27.12 Wa 'Adkhil Yadaka Fī Jaybika Takhruj Bayđā'a Min Ghayri Sū'in Fī Tis`i 'Āyātin 'Ilá Fir`awna Wa Qawmihi 'Innahum Kānū Qawmāan Fāsiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And put your hand into the opening of your garment [at the breast]; it will come out white without disease. [These are] among the nine signs [you will take] to Pharaoh and his people. Indeed, they have been a people defiantly disobedient.\"",
            "english_hilali_khan": "\"And put your hand into your bosom, it will come forth white without hurt. (These are) among the nine signs (you will take) to Fir‘aun (Pharaoh) and his people. Verily they are a people who are Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "Put your hand into your garment, it will come out shining white without blemish, as one of nine signs to Pharaoh and his people, for they are indeed a rebellious people.”"
        }
    },
    {
        "id": 3171,
        "chapter": 27,
        "verse": 13,
        "arabic_text": "فَلَمَّا جَآءَتۡهُمۡ ءَايَٰتُنَا مُبۡصِرَةٗ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ",
        "phonetic": "27.13 Falammā Jā'at/hum 'Āyātunā Mubşiratan Qālū Hādhā Siĥrun Mubīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when there came to them Our visible signs, they said, \"This is obvious magic.\"",
            "english_hilali_khan": "But when Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) came to them, clear to see, they said: \"This is a manifest magic.\"",
            "english_rwwad": "But when Our visible signs came to them, they said, “This is clear magic.”"
        }
    },
    {
        "id": 3172,
        "chapter": 27,
        "verse": 14,
        "arabic_text": "وَجَحَدُواْ بِهَا وَٱسۡتَيۡقَنَتۡهَآ أَنفُسُهُمۡ ظُلۡمٗا وَعُلُوّٗاۚ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ",
        "phonetic": "27.14 Wa Jaĥadū Bihā Wa Astayqanat/hā 'Anfusuhum Žulmāan Wa `Ulūwāan Fānžur Kayfa Kāna `Āqibatu Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they rejected them, while their [inner] selves were convinced thereof, out of injustice and haughtiness. So see how was the end of the corrupters.",
            "english_hilali_khan": "And they belied them (those Ayât) wrongfully and arrogantly, though their ownselves were convinced thereof [i.e. those (Ayât ) are from Allâh, and Mûsâ (Moses) is the Messenger of Allâh in truth, but they disliked to obey Mûsâ (Moses), and hated to believe in his Message of Monotheism]. So see what was the end of the Mufsidûn (disbelievers, disobedient to Allâh, evil-doers and liars.).",
            "english_rwwad": "They denied them wrongfully and arrogantly, although their hearts were convinced that they were true. See then how was the end of those who spread corruption!"
        }
    },
    {
        "id": 3173,
        "chapter": 27,
        "verse": 15,
        "arabic_text": "وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ وَسُلَيۡمَٰنَ عِلۡمٗاۖ وَقَالَا ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٖ مِّنۡ عِبَادِهِ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "27.15 Wa Laqad 'Ātaynā Dāwūda Wa Sulaymāna `Ilmāan Wa Qālā Al-Ĥamdu Lillāhi Al-Ladhī Fađđalanā `Alá Kathīrin Min `Ibādihi Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly given to David and Solomon knowledge, and they said, \"Praise [is due] to Allāh, who has favored us over many of His believing servants.\"",
            "english_hilali_khan": "And indeed We gave knowledge to Dâwûd (David) and Sulaimân (Solomon), and they both said: \"All the praises and thanks be to Allâh, Who has preferred us above many of His believing slaves!\"",
            "english_rwwad": "We gave David and Solomon knowledge, and they said, “All praise be to Allah, Who has favored us over many of His believing slaves.”"
        }
    },
    {
        "id": 3174,
        "chapter": 27,
        "verse": 16,
        "arabic_text": "وَوَرِثَ سُلَيۡمَٰنُ دَاوُۥدَۖ وَقَالَ يَٰٓأَيُّهَا ٱلنَّاسُ عُلِّمۡنَا مَنطِقَ ٱلطَّيۡرِ وَأُوتِينَا مِن كُلِّ شَيۡءٍۖ إِنَّ هَٰذَا لَهُوَ ٱلۡفَضۡلُ ٱلۡمُبِينُ",
        "phonetic": "27.16 Wa Waritha Sulaymānu Dāwūda Wa Qāla Yā 'Ayyuhā An-Nāsu `Ullimnā Manţiqa Aţ-Ţayri Wa 'Ūtīnā Min Kulli Shay'in 'Inna Hādhā Lahuwa Al-Fađlu Al-Mubīnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Solomon inherited David. He said, \"O people, we have been taught the language of birds, and we have been given from all things. Indeed, this is evident bounty.\"",
            "english_hilali_khan": "And Sulaimân (Solomon) inherited (the knowledge of) Dâwûd (David). He said: \"O mankind! We have been taught the language of birds, and on us have been bestowed all things. This, verily, is an evident grace (from Allâh).\"",
            "english_rwwad": "Solomon succeeded David, and said, “O people, we have been taught the speech of birds, and we have been given from all things. This is indeed a clear favor.”"
        }
    },
    {
        "id": 3175,
        "chapter": 27,
        "verse": 17,
        "arabic_text": "وَحُشِرَ لِسُلَيۡمَٰنَ جُنُودُهُۥ مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ وَٱلطَّيۡرِ فَهُمۡ يُوزَعُونَ",
        "phonetic": "27.17 Wa Ĥushira Lisulaymāna Junūduhu Mina Al-Jinni Wa Al-'Insi Wa Aţ-Ţayri Fahum Yūza`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And gathered for Solomon were his soldiers of the jinn and men and birds, and they were [marching] in rows",
            "english_hilali_khan": "And there were gathered before Sulaimân (Solomon) his hosts of jinn and men, and birds, and they all were set in battle order (marching forward).",
            "english_rwwad": "Solomon’s armies of jinn, men and birds were assembled before him, marching in organized ranks,"
        }
    },
    {
        "id": 3176,
        "chapter": 27,
        "verse": 18,
        "arabic_text": "حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ٱلنَّمۡلِ قَالَتۡ نَمۡلَةٞ يَٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ",
        "phonetic": "27.18 Ĥattá 'Idhā 'Ataw `Alá Wādī An-Namli Qālat Namlatun Yā 'Ayyuhā An-Namlu Adkhulū Masākinakum Lā Yaĥţimannakum Sulaymānu Wa Junūduhu Wa Hum Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Until, when they came upon the valley of the ants, an ant said, \"O ants, enter your dwellings that you not be crushed by Solomon and his soldiers while they perceive not.\"",
            "english_hilali_khan": "Till, when they came to the valley of the ants, one of the ants said: \"O ants! Enter your dwellings, lest Sulaimân (Solomon) and his hosts should crush you, while they perceive not.\"",
            "english_rwwad": "until when they reached a valley of the ants, an ant said, “O ants, get into your dwellings, so Solomon and his armies do not crush you unknowingly.”"
        }
    },
    {
        "id": 3177,
        "chapter": 27,
        "verse": 19,
        "arabic_text": "فَتَبَسَّمَ ضَاحِكٗا مِّن قَوۡلِهَا وَقَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَدۡخِلۡنِي بِرَحۡمَتِكَ فِي عِبَادِكَ ٱلصَّٰلِحِينَ",
        "phonetic": "27.19 Fatabassama Đāĥikāan Min Qawlihā Wa Qāla Rabbi 'Awzi`nī 'An 'Ashkura Ni`mataka Allatī 'An`amta `Alayya Wa `Alá Wa A-Dayya Wa 'An 'A`mala Şāliĥāan Tarđāhu Wa 'Adkhilnī Biraĥmatika Fī `Ibādika Aş-Şāliĥīna",
        "footnotes": {
            "english_saheeh": "[1073]- More literally, \"gather within me the utmost strength and ability.\"\n[1074]- Or \"with Your righteous servants [into Paradise].\"",
            "english_hilali_khan": "(V.27:19) See the footnote of (V.6:143).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So [Solomon] smiled, amused at her speech, and said, \"My Lord, enable me[1073] to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.\"[1074]",
            "english_hilali_khan": "So he [Sulaimân (Solomon)] smiled, amused at her speech[1] and said: \"My Lord! Grant me the power and ability that I may be grateful for Your Favours which You have bestowed on me and on my parents, and that I may do righteous good deeds that will please You, and admit me by Your Mercy among Your righteous slaves.\"",
            "english_rwwad": "So he smiled in amusement at her words and said, “My Lord, inspire me to be grateful for Your favor which You have bestowed upon me and my parents, and to do righteous deeds that please you. And admit me, by Your mercy, among Your righteous slaves.”"
        }
    },
    {
        "id": 3178,
        "chapter": 27,
        "verse": 20,
        "arabic_text": "وَتَفَقَّدَ ٱلطَّيۡرَ فَقَالَ مَالِيَ لَآ أَرَى ٱلۡهُدۡهُدَ أَمۡ كَانَ مِنَ ٱلۡغَآئِبِينَ",
        "phonetic": "27.20 Wa Tafaqqada Aţ-Ţayra Faqāla Mā Lī Lā 'Ará Al-Hud/huda 'Am Kāna Mina Al-Ghā'ibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he took attendance of the birds and said, \"Why do I not see the hoopoe - or is he among the absent?",
            "english_hilali_khan": "He inspected the birds, and said: \"What is the matter that I see not the hoopoe? Or is he among the absentees?",
            "english_rwwad": "Once he checked the birds, and said, “Why is it that I do not see the hoopoe – or is he among the absent?"
        }
    },
    {
        "id": 3179,
        "chapter": 27,
        "verse": 21,
        "arabic_text": "لَأُعَذِّبَنَّهُۥ عَذَابٗا شَدِيدًا أَوۡ لَأَاْذۡبَحَنَّهُۥٓ أَوۡ لَيَأۡتِيَنِّي بِسُلۡطَٰنٖ مُّبِينٖ",
        "phonetic": "27.21 La'u`adhibannahu `Adhābāan Shadīdāan 'Aw La'adhbaĥannahu 'Aw Laya'tiyanī Bisulţānin Mubīnin",
        "footnotes": {
            "english_saheeh": "[1075]- i.e., a valid excuse.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I will surely punish him with a severe punishment or slaughter him unless he brings me clear authorization.\"[1075]",
            "english_hilali_khan": "\"I will surely punish him with a severe torment, or slaughter him, unless he brings me a clear reason.\"",
            "english_rwwad": "I will surely punish him severely, or slaughter him, unless he brings me a valid reason.”"
        }
    },
    {
        "id": 3180,
        "chapter": 27,
        "verse": 22,
        "arabic_text": "فَمَكَثَ غَيۡرَ بَعِيدٖ فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ",
        "phonetic": "27.22 Famakatha Ghayra Ba`īdin Faqāla 'Aĥaţtu Bimā Lam Tuĥiţ Bihi Wa Ji'tuka Min Saba'iin Binaba'iin Yaqīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But he [i.e., the hoopoe] stayed not long and said, \"I have encompassed [in knowledge] that which you have not encompassed, and I have come to you from Sheba with certain news.",
            "english_hilali_khan": "But the hoopoe stayed not long: he (came up and) said: \"I have grasped (the knowledge of a thing) which you have not grasped and I have come to you from Saba’ (Sheba) with true news.",
            "english_rwwad": "It was not long before the hoopoe came and said, “I have learned something that you do not; I come to you from Sheba with sure news."
        }
    },
    {
        "id": 3181,
        "chapter": 27,
        "verse": 23,
        "arabic_text": "إِنِّي وَجَدتُّ ٱمۡرَأَةٗ تَمۡلِكُهُمۡ وَأُوتِيَتۡ مِن كُلِّ شَيۡءٖ وَلَهَا عَرۡشٌ عَظِيمٞ",
        "phonetic": "27.23 'Innī Wa Jadttu Amra'atan Tamlikuhum Wa 'Ūtiyat Min Kulli Shay'in Wa Lahā `Arshun `Ažīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, I found [there] a woman ruling them, and she has been given of all things, and she has a great throne.",
            "english_hilali_khan": "\"I found a woman ruling over them: she has been given all things that could be possessed by any ruler of the earth, and she has a great throne.",
            "english_rwwad": "I found a woman ruling over them, who has been given of all things, and she has a great throne."
        }
    },
    {
        "id": 3182,
        "chapter": 27,
        "verse": 24,
        "arabic_text": "وَجَدتُّهَا وَقَوۡمَهَا يَسۡجُدُونَ لِلشَّمۡسِ مِن دُونِ ٱللَّهِ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ فَصَدَّهُمۡ عَنِ ٱلسَّبِيلِ فَهُمۡ لَا يَهۡتَدُونَ",
        "phonetic": "27.24 Wa Jadtuhā Wa Qawmahā Yasjudūna Lilshamsi Min Dūni Allāhi Wa Zayyana Lahumu Ash-Shayţānu 'A`mālahum Faşaddahum `Ani As-Sabīli Fahum Lā Yahtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I found her and her people prostrating to the sun instead of Allāh, and Satan has made their deeds pleasing to them and averted them from [His] way, so they are not guided,",
            "english_hilali_khan": "\"I found her and her people worshipping the sun instead of Allâh, and Shaitân (Satan) has made their deeds fair-seeming to them, and has barred them from (Allâh’s) Way: so they have no guidance.\"",
            "english_rwwad": "I found her and her people prostrating before the sun instead of Allah. Satan has made their deeds appealing to them and turned them away from the right way, so they are not guided."
        }
    },
    {
        "id": 3183,
        "chapter": 27,
        "verse": 25,
        "arabic_text": "أَلَّاۤ يَسۡجُدُواْۤ لِلَّهِ ٱلَّذِي يُخۡرِجُ ٱلۡخَبۡءَ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَيَعۡلَمُ مَا تُخۡفُونَ وَمَا تُعۡلِنُونَ",
        "phonetic": "27.25 'Allā Yasjudū Lillāhi Al-Ladhī Yukhriju Al-Khab'a Fī As-Samāwāti Wa Al-'Arđi Wa Ya`lamu Mā Tukhfūna Wa Mā Tu`linūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[And] so they do not prostrate to Allāh, who brings forth what is hidden within the heavens and the earth and knows what you conceal and what you declare -",
            "english_hilali_khan": "[As Shaitân (Satan) has barred them from Allâh’s Way] so they do not worship (prostrate themselves before) Allâh, Who brings to light what is hidden in the heavens and the earth, and knows what you conceal and what you reveal. [Tafsir At-Tabarî]",
            "english_rwwad": "so that they do not prostrate before Allah Who brings forth what is hidden in the heavens and earth, and Who knows all that you conceal and all that you reveal."
        }
    },
    {
        "id": 3184,
        "chapter": 27,
        "verse": 26,
        "arabic_text": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ۩",
        "phonetic": "27.26 Allāhu Lā 'Ilāha 'Illā Huwa Rabbu Al-`Arshi Al-`Ažīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh - there is no deity except Him, Lord of the Great Throne.\"",
            "english_hilali_khan": "Allâh, Lâ ilâha illa Huwa (none has the right to be worshipped but He), the Lord of the Supreme Throne!",
            "english_rwwad": "Allah; none has the right to be worshiped except Him, the Lord of the Mighty Throne.”"
        }
    },
    {
        "id": 3185,
        "chapter": 27,
        "verse": 27,
        "arabic_text": "۞ قَالَ سَنَنظُرُ أَصَدَقۡتَ أَمۡ كُنتَ مِنَ ٱلۡكَٰذِبِينَ",
        "phonetic": "27.27 Qāla Sananžuru 'Aşadaqta 'Am Kunta Mina Al-Kādhibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Solomon] said, \"We will see whether you were truthful or were of the liars.",
            "english_hilali_khan": "[Sulaimân (Solomon)] said: \"We shall see whether you speak the truth or you are (one) of the liars.",
            "english_rwwad": "Solomon said, “We will see whether you have told the truth or you are one of the liars."
        }
    },
    {
        "id": 3186,
        "chapter": 27,
        "verse": 28,
        "arabic_text": "ٱذۡهَب بِّكِتَٰبِي هَٰذَا فَأَلۡقِهۡ إِلَيۡهِمۡ ثُمَّ تَوَلَّ عَنۡهُمۡ فَٱنظُرۡ مَاذَا يَرۡجِعُونَ",
        "phonetic": "27.28 Adh/hab Bikitābī Hādhā Fa'alqih 'Ilayhim Thumma Tawalla `Anhum Fānžur Mādhā Yarji`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Take this letter of mine and deliver it to them. Then leave them and see what [answer] they will return.\"",
            "english_hilali_khan": "\"Go you with this letter of mine, and deliver it to them, then draw back from them, and see what (answer) they return.\"",
            "english_rwwad": "Take this letter of mine and deliver it to them, then withdraw and see how they respond.”"
        }
    },
    {
        "id": 3187,
        "chapter": 27,
        "verse": 29,
        "arabic_text": "قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ إِنِّيٓ أُلۡقِيَ إِلَيَّ كِتَٰبٞ كَرِيمٌ",
        "phonetic": "27.29 Qālat Yā 'Ayyuhā Al-Mala'u 'Innī 'Ulqiya 'Ilayya Kitābun Karīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "She said, \"O eminent ones, indeed, to me has been delivered a noble letter.",
            "english_hilali_khan": "She said: \"O chiefs! Verily! Here is delivered to me a noble letter,",
            "english_rwwad": "The Queen said, “O chiefs, a noble letter has been delivered to me."
        }
    },
    {
        "id": 3188,
        "chapter": 27,
        "verse": 30,
        "arabic_text": "إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ",
        "phonetic": "27.30 'Innahu Min Sulaymāna Wa 'Innahu Bismi Allāhi Ar-Raĥmāni Ar-Raĥīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, it is from Solomon, and indeed, it is [i.e., reads]: 'In the name of Allāh, the Entirely Merciful, the Especially Merciful,",
            "english_hilali_khan": "\"Verily it is from Sulaimân (Solomon), and verily, it (reads): In the Name of Allâh, the Most Gracious, the Most Merciful:",
            "english_rwwad": "It is from Solomon, and it reads, ‘In the name of Allah, the Most Compassionate, the Most Merciful."
        }
    },
    {
        "id": 3189,
        "chapter": 27,
        "verse": 31,
        "arabic_text": "أَلَّا تَعۡلُواْ عَلَيَّ وَأۡتُونِي مُسۡلِمِينَ",
        "phonetic": "27.31 'Allā Ta`lū `Alayya Wa 'Tūnī Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Be not haughty with me but come to me in submission [as Muslims].'\"",
            "english_hilali_khan": "\"Be you not exalted against me, but come to me as Muslims (true believers who submit to Allâh with full submission).’ \"",
            "english_rwwad": "Do not be arrogant towards me, but come to me in full submission.”"
        }
    },
    {
        "id": 3190,
        "chapter": 27,
        "verse": 32,
        "arabic_text": "قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَفۡتُونِي فِيٓ أَمۡرِي مَا كُنتُ قَاطِعَةً أَمۡرًا حَتَّىٰ تَشۡهَدُونِ",
        "phonetic": "27.32 Qālat Yā 'Ayyuhā Al-Mala'u 'Aftūnī Fī 'Amrī Mā Kuntu Qāţi`atan 'Amrāan Ĥattá Tash/hadūni",
        "footnotes": {
            "english_saheeh": "[1076]- i.e., are present with me or testify in my favor.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "She said, \"O eminent ones, advise me in my affair. I would not decide a matter until you witness [for] me.\"[1076]",
            "english_hilali_khan": "She said: \"O chiefs! Advise me in (this) case of mine. I decide no case till you are present with me (and give me your opinions).\"",
            "english_rwwad": "She said, “O chiefs, advice me in this matter of mine, for I would make no decision without your consent.”"
        }
    },
    {
        "id": 3191,
        "chapter": 27,
        "verse": 33,
        "arabic_text": "قَالُواْ نَحۡنُ أُوْلُواْ قُوَّةٖ وَأُوْلُواْ بَأۡسٖ شَدِيدٖ وَٱلۡأَمۡرُ إِلَيۡكِ فَٱنظُرِي مَاذَا تَأۡمُرِينَ",
        "phonetic": "27.33 Qālū Naĥnu 'Ūlū Qūwatin Wa 'Ūlū Ba'sin Shadīdin Wa Al-'Amru 'Ilayki Fānžurī Mādhā Ta'murīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"We are men of strength and of great military might, but the command is yours, so see what you will command.\"",
            "english_hilali_khan": "They said: \"We have great strength, and great ability for war, but it is for you to command: so think over what you will command.\"",
            "english_rwwad": "They said, “We are powerful and great fighters, but the decision is yours, so consider what you will command.”"
        }
    },
    {
        "id": 3192,
        "chapter": 27,
        "verse": 34,
        "arabic_text": "قَالَتۡ إِنَّ ٱلۡمُلُوكَ إِذَا دَخَلُواْ قَرۡيَةً أَفۡسَدُوهَا وَجَعَلُوٓاْ أَعِزَّةَ أَهۡلِهَآ أَذِلَّةٗۚ وَكَذَٰلِكَ يَفۡعَلُونَ",
        "phonetic": "27.34 Qālat 'Inna Al-Mulūka 'Idhā Dakhalū Qaryatan 'Afsadūhā Wa Ja`alū 'A`izzata 'Ahlihā 'Adhillatan Wa Kadhalika Yaf`alūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "She said, \"Indeed kings - when they enter a city, they ruin it and render the honored of its people humbled. And thus do they do.",
            "english_hilali_khan": "She said: \"Verily kings, when they enter a town (country), they despoil it and make the most honourable amongst its people the lowest. And thus they do.",
            "english_rwwad": "She said, “When kings enter a town, they ravage it and humiliate its notables; this is what they really do."
        }
    },
    {
        "id": 3193,
        "chapter": 27,
        "verse": 35,
        "arabic_text": "وَإِنِّي مُرۡسِلَةٌ إِلَيۡهِم بِهَدِيَّةٖ فَنَاظِرَةُۢ بِمَ يَرۡجِعُ ٱلۡمُرۡسَلُونَ",
        "phonetic": "27.35 Wa 'Innī Mursilatun 'Ilayhim Bihadīyatin Fanāžiratun Bima Yarji`u Al-Mursalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But indeed, I will send to them a gift and see with what [reply] the messengers will return.\"",
            "english_hilali_khan": "\"But verily! I am going to send him a present, and see with what (answer) the messengers return.\"",
            "english_rwwad": "But I will send them a gift, then see with what response the envoys will return.”"
        }
    },
    {
        "id": 3194,
        "chapter": 27,
        "verse": 36,
        "arabic_text": "فَلَمَّا جَآءَ سُلَيۡمَٰنَ قَالَ أَتُمِدُّونَنِ بِمَالٖ فَمَآ ءَاتَىٰنِۦَ ٱللَّهُ خَيۡرٞ مِّمَّآ ءَاتَىٰكُمۚ بَلۡ أَنتُم بِهَدِيَّتِكُمۡ تَفۡرَحُونَ",
        "phonetic": "27.36 Falammā Jā'a Sulaymāna Qāla 'Atumiddūnani Bimālin Famā 'Ātāniya Allāhu Khayrun Mimmā 'Ātākum Bal 'Antum Bihadīyatikum Tafraĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when they came to Solomon, he said, \"Do you provide me with wealth? But what Allāh has given me is better than what He has given you. Rather, it is you who rejoice in your gift.",
            "english_hilali_khan": "So when (the messengers with the present) came to Sulaimân (Solomon), he said: \"Will you help me in wealth? What Allâh has given me is better than that which He has given you! Nay, you rejoice in your gift!\"",
            "english_rwwad": "When the envoy came to Solomon, he said, “Do you seek to appease me with wealth? What Allah has given me is far better than what He has given you. Rather, it is you who take pleasure in gifts."
        }
    },
    {
        "id": 3195,
        "chapter": 27,
        "verse": 37,
        "arabic_text": "ٱرۡجِعۡ إِلَيۡهِمۡ فَلَنَأۡتِيَنَّهُم بِجُنُودٖ لَّا قِبَلَ لَهُم بِهَا وَلَنُخۡرِجَنَّهُم مِّنۡهَآ أَذِلَّةٗ وَهُمۡ صَٰغِرُونَ",
        "phonetic": "27.37 Arji` 'Ilayhim Falana'tiyannahum Bijunūdin Lā Qibala Lahum Bihā Wa Lanukhrijannahum Minhā 'Adhillatan Wa Hum Şāghirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Return to them, for we will surely come to them with soldiers that they will be powerless to encounter, and we will surely expel them therefrom in humiliation, and they will be debased.\"",
            "english_hilali_khan": "[Then Sulaimân (Solomon) said to the chief of her messengers who brought the present]: \"Go back to them. We verily shall come to them with hosts that they cannot resist, and we shall drive them out from there in disgrace, and they will be abased.\"",
            "english_rwwad": "Go back to them; we will surely come to them with forces that they cannot resist, and we will surely drive them out therefrom in disgrace, fully humbled.”"
        }
    },
    {
        "id": 3196,
        "chapter": 27,
        "verse": 38,
        "arabic_text": "قَالَ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَيُّكُمۡ يَأۡتِينِي بِعَرۡشِهَا قَبۡلَ أَن يَأۡتُونِي مُسۡلِمِينَ",
        "phonetic": "27.38 Qāla Yā 'Ayyuhā Al-Mala'u 'Ayyukum Ya'tīnī Bi`arshihā Qabla 'An Ya'tūnī Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Solomon] said, \"O assembly [of jinn], which of you will bring me her throne before they come to me in submission?\"",
            "english_hilali_khan": "He said: \"O chiefs! Which of you can bring me her throne before they come to me surrendering themselves in obedience?\"",
            "english_rwwad": "He said, “O chiefs, which one of you can bring me her throne before they come to me in submission?”"
        }
    },
    {
        "id": 3197,
        "chapter": 27,
        "verse": 39,
        "arabic_text": "قَالَ عِفۡرِيتٞ مِّنَ ٱلۡجِنِّ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن تَقُومَ مِن مَّقَامِكَۖ وَإِنِّي عَلَيۡهِ لَقَوِيٌّ أَمِينٞ",
        "phonetic": "27.39 Qāla `Ifrytun Mina Al-Jinni 'Anā 'Ātīka Bihi Qabla 'An Taqūma Min Maqāmika Wa 'Innī `Alayhi Laqawīyun 'Amīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "A powerful one from among the jinn said, \"I will bring it to you before you rise from your place, and indeed, I am for this [task] strong and trustworthy.\"",
            "english_hilali_khan": "A ‘Ifrît (strong one) from the jinn said: \"I will bring it to you before you rise from your place (council). And verily, I am indeed strong, and trustworthy for such work.\"",
            "english_rwwad": "A powerful jinn said, “I will bring it to you before you rise up from your council, and I am strong enough and trustworthy.”"
        }
    },
    {
        "id": 3198,
        "chapter": 27,
        "verse": 40,
        "arabic_text": "قَالَ ٱلَّذِي عِندَهُۥ عِلۡمٞ مِّنَ ٱلۡكِتَٰبِ أَنَا۠ ءَاتِيكَ بِهِۦ قَبۡلَ أَن يَرۡتَدَّ إِلَيۡكَ طَرۡفُكَۚ فَلَمَّا رَءَاهُ مُسۡتَقِرًّا عِندَهُۥ قَالَ هَٰذَا مِن فَضۡلِ رَبِّي لِيَبۡلُوَنِيٓ ءَأَشۡكُرُ أَمۡ أَكۡفُرُۖ وَمَن شَكَرَ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ رَبِّي غَنِيّٞ كَرِيمٞ",
        "phonetic": "27.40 Qāla Al-Ladhī `Indahu `Ilmun Mina Al-Kitābi 'Anā 'Ātīka Bihi Qabla 'An Yartadda 'Ilayka Ţarfuka Falammā Ra'āhu Mustaqirrāan `Indahu Qāla Hādhā Min Fađli Rabbī Liyabluwanī 'A'ashkuru 'Am 'Akfuru Wa Man Shakara Fa'innamā Yashkuru Linafsihi Wa Man Kafara Fa'inna Rabbī Ghanīyun Karīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said one who had knowledge from the Scripture, \"I will bring it to you before your glance returns to you.\" And when [Solomon] saw it placed before him, he said, \"This is from the favor of my Lord to test me whether I will be grateful or ungrateful. And whoever is grateful - his gratitude is only for [the benefit of] himself. And whoever is ungrateful - then indeed, my Lord is Free of need and Generous.\"",
            "english_hilali_khan": "One with whom was knowledge of the Scripture said: \"I will bring it to you within the twinkling of an eye!\" Then when he [Sulaimân (Solomon)] saw it placed before him, he said: \"This is by the Grace of my Lord - to test me whether I am grateful or ungrateful! And whoever is grateful, truly, his gratitude is for (the good of) his ownself; and whoever is ungrateful, (he is ungrateful only for the loss of his ownself). Certainly my Lord is Rich (Free of all needs), Bountiful.\"",
            "english_rwwad": "But the one who had some knowledge of the scripture said, “I will bring it to you in the blink of your eye.” When he saw it placed before him, he said, “This is a favor of my Lord, to test me whether I will be grateful or ungrateful. Whoever is grateful, it is only for his own good; and whoever is ungrateful, then my Lord is Self-Sufficient, Most Generous.”"
        }
    },
    {
        "id": 3199,
        "chapter": 27,
        "verse": 41,
        "arabic_text": "قَالَ نَكِّرُواْ لَهَا عَرۡشَهَا نَنظُرۡ أَتَهۡتَدِيٓ أَمۡ تَكُونُ مِنَ ٱلَّذِينَ لَا يَهۡتَدُونَ",
        "phonetic": "27.41 Qāla Nakkirū Lahā `Arshahā Nanžur 'Atahtadī 'Am Takūnu Mina Al-Ladhīna Lā Yahtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Disguise for her her throne; we will see whether she will be guided [to truth] or will be of those who is not guided.\"",
            "english_hilali_khan": "He said: \"Disguise her throne for her that we may see whether she will be guided (to recognise her throne), or she will be one of those not guided.\"",
            "english_rwwad": "He said, “Disguise her throne for her, so we may see whether she can discover the truth, or she will be of those who cannot recognize.”"
        }
    },
    {
        "id": 3200,
        "chapter": 27,
        "verse": 42,
        "arabic_text": "فَلَمَّا جَآءَتۡ قِيلَ أَهَٰكَذَا عَرۡشُكِۖ قَالَتۡ كَأَنَّهُۥ هُوَۚ وَأُوتِينَا ٱلۡعِلۡمَ مِن قَبۡلِهَا وَكُنَّا مُسۡلِمِينَ",
        "phonetic": "27.42 Falammā Jā'at Qīla 'Ahakadhā `Arshuki Qālat Ka'annahu Huwa Wa 'Ūtīnā Al-`Ilma Min Qablihā Wa Kunnā Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when she arrived, it was said [to her], \"Is your throne like this?\" She said, \"[It is] as though it was it.\" [Solomon said], \"And we were given knowledge before her, and we have been Muslims [in submission to Allāh].",
            "english_hilali_khan": "So when she came, it was said (to her): \"Is your throne like this?\" She said: \"(It is) as though it were the very same.\" And [Sulaimân (Solomon) said]: \"Knowledge was bestowed on us before her, and we were submitted to Allâh (in Islâm as Muslims before her).\"",
            "english_rwwad": "So when she came, she was asked, “Is your throne like this?” She said, “It looks as if it is the same. We were given knowledge beforehand, and have submitted [to Allah].”"
        }
    },
    {
        "id": 3201,
        "chapter": 27,
        "verse": 43,
        "arabic_text": "وَصَدَّهَا مَا كَانَت تَّعۡبُدُ مِن دُونِ ٱللَّهِۖ إِنَّهَا كَانَتۡ مِن قَوۡمٖ كَٰفِرِينَ",
        "phonetic": "27.43 Wa Şaddahā Mā Kānat Ta`budu Min Dūni Allāhi 'Innahā Kānat Min Qawmin Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And that which she was worshipping other than Allāh had averted her [from submission to Him]. Indeed, she was from a disbelieving people.\"",
            "english_hilali_khan": "And that which she used to worship besides Allâh has prevented her (from Islâm), for she was of a disbelieving people.",
            "english_rwwad": "But she was hindered [from the faith] because she used to worship other than Allah, for she came from a disbelieving people."
        }
    },
    {
        "id": 3202,
        "chapter": 27,
        "verse": 44,
        "arabic_text": "قِيلَ لَهَا ٱدۡخُلِي ٱلصَّرۡحَۖ فَلَمَّا رَأَتۡهُ حَسِبَتۡهُ لُجَّةٗ وَكَشَفَتۡ عَن سَاقَيۡهَاۚ قَالَ إِنَّهُۥ صَرۡحٞ مُّمَرَّدٞ مِّن قَوَارِيرَۗ قَالَتۡ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي وَأَسۡلَمۡتُ مَعَ سُلَيۡمَٰنَ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "27.44 Qīla Lahā Adkhulī Aş-Şarĥa Falammā Ra'at/hu Ĥasibat/hu Lujjatan Wa Kashafat `An Sāqayhā Qāla 'Innahu Şarĥun Mumarradun Min Qawārīra Qālat Rabbi 'Innī Žalamtu Nafsī Wa 'Aslamtu Ma`a Sulaymāna Lillāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[1077]- The floor was transparent, and beneath it was flowing water.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "She was told, \"Enter the palace.\" But when she saw it, she thought it was a body of water[1077] and uncovered her shins [to wade through]. He said, \"Indeed, it is a palace [whose floor is] made smooth with glass.\" She said, \"My Lord, indeed I have wronged myself, and I submit with Solomon to Allāh, Lord of the worlds.\"",
            "english_hilali_khan": "It was said to her: \"Enter As-Sarh\" (a glass surface with water underneath it or a palace): but when she saw it, she thought it was a pool, and she (tucked up her clothes) uncovering her legs. (Sulaimân (Solomon)) said: \"Verily, it is a Sarh (a glass surface with water underneath it or a palace).\" She said: \"My Lord! Verily, I have wronged myself, and I submit [in Islâm, together with Sulaimân (Solomon)] to Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists).\"",
            "english_rwwad": "It was said to her, “Enter the palace.” But when she saw it, she thought it was a body of water, so she uncovered her calves. He said, “This is a palace paved with crystal.” She said, “My Lord, I have wronged myself, and now I submit along with Solomon to Allah, the Lord of the worlds.”"
        }
    },
    {
        "id": 3203,
        "chapter": 27,
        "verse": 45,
        "arabic_text": "وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحًا أَنِ ٱعۡبُدُواْ ٱللَّهَ فَإِذَا هُمۡ فَرِيقَانِ يَخۡتَصِمُونَ",
        "phonetic": "27.45 Wa Laqad 'Arsalnā 'Ilá Thamūda 'Akhāhum Şāliĥāan 'Ani A`budū Allāha Fa'idhā Hum Farīqāni Yakhtaşimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly sent to Thamūd their brother Ṣāliḥ, [saying], \"Worship Allāh,\" and at once they were two parties conflicting.",
            "english_hilali_khan": "And indeed We sent to Thamûd their brother Sâlih, saying: \"Worship Allâh (Alone and none else). Then look! They became two parties (believers and disbelievers) quarreling with each other.\"",
            "english_rwwad": "We sent to the people of Thamūd their brother Sālih [saying], “Worship Allah,” then they suddenly split into two quarreling factions."
        }
    },
    {
        "id": 3204,
        "chapter": 27,
        "verse": 46,
        "arabic_text": "قَالَ يَٰقَوۡمِ لِمَ تَسۡتَعۡجِلُونَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِۖ لَوۡلَا تَسۡتَغۡفِرُونَ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ",
        "phonetic": "27.46 Qāla Yā Qawmi Lima Tasta`jilūna Bis-Sayyi'ati Qabla Al-Ĥasanati Lawlā Tastaghfirūna Allāha La`allakum Turĥamūna",
        "footnotes": {
            "english_saheeh": "[1078]- By challenging Ṣāliḥ to bring on the promised punishment rather than asking for mercy from Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"O my people, why are you impatient for evil before [i.e., instead of] good?[1078] Why do you not seek forgiveness of Allāh that you may receive mercy?\"",
            "english_hilali_khan": "He said: \"O my people! Why do you seek to hasten the evil (torment) before the good (Allâh’s Mercy)? Why seek you not the Forgiveness of Allâh, that you may receive mercy?\"",
            "english_rwwad": "He said, “O my people, why do you seek to hasten punishment rather than good? If only you sought Allah’s forgiveness, so that you may be shown mercy!”"
        }
    },
    {
        "id": 3205,
        "chapter": 27,
        "verse": 47,
        "arabic_text": "قَالُواْ ٱطَّيَّرۡنَا بِكَ وَبِمَن مَّعَكَۚ قَالَ طَٰٓئِرُكُمۡ عِندَ ٱللَّهِۖ بَلۡ أَنتُمۡ قَوۡمٞ تُفۡتَنُونَ",
        "phonetic": "27.47 Qālū Aţţayyarnā Bika Wa Biman Ma`aka Qāla Ţā'irukum `Inda Allāhi Bal 'Antum Qawmun Tuftanūna",
        "footnotes": {
            "english_saheeh": "[1079]- Or \"being tempted [by Satan].\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"We consider you a bad omen, you and those with you.\" He said, \"Your omen [i.e., fate] is with Allāh. Rather, you are a people being tested.\"[1079]",
            "english_hilali_khan": "They said: \"We augur ill omen from you and those with you.\" He said: \"Your ill omen is with Allâh; nay, but you are a people that are being tested.\"",
            "english_rwwad": "They said, “We consider you and those who are with you as a bad omen.” He said, “Your omen is from Allah, but you are a people who are being tested.”"
        }
    },
    {
        "id": 3206,
        "chapter": 27,
        "verse": 48,
        "arabic_text": "وَكَانَ فِي ٱلۡمَدِينَةِ تِسۡعَةُ رَهۡطٖ يُفۡسِدُونَ فِي ٱلۡأَرۡضِ وَلَا يُصۡلِحُونَ",
        "phonetic": "27.48 Wa Kāna Fī Al-Madīnati Tis`atu Rahţin Yufsidūna Fī Al-'Arđi Wa Lā Yuşliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there were in the city nine family heads causing corruption in the land and not amending [its affairs].",
            "english_hilali_khan": "And there were in the city nine men (from the sons of their chiefs), who made mischief in the land, and would not reform.",
            "english_rwwad": "There were nine men in the city who used to spread corruption in the land without doing anything good."
        }
    },
    {
        "id": 3207,
        "chapter": 27,
        "verse": 49,
        "arabic_text": "قَالُواْ تَقَاسَمُواْ بِٱللَّهِ لَنُبَيِّتَنَّهُۥ وَأَهۡلَهُۥ ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِۦ مَا شَهِدۡنَا مَهۡلِكَ أَهۡلِهِۦ وَإِنَّا لَصَٰدِقُونَ",
        "phonetic": "27.49 Qālū Taqāsamū Billāhi Lanubayyitannahu Wa 'Ahlahu Thumma Lanaqūlanna Liwalīyihi Mā Shahidnā Mahlika 'Ahlihi Wa 'Innā Laşādiqūna",
        "footnotes": {
            "english_saheeh": "[1080]- i.e., the one responsible for executing his will and avenging his blood.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"Take a mutual oath by Allāh that we will kill him by night, he and his family. Then we will say to his executor,[1080] 'We did not witness the destruction of his family, and indeed, we are truthful.'\"",
            "english_hilali_khan": "They said: \"Swear one to another by Allâh that we shall make a secret night attack on him and his household, and thereafter we will surely say to his near relatives: ‘We witnessed not the destruction of his household, and verily we are telling the truth.’\"",
            "english_rwwad": "They said, “Let us all swear by Allah that we will kill him and his family by night. Then we will tell his heir, ‘We did not witness the murder of his family, and we are indeed truthful.’”"
        }
    },
    {
        "id": 3208,
        "chapter": 27,
        "verse": 50,
        "arabic_text": "وَمَكَرُواْ مَكۡرٗا وَمَكَرۡنَا مَكۡرٗا وَهُمۡ لَا يَشۡعُرُونَ",
        "phonetic": "27.50 Wa Makarū Makrāan Wa Makarnā Makrāan Wa Hum Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they planned a plan, and We planned a plan, while they perceived not.",
            "english_hilali_khan": "So they plotted a plot, and We plotted a plot, while they perceived not.",
            "english_rwwad": "Thus they made a plan and We too made a plan, but they were unaware of it."
        }
    },
    {
        "id": 3209,
        "chapter": 27,
        "verse": 51,
        "arabic_text": "فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ مَكۡرِهِمۡ أَنَّا دَمَّرۡنَٰهُمۡ وَقَوۡمَهُمۡ أَجۡمَعِينَ",
        "phonetic": "27.51 Fānžur Kayfa Kāna `Āqibatu Makrihim 'Annā Dammarnāhum Wa Qawmahum 'Ajma`īna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then look how was the outcome of their plan - that We destroyed them and their people, all.",
            "english_hilali_khan": "Then see how was the end of their plot! Verily! We destroyed them and their nation, all together.",
            "english_rwwad": "See then what was the consequences of their plan: We destroyed them and their entire people."
        }
    },
    {
        "id": 3210,
        "chapter": 27,
        "verse": 52,
        "arabic_text": "فَتِلۡكَ بُيُوتُهُمۡ خَاوِيَةَۢ بِمَا ظَلَمُوٓاْۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡلَمُونَ",
        "phonetic": "27.52 Fatilka Buyūtuhum Khāwiyatan Bimā Žalamū 'Inna Fī Dhālika La'āyatan Liqawmin Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So those are their houses, desolate because of the wrong they had done. Indeed in that is a sign for people who know.",
            "english_hilali_khan": "These are their houses in utter ruin, for they did wrong. Verily, in this is indeed an Ayâh (a lesson or a sign) for people who know.",
            "english_rwwad": "Now their houses are utterly ruined because of their wrongdoing. Indeed, there are signs in this for people of knowledge."
        }
    },
    {
        "id": 3211,
        "chapter": 27,
        "verse": 53,
        "arabic_text": "وَأَنجَيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ",
        "phonetic": "27.53 Wa 'Anjaynā Al-Ladhīna 'Āmanū Wa Kānū Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We saved those who believed and used to fear Allāh.",
            "english_hilali_khan": "And We saved those who believed, and used to fear Allâh, and keep their duty to Him.",
            "english_rwwad": "And We saved those who believed and feared Allah."
        }
    },
    {
        "id": 3212,
        "chapter": 27,
        "verse": 54,
        "arabic_text": "وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ وَأَنتُمۡ تُبۡصِرُونَ",
        "phonetic": "27.54 Wa Lūţāan 'Idh Qāla Liqawmihi 'Ata'tūna Al-Fāĥishata Wa 'Antum Tubşirūna",
        "footnotes": {
            "english_saheeh": "[1081]- Homosexual acts.\n[1082]- i.e., openly.  Another meaning is \"...while you are aware [that it is wrong].\"",
            "english_hilali_khan": "(V.27:54) i.e. the town of Sodom in Palestine - the place where the Dead Sea is now. (See the book of history by Ibn Kathir ‘The Stories of the Prophets’). (كتاب التاريخ لابن كثير).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] Lot, when he said to his people, \"Do you commit immorality[1081] while you are seeing?[1082]",
            "english_hilali_khan": "And (remember) Lût (Lot)! When he said to his people.[1] Do you commit Al-Fâhishah (evil, great sin, every kind of unlawful sexual intercourse, sodomy) while you see (one another doing evil without any screen)?\"",
            "english_rwwad": "And [remember] Lot, when he said to his people, “Do you commit this shameful act while seeing [one another]?"
        }
    },
    {
        "id": 3213,
        "chapter": 27,
        "verse": 55,
        "arabic_text": "أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ تَجۡهَلُونَ",
        "phonetic": "27.55 'A'innakum Lata'tūna Ar-Rijāla Shahwatan Min Dūni An-Nisā' Bal 'Antum Qawmun Tajhalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do you indeed approach men with desire instead of women? Rather, you are a people behaving ignorantly.\"",
            "english_hilali_khan": "\"Do you practise your lusts on men instead of women? Nay, but you are a people who behave senselessly.\"",
            "english_rwwad": "Do you approach men with lust instead of women? In fact, you are an ignorant people!”"
        }
    },
    {
        "id": 3214,
        "chapter": 27,
        "verse": 56,
        "arabic_text": "۞ فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ يَتَطَهَّرُونَ",
        "phonetic": "27.56 Famā Kāna Jawāba Qawmihi 'Illā 'An Qālū 'Akhrijū 'Āla Lūţin Min Qaryatikum 'Innahum 'Unāsun Yataţahharūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But the answer of his people was not except that they said, \"Expel the family of Lot from your city. Indeed, they are people who keep themselves pure.\"",
            "english_hilali_khan": "There was no other answer given by his people except that they said: \"Drive out the family of Lût (Lot) from your city Verily, these are men who want to be clean and pure!\"",
            "english_rwwad": "But the only response his people gave was to say, “Drive the family of Lot out of your town, for they are a people who keep themselves pure!”"
        }
    },
    {
        "id": 3215,
        "chapter": 27,
        "verse": 57,
        "arabic_text": "فَأَنجَيۡنَٰهُ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَٰهَا مِنَ ٱلۡغَٰبِرِينَ",
        "phonetic": "27.57 Fa'anjaynāhu Wa 'Ahlahu 'Illā Amra'atahu Qaddarnāhā Mina Al-Ghābirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We saved him and his family, except for his wife; We destined her to be of those who remained behind.",
            "english_hilali_khan": "So We saved him and his family, except his wife. We destined her to be of those who remained behind.",
            "english_rwwad": "So We saved him and his family, except his wife whom We destined to be among those who would remain behind."
        }
    },
    {
        "id": 3216,
        "chapter": 27,
        "verse": 58,
        "arabic_text": "وَأَمۡطَرۡنَا عَلَيۡهِم مَّطَرٗاۖ فَسَآءَ مَطَرُ ٱلۡمُنذَرِينَ",
        "phonetic": "27.58 Wa 'Amţarnā `Alayhim Maţarāan Fasā'a Maţaru Al-Mundharīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We rained upon them a rain [of stones], and evil was the rain of those who were warned.",
            "english_hilali_khan": "And We rained down on them a rain (of stones). So evil was the rain of those who were warned.",
            "english_rwwad": "And We rained upon them a rain [of stones]. How terrible was the rain of those who were warned!"
        }
    },
    {
        "id": 3217,
        "chapter": 27,
        "verse": 59,
        "arabic_text": "قُلِ ٱلۡحَمۡدُ لِلَّهِ وَسَلَٰمٌ عَلَىٰ عِبَادِهِ ٱلَّذِينَ ٱصۡطَفَىٰٓۗ ءَآللَّهُ خَيۡرٌ أَمَّا يُشۡرِكُونَ",
        "phonetic": "27.59 Quli Al-Ĥamdu Lillāhi Wa Salāmun `Alá `Ibādihi Al-Ladhīna Aşţafá 'Āālllahu Khayrun 'Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.27:59)\nA) Narrated Anas رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Whoever possesses the following three (qualities) will have the sweetness (delight) of faith:\n1) The one to whom Allâh عز وجل and His Messenger (Muhammad صلى الله عليه وسلم) become dearer than anything else.\n2) Who loves a person and he loves him only for Allâh’s sake.\n3) Who hates to revert to kufr (disbelief) as he hates to be thrown into the fire.\" (Sahih Al-Bukhari, Vol.1, Hadith No.15)\nB) Narrated Abû Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم was asked, \"What is the best deed?\" He replied, \"To believe in Allâh عز وجل and His Messenger Muhammad.\" The questioner then asked, \"What is the next (in goodness)?\" He replied, \"To participate in Jihâd (holy fighting) in Allâh’s Cause.\" The questioner again asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj (pilgrimage to Makkah) Mabrûr (which is accepted by Allâh and is performed with the intention of seeking Allâh’s Pleasures only and not to show-off and without committing any sin, and in accordance with the legal ways of the Prophet صلى الله عليه وسلم).\" (Sahih Al-Bukhari, Vol.1, Hadith No.25)\nC) Narrated ‘Abdullâh رضي الله عنه: When the following Verse was revealed: \"It is those who believe (in the Oneness of Allâh and worship none but Him Alone) and confuse not their belief with Zulm (wrong i.e., by worshipping others besides Allâh.)...\" (V.6:82), the Companions of Allâh’s Messenger صلى الله عليه وسلم said, \"Who is amongst us who had not done Zulm (wrong)?\" Then Allâh تعالى revealed: \"Verily, joining others in worship with Allâh is a great Zulm (wrong) indeed.\" (V.31:13) (Sahih Al-Bukhari, Vol.1, Hadith No.31).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Praise be to Allāh, and peace upon His servants whom He has chosen. Is Allāh better or what they associate with Him?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Praise and thanks be to Allâh, and peace be on His slaves whom He has chosen (for His Message)! Is Allâh better, or (all) that you ascribe as partners (to Him)?\" (Of course, Allâh is Better).[1]",
            "english_rwwad": "Say, “All praise is for Allah, and peace be upon His slaves whom He has chosen. Is Allah better, or those partners whom they associate with Him?”"
        }
    },
    {
        "id": 3218,
        "chapter": 27,
        "verse": 60,
        "arabic_text": "أَمَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهۡجَةٖ مَّا كَانَ لَكُمۡ أَن تُنۢبِتُواْ شَجَرَهَآۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ هُمۡ قَوۡمٞ يَعۡدِلُونَ",
        "phonetic": "27.60 'Amman Khalaqa As-Samāwāti Wa Al-'Arđa Wa 'Anzala Lakum Mina As-Samā'i Mā'an Fa'anbatnā Bihi Ĥadā'iqa Dhāta Bahjatin Mā Kāna Lakum 'An Tunbitū Shajarahā 'A'ilahun Ma`a Allāhi Bal Hum Qawmun Ya`dilūna",
        "footnotes": {
            "english_saheeh": "[1083]- Three meanings are implied:  \"Is there another god who did all of this with Allāh?\" or \"Is there any deity worthy to be worshipped along with Allāh?\" or \"Is there a deity to be compared with Allāh?\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[More precisely], is He [not best] who created the heavens and the earth and sent down for you rain from the sky, causing to grow thereby gardens of joyful beauty which you could not [otherwise] have grown the trees thereof? Is there a deity with Allāh?[1083] [No], but they are a people who ascribe equals [to Him].",
            "english_hilali_khan": "Is not He (better than your gods) Who created the heavens and the earth, and sends down for you water (rain) from the sky, whereby We cause to grow wonderful gardens full of beauty and delight? It is not in your ability to cause the growth of their trees. Is there any ilâh (god) with Allâh? Nay, but they are a people who ascribe equals (to Him)!",
            "english_rwwad": "Is He [not better] Who created the heavens and earth, and sent down for you rain from the sky, by which We caused to grow gardens of cheerful beauty? You could never cause their trees to grow. Is there any god besides Allah? No, but they are people who ascribe equals [to Allah]."
        }
    },
    {
        "id": 3219,
        "chapter": 27,
        "verse": 61,
        "arabic_text": "أَمَّن جَعَلَ ٱلۡأَرۡضَ قَرَارٗا وَجَعَلَ خِلَٰلَهَآ أَنۡهَٰرٗا وَجَعَلَ لَهَا رَوَٰسِيَ وَجَعَلَ بَيۡنَ ٱلۡبَحۡرَيۡنِ حَاجِزًاۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "27.61 'Amman Ja`ala Al-'Arđa Qarārāan Wa Ja`ala Khilālahā 'Anhārāan Wa Ja`ala Lahā Rawāsiya Wa Ja`ala Bayna Al-Baĥrayni Ĥājizāan 'A'ilahun Ma`a Allāhi Bal 'Aktharuhum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Is He [not best] who made the earth a stable ground and placed within it rivers and made for it firmly set mountains and placed between the two seas a barrier? Is there a deity with Allāh? [No], but most of them do not know.",
            "english_hilali_khan": "Is not He (better than your gods) Who has made the earth as a fixed abode, and has placed rivers in its midst, and has placed firm mountains therein, and has set a barrier between the two seas (of salt and sweet water)? Is there any ilâh (god) with Allâh? Nay, but most of them know not!",
            "english_rwwad": "Is He [not better] Who made the earth a stable place to live, and caused rivers to flow through it, and placed therein firm mountains, and made a barrier between two flowing bodies of water? Is there any god besides Allah? No, but most of them do not know."
        }
    },
    {
        "id": 3220,
        "chapter": 27,
        "verse": 62,
        "arabic_text": "أَمَّن يُجِيبُ ٱلۡمُضۡطَرَّ إِذَا دَعَاهُ وَيَكۡشِفُ ٱلسُّوٓءَ وَيَجۡعَلُكُمۡ خُلَفَآءَ ٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قَلِيلٗا مَّا تَذَكَّرُونَ",
        "phonetic": "27.62 'Amman Yujību Al-Muđţarra 'Idhā Da`āhu Wa Yakshifu As-Sū'a Wa Yaj`alukum Khulafā'a Al-'Arđi 'A'ilahun Ma`a Allāhi Qalīlāan Mā Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "[1084]- Generation after generation.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Is He [not best] who responds to the desperate one when he calls upon Him and removes evil and makes you inheritors of the earth?[1084] Is there a deity with Allāh? Little do you remember.",
            "english_hilali_khan": "Is not He (better than your gods) Who responds to the distressed one, when he calls on Him, and Who removes the evil, and makes you inheritors of the earth, generations after generations? Is there any ilâh (god) with Allâh? Little is that you remember!",
            "english_rwwad": "Is He [not better] Who responds to the distressed when he calls out to Him, and Who relieves suffering, and Who makes you successors on earth? Is there any god besides Allah? Little is it that you take heed!"
        }
    },
    {
        "id": 3221,
        "chapter": 27,
        "verse": 63,
        "arabic_text": "أَمَّن يَهۡدِيكُمۡ فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ وَمَن يُرۡسِلُ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦٓۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ تَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ",
        "phonetic": "27.63 'Amman Yahdīkum Fī Žulumāti Al-Barri Wa Al-Baĥri Wa Man Yursilu Ar-Riyāĥa Bushrāan Bayna Yaday Raĥmatihi 'A'ilahun Ma`a Allāhi Ta`ālá Allāhu `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Is He [not best] who guides you through the darknesses of the land and sea and who sends the winds as good tidings before His mercy? Is there a deity with Allāh? High is Allāh above whatever they associate with Him.",
            "english_hilali_khan": "Is not He (better than your gods) Who guides you in the darkness of the land and the sea, and Who sends the winds as heralds of glad tidings, going before His Mercy (rain)? Is there any ilâh (god) with Allâh? High Exalted be Allâh above all that they associate as partners (to Him)!",
            "english_rwwad": "Is He [not better] Who guides you in the depths of darkness of the land and sea, and Who sends the winds as harbingers ahead of His mercy? Is there any god besides Allah? Exalted is Allah far above the partners they associate with Him!"
        }
    },
    {
        "id": 3222,
        "chapter": 27,
        "verse": 64,
        "arabic_text": "أَمَّن يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَمَن يَرۡزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قُلۡ هَاتُواْ بُرۡهَٰنَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "27.64 'Amman Yabda'u Al-Khalqa Thumma Yu`īduhu Wa Man Yarzuqukum Mina As-Samā'i Wa Al-'Arđi 'A'ilahun Ma`a Allāhi Qul Hātū Burhānakum 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Is He [not best] who begins creation and then repeats it and who provides for you from the heaven and earth? Is there a deity with Allāh? Say, \"Produce your proof, if you should be truthful.\"",
            "english_hilali_khan": "Is not He (better than your so-called gods) Who originates creation, and shall thereafter repeat it, and Who provides for you from heaven and earth? Is there any ilâh (god) with Allâh? Say: \"Bring forth your proofs, if you are truthful.\"",
            "english_rwwad": "Is He [not better] Who originates creation then repeats it, and Who gives you provision from the heaven and earth? Is there any god besides Allah? Say, “Produce your evidence if you are truthful.”"
        }
    },
    {
        "id": 3223,
        "chapter": 27,
        "verse": 65,
        "arabic_text": "قُل لَّا يَعۡلَمُ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلۡغَيۡبَ إِلَّا ٱللَّهُۚ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ",
        "phonetic": "27.65 Qul Lā Ya`lamu Man Fī As-Samāwāti Wa Al-'Arđi Al-Ghayba 'Illā Allāhu Wa Mā Yash`urūna 'Ayyāna Yub`athūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"None in the heavens and earth knows the unseen except Allāh, and they do not perceive when they will be resurrected.\"",
            "english_hilali_khan": "Say: \"None in the heavens and the earth knows the Ghaib (Unseen) except Allâh, nor can they perceive when they shall be resurrected.\"",
            "english_rwwad": "Say, “No one in the heavens and earth has knowledge of the unseen except Allah.” Nor do they know when they will be resurrected."
        }
    },
    {
        "id": 3224,
        "chapter": 27,
        "verse": 66,
        "arabic_text": "بَلِ ٱدَّٰرَكَ عِلۡمُهُمۡ فِي ٱلۡأٓخِرَةِۚ بَلۡ هُمۡ فِي شَكّٖ مِّنۡهَاۖ بَلۡ هُم مِّنۡهَا عَمُونَ",
        "phonetic": "27.66 Bal Addāraka `Ilmuhum Fī Al-'Ākhirati Bal Hum Fī Shakkin Minhā Bal Hum Minhā `Amūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Rather, their knowledge is arrested concerning the Hereafter. Rather, they are in doubt about it. Rather, they are, concerning it, blind.",
            "english_hilali_khan": "Nay, they have no knowledge of the Hereafter. Nay, they are in doubt about it. Nay, they are in complete blindness about it.",
            "english_rwwad": "In fact, their knowledge cannot comprehend the Hereafter; rather, they are in doubt about it; rather, they are blind to it."
        }
    },
    {
        "id": 3225,
        "chapter": 27,
        "verse": 67,
        "arabic_text": "وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ أَءِذَا كُنَّا تُرَٰبٗا وَءَابَآؤُنَآ أَئِنَّا لَمُخۡرَجُونَ",
        "phonetic": "27.67 Wa Qāla Al-Ladhīna Kafarū 'A'idhā Kunnā Turābāan Wa 'Ābā'uunā 'A'innā Lamukhrajūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who disbelieve say, \"When we have become dust as well as our forefathers, will we indeed be brought out [of the graves]?",
            "english_hilali_khan": "And those who disbelieve say: \"When we have become dust - we and our fathers - shall we really be brought forth (again)?",
            "english_rwwad": "Those who disbelieve say, “What! Is it that when we and our forefathers become dust, will we really be brought forth [alive]?"
        }
    },
    {
        "id": 3226,
        "chapter": 27,
        "verse": 68,
        "arabic_text": "لَقَدۡ وُعِدۡنَا هَٰذَا نَحۡنُ وَءَابَآؤُنَا مِن قَبۡلُ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ",
        "phonetic": "27.68 Laqad Wu`idnā Hādhā Naĥnu Wa 'Ābā'uunā Min Qablu 'In Hādhā 'Illā 'Asāţīru Al-'Awwalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We have been promised this, we and our forefathers, before. This is not but legends of the former peoples.\"",
            "english_hilali_khan": "\"Indeed we were promised this - we and our forefathers before (us), verily, these are nothing but tales of ancients.\"",
            "english_rwwad": "We and our forefathers have been promised this before; this is nothing but ancient fables!”"
        }
    },
    {
        "id": 3227,
        "chapter": 27,
        "verse": 69,
        "arabic_text": "قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ",
        "phonetic": "27.69 Qul Sīrū Fī Al-'Arđi Fānžurū Kayfa Kāna `Āqibatu Al-Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Proceed [i.e., travel] through the land and observe how was the end of the criminals.\"",
            "english_hilali_khan": "Say to them (O Muhammad صلى الله عليه وسلم) \"Travel in the land and see how has been the end of the Mujrimûn (criminals, those who denied Allâh’s Messengers and disobeyed Allâh).\"",
            "english_rwwad": "Say, “Travel in the land and see how was the end of the wicked.”"
        }
    },
    {
        "id": 3228,
        "chapter": 27,
        "verse": 70,
        "arabic_text": "وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَلَا تَكُن فِي ضَيۡقٖ مِّمَّا يَمۡكُرُونَ",
        "phonetic": "27.70 Wa Lā Taĥzan `Alayhim Wa Lā Takun Fī Đayqin Mimmā Yamkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And grieve not over them or be in distress from what they conspire.",
            "english_hilali_khan": "And grieve you not over them, nor be straitened (in distress) because of what they plot.",
            "english_rwwad": "Do not grieve over them, nor be distressed by their plots."
        }
    },
    {
        "id": 3229,
        "chapter": 27,
        "verse": 71,
        "arabic_text": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "27.71 Wa Yaqūlūna Matá Hādhā Al-Wa`du 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"When is [the fulfillment of] this promise, if you should be truthful?\"",
            "english_hilali_khan": "And they (the disbelievers in the Oneness of Allâh) say: \"When (will) this promise (be fulfilled), if you are truthful?\"",
            "english_rwwad": "They say, “When will this warning come to pass, if you are truthful?”"
        }
    },
    {
        "id": 3230,
        "chapter": 27,
        "verse": 72,
        "arabic_text": "قُلۡ عَسَىٰٓ أَن يَكُونَ رَدِفَ لَكُم بَعۡضُ ٱلَّذِي تَسۡتَعۡجِلُونَ",
        "phonetic": "27.72 Qul `Asá 'An Yakūna Radifa Lakum Ba`đu Al-Ladhī Tasta`jilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Perhaps it is close behind you [i.e., very near] - some of that for which you are impatient.",
            "english_hilali_khan": "Say: \"Perhaps that which you wish to hasten on, may be close behind you.",
            "english_rwwad": "Say, “Perhaps some of what you seek to hasten is quite near to you.”"
        }
    },
    {
        "id": 3231,
        "chapter": 27,
        "verse": 73,
        "arabic_text": "وَإِنَّ رَبَّكَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَشۡكُرُونَ",
        "phonetic": "27.73 Wa 'Inna Rabbaka Ladhū Fađlin `Alá An-Nāsi Wa Lakinna 'Aktharahum Lā Yashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, your Lord is the possessor of bounty for the people, but most of them are not grateful.\"",
            "english_hilali_khan": "\"Verily, your Lord is full of Grace for mankind, yet most of them do not give thanks.\"",
            "english_rwwad": "Indeed, your Lord is graceful to mankind, but most of them are ungrateful."
        }
    },
    {
        "id": 3232,
        "chapter": 27,
        "verse": 74,
        "arabic_text": "وَإِنَّ رَبَّكَ لَيَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ",
        "phonetic": "27.74 Wa 'Inna Rabbaka Laya`lamu Mā Tukinnu Şudūruhum Wa Mā Yu`linūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, your Lord knows what their breasts conceal and what they declare.",
            "english_hilali_khan": "And verily, your Lord knows what their breasts conceal and what they reveal.",
            "english_rwwad": "Your Lord surely knows all that their hearts conceal and all that they reveal."
        }
    },
    {
        "id": 3233,
        "chapter": 27,
        "verse": 75,
        "arabic_text": "وَمَا مِنۡ غَآئِبَةٖ فِي ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِلَّا فِي كِتَٰبٖ مُّبِينٍ",
        "phonetic": "27.75 Wa Mā Min Ghā'ibatin Fī As-Samā'i Wa Al-'Arđi 'Illā Fī Kitābin Mubīnin",
        "footnotes": {
            "english_saheeh": "[1085]- Literally, \"absent [from the senses].\"\n[1086]- The Preserved Slate (al-Lawḥ al-Maḥfūẓ), which is with Allāh (subḥānahu wa taʿālā).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there is nothing concealed[1085] within the heaven and the earth except that it is in a clear Register.[1086]",
            "english_hilali_khan": "And there is nothing hidden in the heaven and the earth but it is in a Clear Book (i.e. Al-Lauh Al-Mahfûz).",
            "english_rwwad": "For there is nothing hidden in the heavens and earth except that it is [written] in a clear Record."
        }
    },
    {
        "id": 3234,
        "chapter": 27,
        "verse": 76,
        "arabic_text": "إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَقُصُّ عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَكۡثَرَ ٱلَّذِي هُمۡ فِيهِ يَخۡتَلِفُونَ",
        "phonetic": "27.76 'Inna Hādhā Al-Qur'āna Yaquşşu `Alá Banī 'Isrā'īla 'Akthara Al-Ladhī Hum Fīhi Yakhtalifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, this Qur’ān relates to the Children of Israel most of that over which they disagree.",
            "english_hilali_khan": "Verily, this Qur’ân narrates to the Children of Israel most of that in which they differ.",
            "english_rwwad": "Indeed, this Qur’an explains to the Children of Israel most of that over which they differ."
        }
    },
    {
        "id": 3235,
        "chapter": 27,
        "verse": 77,
        "arabic_text": "وَإِنَّهُۥ لَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ",
        "phonetic": "27.77 Wa 'Innahu Lahudáan Wa Raĥmatun Lilmu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, it is guidance and mercy for the believers.",
            "english_hilali_khan": "And truly, it (this Qur’ân) is a guide and a mercy for the believers.",
            "english_rwwad": "And it is certainly a guidance and mercy for the believers."
        }
    },
    {
        "id": 3236,
        "chapter": 27,
        "verse": 78,
        "arabic_text": "إِنَّ رَبَّكَ يَقۡضِي بَيۡنَهُم بِحُكۡمِهِۦۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡعَلِيمُ",
        "phonetic": "27.78 'Inna Rabbaka Yaqđī Baynahum Biĥukmihi Wa Huwa Al-`Azīzu Al-`Alīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord will judge between them by His [wise] judgement. And He is the Exalted in Might, the Knowing.",
            "english_hilali_khan": "Verily, your Lord will decide between them (various sects) by His Judgement. And He is the All-Mighty, the All-Knowing.",
            "english_rwwad": "Indeed, your Lord will judge between them by His justice, for He is the All-Mighty, the All-Knowing."
        }
    },
    {
        "id": 3237,
        "chapter": 27,
        "verse": 79,
        "arabic_text": "فَتَوَكَّلۡ عَلَى ٱللَّهِۖ إِنَّكَ عَلَى ٱلۡحَقِّ ٱلۡمُبِينِ",
        "phonetic": "27.79 Fatawakkal `Alá Allāhi 'Innaka `Alá Al-Ĥaqqi Al-Mubīni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So rely upon Allāh; indeed, you are upon the clear truth.",
            "english_hilali_khan": "So put your trust in Allâh; surely, you (O Muhammad صلى الله عليه وسلم) are on manifest truth.",
            "english_rwwad": "So put your trust in Allah, for you are upon the clear truth."
        }
    },
    {
        "id": 3238,
        "chapter": 27,
        "verse": 80,
        "arabic_text": "إِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ",
        "phonetic": "27.80 'Innaka Lā Tusmi`u Al-Mawtá Wa Lā Tusmi`u Aş-Şumma Ad-Du`ā'a 'Idhā Wa Llaw Mudbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, you will not make the dead hear, nor will you make the deaf hear the call when they have turned their backs retreating.",
            "english_hilali_khan": "Verily, you cannot make the dead to hear nor can you make the deaf to hear the call (i.e. benefit them and similarly the disbelievers), when they flee, turning their backs.",
            "english_rwwad": "You cannot make the dead hear, nor can you make the deaf hear the call when they turn their backs retreating."
        }
    },
    {
        "id": 3239,
        "chapter": 27,
        "verse": 81,
        "arabic_text": "وَمَآ أَنتَ بِهَٰدِي ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ",
        "phonetic": "27.81 Wa Mā 'Anta Bihādī Al-`Umyi `An Đalālatihim 'In Tusmi`u 'Illā Man Yu'uminu Bi'āyātinā Fahum Muslimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [i.e., submitting to Allāh].",
            "english_hilali_khan": "Nor can you lead the blind out of their error. You can only make to hear those who believe in Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), and who have submitted (themselves to Allâh in Islâm as Muslims).",
            "english_rwwad": "Nor can you guide the blind out of their error, nor can you make anyone hear except those who believe in Our verses, for they are ready to submit to Allah."
        }
    },
    {
        "id": 3240,
        "chapter": 27,
        "verse": 82,
        "arabic_text": "۞ وَإِذَا وَقَعَ ٱلۡقَوۡلُ عَلَيۡهِمۡ أَخۡرَجۡنَا لَهُمۡ دَآبَّةٗ مِّنَ ٱلۡأَرۡضِ تُكَلِّمُهُمۡ أَنَّ ٱلنَّاسَ كَانُواْ بِـَٔايَٰتِنَا لَا يُوقِنُونَ",
        "phonetic": "27.82 Wa 'Idhā Waqa`a Al-Qawlu `Alayhim 'Akhrajnā Lahum Dābbatan Mina Al-'Arđi Tukallimuhum 'Anna An-Nāsa Kānū Bi'āyātinā Lā Yūqinūna",
        "footnotes": {
            "english_saheeh": "[1087]- At the approach of the Hour.",
            "english_hilali_khan": "(V.27:82) See the footnote of (V.6:158).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when the word [i.e., decree] befalls them,[1087] We will bring forth for them a creature from the earth speaking to them, [saying] that the people were, of Our verses, not certain [in faith].",
            "english_hilali_khan": "And when the Word (of torment) is fulfilled against them, We shall bring out from the earth a beast[1] for them, to speak to them because mankind believed not with certainty in Our Ayât (Verses of the Qur’ân and Prophet Muhammad صلى الله عليه وسلم).",
            "english_rwwad": "When the decree [of the Hour] comes to pass against them, We will bring forth to them a beast out of the earth that will tell them that the people had no faith in Our verses."
        }
    },
    {
        "id": 3241,
        "chapter": 27,
        "verse": 83,
        "arabic_text": "وَيَوۡمَ نَحۡشُرُ مِن كُلِّ أُمَّةٖ فَوۡجٗا مِّمَّن يُكَذِّبُ بِـَٔايَٰتِنَا فَهُمۡ يُوزَعُونَ",
        "phonetic": "27.83 Wa Yawma Naĥshuru Min Kulli 'Ummatin Fawjāan Mimman Yukadhibu Bi'āyātinā Fahum Yūza`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [warn of] the Day when We will gather from every nation a company of those who deny Our signs, and they will be [driven] in rows",
            "english_hilali_khan": "And (remember) the Day when We shall gather out of every nation a troop of those who denied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), and (then) they (all) shall be driven (to the place of reckoning),",
            "english_rwwad": "And [beware of] the Day when We will gather from every nation a group of those who used to reject Our verses, and they will be driven in ranks."
        }
    },
    {
        "id": 3242,
        "chapter": 27,
        "verse": 84,
        "arabic_text": "حَتَّىٰٓ إِذَا جَآءُو قَالَ أَكَذَّبۡتُم بِـَٔايَٰتِي وَلَمۡ تُحِيطُواْ بِهَا عِلۡمًا أَمَّاذَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "27.84 Ĥattá 'Idhā Jā'ū Qāla 'Akadhabtum Bi'āyātī Wa Lam Tuĥīţū Bihā `Ilmāan 'Ammādhā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Until, when they arrive [at the place of Judgement], He will say, \"Did you deny My signs while you encompassed them not in knowledge, or what [was it that] you were doing?\"",
            "english_hilali_khan": "Till, when they come (before their Lord at the place of reckoning), He will say: \"Did you deny My Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) whereas you comprehended them not by knowledge (of their truth or falsehood), or what (else) was it that you used to do?\"",
            "english_rwwad": "When they finally come, He will say, “Did you reject My verses without even comprehending them, or what exactly were you doing?"
        }
    },
    {
        "id": 3243,
        "chapter": 27,
        "verse": 85,
        "arabic_text": "وَوَقَعَ ٱلۡقَوۡلُ عَلَيۡهِم بِمَا ظَلَمُواْ فَهُمۡ لَا يَنطِقُونَ",
        "phonetic": "27.85 Wa Waqa`a Al-Qawlu `Alayhim Bimā Žalamū Fahum Lā Yanţiqūna",
        "footnotes": {
            "english_saheeh": "[1088]- Allāh's decree will come into effect upon them, and His promise will be fulfilled.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the decree will befall them[1088] for the wrong they did, and they will not [be able to] speak.",
            "english_hilali_khan": "And the Word (of torment) will be fulfilled against them, because they have done wrong, and they will be unable to speak (in order to defend themselves).",
            "english_rwwad": "The decree [of punishment] will befall them because of their wrongdoing, leaving them speechless."
        }
    },
    {
        "id": 3244,
        "chapter": 27,
        "verse": 86,
        "arabic_text": "أَلَمۡ يَرَوۡاْ أَنَّا جَعَلۡنَا ٱلَّيۡلَ لِيَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "27.86 'Alam Yaraw 'Annā Ja`alnā Al-Layla Liyaskunū Fīhi Wa An-Nahāra Mubşirāan 'Inna Fī Dhālika La'āyātin Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not see that We made the night that they may rest therein and the day giving sight? Indeed in that are signs for a people who believe.",
            "english_hilali_khan": "See they not that We have made the night for them to rest therein, and the day sight-giving? Verily, in this are Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) for the people who believe.",
            "english_rwwad": "Do they not see that We made the night for them to rest in, and made the day bright? Indeed, there are signs in this for people who believe."
        }
    },
    {
        "id": 3245,
        "chapter": 27,
        "verse": 87,
        "arabic_text": "وَيَوۡمَ يُنفَخُ فِي ٱلصُّورِ فَفَزِعَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۚ وَكُلٌّ أَتَوۡهُ دَٰخِرِينَ",
        "phonetic": "27.87 Wa Yawma Yunfakhu Fī Aş-Şūri Fafazi`a Man Fī As-Samāwāti Wa Man Fī Al-'Arđi 'Illā Man Shā'a Allāhu Wa Kullun 'Atawhu Dākhirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [warn of] the Day the Horn will be blown, and whoever is in the heavens and whoever is on the earth will be terrified except whom Allāh wills. And all will come to Him humbled.",
            "english_hilali_khan": "And (remember) the Day on which the Trumpet will be blown - and all who are in the heavens and all who are on the earth, will be terrified except him whom Allâh will (exempt). And all shall come to Him, humbled.",
            "english_rwwad": "And [beware of] the Day when the Trumpet will be blown, and all those who are in the heavens and on earth will be horrified except whom Allah wills, and all will come to Him, fully humbled."
        }
    },
    {
        "id": 3246,
        "chapter": 27,
        "verse": 88,
        "arabic_text": "وَتَرَى ٱلۡجِبَالَ تَحۡسَبُهَا جَامِدَةٗ وَهِيَ تَمُرُّ مَرَّ ٱلسَّحَابِۚ صُنۡعَ ٱللَّهِ ٱلَّذِيٓ أَتۡقَنَ كُلَّ شَيۡءٍۚ إِنَّهُۥ خَبِيرُۢ بِمَا تَفۡعَلُونَ",
        "phonetic": "27.88 Wa Tará Al-Jibāla Taĥsabuhā Jāmidatan Wa Hiya Tamurru Marra As-Saĥābi Şun`a Allāhi Al-Ladhī 'Atqana Kulla Shay'in 'Innahu Khabīrun Bimā Taf`alūna",
        "footnotes": {
            "english_saheeh": "[1089]- Or \"solid and rigid.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you see the mountains, thinking them motionless,[1089] while they will pass as the passing of clouds. [It is] the work of Allāh, who perfected all things. Indeed, He is Aware of that which you do.",
            "english_hilali_khan": "And you will see the mountains and think them solid, but they shall pass away as the passing away of the clouds. The Work of Allâh, Who perfected all things, verily He is Well-Acquainted with what you do.",
            "english_rwwad": "You will see the mountains, thinking them firmly fixed, but they will be moving like clouds – such is the design of Allah, Who has perfected everything. Indeed, He is All-Aware of what you do."
        }
    },
    {
        "id": 3247,
        "chapter": 27,
        "verse": 89,
        "arabic_text": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَا وَهُم مِّن فَزَعٖ يَوۡمَئِذٍ ءَامِنُونَ",
        "phonetic": "27.89 Man Jā'a Bil-Ĥasanati Falahu Khayrun Minhā Wa Hum Min Faza`in Yawma'idhin 'Āminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever comes [at Judgement] with a good deed will have better than it, and they, from the terror of that Day, will be safe.",
            "english_hilali_khan": "Whoever brings a good deed (i.e. Belief in the Oneness of Allâh along with every deed of righteousness), will have better than its worth; and they will be safe from the terror on that Day.",
            "english_rwwad": "Whoever comes with a good deed will be rewarded with better than it, and they will be safe from the horror of that Day."
        }
    },
    {
        "id": 3248,
        "chapter": 27,
        "verse": 90,
        "arabic_text": "وَمَن جَآءَ بِٱلسَّيِّئَةِ فَكُبَّتۡ وُجُوهُهُمۡ فِي ٱلنَّارِ هَلۡ تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "27.90 Wa Man Jā'a Bis-Sayyi'ati Fakubbat Wujūhuhum Fī An-Nāri Hal Tujzawna 'Illā Mā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[1090]- Without having repented.  It may refer generally to any sin or more specifically to association of another with Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whoever comes with an evil deed[1090] - their faces will be overturned into the Fire, [and it will be said], \"Are you recompensed except for what you used to do?\"",
            "english_hilali_khan": "And whoever brings an evil deed (i.e. Shirk - polytheism, disbelief in the Oneness of Allâh and every evil sinful deed), they will be cast down (prone) on their faces in the Fire. (And it will be said to them) \"Are you being recompensed anything except what you used to do?\"",
            "english_rwwad": "But whoever comes with an evil deed will be thrown on their faces in the Fire. Are you recompensed except for what you used to do?"
        }
    },
    {
        "id": 3249,
        "chapter": 27,
        "verse": 91,
        "arabic_text": "إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ رَبَّ هَٰذِهِ ٱلۡبَلۡدَةِ ٱلَّذِي حَرَّمَهَا وَلَهُۥ كُلُّ شَيۡءٖۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِينَ",
        "phonetic": "27.91 'Innamā 'Umirtu 'An 'A`buda Rabba Hadhihi Al-Baldati Al-Ladhī Ĥarramahā Wa Lahu Kullu Shay'in Wa 'Umirtu 'An 'Akūna Mina Al-Muslimīna",
        "footnotes": {
            "english_saheeh": "[1091]- Or region, meaning Makkah and its surroundings.",
            "english_hilali_khan": "(V.27:91)\na) Narrated Ibn ‘Abbâs رضي الله عنهما : On the day of the conquest of Makkah, Allâh’s Messenger صلى الله عليه وسلم said: \"Allâh has made this town a sanctuary. Its thorny bushes should not be cut, its game should not be chased, and its fallen things should not be picked up except by one who would announce them publicly.\" (Sahih Al-Bukhari, Vol.2, Hadîth No.657).\nb) See the footnote of (V.2:191).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Say, O Muḥammad], \"I have only been commanded to worship the Lord of this city,[1091] who made it sacred and to whom [belongs] all things. And I am commanded to be of the Muslims [i.e., those who submit to Allāh].",
            "english_hilali_khan": "I (Muhammad صلى الله عليه وسلم) have been commanded only to worship the Lord of this city (Makkah), Who has sanctified it and to Whom belongs everything. And I am commanded to be from among the Muslims (those who submit to Allâh in Islâm).[1]",
            "english_rwwad": "Say, “I have been commanded only to worship the Lord of this city [of Makkah] Who made it sacred and to Whom belongs all things. And I am commanded to be one of those who submit to Allah [in Islam],"
        }
    },
    {
        "id": 3250,
        "chapter": 27,
        "verse": 92,
        "arabic_text": "وَأَنۡ أَتۡلُوَاْ ٱلۡقُرۡءَانَۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَقُلۡ إِنَّمَآ أَنَا۠ مِنَ ٱلۡمُنذِرِينَ",
        "phonetic": "27.92 Wa 'An 'Atluwa Al-Qur'āna Famani Ahtadá Fa'innamā Yahtadī Linafsihi Wa Man Đalla Faqul 'Innamā 'Anā Mina Al-Mundhirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to recite the Qur’ān.\" And whoever is guided is only guided for [the benefit of] himself; and whoever strays - say, \"I am only [one] of the warners.\"",
            "english_hilali_khan": "And that I should recite the Qur’ân, then whosoever receives guidance, receives it for the good of his ownself; and whosoever goes astray, say (to him): \"I am only one of the warners.\"",
            "english_rwwad": "and to recite the Qur’an.” Then whoever chooses guidance, it is only for his own good; but whoever chooses to go astray, say [O Prophet], “I am only one of the warners.”"
        }
    },
    {
        "id": 3251,
        "chapter": 27,
        "verse": 93,
        "arabic_text": "وَقُلِ ٱلۡحَمۡدُ لِلَّهِ سَيُرِيكُمۡ ءَايَٰتِهِۦ فَتَعۡرِفُونَهَاۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ",
        "phonetic": "27.93 Wa Quli Al-Ĥamdu Lillāhi Sayurīkum 'Āyātihi Fata`rifūnahā Wa Mā Rabbuka Bighāfilin `Ammā Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And say, \"[All] praise is [due] to Allāh. He will show you His signs, and you will recognize them. And your Lord is not unaware of what you do.\"",
            "english_hilali_khan": "And say [(O Muhammad صلى الله عليه وسلم) to these polytheists and pagans.]: \"All the praises and thanks be to Allâh. He will show you His Ayât (signs, in yourselves, and in the universe or punishments), and you shall recognise them. And your Lord is not unaware of what you do.\"",
            "english_rwwad": "And say, “All praise is for Allah. He will show you His signs, then you will acknowledge them. Your Lord is not unaware of what you do.”"
        }
    }
]