[
    {
        "id": 3252,
        "chapter": 28,
        "verse": 1,
        "arabic_text": "طسٓمٓ",
        "phonetic": "28.1 Ţā-Sīn-Mīm",
        "footnotes": {
            "english_saheeh": "[1093]- See footnote to 2:1.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Ṭā, Seen, Meem.[1093]",
            "english_hilali_khan": "Tâ-Sîn-Mîm",
            "english_rwwad": "Tā Sīn Mīm."
        }
    },
    {
        "id": 3253,
        "chapter": 28,
        "verse": 2,
        "arabic_text": "تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ",
        "phonetic": "28.2 Tilka 'Āyātu Al-Kitābi Al-Mubīni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "These are verses of the clear Book.",
            "english_hilali_khan": "These are the Verses of the manifest Book (that makes clear truth from falsehood, good from evil).",
            "english_rwwad": "These are the verses of the clear Book."
        }
    },
    {
        "id": 3254,
        "chapter": 28,
        "verse": 3,
        "arabic_text": "نَتۡلُواْ عَلَيۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "28.3 Natlū `Alayka Min Naba'i Mūsá Wa Fir`awna Bil-Ĥaqqi Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We recite to you from the news of Moses and Pharaoh in truth for a people who believe.",
            "english_hilali_khan": "We recite to you some of the news of Mûsâ (Moses) and Fir‘aun (Pharaoh) in truth, for a people who believe (in this Qur’ân, and in the Oneness of Allâh).",
            "english_rwwad": "We recount to you part of the story of Moses and Pharaoh in truth for people who believe."
        }
    },
    {
        "id": 3255,
        "chapter": 28,
        "verse": 4,
        "arabic_text": "إِنَّ فِرۡعَوۡنَ عَلَا فِي ٱلۡأَرۡضِ وَجَعَلَ أَهۡلَهَا شِيَعٗا يَسۡتَضۡعِفُ طَآئِفَةٗ مِّنۡهُمۡ يُذَبِّحُ أَبۡنَآءَهُمۡ وَيَسۡتَحۡيِۦ نِسَآءَهُمۡۚ إِنَّهُۥ كَانَ مِنَ ٱلۡمُفۡسِدِينَ",
        "phonetic": "28.4 'Inna Fir`awna `Alā Fī Al-'Arđi Wa Ja`ala 'Ahlahā Shiya`āan Yastađ`ifu Ţā'ifatan Minhum Yudhabbiĥu 'Abnā'ahum Wa Yastaĥyī Nisā'ahum 'Innahu Kāna Mina Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Pharaoh exalted himself in the land and made its people into factions, oppressing a sector among them, slaughtering their [newborn] sons and keeping their females alive. Indeed, he was of the corrupters.",
            "english_hilali_khan": "Verily, Fir‘aun (Pharaoh) exalted himself in the land and made its people sects, weakening (oppressing) a group (i.e. Children of Israel) among them: killing their sons, and letting their females live. Verily, he was of the Mufsidûn(i.e. those who commit great sins and crimes, oppressors, tyrants).",
            "english_rwwad": "Indeed, Pharaoh arrogantly elevated himself in the land and divided its people into different factions; oppressing one group of them, slaughtering their sons and sparing their women alive. He was truly one of those who spread corruption."
        }
    },
    {
        "id": 3256,
        "chapter": 28,
        "verse": 5,
        "arabic_text": "وَنُرِيدُ أَن نَّمُنَّ عَلَى ٱلَّذِينَ ٱسۡتُضۡعِفُواْ فِي ٱلۡأَرۡضِ وَنَجۡعَلَهُمۡ أَئِمَّةٗ وَنَجۡعَلَهُمُ ٱلۡوَٰرِثِينَ",
        "phonetic": "28.5 Wa Nurīdu 'An Namunna `Alá Al-Ladhīna Astuđ`ifū Fī Al-'Arđi Wa Naj`alahum 'A'immatan Wa Naj`alahumu Al-Wārithīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We wanted to confer favor upon those who were oppressed in the land and make them leaders and make them inheritors",
            "english_hilali_khan": "And We wished to do a favour to those who were weak (and oppressed) in the land, and to make them rulers and to make them the inheritors,",
            "english_rwwad": "But We wanted to bestow favor upon those who were oppressed in the land, and make them leaders and inheritors [of the land],"
        }
    },
    {
        "id": 3257,
        "chapter": 28,
        "verse": 6,
        "arabic_text": "وَنُمَكِّنَ لَهُمۡ فِي ٱلۡأَرۡضِ وَنُرِيَ فِرۡعَوۡنَ وَهَٰمَٰنَ وَجُنُودَهُمَا مِنۡهُم مَّا كَانُواْ يَحۡذَرُونَ",
        "phonetic": "28.6 Wa Numakkina Lahum Fī Al-'Arđi Wa Nuriya Fir`awna Wa Hāmāna Wa Junūdahumā Minhum Mā Kānū Yaĥdharūna",
        "footnotes": {
            "english_saheeh": "[1094]- By means of those whom they had oppressed and enslaved.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And establish them in the land and show Pharaoh and [his minister] Hāmān and their soldiers through them[1094] that which they had feared.",
            "english_hilali_khan": "And to establish them in the land, and We let Fir‘aun (Pharaoh) and Hâmân and their hosts receive from them that which they feared.",
            "english_rwwad": "and to establish them in the land, and to show Pharaoh, Hamān and their soldiers that which they feared."
        }
    },
    {
        "id": 3258,
        "chapter": 28,
        "verse": 7,
        "arabic_text": "وَأَوۡحَيۡنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنۡ أَرۡضِعِيهِۖ فَإِذَا خِفۡتِ عَلَيۡهِ فَأَلۡقِيهِ فِي ٱلۡيَمِّ وَلَا تَخَافِي وَلَا تَحۡزَنِيٓۖ إِنَّا رَآدُّوهُ إِلَيۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِينَ",
        "phonetic": "28.7 Wa 'Awĥaynā 'Ilá 'Ummi Mūsá 'An 'Arđi`īhi Fa'idhā Khifti `Alayhi Fa'alqīhi Fī Al-Yammi Wa Lā Takhāfī Wa Lā Taĥzanī 'Innā Rāddūhu 'Ilayki Wa Jā`ilūhu Mina Al-Mursalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We inspired to the mother of Moses, \"Suckle him; but when you fear for him, cast him into the river and do not fear and do not grieve. Indeed, We will return him to you and will make him [one] of the messengers.\"",
            "english_hilali_khan": "And We inspired the mother of Mûsâ (Moses): (telling): \"Suckle him [Mûsâ (Moses)], but when you fear for him, then cast him into the river and fear not, nor grieve. Verily, We shall bring him back to you, and shall make him one of (Our) Messengers.\" [Tafsir Al-Qurtubi]",
            "english_rwwad": "We inspired the mother of Moses, “Suckle him; but when you fear for him, cast him into the river, and do not fear or grieve. We will surely return him to you, and will make him one of the messengers.”"
        }
    },
    {
        "id": 3259,
        "chapter": 28,
        "verse": 8,
        "arabic_text": "فَٱلۡتَقَطَهُۥٓ ءَالُ فِرۡعَوۡنَ لِيَكُونَ لَهُمۡ عَدُوّٗا وَحَزَنًاۗ إِنَّ فِرۡعَوۡنَ وَهَٰمَٰنَ وَجُنُودَهُمَا كَانُواْ خَٰطِـِٔينَ",
        "phonetic": "28.8 Fāltaqaţahu 'Ālu Fir`awna Liyakūna Lahum `Adūwāan Wa Ĥazanāan 'Inna Fir`awna Wa Hāmāna Wa Junūdahumā Kānū Khāţi'īna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the family of Pharaoh picked him up [out of the river] so that he would become to them an enemy and a [cause of] grief. Indeed, Pharaoh and Hāmān and their soldiers were deliberate sinners.",
            "english_hilali_khan": "Then the household of Fir‘aun (Pharaoh) picked him up, that he might become for them an enemy and a (cause of) grief. Verily, Fir‘aun (Pharaoh), Hâmân and their hosts were sinners.",
            "english_rwwad": "Then the household of Pharaoh picked him up, so that he may become an enemy to them and a source of grief. Indeed, Pharaoh, Hāmān and their soldiers were wrongdoers."
        }
    },
    {
        "id": 3260,
        "chapter": 28,
        "verse": 9,
        "arabic_text": "وَقَالَتِ ٱمۡرَأَتُ فِرۡعَوۡنَ قُرَّتُ عَيۡنٖ لِّي وَلَكَۖ لَا تَقۡتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوۡ نَتَّخِذَهُۥ وَلَدٗا وَهُمۡ لَا يَشۡعُرُونَ",
        "phonetic": "28.9 Wa Qālat Amra'atu Fir`awna Qurratu `Aynin Lī Wa Laka Lā Taqtulūhu `Asá 'An Yanfa`anā 'Aw Nattakhidhahu Waladāan Wa Hum Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "[1095]- What would be the result of that.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the wife of Pharaoh said, \"[He will be] a comfort of the eye [i.e., pleasure] for me and for you. Do not kill him; perhaps he may benefit us, or we may adopt him as a son.\" And they perceived not.[1095]",
            "english_hilali_khan": "And the wife of Fir‘aun (Pharaoh) said: \"A comfort of the eye for me and for you. Kill him not, perhaps he may be of benefit to us, or we may adopt him as a son.\" And they perceived not (the result of that).",
            "english_rwwad": "Pharaoh’s wife said, “He is a source of joy for me and you. Do not kill him; he will probably benefit us, or we may adopt him as a son.” They were unaware [of the consequences]."
        }
    },
    {
        "id": 3261,
        "chapter": 28,
        "verse": 10,
        "arabic_text": "وَأَصۡبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَٰرِغًاۖ إِن كَادَتۡ لَتُبۡدِي بِهِۦ لَوۡلَآ أَن رَّبَطۡنَا عَلَىٰ قَلۡبِهَا لِتَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "28.10 Wa 'Aşbaĥa Fu'uādu 'Ummi Mūsá Fārighāan 'In Kādat Latubdī Bihi Lawlā 'An Rabaţnā `Alá Qalbihā Litakūna Mina Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the heart of Moses' mother became empty [of all else]. She was about to disclose [the matter concerning] him had We not bound fast her heart that she would be of the believers.",
            "english_hilali_khan": "And the heart of the mother of Mûsâ (Moses) became empty [from every thought, except the thought of Mûsâ (Moses)]. She was very near to disclose his (case, i.e. the child is her son), had We not strengthened her heart (with Faith), so that she might remain as one of the believers.",
            "english_rwwad": "The heart of Moses’ mother became restless; she was about to disclose it, had We not reassured her heart so that she would maintain her faith [in Allah’s promise]."
        }
    },
    {
        "id": 3262,
        "chapter": 28,
        "verse": 11,
        "arabic_text": "وَقَالَتۡ لِأُخۡتِهِۦ قُصِّيهِۖ فَبَصُرَتۡ بِهِۦ عَن جُنُبٖ وَهُمۡ لَا يَشۡعُرُونَ",
        "phonetic": "28.11 Wa Qālat Li'khtihi Quşşīhi Fabaşurat Bihi `An Junubin Wa Hum Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And she said to his sister, \"Follow him\"; so she watched him from a distance while they perceived not.",
            "english_hilali_khan": "And she said to his [Mûsâ’s (Moses)] sister: \"Follow him.\" So she (his sister) watched him from a far place secretly, while they perceived not.",
            "english_rwwad": "She said to his sister, “Keep track of him.” So she watched him from a distance, without them noticing."
        }
    },
    {
        "id": 3263,
        "chapter": 28,
        "verse": 12,
        "arabic_text": "۞ وَحَرَّمۡنَا عَلَيۡهِ ٱلۡمَرَاضِعَ مِن قَبۡلُ فَقَالَتۡ هَلۡ أَدُلُّكُمۡ عَلَىٰٓ أَهۡلِ بَيۡتٖ يَكۡفُلُونَهُۥ لَكُمۡ وَهُمۡ لَهُۥ نَٰصِحُونَ",
        "phonetic": "28.12 Wa Ĥarramnā `Alayhi Al-Marāđi`a Min Qablu Faqālat Hal 'Adullukum `Alá 'Ahli Baytin Yakfulūnahu Lakum Wa Hum Lahu Nāşiĥūna",
        "footnotes": {
            "english_saheeh": "[1096]- Prior to that, Moses had refused to nurse from any other woman.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had prevented from him [all] wet nurses before,[1096] so she said, \"Shall I direct you to a household that will be responsible for him for you while they are to him [for his upbringing] sincere?\"",
            "english_hilali_khan": "And We had already forbidden (other) foster suckling mothers for him, until she (his sister came up and) said: \"Shall I direct you to a household who will rear him for you, and look after him in a good manner?\"",
            "english_rwwad": "We had already forbidden for him all wet-nurses, then she said, “Shall I direct you to a household who will nurse him for you and take good care of him?”"
        }
    },
    {
        "id": 3264,
        "chapter": 28,
        "verse": 13,
        "arabic_text": "فَرَدَدۡنَٰهُ إِلَىٰٓ أُمِّهِۦ كَيۡ تَقَرَّ عَيۡنُهَا وَلَا تَحۡزَنَ وَلِتَعۡلَمَ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "28.13 Faradadnāhu 'Ilá 'Ummihi Kay Taqarra `Aynuhā Wa Lā Taĥzana Wa Lita`lama 'Anna Wa`da Allāhi Ĥaqqun Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We restored him to his mother that she might be content and not grieve and that she would know that the promise of Allāh is true. But most of them [i.e., the people] do not know.",
            "english_hilali_khan": "So did We restore him to his mother, that her eye might be comforted, and that she might not grieve, and that she might know that the Promise of Allâh is true. But most of them know not.",
            "english_rwwad": "Then We returned him to his mother, so that she would be comforted and not grieve, and so that she would know that Allah’s promise is true. Yet most of them do not know."
        }
    },
    {
        "id": 3265,
        "chapter": 28,
        "verse": 14,
        "arabic_text": "وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسۡتَوَىٰٓ ءَاتَيۡنَٰهُ حُكۡمٗا وَعِلۡمٗاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُحۡسِنِينَ",
        "phonetic": "28.14 Wa Lammā Balagha 'Ashuddahu Wa Astawá 'Ātaynāhu Ĥukmāan Wa `Ilmāan Wa Kadhalika Najzī Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he attained his full strength and was [mentally] mature, We bestowed upon him judgement and knowledge. And thus do We reward the doers of good.",
            "english_hilali_khan": "And when he attained his full strength, and was perfect (in manhood), We bestowed on him Hukm (Prophethood and right judgement of the affairs) and religious knowledge [of the religion of his forefathers i.e. Islâmic Monotheism]. And thus do We reward the Muhsinûn (i.e. good doers. See the footnote of V.9:120).",
            "english_rwwad": "When he reached his full strength and maturity, We gave him wisdom and knowledge. This is how We reward those who do good."
        }
    },
    {
        "id": 3266,
        "chapter": 28,
        "verse": 15,
        "arabic_text": "وَدَخَلَ ٱلۡمَدِينَةَ عَلَىٰ حِينِ غَفۡلَةٖ مِّنۡ أَهۡلِهَا فَوَجَدَ فِيهَا رَجُلَيۡنِ يَقۡتَتِلَانِ هَٰذَا مِن شِيعَتِهِۦ وَهَٰذَا مِنۡ عَدُوِّهِۦۖ فَٱسۡتَغَٰثَهُ ٱلَّذِي مِن شِيعَتِهِۦ عَلَى ٱلَّذِي مِنۡ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَيۡهِۖ قَالَ هَٰذَا مِنۡ عَمَلِ ٱلشَّيۡطَٰنِۖ إِنَّهُۥ عَدُوّٞ مُّضِلّٞ مُّبِينٞ",
        "phonetic": "28.15 Wa Dakhala Al-Madīnata `Alá Ĥīni Ghaflatin Min 'Ahlihā Fawajada Fīhā Rajulayni Yaqtatilāni Hādhā Min Shī`atihi Wa Hadhā Min `Adūwihi Fāstaghāthahu Al-Ladhī Min Shī`atihi `Alá Al-Ladhī Min `Adūwihi Fawakazahu Mūsá Faqađá `Alayhi Qāla Hādhā Min `Amali Ash-Shayţāni 'Innahu `Adūwun Muđillun Mubīnun",
        "footnotes": {
            "english_saheeh": "[1097]- i.e., during the noon period of rest.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he entered the city at a time of inattention by its people[1097] and found therein two men fighting: one from his faction and one from among his enemy. And the one from his faction called for help to him against the one from his enemy, so Moses struck him and [unintentionally] killed him. [Moses] said, \"This is from the work of Satan. Indeed, he is a manifest, misleading enemy.\"",
            "english_hilali_khan": "And he entered the city at a time of unawareness of its people: and he found there two men fighting, - one of his party (his religion - from the Children of Israel), and the other of his foes. The man of his (own) party asked him for help against his foe, so Mûsâ (Moses) struck him with his fist and killed him. He said: \"This is of Shaitan’s (Satan) doing: verily, he is a plain misleading enemy.\"",
            "english_rwwad": "Once he entered the city unnoticed by its people, and found two men fighting: one of his own people and the other of his enemies. The one from his own people called him for help against his enemy, so Moses struck him with his fist, causing his death. Moses said, “This is of Satan’s work; he is a sworn enemy who mislead people.”"
        }
    },
    {
        "id": 3267,
        "chapter": 28,
        "verse": 16,
        "arabic_text": "قَالَ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي فَٱغۡفِرۡ لِي فَغَفَرَ لَهُۥٓۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ",
        "phonetic": "28.16 Qāla Rabbi 'Innī Žalamtu Nafsī Fāghfir Lī Faghafara Lahu 'Innahu Huwa Al-Ghafūru Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"My Lord, indeed I have wronged myself, so forgive me,\" and He forgave him. Indeed, He is the Forgiving, the Merciful.",
            "english_hilali_khan": "He said: \"My Lord! Verily, I have wronged myself, so forgive me.\" Then He forgave him. Verily, He is the Oft-Forgiving, the Most Merciful.",
            "english_rwwad": "He said, “My Lord, I have wronged myself, so forgive me,” Then He forgave him, for He is indeed the All-Forgiving, the Most Merciful."
        }
    },
    {
        "id": 3268,
        "chapter": 28,
        "verse": 17,
        "arabic_text": "قَالَ رَبِّ بِمَآ أَنۡعَمۡتَ عَلَيَّ فَلَنۡ أَكُونَ ظَهِيرٗا لِّلۡمُجۡرِمِينَ",
        "phonetic": "28.17 Qāla Rabbi Bimā 'An`amta `Alayya Falan 'Akūna Žahīrāan Lilmujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals.\"",
            "english_hilali_khan": "He said: \"My Lord! For that with which You have favoured me, I will never more be a helper of the Mujrimûn (criminals, disbelievers, polytheists, sinners)!\"",
            "english_rwwad": "He said, “My Lord, because of the blessings that You have bestowed upon me, I will never be a supporter to the wicked.”"
        }
    },
    {
        "id": 3269,
        "chapter": 28,
        "verse": 18,
        "arabic_text": "فَأَصۡبَحَ فِي ٱلۡمَدِينَةِ خَآئِفٗا يَتَرَقَّبُ فَإِذَا ٱلَّذِي ٱسۡتَنصَرَهُۥ بِٱلۡأَمۡسِ يَسۡتَصۡرِخُهُۥۚ قَالَ لَهُۥ مُوسَىٰٓ إِنَّكَ لَغَوِيّٞ مُّبِينٞ",
        "phonetic": "28.18 Fa'aşbaĥa Fī Al-Madīnati Khā'ifāan Yataraqqabu Fa'idhā Al-Ladhī Astanşarahu Bil-'Amsi Yastaşrikhuhu Qāla Lahu Mūsá 'Innaka Laghawīyun Mubīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he became inside the city fearful and anticipating [exposure], when suddenly the one who sought his help the previous day cried out to him [once again]. Moses said to him, \"Indeed, you are an evident, [persistent] deviator.\"",
            "english_hilali_khan": "So he became afraid, looking about in the city (waiting as to what will be the result of his crime of killing), when behold, the man who had sought his help the day before, called for his help (again). Mûsâ (Moses) said to him: \"Verily, you are a plain misleader!\"",
            "english_rwwad": "Then he became fearful and vigilant in the city; suddenly the one who sought his help the day before cried out to him again for help. Moses said to him, “You are clearly a troublemaker.”"
        }
    },
    {
        "id": 3270,
        "chapter": 28,
        "verse": 19,
        "arabic_text": "فَلَمَّآ أَنۡ أَرَادَ أَن يَبۡطِشَ بِٱلَّذِي هُوَ عَدُوّٞ لَّهُمَا قَالَ يَٰمُوسَىٰٓ أَتُرِيدُ أَن تَقۡتُلَنِي كَمَا قَتَلۡتَ نَفۡسَۢا بِٱلۡأَمۡسِۖ إِن تُرِيدُ إِلَّآ أَن تَكُونَ جَبَّارٗا فِي ٱلۡأَرۡضِ وَمَا تُرِيدُ أَن تَكُونَ مِنَ ٱلۡمُصۡلِحِينَ",
        "phonetic": "28.19 Falammā 'An 'Arāda 'An Yabţisha Bial-Ladhī Huwa `Adūwun Lahumā Qāla Yā Mūsá 'Aturīdu 'An Taqtulanī Kamā Qatalta Nafsāan Bil-'Amsi 'In Turīdu 'Illā 'An Takūna Jabbārāan Fī Al-'Arđi Wa Mā Turīdu 'An Takūna Mina Al-Muşliĥīna",
        "footnotes": {
            "english_saheeh": "[1098]- i.e., the Israelite, thinking that Moses meant to strike him.  Some commentators have attributed the words to the Copt; however, the Israelite was the only one who knew of the previous occurrence.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he wanted to strike the one who was an enemy to both of them, he[1098] said, \"O Moses, do you intend to kill me as you killed someone yesterday? You only want to be a tyrant in the land and do not want to be of the amenders.\"",
            "english_hilali_khan": "Then when he decided to seize the man who was an enemy to both of them, the man said: \"O Mûsâ (Moses)! Is it your intention to kill me as you killed a man yesterday? Your aim is nothing but to become a tyrant in the land, and not to be one of those who do right.\"",
            "english_rwwad": "When he was about to strike the one who was an enemy to both of them, he said, “O Moses, do you want to kill me as you killed that person yesterday? You only want to be a tyrant in the land, and you do not want to be one of those who put things right!”"
        }
    },
    {
        "id": 3271,
        "chapter": 28,
        "verse": 20,
        "arabic_text": "وَجَآءَ رَجُلٞ مِّنۡ أَقۡصَا ٱلۡمَدِينَةِ يَسۡعَىٰ قَالَ يَٰمُوسَىٰٓ إِنَّ ٱلۡمَلَأَ يَأۡتَمِرُونَ بِكَ لِيَقۡتُلُوكَ فَٱخۡرُجۡ إِنِّي لَكَ مِنَ ٱلنَّٰصِحِينَ",
        "phonetic": "28.20 Wa Jā'a Rajulun Min 'Aqşá Al-Madīnati Yas`á Qāla Yā Mūsá 'Inna Al-Mala'a Ya'tamirūna Bika Liyaqtulūka Fākhruj 'Innī Laka Mina An-Nāşiĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And a man came from the farthest end of the city, running. He said, \"O Moses, indeed the eminent ones are conferring over you [intending] to kill you, so leave [the city]; indeed, I am to you of the sincere advisors.\"",
            "english_hilali_khan": "And there came a man running, from the farthest end of the city. He said: \"O Mûsâ (Moses)! Verily, the chiefs are taking counsel together about you, to kill you, so escape. Truly, I am one of the good advisers to you.\"",
            "english_rwwad": "Then there came a man rushing from the farthest end of the city, and said, “O Moses, the chiefs are conspiring to kill you, so leave. I am giving you a sincere advice.”"
        }
    },
    {
        "id": 3272,
        "chapter": 28,
        "verse": 21,
        "arabic_text": "فَخَرَجَ مِنۡهَا خَآئِفٗا يَتَرَقَّبُۖ قَالَ رَبِّ نَجِّنِي مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
        "phonetic": "28.21 Fakharaja Minhā Khā'ifāan Yataraqqabu Qāla Rabbi Najjinī Mina Al-Qawmi Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he left it, fearful and anticipating [apprehension]. He said, \"My Lord, save me from the wrongdoing people.\"",
            "english_hilali_khan": "So he escaped from there, looking about in a state of fear. He said: \"My Lord! Save me from the people who are Zâlimûn (polytheists and wrong-doers)!\"",
            "english_rwwad": "So he left the city, fearful and vigilant. He said, “My Lord, save me from the wrongdoing people.”"
        }
    },
    {
        "id": 3273,
        "chapter": 28,
        "verse": 22,
        "arabic_text": "وَلَمَّا تَوَجَّهَ تِلۡقَآءَ مَدۡيَنَ قَالَ عَسَىٰ رَبِّيٓ أَن يَهۡدِيَنِي سَوَآءَ ٱلسَّبِيلِ",
        "phonetic": "28.22 Wa Lammā Tawajjaha Tilqā'a Madyana Qāla `Asá Rabbī 'An Yahdiyanī Sawā'a As-Sabīl",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he directed himself toward Madyan, he said, \"Perhaps my Lord will guide me to the sound way.\"",
            "english_hilali_khan": "And when he went towards (the land of) Madyan (Midian), he said: \"It may be that my Lord guides me to the Right Way.\"",
            "english_rwwad": "When he headed towards Midian, he said, “My Lord will surely guide me to a straight way.”"
        }
    },
    {
        "id": 3274,
        "chapter": 28,
        "verse": 23,
        "arabic_text": "وَلَمَّا وَرَدَ مَآءَ مَدۡيَنَ وَجَدَ عَلَيۡهِ أُمَّةٗ مِّنَ ٱلنَّاسِ يَسۡقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمۡرَأَتَيۡنِ تَذُودَانِۖ قَالَ مَا خَطۡبُكُمَاۖ قَالَتَا لَا نَسۡقِي حَتَّىٰ يُصۡدِرَ ٱلرِّعَآءُۖ وَأَبُونَا شَيۡخٞ كَبِيرٞ",
        "phonetic": "28.23 Wa Lammā Warada Mā'a Madyana Wajada `Alayhi 'Ummatan Mina An-Nāsi Yasqūna Wa Wajada Min Dūnihimu Amra'tayni Tadhūdāni Qāla Mā Khaţbukumā Qālatā Lā Nasqī Ĥattá Yuşdira Ar-Ri`ā'u Wa 'Abūnā Shaykhun Kabīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he came to the water [i.e., well] of Madyan, he found there a crowd of people watering [their flocks], and he found aside from them two women holding back [their flocks]. He said, \"What is your circumstance?\" They said, \"We do not water until the shepherds dispatch [their flocks]; and our father is an old man.\"",
            "english_hilali_khan": "And when he arrived at the water (a well) of Madyan (Midian) he found there a group of men watering (their flocks), and besides them he found two women who were keeping back (their flocks). He said: \"What is the matter with you?\" They said: \"We cannot water (our flocks) until the shepherds take (their flocks). And our father is a very old man.\"",
            "english_rwwad": "When he arrived at the well of Midian, he found a crowd of people watering [their flocks] and found apart from them two women holding [their flocks] back. He said, “What is the matter with you?” They said, “We cannot water [them] until the shepherds take [their flocks] away, and our father is a very old man.”"
        }
    },
    {
        "id": 3275,
        "chapter": 28,
        "verse": 24,
        "arabic_text": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَآ أَنزَلۡتَ إِلَيَّ مِنۡ خَيۡرٖ فَقِيرٞ",
        "phonetic": "28.24 Fasaqá Lahumā Thumma Tawallá 'Ilá Až-Žilli Faqāla Rabbi 'Innī Limā 'Anzalta 'Ilayya Min Khayrin Faqīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he watered [their flocks] for them; then he went back to the shade and said, \"My Lord, indeed I am, for whatever good You would send down to me, in need.\"",
            "english_hilali_khan": "So he watered (their flocks) for them, then he turned back to shade, and said: \"My Lord! truly, I am in need of whatever good that You bestow on me!\"",
            "english_rwwad": "So he watered [their flocks] for them, then he turned to the shade and said, “My Lord, I am desperately in need of whatever good You may send down to me.”"
        }
    },
    {
        "id": 3276,
        "chapter": 28,
        "verse": 25,
        "arabic_text": "فَجَآءَتۡهُ إِحۡدَىٰهُمَا تَمۡشِي عَلَى ٱسۡتِحۡيَآءٖ قَالَتۡ إِنَّ أَبِي يَدۡعُوكَ لِيَجۡزِيَكَ أَجۡرَ مَا سَقَيۡتَ لَنَاۚ فَلَمَّا جَآءَهُۥ وَقَصَّ عَلَيۡهِ ٱلۡقَصَصَ قَالَ لَا تَخَفۡۖ نَجَوۡتَ مِنَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
        "phonetic": "28.25 Fajā'at/hu 'Iĥdāhumā Tamshī `Alá Astiĥyā'in Qālat 'Inna 'Abī Yad`ūka Liyajziyaka 'Ajra Mā Saqayta Lanā Falammā Jā'ahu Wa Qaşşa `Alayhi Al-Qaşaşa Qāla Lā Takhaf Najawta Mina Al-Qawmi Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "[1099]- Prophet Shuʿayb, the father of the two women.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then one of the two women came to him walking with shyness. She said, \"Indeed, my father invites you that he may reward you for having watered for us.\" So when he came to him[1099] and related to him the story, he said, \"Fear not. You have escaped from the wrongdoing people.\"",
            "english_hilali_khan": "Then there came to him one of the two women, walking shyly. She said: \"Verily, my father calls you that he may reward you for having watered (our flocks) for us.\" So when he came to him and narrated the story, he said: \"Fear you not. You have escaped from the people who are Zâlimûn (polytheists, disbelievers, and wrong-doers).\"",
            "english_rwwad": "Then one of the two women came to him, walking modestly. She said, “My father is inviting you so that he may reward you for watering [our flocks] for us.” When he came to him and told him the whole story, he said, “Have no fear. You are now safe from the wrongdoing people.”"
        }
    },
    {
        "id": 3277,
        "chapter": 28,
        "verse": 26,
        "arabic_text": "قَالَتۡ إِحۡدَىٰهُمَا يَٰٓأَبَتِ ٱسۡتَـٔۡجِرۡهُۖ إِنَّ خَيۡرَ مَنِ ٱسۡتَـٔۡجَرۡتَ ٱلۡقَوِيُّ ٱلۡأَمِينُ",
        "phonetic": "28.26 Qālat 'Iĥdāhumā Yā 'Abati Asta'jirhu 'Inna Khayra Mani Asta'jarta Al-Qawīyu Al-'Amīnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "One of the women said, \"O my father, hire him. Indeed, the best one you can hire is the strong and the trustworthy.\"",
            "english_hilali_khan": "And said one of them (the two women): \"O my father! Hire him! Verily, the best of men for you to hire is the strong, the trustworthy.\"",
            "english_rwwad": "One of the two daughters said, “O dear father, hire him; the best one you can hire is the strong and trustworthy.”"
        }
    },
    {
        "id": 3278,
        "chapter": 28,
        "verse": 27,
        "arabic_text": "قَالَ إِنِّيٓ أُرِيدُ أَنۡ أُنكِحَكَ إِحۡدَى ٱبۡنَتَيَّ هَٰتَيۡنِ عَلَىٰٓ أَن تَأۡجُرَنِي ثَمَٰنِيَ حِجَجٖۖ فَإِنۡ أَتۡمَمۡتَ عَشۡرٗا فَمِنۡ عِندِكَۖ وَمَآ أُرِيدُ أَنۡ أَشُقَّ عَلَيۡكَۚ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰلِحِينَ",
        "phonetic": "28.27 Qāla 'Innī 'Urīdu 'An 'Unkiĥaka 'Iĥdá Abnatayya Hātayni `Alá 'An Ta'juranī Thamāniyata Ĥijajin Fa'in 'Atmamta `Ashrāan Famin `Indika Wa Mā 'Urīdu 'An 'Ashuqqa `Alayka Satajidunī 'In Shā'a Allāhu Mina Aş-Şāliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Indeed, I wish to wed you one of these, my two daughters, on [the condition] that you serve me for eight years; but if you complete ten, it will be [as a favor] from you. And I do not wish to put you in difficulty. You will find me, if Allāh wills, from among the righteous.\"",
            "english_hilali_khan": "He said: \"I intend to wed one of these two daughters of mine to you, on condition that you serve me for eight years; but if you complete ten years, it will be (a favour) from you. But I intend not to place you under a difficulty. If Allâh wills, you will find me one of the righteous.\"",
            "english_rwwad": "He said, “I would like to give you one of these two daughters of mine in marriage, provided that you serve me for eight years; if you complete ten, it will be of your own free will. I do not want to make things difficult for you. You will find me, if Allah wills, from among the righteous.”"
        }
    },
    {
        "id": 3279,
        "chapter": 28,
        "verse": 28,
        "arabic_text": "قَالَ ذَٰلِكَ بَيۡنِي وَبَيۡنَكَۖ أَيَّمَا ٱلۡأَجَلَيۡنِ قَضَيۡتُ فَلَا عُدۡوَٰنَ عَلَيَّۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٞ",
        "phonetic": "28.28 Qāla Dhālika Baynī Wa Baynaka 'Ayyamā Al-'Ajalayni Qađaytu Falā `Udwāna `Alayya Wa Allāhu `Alá Mā Naqūlu Wa Kīlun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"That is [established] between me and you. Whichever of the two terms I complete - there is no injustice to me, and Allāh, over what we say, is Witness.\"",
            "english_hilali_khan": "He [Mûsâ (Moses)] said: \"That (is settled) between me and you: whichever of the two terms I fulfil, there will be no injustice to me, and Allâh is Surety over what we say.\"",
            "english_rwwad": "Moses said, “Let that be the agreement between me and you. Whichever of the two terms I complete, there will be no further obligation on me, and Allah is Witness over what we say.”"
        }
    },
    {
        "id": 3280,
        "chapter": 28,
        "verse": 29,
        "arabic_text": "۞ فَلَمَّا قَضَىٰ مُوسَى ٱلۡأَجَلَ وَسَارَ بِأَهۡلِهِۦٓ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارٗاۖ قَالَ لِأَهۡلِهِ ٱمۡكُثُوٓاْ إِنِّيٓ ءَانَسۡتُ نَارٗا لَّعَلِّيٓ ءَاتِيكُم مِّنۡهَا بِخَبَرٍ أَوۡ جَذۡوَةٖ مِّنَ ٱلنَّارِ لَعَلَّكُمۡ تَصۡطَلُونَ",
        "phonetic": "28.29 Falammā Qađá Mūsá Al-'Ajala Wa Sāra Bi'ahlihi 'Ānasa Min Jānibi Aţ-Ţūri Nārāan Qāla Li'hlihi Amkuthū 'Innī 'Ānastu Nārāan La`allī 'Ātīkum Minhā Bikhabarin 'Aw Jadhwatin Mina An-Nāri La`allakum Taşţalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Moses had completed the term and was traveling with his family, he perceived from the direction of the mount a fire. He said to his family, \"Stay here; indeed, I have perceived a fire. Perhaps I will bring you from there [some] information or burning wood from the fire that you may warm yourselves.\"",
            "english_hilali_khan": "Then, when Mûsâ (Moses) had fulfilled the term, and was travelling with his family, he saw a fire in the direction of Tûr (Mount). He said to his family: \"Wait, I have seen a fire; perhaps I may bring you from there some information, or a burning fire-brand that you may warm yourselves.\"",
            "english_rwwad": "When Moses had completed the term and was traveling with his family, he spotted a fire in the direction of Mount Tūr. He said to his family, “Stay here; I have spotted a fire. Perhaps I will bring you from there some news or a brand of fire so that you may warm yourselves.”"
        }
    },
    {
        "id": 3281,
        "chapter": 28,
        "verse": 30,
        "arabic_text": "فَلَمَّآ أَتَىٰهَا نُودِيَ مِن شَٰطِيِٕ ٱلۡوَادِ ٱلۡأَيۡمَنِ فِي ٱلۡبُقۡعَةِ ٱلۡمُبَٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن يَٰمُوسَىٰٓ إِنِّيٓ أَنَا ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ",
        "phonetic": "28.30 Falammā 'Atāhā Nūdī Min Shāţi'i Al-Wādī Al-'Aymani Fī Al-Buq`ati Al-Mubārakati Mina Ash-Shajarati 'An Yā Mūsá 'Innī 'Anā Allāhu Rabbu Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[1100]- Which was within the fire.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when he came to it, he was called from the right side of the valley in a blessed spot - from the tree,[1100] \"O Moses, indeed I am Allāh, Lord of the worlds.\"",
            "english_hilali_khan": "So when he reached it (the fire), he was called from the right side of the valley, in the blessed place, from the tree: \"O Mûsâ (Moses)! Verily I am Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists)!",
            "english_rwwad": "But when he came to it, he was called from the tree in the sacred ground on the right side of the valley: “O Moses, I am Allah, the Lord of the worlds."
        }
    },
    {
        "id": 3282,
        "chapter": 28,
        "verse": 31,
        "arabic_text": "وَأَنۡ أَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَآنّٞ وَلَّىٰ مُدۡبِرٗا وَلَمۡ يُعَقِّبۡۚ يَٰمُوسَىٰٓ أَقۡبِلۡ وَلَا تَخَفۡۖ إِنَّكَ مِنَ ٱلۡأٓمِنِينَ",
        "phonetic": "28.31 Wa 'An 'Alqi `Aşāka Falammā Ra'āhā Tahtazzu Ka'annahā Jānnun Wallá Mudbirāan Wa Lam Yu`aqqib Yā Mūsá 'Aqbil Wa Lā Takhaf 'Innaka Mina Al-'Āminīna",
        "footnotes": {
            "english_saheeh": "[1101]- Or \"did not look back.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [he was told], \"Throw down your staff.\" But when he saw it writhing as if it was a snake, he turned in flight and did not return.[1101] [Allāh said], \"O Moses, approach and fear not. Indeed, you are of the secure.",
            "english_hilali_khan": "\"And throw your stick!\" But when he saw it moving as if it were a snake, he turned in flight, and looked not back. (It was said:) \"O Mûsâ (Moses)! Draw near, and fear not. Verily, you are of those who are secure.",
            "english_rwwad": "Throw down your staff.” But when he saw it slithering as if it were a snake, he turned and ran away without looking back. [Allah said], “O Moses, come back, and have no fear; you are perfectly safe."
        }
    },
    {
        "id": 3283,
        "chapter": 28,
        "verse": 32,
        "arabic_text": "ٱسۡلُكۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ بَيۡضَآءَ مِنۡ غَيۡرِ سُوٓءٖ وَٱضۡمُمۡ إِلَيۡكَ جَنَاحَكَ مِنَ ٱلرَّهۡبِۖ فَذَٰنِكَ بُرۡهَٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ",
        "phonetic": "28.32 Asluk Yadaka Fī Jaybika Takhruj Bayđā'a Min Ghayri Sū'in Wa Ađmum 'Ilayka Janāĥaka Mina Ar-Rahbi Fadhānika Burhānāni Min Rabbika 'Ilá Fir`awna Wa Mala'ihi 'Innahum Kānū Qawmāan Fāsiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Insert your hand into the opening of your garment; it will come out white, without disease. And draw in your arm close to you [as prevention] from fear, for those are two proofs from your Lord to Pharaoh and his establishment. Indeed, they have been a people defiantly disobedient.\"",
            "english_hilali_khan": "\"Put your hand in your bosom, it will come forth white without a disease; and draw your hand close to your side to be free from the fear (which you suffered from the snake, and also your hand will return to its original state). These are two Burhâns (signs, miracles, evidence, proofs) from your Lord to Fir‘aun (Pharaoh) and his chiefs. Verily, they are the people who are Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "Put your hand into your garment, it will come out shining white without blemish; and draw your arms tight to you to calm your fear. These are two proofs from your Lord to Pharaoh and his chiefs, for they are indeed a rebellious people.”"
        }
    },
    {
        "id": 3284,
        "chapter": 28,
        "verse": 33,
        "arabic_text": "قَالَ رَبِّ إِنِّي قَتَلۡتُ مِنۡهُمۡ نَفۡسٗا فَأَخَافُ أَن يَقۡتُلُونِ",
        "phonetic": "28.33 Qāla Rabbi 'Innī Qataltu Minhum Nafsāan Fa'akhāfu 'An Yaqtulūni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"My Lord, indeed I killed from among them someone, and I fear they will kill me.",
            "english_hilali_khan": "He said: \"My Lord! I have killed a man among them, and I fear that they will kill me.",
            "english_rwwad": "Moses said, “My Lord, I have killed one of their men, and I fear that they may kill me."
        }
    },
    {
        "id": 3285,
        "chapter": 28,
        "verse": 34,
        "arabic_text": "وَأَخِي هَٰرُونُ هُوَ أَفۡصَحُ مِنِّي لِسَانٗا فَأَرۡسِلۡهُ مَعِيَ رِدۡءٗا يُصَدِّقُنِيٓۖ إِنِّيٓ أَخَافُ أَن يُكَذِّبُونِ",
        "phonetic": "28.34 Wa 'Akhī Hārūnu Huwa 'Afşaĥu Minnī Lisānāan Fa'arsilhu Ma`iya Rid'āan Yuşaddiqunī 'Innī 'Akhāfu 'An Yukadhibūni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And my brother Aaron is more fluent than me in tongue, so send him with me as support, verifying me. Indeed, I fear that they will deny me.\"",
            "english_hilali_khan": "\"And my brother Hârûn (Aaron) - he is more eloquent in speech than me: so send him with me as a helper to confirm me. Verily I fear that they will belie me.\"",
            "english_rwwad": "My brother Aaron is more eloquent than me in speech, so send him with me as a helper to confirm my words, for I fear that they may reject me.”"
        }
    },
    {
        "id": 3286,
        "chapter": 28,
        "verse": 35,
        "arabic_text": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجۡعَلُ لَكُمَا سُلۡطَٰنٗا فَلَا يَصِلُونَ إِلَيۡكُمَا بِـَٔايَٰتِنَآۚ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلۡغَٰلِبُونَ",
        "phonetic": "28.35 Qāla Sanashuddu `Ađudaka Bi'akhīka Wa Naj`alu Lakumā Sulţānāan Falā Yaşilūna 'Ilaykumā Bi'āyātinā 'Antumā Wa Mani Attaba`akumā Al-Ghālibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"We will strengthen your arm through your brother and grant you both supremacy so they will not reach you. [It will be] through Our signs; you and those who follow you will be the predominant.\"",
            "english_hilali_khan": "Allâh said: \"We will strengthen your arm through your brother, and give you both power, so they shall not be able to harm you: with Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), you two as well as those who follow you will be the victors.\"",
            "english_rwwad": "Allah said, “We will strengthen you through your brother and give you both power, so they cannot harm you. With Our signs, you and your followers will prevail.”"
        }
    },
    {
        "id": 3287,
        "chapter": 28,
        "verse": 36,
        "arabic_text": "فَلَمَّا جَآءَهُم مُّوسَىٰ بِـَٔايَٰتِنَا بَيِّنَٰتٖ قَالُواْ مَا هَٰذَآ إِلَّا سِحۡرٞ مُّفۡتَرٗى وَمَا سَمِعۡنَا بِهَٰذَا فِيٓ ءَابَآئِنَا ٱلۡأَوَّلِينَ",
        "phonetic": "28.36 Falammā Jā'ahum Mūsá Bi'āyātinā Bayyinātin Qālū Mā Hādhā 'Illā Siĥrun Muftaráan Wa Mā Sami`nā Bihadhā Fī 'Ābā'inā Al-'Awwalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when Moses came to them with Our signs as clear evidences, they said, \"This is not except invented magic, and we have not heard of this [religion] among our forefathers.\"",
            "english_hilali_khan": "Then when Mûsâ (Moses) came to them with Our Clear Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), they said: \"This is nothing but invented magic. Never did we hear of this among our fathers of old.\"",
            "english_rwwad": "When Moses came to them with Our clear signs, they said, “This is nothing but fabricated magic; we have not heard of this from our earlier ancestors.”"
        }
    },
    {
        "id": 3288,
        "chapter": 28,
        "verse": 37,
        "arabic_text": "وَقَالَ مُوسَىٰ رَبِّيٓ أَعۡلَمُ بِمَن جَآءَ بِٱلۡهُدَىٰ مِنۡ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّٰلِمُونَ",
        "phonetic": "28.37 Wa Qāla Mūsá Rabbī 'A`lamu Biman Jā'a Bil-Hudá Min `Indihi Wa Man Takūnu Lahu `Āqibatu Ad-Dāri 'Innahu Lā Yufliĥu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "[1102]- i.e., in this world or in the Hereafter.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Moses said, \"My Lord is more knowing [than we or you] of who has come with guidance from Him and to whom will be succession in the home.[1102] Indeed, wrongdoers do not succeed.\"",
            "english_hilali_khan": "Mûsâ (Moses) said: \"My Lord knows best him who came with guidance from Him, and whose will be the happy end in the Hereafter. Verily, the Zâlimûn (wrong-doers, polytheists and disbelievers in the Oneness of Allâh) will not be successful.\"",
            "english_rwwad": "Moses said, “My Lord knows best who has come with guidance from Him and who will have the best abode in the end. The wrongdoers will never succeed.”"
        }
    },
    {
        "id": 3289,
        "chapter": 28,
        "verse": 38,
        "arabic_text": "وَقَالَ فِرۡعَوۡنُ يَٰٓأَيُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَٰهٍ غَيۡرِي فَأَوۡقِدۡ لِي يَٰهَٰمَٰنُ عَلَى ٱلطِّينِ فَٱجۡعَل لِّي صَرۡحٗا لَّعَلِّيٓ أَطَّلِعُ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ مِنَ ٱلۡكَٰذِبِينَ",
        "phonetic": "28.38 Wa Qāla Fir`awnu Yā 'Ayyuhā Al-Mala'u Mā `Alimtu Lakum Min 'Ilahin Ghayrī Fa'awqid Lī Yā Hāmānu `Alá Aţ-Ţīni Fāj`al Lī Şarĥāan La`allī 'Aţţali`u 'Ilá 'Ilahi Mūsá Wa 'Innī La'ažunnuhu Mina Al-Kādhibīna",
        "footnotes": {
            "english_saheeh": "[1103]- From which bricks are made.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Pharaoh said, \"O eminent ones, I have not known you to have a god other than me. Then ignite for me, O Hāmān, [a fire] upon the clay[1103] and make for me a tower that I may look at the God of Moses. And indeed, I do think he is among the liars.\"",
            "english_hilali_khan": "Fir‘aun (Pharaoh) said: \"O chiefs! I know not that you have an ilâh (a god) other than me. So kindle for me (a fire), O Hâmân, to bake (bricks out of) clay, and set up for me a Sarh (a lofty tower, or palace) in order that I may look at (or look for) the Ilâh (God) of Mûsâ (Moses); and verily, I think that he [Mûsâ (Moses)] is one of the liars.\"",
            "english_rwwad": "Pharaoh said, “O chiefs, I do not know for you any god other than myself. So bake for me bricks out of clay, O Hāmān, and build for me a tower so that I may have a look at the God of Moses, for I think he is a liar.”"
        }
    },
    {
        "id": 3290,
        "chapter": 28,
        "verse": 39,
        "arabic_text": "وَٱسۡتَكۡبَرَ هُوَ وَجُنُودُهُۥ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَظَنُّوٓاْ أَنَّهُمۡ إِلَيۡنَا لَا يُرۡجَعُونَ",
        "phonetic": "28.39 Wa Astakbara Huwa Wa Junūduhu Fī Al-'Arđi Bighayri Al-Ĥaqqi Wa Žannū 'Annahum 'Ilaynā Lā Yurja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he was arrogant, he and his soldiers, in the land, without right, and they thought that they would not be returned to Us.",
            "english_hilali_khan": "And he and his hosts were arrogant in the land, without right, and they thought that they would never return to Us.",
            "english_rwwad": "He and his soldiers were arrogant in the land without any right, and thought that they would not be brought back to Us."
        }
    },
    {
        "id": 3291,
        "chapter": 28,
        "verse": 40,
        "arabic_text": "فَأَخَذۡنَٰهُ وَجُنُودَهُۥ فَنَبَذۡنَٰهُمۡ فِي ٱلۡيَمِّۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلظَّٰلِمِينَ",
        "phonetic": "28.40 Fa'akhadhnāhu Wa Junūdahu Fanabadhnāhum Fī Al-Yammi Fānžur Kayfa Kāna `Āqibatu Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "[1104]- Allāh (subḥānahu wa taʿālā) caused them to leave all their worldly wealth behind and enter the sea in pursuit of the Children of Israel.  See 26:52-66.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We took him and his soldiers and threw them into the sea.[1104] So see how was the end of the wrongdoers.",
            "english_hilali_khan": "So We seized him and his hosts, and We threw them all into the sea (and drowned them). So behold (O Muhammad صلى الله عليه وسلم) what was the end of the Zâlimûn [wrong-doers, polytheists and those who disbelieved in the Oneness of their Lord (Allâh), or rejected the advice of His Messenger Mûsâ (Moses) عليه السلام].",
            "english_rwwad": "So We seized him and his soldiers and flung them into the sea. See how was the end of the wrongdoers!"
        }
    },
    {
        "id": 3292,
        "chapter": 28,
        "verse": 41,
        "arabic_text": "وَجَعَلۡنَٰهُمۡ أَئِمَّةٗ يَدۡعُونَ إِلَى ٱلنَّارِۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ لَا يُنصَرُونَ",
        "phonetic": "28.41 Wa Ja`alnāhum 'A'immatan Yad`ūna 'Ilá An-Nāri Wa Yawma Al-Qiyāmati Lā Yunşarūna",
        "footnotes": {
            "english_saheeh": "[1105]- i.e., examples or precedents, followed by subsequent tyrants.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We made them leaders[1105] inviting to the Fire, and on the Day of Resurrection they will not be helped.",
            "english_hilali_khan": "And We made them leaders inviting to the Fire: and on the Day of Resurrection, they will not be helped.",
            "english_rwwad": "We made them leaders calling to the Fire, and on the Day of Resurrection they will not be helped."
        }
    },
    {
        "id": 3293,
        "chapter": 28,
        "verse": 42,
        "arabic_text": "وَأَتۡبَعۡنَٰهُمۡ فِي هَٰذِهِ ٱلدُّنۡيَا لَعۡنَةٗۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ هُم مِّنَ ٱلۡمَقۡبُوحِينَ",
        "phonetic": "28.42 Wa 'Atba`nāhum Fī Hadhihi Ad-Dunyā La`natan Wa Yawma Al-Qiyāmati Hum Mina Al-Maqbūĥīna",
        "footnotes": {
            "english_saheeh": "[1106]- Literally, \"those made hideous,\" who will be far removed from all good and mercy.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We caused to overtake them in this world a curse, and on the Day of Resurrection they will be of the despised.[1106]",
            "english_hilali_khan": "And We made a curse to follow them in this world, and on the Day of Resurrection, they will be among Al-Maqbuhûn (those who are prevented from receiving Allâh’s Mercy or any good; despised or destroyed).",
            "english_rwwad": "We caused a curse to pursue them in this world, and on the Day of Resurrection they will be among those who are despised."
        }
    },
    {
        "id": 3294,
        "chapter": 28,
        "verse": 43,
        "arabic_text": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ مِنۢ بَعۡدِ مَآ أَهۡلَكۡنَا ٱلۡقُرُونَ ٱلۡأُولَىٰ بَصَآئِرَ لِلنَّاسِ وَهُدٗى وَرَحۡمَةٗ لَّعَلَّهُمۡ يَتَذَكَّرُونَ",
        "phonetic": "28.43 Wa Laqad 'Ātaynā Mūsá Al-Kitāba Min Ba`di Mā 'Ahlaknā Al-Qurūna Al-'Ūlá Başā'ira Lilnnāsi Wa Hudáan Wa Raĥmatan La`allahum Yatadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We gave Moses the Scripture, after We had destroyed the former generations, as enlightenment for the people and guidance and mercy that they might be reminded.",
            "english_hilali_khan": "And indeed We gave Mûsâ (Moses) - after We had destroyed the generations of old -the Scripture [the Taurât (Torah)] as an enlightenment for mankind, and a guidance and a mercy, that they might remember (or receive admonition).",
            "english_rwwad": "We gave Moses the Scripture after destroying earlier nations, as an insight for mankind, and a guidance and mercy, so that they may take heed."
        }
    },
    {
        "id": 3295,
        "chapter": 28,
        "verse": 44,
        "arabic_text": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ",
        "phonetic": "28.44 Wa Mā Kunta Bijānibi Al-Gharbīyi 'Idh Qađaynā 'Ilá Mūsá Al-'Amra Wa Mā Kunta Mina Ash-Shāhidīn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you, [O Muḥammad], were not on the western side [of the mount] when We revealed to Moses the command, and you were not among the witnesses [to that].",
            "english_hilali_khan": "And you (O Muhammad صلى الله عليه وسلم) were not on the western side (of the Mount), when We made clear to Mûsâ (Moses) the commandment, and you were not among the witnesses.",
            "english_rwwad": "You were not [O Prophet] on the western side [of the mountain] when We gave Moses Our commandment, nor did you witness that event."
        }
    },
    {
        "id": 3296,
        "chapter": 28,
        "verse": 45,
        "arabic_text": "وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ",
        "phonetic": "28.45 Wa Lakinnā 'Ansha'nā Qurūnāan Fataţāwala `Alayhimu Al-`Umuru Wa Mā Kunta Thāwīāan Fī 'Ahli Madyana Tatlū `Alayhim 'Āyātinā Wa Lakinnā Kunnā Mursilīna",
        "footnotes": {
            "english_saheeh": "[1107]- So they forgot and neglected the ordinances of Allāh.\n[1108]- The Prophet (ﷺ) had no way of obtaining this information except through Allāh's revelation.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But We produced [many] generations [after Moses], and prolonged was their duration.[1107] And you were not a resident among the people of Madyan, reciting to them Our verses, but We were senders [of this message].[1108]",
            "english_hilali_khan": "But We created generations [after generations i.e. after Mûsâ (Moses) عليه السلام], and long were the ages that passed over them. And you (O Muhammad صلى الله عليه وسلم) were not a dweller among the people of Madyan (Midian), reciting Our Verses to them. But it is We Who kept sending (Messengers).",
            "english_rwwad": "But We brought forth many generations [after Moses], and a long time passed on them. And you [O Prophet] did not dwell among the people of Midian, rehearsing with them Our verses, but it is We Who sent you as a messenger [and revealed to you their stories]."
        }
    },
    {
        "id": 3297,
        "chapter": 28,
        "verse": 46,
        "arabic_text": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ",
        "phonetic": "28.46 Wa Mā Kunta Bijānibi Aţ-Ţūri 'Idh Nādaynā Wa Lakin Raĥmatan Min Rabbika Litundhira Qawmāan Mā 'Atāhum Min Nadhīrin Min Qablika La`allahum Yatadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you were not at the side of the mount when We called [Moses] but [were sent] as a mercy from your Lord to warn a people to whom no warner had come before you that they might be reminded.",
            "english_hilali_khan": "And you (O Muhammad صلى الله عليه وسلم) were not at the side of the Tûr (Mount) when We did call: [it is said that Allâh called the followers of Muhammad صلى الله عليه وسلم, and they answered His Call, or that Allâh called Mûsâ (Moses)]. But (you are sent) as a mercy from your Lord, to give warning to a people to whom no warner had come before you: in order that they may remember or receive admonition. [Tafsir At-Tabarî].",
            "english_rwwad": "You were not at the side of Mount Tūr when We called out [to Moses]. But [you have been sent] as a mercy from your Lord, to warn a people to whom no warner had come before you, so that they may take heed."
        }
    },
    {
        "id": 3298,
        "chapter": 28,
        "verse": 47,
        "arabic_text": "وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "28.47 Wa Lawlā 'An Tuşībahum Muşībatun Bimā Qaddamat 'Aydīhim Fayaqūlū Rabbanā Lawlā 'Arsalta 'Ilaynā Rasūlāan Fanattabi`a 'Āyātika Wa Nakūna Mina Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[1109]- The conclusion of the sentence is understood to be \"...We would not have sent messengers,\" meaning that Allāh (subḥānahu wa taʿālā) sent messengers and sent Muḥammad (ﷺ) with the final scripture to mankind so that no one could claim that punishment was imposed unjustly without warning.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if not that a disaster should strike them for what their hands put forth [of sins] and they would say, \"Our Lord, why did You not send us a messenger so we could have followed Your verses and been among the believers?\"...[1109]",
            "english_hilali_khan": "And if (We had) not (sent you to the people of Makkah) - in case a calamity should seize them for (the deeds) that their hands have sent forth, they would have said: \"Our Lord! Why did You not send us a Messenger? We would then have followed Your Ayât (Verses of the Qur’ân) and would have been among the believers.\"",
            "english_rwwad": "So they would not say – if struck by a calamity because of what their hands have sent forth, “Our Lord, if only You had sent us a messenger, so we could follow Your verses and be among the believers?”"
        }
    },
    {
        "id": 3299,
        "chapter": 28,
        "verse": 48,
        "arabic_text": "فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَلَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ",
        "phonetic": "28.48 Falammā Jā'ahumu Al-Ĥaqqu Min `Indinā Qālū Lawlā 'Ūtiya Mithla Mā 'Ūtiya Mūsá 'Awalam Yakfurū Bimā 'Ūtiya Mūsá Min Qablu Qālū Siĥrāni Tažāharā Wa Qālū 'Innā Bikullin Kāfirūna",
        "footnotes": {
            "english_saheeh": "[1110]- The reference is by the disbelievers of Quraysh to the Qur’ān and the Torah.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when the truth came to them from Us, they said, \"Why was he not given like that which was given to Moses?\" Did they not disbelieve in that which was given to Moses before? They said, \"[They are but] two works of magic supporting each other,[1110] and indeed we are, in both, disbelievers.\"",
            "english_hilali_khan": "But when the truth (i.e. Muhammad صلى الله عليه وسلم with his Message) has come to them from Us, they say: \"Why is he not given the like of what was given to Mûsâ (Moses)? Did they not disbelieve in that which was given to Mûsâ (Moses) of old? They say: \"Two kinds of magic [the Taurât (Torah) and the Qur’an], each helping the other!\" And they say: \"Verily in both we are disbelievers.\"",
            "english_rwwad": "But when the truth came to them from Us, they said, “If only he was given the like of what was given to Moses before.” Did they not reject what was given to Moses before? They say, “Both [revelations] are works of magic, supporting each other”, adding, “We truly reject both of them.”"
        }
    },
    {
        "id": 3300,
        "chapter": 28,
        "verse": 49,
        "arabic_text": "قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "28.49 Qul Fa'tū Bikitābin Min `Indi Allāhi Huwa 'Ahdá Minhumā 'Attabi`hu 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Then bring a scripture from Allāh which is more guiding than either of them that I may follow it, if you should be truthful.\"",
            "english_hilali_khan": "Say (to them, O Muhammad صلى الله عليه وسلم): \"Then bring a Book from Allâh, which is a better guide than these two [the Taurât (Torah) and the Qur’an], that I may follow it, if you are truthful.\"",
            "english_rwwad": "Say, “Then bring a scripture from Allah which is better in guidance than these two so that I may follow it, if you are truthful.”"
        }
    },
    {
        "id": 3301,
        "chapter": 28,
        "verse": 50,
        "arabic_text": "فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ",
        "phonetic": "28.50 Fa'in Lam Yastajībū Laka Fā`lam 'Annamā Yattabi`ūna 'Ahwā'ahum Wa Man 'Ađallu Mimmani Attaba`a Hawāhu Bighayri Hudáan Mina Allāhi 'Inna Allāha Lā Yahdī Al-Qawma Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allāh? Indeed, Allāh does not guide the wrongdoing people.",
            "english_hilali_khan": "But if they answer you not (i.e. do not bring the Book nor believe in your doctrine of Islâmic Monotheism), then know that they only follow their own lusts. And who is more astray than one who follows his own lusts, without guidance from Allâh? Verily Allâh guides not the people who are Zâlimûn (wrong-doers, disobedient to Allâh, and polytheists).",
            "english_rwwad": "But if they do not respond to you, then know that they only follow their desires. Who is more astray than one who follows his desire without any guidance from Allah? Indeed, Allah does not guide the wrongdoing people."
        }
    },
    {
        "id": 3302,
        "chapter": 28,
        "verse": 51,
        "arabic_text": "۞ وَلَقَدۡ وَصَّلۡنَا لَهُمُ ٱلۡقَوۡلَ لَعَلَّهُمۡ يَتَذَكَّرُونَ",
        "phonetic": "28.51 Wa Laqad Waşşalnā Lahumu Al-Qawla La`allahum Yatadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have [repeatedly] conveyed to them the word [i.e., the Qur’ān] that they might be reminded.",
            "english_hilali_khan": "And indeed now We have conveyed the Word (this Qur’ân in which is the news of everything) to them, in order that they may remember (or receive admonition).",
            "english_rwwad": "Now We have conveyed Our Word to them, so that they may take heed."
        }
    },
    {
        "id": 3303,
        "chapter": 28,
        "verse": 52,
        "arabic_text": "ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ مِن قَبۡلِهِۦ هُم بِهِۦ يُؤۡمِنُونَ",
        "phonetic": "28.52 Al-Ladhīna 'Ātaynāhumu Al-Kitāba Min Qablihi Hum Bihi Yu'uminūna",
        "footnotes": {
            "english_saheeh": "[1111]- i.e., the sincere believers among them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those to whom We gave the Scripture before it - they[1111] are believers in it.",
            "english_hilali_khan": "Those to whom We gave the Scripture [i.e. the Taurât (Torah) and the Injeel (Gospel)] before it, they believe in it (the Qur’ân).",
            "english_rwwad": "As for those whom We gave the Scripture before this [Qur’an], they do believe in it."
        }
    },
    {
        "id": 3304,
        "chapter": 28,
        "verse": 53,
        "arabic_text": "وَإِذَا يُتۡلَىٰ عَلَيۡهِمۡ قَالُوٓاْ ءَامَنَّا بِهِۦٓ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبۡلِهِۦ مُسۡلِمِينَ",
        "phonetic": "28.53 Wa 'Idhā Yutlá `Alayhim Qālū 'Āmannā Bihi 'Innahu Al-Ĥaqqu Min Rabbinā 'Innā Kunnā Min Qablihi Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.28:53): See the footnote of (V.5:66).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when it is recited to them, they say, \"We have believed in it; indeed, it is the truth from our Lord. Indeed we were, [even] before it, Muslims [i.e., submitting to Allāh].\"",
            "english_hilali_khan": "And when it is recited to them, they say: \"We believe in it. Verily, it is the truth from our Lord. Indeed even before it we have been from those who submit themselves to Allâh in Islâm as Muslims (like ‘Abdullâh bin Salâm and Salmân Al-Farisî).[1]",
            "english_rwwad": "When this [Qur’an] is recited to them, they say, “We believe in it, for it is the truth from our Lord. We had already submitted [as Muslims even] before this.”"
        }
    },
    {
        "id": 3305,
        "chapter": 28,
        "verse": 54,
        "arabic_text": "أُوْلَٰٓئِكَ يُؤۡتَوۡنَ أَجۡرَهُم مَّرَّتَيۡنِ بِمَا صَبَرُواْ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
        "phonetic": "28.54 'Ūlā'ika Yu'utawna 'Ajrahum Marratayni Bimā Şabarū Wa Yadra'ūna Bil-Ĥasanati As-Sayyi'ata Wa Mimmā Razaqnāhum Yunfiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.28:54)\na) Narrated Abû Burdah’s father: Allâh’s Messenger صلى الله عليه وسلم said, \"Any man who has a slave-girl whom he educates properly, teaches good manners, manumits and marries her, will get a double reward. And if any man of the people of the Scriptures (Jews and Christians) believes in his own Prophet and then believes in me (Muhammad صلى الله عليه وسلم) too, he will (also) get a double reward. And any slave who fulfils his duty to his master and to his Lord (Allah), will (also) get a double reward.\" (Sahih Al-Bukhari, Vol.7, Hadîth No.20).\nb) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those will be given their reward twice for what they patiently endured and [because] they avert evil through good, and from what We have provided them they spend.",
            "english_hilali_khan": "These will be given their reward twice over,[2] because they are patient, and repel evil with good, and spend (in charity) out of what We have provided them.",
            "english_rwwad": "They will be given their reward twice for their patience, repelling evil with good, and for spending out of what We have provided for them."
        }
    },
    {
        "id": 3306,
        "chapter": 28,
        "verse": 55,
        "arabic_text": "وَإِذَا سَمِعُواْ ٱللَّغۡوَ أَعۡرَضُواْ عَنۡهُ وَقَالُواْ لَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ سَلَٰمٌ عَلَيۡكُمۡ لَا نَبۡتَغِي ٱلۡجَٰهِلِينَ",
        "phonetic": "28.55 Wa 'Idhā Sami`ū Al-Laghwa 'A`rađū `Anhu Wa Qālū Lanā 'A`mālunā Wa Lakum 'A`mālukum Salāmun `Alaykum Lā Nabtaghī Al-Jāhilīna",
        "footnotes": {
            "english_saheeh": "[1112]- This is not the Islāmic greeting of \"Peace be upon you.\"  Rather, it means \"You are secure from being treated in a like manner by us.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they hear ill speech, they turn away from it and say, \"For us are our deeds, and for you are your deeds. Peace will be upon you;[1112] we seek not the ignorant.\"",
            "english_hilali_khan": "And when they hear Al-Laghw (dirty, false, evil vain talk), they withdraw from it and say: \"To us our deeds, and to you your deeds. Peace be to you. We seek not (the way of) the ignorant.\"",
            "english_rwwad": "When they hear vain talk, they turn away from it and say, “We are accountable for our deeds and you for yours. Peace [is our response] to you! We do not want [to be with] the ignorant.”"
        }
    },
    {
        "id": 3307,
        "chapter": 28,
        "verse": 56,
        "arabic_text": "إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ",
        "phonetic": "28.56 'Innaka Lā Tahdī Man 'Aĥbabta Wa Lakinna Allāha Yahdī Man Yashā'u Wa Huwa 'A`lamu Bil-Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.28:56) Narrated Al-Musayyab: When Abû Tâlib was on his death bed, the Prophet صلى الله عليه وسلم went to him while Abû Jahl was sitting beside him. The Prophet صلى الله عليه وسلم said: \"O my uncle! Say: Lâ ilâha illallâh (none has the right to be worshipped but Allah), an expression with which I will defend your case, before Allah.\" Abû Jahl and ‘Abdullâh bin Umayyah said: \"O Abû Tâlib! Will you leave the religion of ‘Abdul Muttalib?\" So they kept on saying this to him so that the last statement he said to them (before he died) was: \"I am on the religion of ‘Abdul Muttalib.\" Then the Prophet صلى الله عليه وسلم said: \"I will keep on asking for Allah’s Forgiveness for you unless I am forbidden to do so.\" Then the following Verse was revealed: \"It is not proper for the Prophet and those who believe to ask Allah’s Forgiveness for the Mushrikûn even though they be of kin, after it has become clear to them that they are the dwellers of the (Hell) Fire (because they died in a state of disbelief).\" (V.9:113).\nThe other Verse was also revealed: \"Verily, you (O Muhammad صلى الله عليه وسلم) guide not whom you like, but Allah guides whom He wills.\" (V.28:56). (Sahih Al Bukhari, Vol.5, Hadîth No.223).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, [O Muḥammad], you do not guide whom you like, but Allāh guides whom He wills. And He is most knowing of the [rightly] guided.",
            "english_hilali_khan": "Verily you (O Muhammad صلى الله عليه وسلم) guide not whom you like, but Allâh guides whom He wills. And He knows best those who are the guided.[3]",
            "english_rwwad": "You cannot guide whoever you like, but Allah guides whom He wills, and He knows best who will be guided."
        }
    },
    {
        "id": 3308,
        "chapter": 28,
        "verse": 57,
        "arabic_text": "وَقَالُوٓاْ إِن نَّتَّبِعِ ٱلۡهُدَىٰ مَعَكَ نُتَخَطَّفۡ مِنۡ أَرۡضِنَآۚ أَوَلَمۡ نُمَكِّن لَّهُمۡ حَرَمًا ءَامِنٗا يُجۡبَىٰٓ إِلَيۡهِ ثَمَرَٰتُ كُلِّ شَيۡءٖ رِّزۡقٗا مِّن لَّدُنَّا وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "28.57 Wa Qālū 'In Nattabi`i Al-Hudá Ma`aka Nutakhaţţaf Min 'Arđinā 'Awalam Numakkin Lahum Ĥaramāan 'Āmināan Yujbá 'Ilayhi Thamarātu Kulli Shay'in Rizqāan Min Ladunnā Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[1113]- By the other Arab tribes.",
            "english_hilali_khan": "(V.28:57)\na) Narrated Ibn ‘Abbâs رضي الله عنهما: On the day of the conquest of Makkah, Allâh’s Messenger صلى الله عليه وسلم said: \"Allâh has made this town a sanctuary. Its thorny bushes should not be cut, its game should not be chased, and its fallen things should not be picked up except by one who would announce them publicly.\" (Sahih Al Bukhari, Vol.2, Hadîth No.657).\nb) See the footnote of (V.2:191).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they [i.e., the Quraysh] say, \"If we were to follow the guidance with you, we would be swept[1113] from our land.\" Have We not established for them a safe sanctuary to which are brought the fruits of all things as provision from Us? But most of them do not know.",
            "english_hilali_khan": "And they say: \"If we follow the guidance with you, we would be snatched away from our land.\" Have We not established for them a secure sanctuary (Makkah), to which are brought fruits of all kinds, a provision from Ourselves, but most of them know not.[4]",
            "english_rwwad": "They say, “If we follow the guidance with you [O Prophet], we will be snatched away from our land.” Have We not established for them a safe sanctuary [in Makkah] to which fruits of all kinds are brought as provision from Us? But most of them do not know."
        }
    },
    {
        "id": 3309,
        "chapter": 28,
        "verse": 58,
        "arabic_text": "وَكَمۡ أَهۡلَكۡنَا مِن قَرۡيَةِۭ بَطِرَتۡ مَعِيشَتَهَاۖ فَتِلۡكَ مَسَٰكِنُهُمۡ لَمۡ تُسۡكَن مِّنۢ بَعۡدِهِمۡ إِلَّا قَلِيلٗاۖ وَكُنَّا نَحۡنُ ٱلۡوَٰرِثِينَ",
        "phonetic": "28.58 Wa Kam 'Ahlaknā Min Qaryatin Baţirat Ma`īshatahā Fatilka Masākinuhum Lam Tuskan Min Ba`dihim 'Illā Qalīlāan Wa Kunnā Naĥnu Al-Wārithīna",
        "footnotes": {
            "english_saheeh": "[1114]- By travelers seeking temporary shelter.  The reference is to the ruins which were visible to the Quraysh during their journeys.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how many a city have We destroyed that was insolent in its [way of] living, and those are their dwellings which have not been inhabited after them except briefly.[1114] And it is We who were the inheritors.",
            "english_hilali_khan": "And how many a town (population) have We destroyed, which was thankless for its means of livelihood (disobeyed Allâh, and His Messengers, by doing evil deeds and crimes)! And those are their dwellings, which have not been inhabited after them except a little. And verily! We have been the inheritors.",
            "english_rwwad": "How many a town We have destroyed that were arrogant due to their affluence! Those are their dwellings which were never inhabited after them except briefly. It is We Who were the Inheritors."
        }
    },
    {
        "id": 3310,
        "chapter": 28,
        "verse": 59,
        "arabic_text": "وَمَا كَانَ رَبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ حَتَّىٰ يَبۡعَثَ فِيٓ أُمِّهَا رَسُولٗا يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَاۚ وَمَا كُنَّا مُهۡلِكِي ٱلۡقُرَىٰٓ إِلَّا وَأَهۡلُهَا ظَٰلِمُونَ",
        "phonetic": "28.59 Wa Mā Kāna Rabbuka Muhlika Al-Qurá Ĥattá Yab`atha Fī 'Ummihā Rasūlāan Yatlū `Alayhim 'Āyātinā Wa Mā Kunnā Muhlikī Al-Qurá 'Illā Wa 'Ahluhā Žālimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And never would your Lord have destroyed the cities until He had sent to their mother [i.e., principal city] a messenger reciting to them Our verses. And We would not destroy the cities except while their people were wrongdoers.",
            "english_hilali_khan": "And never will your Lord destroy the towns (populations) until He sends to their mother town a Messenger reciting to them Our Verses. And never would We destroy the towns unless the people thereof are Zâlimûn (polytheists, wrong-doers, disbelievers in the Oneness of Allâh, oppressors and tyrants).",
            "english_rwwad": "Your Lord would never destroy towns without first sending to their main city a messenger, reciting to them Our verses. Nor would We destroy towns unless their people were wrongdoers."
        }
    },
    {
        "id": 3311,
        "chapter": 28,
        "verse": 60,
        "arabic_text": "وَمَآ أُوتِيتُم مِّن شَيۡءٖ فَمَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَزِينَتُهَاۚ وَمَا عِندَ ٱللَّهِ خَيۡرٞ وَأَبۡقَىٰٓۚ أَفَلَا تَعۡقِلُونَ",
        "phonetic": "28.60 Wa Mā 'Ūtītum Min Shay'in Famatā`u Al-Ĥayāati Ad-Dunyā Wa Zīnatuhā Wa Mā `Inda Allāhi Khayrun Wa 'Abqá 'Afalā Ta`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whatever thing you [people] have been given - it is [only for] the enjoyment of worldly life and its adornment. And what is with Allāh is better and more lasting; so will you not use reason?",
            "english_hilali_khan": "And whatever you have been given is an enjoyment of the life of (this) world and its adornment, and that (Hereafter) which is with Allâh is better and will remain forever. Have you then no sense?",
            "english_rwwad": "Whatever you have been given is only an enjoyment and adornment of the life of this world, but what is with Allah is better and more lasting. Will you not then understand?"
        }
    },
    {
        "id": 3312,
        "chapter": 28,
        "verse": 61,
        "arabic_text": "أَفَمَن وَعَدۡنَٰهُ وَعۡدًا حَسَنٗا فَهُوَ لَٰقِيهِ كَمَن مَّتَّعۡنَٰهُ مَتَٰعَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا ثُمَّ هُوَ يَوۡمَ ٱلۡقِيَٰمَةِ مِنَ ٱلۡمُحۡضَرِينَ",
        "phonetic": "28.61 'Afaman Wa`adnāhu Wa`dāan Ĥasanāan Fahuwa Lāqīhi Kaman Matta`nāhu Matā`a Al-Ĥayāati Ad-Dunyā Thumma Huwa Yawma Al-Qiyāmati Mina Al-Muĥđarīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then is he whom We have promised a good promise which he will meet [i.e., obtain] like he for whom We provided enjoyment of worldly life [but] then he is, on the Day of Resurrection, among those presented [for punishment in Hell]?",
            "english_hilali_khan": "Is he whom We have promised an excellent promise (Paradise) - which he will find true - like him whom We have made to enjoy the luxuries of the life of (this) world, then on the Day of Resurrection, he will be among those brought up (to be punished in the Hell-fire)?",
            "english_rwwad": "Is one whom We promised a good promise – which he is going to obtain – like one whom We gave the pleasure of the life of this world, then on the Day of Resurrection he will be among those summoned [to Hellfire]?"
        }
    },
    {
        "id": 3313,
        "chapter": 28,
        "verse": 62,
        "arabic_text": "وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ",
        "phonetic": "28.62 Wa Yawma Yunādīhim Fayaqūlu 'Ayna Shurakā'iya Al-Ladhīna Kuntum Taz`umūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [warn of] the Day He will call them and say, \"Where are My 'partners' which you used to claim?\"",
            "english_hilali_khan": "And (remember) the Day when He will call to them and say: \"Where are My (so-called) partners whom you used to assert?\"",
            "english_rwwad": "And [beware of] the Day when He will call out to them and say, “Where are those whom you claimed to be My partners?”"
        }
    },
    {
        "id": 3314,
        "chapter": 28,
        "verse": 63,
        "arabic_text": "قَالَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ رَبَّنَا هَٰٓؤُلَآءِ ٱلَّذِينَ أَغۡوَيۡنَآ أَغۡوَيۡنَٰهُمۡ كَمَا غَوَيۡنَاۖ تَبَرَّأۡنَآ إِلَيۡكَۖ مَا كَانُوٓاْ إِيَّانَا يَعۡبُدُونَ",
        "phonetic": "28.63 Qāla Al-Ladhīna Ĥaqqa `Alayhimu Al-Qawlu Rabbanā Hā'uulā' Al-Ladhīna 'Aghwaynā 'Aghwaynāhum Kamā Ghawaynā Tabarra'nā 'Ilayka Mā Kānū 'Īyānā Ya`budūna",
        "footnotes": {
            "english_saheeh": "[1115]- The decree for their punishment.\n[1116]- i.e., We did not compel them, and they did not obey us; instead, they obeyed their own desires and inclinations.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those upon whom the word[1115] will have come into effect will say, \"Our Lord, these are the ones we led to error. We led them to error just as we were in error. We declare our disassociation [from them] to You. They did not used to worship [i.e., obey] us.\"[1116]",
            "english_hilali_khan": "Those about whom the Word will have come true (to be punished) will say: \"Our Lord! These are they whom we led astray. We led them astray, as we were astray ourselves. We declare our innocence (from them) before You. It was not us they worshipped.\"",
            "english_rwwad": "Those against whom the word will be fulfilled will say, “Our Lord, these are the ones whom we led astray; we led them astray as we ourselves went astray. We disassociate ourselves [from them] before You; it was not us that they used to worship.”"
        }
    },
    {
        "id": 3315,
        "chapter": 28,
        "verse": 64,
        "arabic_text": "وَقِيلَ ٱدۡعُواْ شُرَكَآءَكُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَرَأَوُاْ ٱلۡعَذَابَۚ لَوۡ أَنَّهُمۡ كَانُواْ يَهۡتَدُونَ",
        "phonetic": "28.64 Wa Qīla Ad`ū Shurakā'akum Fada`awhum Falam Yastajībū Lahum Wa Ra'aw Al-`Adhāba Law 'Annahum Kānū Yahtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it will be said, \"Invoke your 'partners,'\" and they will invoke them; but they will not respond to them, and they will see the punishment. If only they had followed guidance!",
            "english_hilali_khan": "And it will be said (to them): \"Call upon your (so-called) partners (of Allâh)\", and they will call upon them, but they will give no answer to them, and they will see the torment. (They will then wish) if only they had been guided!",
            "english_rwwad": "Then they will be told, “Call upon your [so-called] partners [for help].” They will call upon them, but will receive no response. They will see the punishment, wishing that they had followed guidance."
        }
    },
    {
        "id": 3316,
        "chapter": 28,
        "verse": 65,
        "arabic_text": "وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ مَاذَآ أَجَبۡتُمُ ٱلۡمُرۡسَلِينَ",
        "phonetic": "28.65 Wa Yawma Yunādīhim Fayaqūlu Mādhā 'Ajabtumu Al-Mursalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] the Day He will call them and say, \"What did you answer the messengers?\"",
            "english_hilali_khan": "And (remember) the Day (Allâh) will call to them, and say: \"What answer gave you to the Messengers?\"",
            "english_rwwad": "On the Day when He will call out to them, saying, “What response did you give to the messengers?”"
        }
    },
    {
        "id": 3317,
        "chapter": 28,
        "verse": 66,
        "arabic_text": "فَعَمِيَتۡ عَلَيۡهِمُ ٱلۡأَنۢبَآءُ يَوۡمَئِذٖ فَهُمۡ لَا يَتَسَآءَلُونَ",
        "phonetic": "28.66 Fa`amiyat `Alayhimu Al-'Anbā'u Yawma'idhin Fahum Lā Yatasā'alūna",
        "footnotes": {
            "english_saheeh": "[1117]- By which they might invent lies or excuses.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But the information[1117] will be unapparent to them that Day, so they will not [be able to] ask one another.",
            "english_hilali_khan": "Then the news of a good answer will be obscured to them on that day, and they will not be able to ask one another.",
            "english_rwwad": "They will be dumbstruck on that Day, not even able to ask one another."
        }
    },
    {
        "id": 3318,
        "chapter": 28,
        "verse": 67,
        "arabic_text": "فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحٗا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلۡمُفۡلِحِينَ",
        "phonetic": "28.67 Fa'ammā Man Tāba Wa 'Āmana Wa `Amila Şāliĥāan Fa`asá 'An Yakūna Mina Al-Mufliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for one who had repented, believed, and done righteousness, it is expected [i.e., promised by Allāh] that he will be among the successful.",
            "english_hilali_khan": "But as for him who repented (from polytheism and sins), believed (in the Oneness of Allâh, and in His Messenger Muhammad صلى الله عليه وسلم), and did righteous deeds (in the life of this world), then he will be among those who are successful.",
            "english_rwwad": "But whoever repents and believes, and does righteous deeds, he will be among the successful."
        }
    },
    {
        "id": 3319,
        "chapter": 28,
        "verse": 68,
        "arabic_text": "وَرَبُّكَ يَخۡلُقُ مَا يَشَآءُ وَيَخۡتَارُۗ مَا كَانَ لَهُمُ ٱلۡخِيَرَةُۚ سُبۡحَٰنَ ٱللَّهِ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
        "phonetic": "28.68 Wa Rabbuka Yakhluqu Mā Yashā'u Wa Yakhtāru Mā Kāna Lahumu Al-Khiyaratu Subĥāna Allāhi Wa Ta`ālá `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord creates what He wills and chooses; not for them was the choice. Exalted is Allāh and high above what they associate with Him.",
            "english_hilali_khan": "And your Lord creates whatsoever He wills and chooses: no choice have they (in any matter). Glorified be Allâh, and exalted above all that they associate (as partners with Him).",
            "english_rwwad": "Your Lord creates and chooses what He wills; they have no choice. Glorified is Allah and Exalted is He far above what they associate with Him."
        }
    },
    {
        "id": 3320,
        "chapter": 28,
        "verse": 69,
        "arabic_text": "وَرَبُّكَ يَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا يُعۡلِنُونَ",
        "phonetic": "28.69 Wa Rabbuka Ya`lamu Mā Tukinnu Şudūruhum Wa Mā Yu`linūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord knows what their breasts conceal and what they declare.",
            "english_hilali_khan": "And your Lord knows what their breasts conceal, and what they reveal.",
            "english_rwwad": "Your Lord knows all that their hearts conceal and all that they reveal."
        }
    },
    {
        "id": 3321,
        "chapter": 28,
        "verse": 70,
        "arabic_text": "وَهُوَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ لَهُ ٱلۡحَمۡدُ فِي ٱلۡأُولَىٰ وَٱلۡأٓخِرَةِۖ وَلَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ",
        "phonetic": "28.70 Wa Huwa Allāhu Lā 'Ilāha 'Illā Huwa Lahu Al-Ĥamdu Fī Al-'Ūlá Wa Al-'Ākhirati Wa Lahu Al-Ĥukmu Wa 'Ilayhi Turja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He is Allāh; there is no deity except Him. To Him is [due all] praise in the first [life] and the Hereafter. And His is the [final] decision, and to Him you will be returned.",
            "english_hilali_khan": "And He is Allâh: Lâ ilâha illa Huwa (none has the right to be worshipped but He), all praises and thanks be to Him (both) in the first (i.e. in this world) and in the last (i.e. in the Hereafter). And for Him is the Decision, and to Him shall you (all) be returned.",
            "english_rwwad": "He is Allah: none has the right to be worshiped except Him. All praise belongs to Him in this life and the Hereafter. His is the Judgment, and to Him you will all be returned."
        }
    },
    {
        "id": 3322,
        "chapter": 28,
        "verse": 71,
        "arabic_text": "قُلۡ أَرَءَيۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَيۡكُمُ ٱلَّيۡلَ سَرۡمَدًا إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِضِيَآءٍۚ أَفَلَا تَسۡمَعُونَ",
        "phonetic": "28.71 Qul 'Ara'aytum 'In Ja`ala Allāhu `Alaykumu Al-Layla Sarmadāan 'Ilá Yawmi Al-Qiyāmati Man 'Ilahun Ghayru Allāhi Ya'tīkum Biđiyā'in 'Afalā Tasma`ūna",
        "footnotes": {
            "english_saheeh": "[1118]- Meaning \"Inform me if you really know.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you considered:[1118] if Allāh should make for you the night continuous until the Day of Resurrection, what deity other than Allāh could bring you light? Then will you not hear?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Tell me! If Allâh made the night continuous for you till the Day of Resurrection, which ilâh (god) besides Allâh could bring you light? Will you not then hear?\"",
            "english_rwwad": "Say, “What do you think, if Allah were to make the night perpetual for you until the Day of Resurrection, which god other than Allah could bring you shining light? Do you not then listen?”"
        }
    },
    {
        "id": 3323,
        "chapter": 28,
        "verse": 72,
        "arabic_text": "قُلۡ أَرَءَيۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَيۡكُمُ ٱلنَّهَارَ سَرۡمَدًا إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِلَيۡلٖ تَسۡكُنُونَ فِيهِۚ أَفَلَا تُبۡصِرُونَ",
        "phonetic": "28.72 Qul 'Ara'aytum 'In Ja`ala Allāhu `Alaykumu An-Nahāra Sarmadāan 'Ilá Yawmi Al-Qiyāmati Man 'Ilahun Ghayru Allāhi Ya'tīkum Bilaylin Taskunūna Fīhi 'Afalā Tubşirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you considered: if Allāh should make for you the day continuous until the Day of Resurrection, what deity other than Allāh could bring you a night in which you may rest? Then will you not see?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Tell me! If Allâh made the day continuous for you till the Day of Resurrection, which ilâh (god) besides Allâh could bring you night wherein you rest? Will you not then see?\"",
            "english_rwwad": "Say, “What do you think, if Allah were to make the day perpetual for you until the Day of Resurrection, which god other than Allah could bring you night to rest in? Do you not then see?”"
        }
    },
    {
        "id": 3324,
        "chapter": 28,
        "verse": 73,
        "arabic_text": "وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ لِتَسۡكُنُواْ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ",
        "phonetic": "28.73 Wa Min Raĥmatihi Ja`ala Lakumu Al-Layla Wa An-Nahāra Litaskunū Fīhi Wa Litabtaghū Min Fađlihi Wa La`allakum Tashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And out of His mercy He made for you the night and the day that you may rest therein and [by day] seek from His bounty and [that] perhaps you will be grateful.",
            "english_hilali_khan": "It is out of His Mercy that He has made for you the night and the day that you may rest therein (i.e. during the night) and that you may seek of His Bounty (i.e. during the day) - and in order that you may be grateful.",
            "english_rwwad": "It is out of His mercy that He made for you the night and day, so that you may rest therein and seek of His bounty, and so that you may be grateful."
        }
    },
    {
        "id": 3325,
        "chapter": 28,
        "verse": 74,
        "arabic_text": "وَيَوۡمَ يُنَادِيهِمۡ فَيَقُولُ أَيۡنَ شُرَكَآءِيَ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ",
        "phonetic": "28.74 Wa Yawma Yunādīhim Fayaqūlu 'Ayna Shurakā'iya Al-Ladhīna Kuntum Taz`umūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [warn of] the Day He will call them and say, \"Where are My 'partners' which you used to claim?\"",
            "english_hilali_khan": "And (remember) the Day when He (your Lord - Allâh) will call to them (those who worshipped others along with Allâh), and will say: \"Where are My (so-called) partners, whom you used to assert?\"",
            "english_rwwad": "And [beware of] the Day when He will call out to them and say, “Where are those whom you claimed to be My partners?”"
        }
    },
    {
        "id": 3326,
        "chapter": 28,
        "verse": 75,
        "arabic_text": "وَنَزَعۡنَا مِن كُلِّ أُمَّةٖ شَهِيدٗا فَقُلۡنَا هَاتُواْ بُرۡهَٰنَكُمۡ فَعَلِمُوٓاْ أَنَّ ٱلۡحَقَّ لِلَّهِ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ",
        "phonetic": "28.75 Wa Naza`nā Min Kulli 'Ummatin Shahīdāan Faqulnā Hātū Burhānakum Fa`alimū 'Anna Al-Ĥaqqa Lillāhi Wa Đalla `Anhum Mā Kānū Yaftarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will extract from every nation a witness and say, \"Produce your proof,\" and they will know that the truth belongs to Allāh, and lost from them is that which they used to invent.",
            "english_hilali_khan": "And We shall take out from every nation a witness, and We shall say: \"Bring your proof.\" Then they shall know that the truth is with Allâh (Alone), and the lies (false gods) which they invented will disappear from them.",
            "english_rwwad": "We will bring forth from every nation a witness and say, “Bring your proof.” They will then know that the truth is with Allah, and all [false gods] that they used to invent will be lost from them."
        }
    },
    {
        "id": 3327,
        "chapter": 28,
        "verse": 76,
        "arabic_text": "۞ إِنَّ قَٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَيۡهِمۡۖ وَءَاتَيۡنَٰهُ مِنَ ٱلۡكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلۡعُصۡبَةِ أُوْلِي ٱلۡقُوَّةِ إِذۡ قَالَ لَهُۥ قَوۡمُهُۥ لَا تَفۡرَحۡۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡفَرِحِينَ",
        "phonetic": "28.76 'Inna Qārūna Kāna Min Qawmi Mūsá Fabaghá `Alayhim Wa 'Ātaynāhu Mina Al-Kunūzi Mā 'Inna Mafātiĥahu Latanū'u Bil-`Uşbati 'Ūlī Al-Qūwati 'Idh Qāla Lahu Qawmuhu Lā Tafraĥ 'Inna Allāha Lā Yuĥibbu Al-Fariĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Qārūn was from the people of Moses, but he tyrannized them. And We gave him of treasures whose keys would burden a band of strong men; thereupon his people said to him, \"Do not exult. Indeed, Allāh does not like the exultant.",
            "english_hilali_khan": "Verily, Qârûn (Korah) was of Mûsâ’s (Moses) people, but he behaved arrogantly towards them. And We gave him of the treasures, that of which the keys would have been a burden to a body of strong men. Remember when his people said to him: \"Do not exult (with riches, being ungrateful to Allâh). Verily Allâh likes not those who exult (with riches, being ungrateful to Allâh).",
            "english_rwwad": "Indeed, Korah was one of the people of Moses, but he behaved arrogantly towards them. We had given him such treasures that their keys would weigh down a group of strong men. When his people said to him, “Do not exult, for Allah does not like the exultant."
        }
    },
    {
        "id": 3328,
        "chapter": 28,
        "verse": 77,
        "arabic_text": "وَٱبۡتَغِ فِيمَآ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلۡأٓخِرَةَۖ وَلَا تَنسَ نَصِيبَكَ مِنَ ٱلدُّنۡيَاۖ وَأَحۡسِن كَمَآ أَحۡسَنَ ٱللَّهُ إِلَيۡكَۖ وَلَا تَبۡغِ ٱلۡفَسَادَ فِي ٱلۡأَرۡضِۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ",
        "phonetic": "28.77 Wa Abtaghi Fīmā 'Ātāka Allāhu Ad-Dāra Al-'Ākhirata Wa Lā Tansa Naşībaka Mina Ad-Dunyā Wa 'Aĥsin Kamā 'Aĥsana Allāhu 'Ilayka Wa Lā Tabghi Al-Fasāda Fī Al-'Arđi 'Inna Allāha Lā Yuĥibbu Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But seek, through that which Allāh has given you, the home of the Hereafter; and [yet], do not forget your share of the world. And do good as Allāh has done good to you. And desire not corruption in the land. Indeed, Allāh does not like corrupters.\"",
            "english_hilali_khan": "\"But seek, with that (wealth) which Allâh has bestowed on you, the home of the Hereafter, and forget not your portion of lawful enjoyment in this world; and do good as Allâh has been good to you, and seek not mischief in the land. Verily, Allâh likes not the Mufsidûn (those who commit great crimes and sins, oppressors, tyrants, mischief-makers, corrupters).\"",
            "english_rwwad": "Rather, seek with what Allah has given you the abode of the Hereafter, without forgetting your share of this world, and do good as Allah has done good to you, and do not seek to spread corruption in the land, for Allah does not like those who spread corruption.”"
        }
    },
    {
        "id": 3329,
        "chapter": 28,
        "verse": 78,
        "arabic_text": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَلَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡـَٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ",
        "phonetic": "28.78 Qāla 'Innamā 'Ūtītuhu `Alá `Ilmin `Indī 'Awalam Ya`lam 'Anna Allāha Qad 'Ahlaka Min Qablihi Mina Al-Qurūni Man Huwa 'Ashaddu Minhu Qūwatan Wa 'Aktharu Jam`āan Wa Lā Yus'alu `An Dhunūbihimu Al-Mujrimūna",
        "footnotes": {
            "english_saheeh": "[1119]- There will be no need to enumerate their sins separately, as their quantity is obvious and more than sufficient to warrant punishment in Hell.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"I was only given it because of knowledge I have.\" Did he not know that Allāh had destroyed before him of generations those who were greater than him in power and greater in accumulation [of wealth]? But the criminals, about their sins, will not be asked.[1119]",
            "english_hilali_khan": "He said: \"This has been given to me only because of the knowledge I possess.\" Did he not know that Allâh had destroyed before him generations, men who were stronger than him in might and greater in the amount (of riches) they had collected? But the Mujrimûn (criminals, disbelievers, polytheists, sinners) will not be questioned of their sins (because Allâh knows them well, so they will be punished without being called to account).",
            "english_rwwad": "He said, “I have been given all this because of the knowledge that I have.” Did he not know that Allah destroyed some generations before him who were superior to him in power and greater in accumulating [wealth]? There will be no need for the wicked to be asked about their sins."
        }
    },
    {
        "id": 3330,
        "chapter": 28,
        "verse": 79,
        "arabic_text": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ",
        "phonetic": "28.79 Fakharaja `Alá Qawmihi Fī Zīnatihi Qāla Al-Ladhīna Yurīdūna Al-Ĥayāata Ad-Dunyā Yālayta Lanā Mithla Mā 'Ūtiya Qārūnu 'Innahu Ladhū Ĥažžin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he came out before his people in his adornment. Those who desired the worldly life said, \"Oh, would that we had like what was given to Qārūn. Indeed, he is one of great fortune.\"",
            "english_hilali_khan": "So he went forth before his people in his pomp. Those who were desirous of the life of the world, said: \"Ah, would that we had the like of what Qârûn (Korah) has been given! Verily he is the owner of a great fortune.\"",
            "english_rwwad": "He came out before his people in all his glamor. Those who desired the life of this world said, “Oh, would that we had the like of what Korah has been given! He is indeed a man of great fortune.”"
        }
    },
    {
        "id": 3331,
        "chapter": 28,
        "verse": 80,
        "arabic_text": "وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ",
        "phonetic": "28.80 Wa Qāla Al-Ladhīna 'Ūtū Al-`Ilma Waylakum Thawābu Allāhi Khayrun Liman 'Āmana Wa `Amila Şāliĥāan Wa Lā Yulaqqāhā 'Illā Aş-Şābirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who had been given knowledge said, \"Woe to you! The reward of Allāh is better for he who believes and does righteousness. And none are granted it except the patient.\"",
            "english_hilali_khan": "But those who had been given (religious) knowledge said: \"Woe to you! The Reward of Allâh (in the Hereafter) is better for those who believe and do righteous good deeds, and this none shall attain except those who are As-Sâbirûn (the patient in following the truth).\"",
            "english_rwwad": "But those who were given knowledge said, “Woe to you! Allah’s reward is better for those who believe and do righteous deeds. But none will attain this except those who are steadfast.”"
        }
    },
    {
        "id": 3332,
        "chapter": 28,
        "verse": 81,
        "arabic_text": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ",
        "phonetic": "28.81 Fakhasafnā Bihi Wa Bidārihi Al-'Arđa Famā Kāna Lahu Min Fi'atin Yanşurūnahu Min Dūni Allāhi Wa Mā Kāna Mina Al-Muntaşirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.28:81) Chapter 5. Whoever drags his garment out of pride and arrogance (conceit).\na) Narrated Abû Hurairahرضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"Allâh will not look, on the Day of Resurrection, at a person who drags his Izâr* (behind him) out of pride and arrogance.\" [See the footnote of (V.22:9)]\nb) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم (or Abul-Qasim صلى الله عليه وسلم) said, \"While a man was walking, clad in a two-piece garment and proud of himself with his hair well-combed, suddenly Allâh made him sink into the earth and he will go on sinking into it till the Day of Resurrection.\"\nc) Narrated ‘Abdullâh (bin ‘Umar رضي الله عنهما): Allâh’s Messenger صلى الله عليه وسلم said, ‘While a man was dragging his Izâr* on the ground (behind him), suddenly Allâh made him sink into the earth and he will go on sinking into it till the Day of Resurrection.\" (Sahih Al-Bukhari, Vol.7, Hadith No.679, 680, 681).\nIzâr: Lower-half body-cover.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We caused the earth to swallow him and his home. And there was for him no company to aid him other than Allāh, nor was he of those who [could] defend themselves.",
            "english_hilali_khan": "So We caused the earth to swallow him[1] and his dwelling place. Then he had no group or party to help him against Allâh, nor was he one of those who could save themselves.",
            "english_rwwad": "Then We caused the earth to swallow him and his house. There was no one to help him against Allah, nor was he able to help himself."
        }
    },
    {
        "id": 3333,
        "chapter": 28,
        "verse": 82,
        "arabic_text": "وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ",
        "phonetic": "28.82 Wa 'Aşbaĥa Al-Ladhīna Tamannaw Makānahu Bil-'Amsi Yaqūlūna Wayka'anna Allāha Yabsuţu Ar-Rizqa Liman Yashā'u Min `Ibādihi Wa Yaqdiru Lawlā 'An Manna Allāhu `Alaynā Lakhasafa Binā Wayka'annahu Lā Yufliĥu Al-Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who had wished for his position the previous day began to say, \"Oh, how Allāh extends provision to whom He wills of His servants and restricts it! If not that Allāh had conferred favor on us, He would have caused it to swallow us. Oh, how the disbelievers do not succeed!\"",
            "english_hilali_khan": "And those who had desired (for a position like) his position the day before, began to say: \"Know you not that it is Allâh Who enlarges the provision or restricts it to whomsoever He pleases of His slaves. Had it not been that Allâh was Gracious to us, He could have caused the earth to swallow us up (also)! Know you not that the disbelievers will never be successful.",
            "english_rwwad": "Those who had wished for his position the day before started saying, “Oh, it is surely Allah Who extends provisions to whom He wills or restricts it. If Allah had not favored us, He could have caused the earth to swallow us too. Oh, indeed the disbelievers will never succeed.”"
        }
    },
    {
        "id": 3334,
        "chapter": 28,
        "verse": 83,
        "arabic_text": "تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ",
        "phonetic": "28.83 Tilka Ad-Dāru Al-'Ākhiratu Naj`aluhā Lilladhīna Lā Yurīdūna `Ulūwāan Fī Al-'Arđi Wa Lā Fasādāan Wa Al-`Āqibatu Lilmuttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.28:83) See the footnote of (V.22:9)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That home of the Hereafter We assign to those who do not desire exaltedness upon the earth or corruption. And the [best] outcome is for the righteous.",
            "english_hilali_khan": "That home of the Hereafter (i.e. Paradise), We shall assign to those who rebel not against the truth with pride[2] and oppression in the land nor do mischief by committing crimes. And the good end is for the Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "That is the abode of the Hereafter We will assign to those who neither seek superiority nor corruption on earth. The best outcome is for those who fear Allah."
        }
    },
    {
        "id": 3335,
        "chapter": 28,
        "verse": 84,
        "arabic_text": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّـَٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "28.84 Man Jā'a Bil-Ĥasanati Falahu Khayrun Minhā Wa Man Jā'a Bis-Sayyi'ati Falā Yujzá Al-Ladhīna `Amilū As-Sayyi'āti 'Illā Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever comes [on the Day of Judgement] with a good deed will have better than it; and whoever comes with an evil deed - then those who did evil deeds will not be recompensed except [as much as] what they used to do.",
            "english_hilali_khan": "Whosoever brings good (Islâmic Monotheism along with righteous deeds), he shall have the better thereof; and whosoever brings evil (polytheism along with evil deeds), then those who do evil deeds will only be requited for what they used to do.",
            "english_rwwad": "Whoever comes with a good deed will be rewarded with what is better, and whoever comes with an evil deed, the evildoers will only be recompensed for what they used to do."
        }
    },
    {
        "id": 3336,
        "chapter": 28,
        "verse": 85,
        "arabic_text": "إِنَّ ٱلَّذِي فَرَضَ عَلَيۡكَ ٱلۡقُرۡءَانَ لَرَآدُّكَ إِلَىٰ مَعَادٖۚ قُل رَّبِّيٓ أَعۡلَمُ مَن جَآءَ بِٱلۡهُدَىٰ وَمَنۡ هُوَ فِي ضَلَٰلٖ مُّبِينٖ",
        "phonetic": "28.85 'Inna Al-Ladhī Farađa `Alayka Al-Qur'āna Larādduka 'Ilá Ma`ādin Qul Rabbī 'A`lamu Man Jā'a Bil-Hudá Wa Man Huwa Fī Đalālin Mubīnin",
        "footnotes": {
            "english_saheeh": "[1120]- Meaning to Makkah (in this life) or to Paradise (in the Hereafter).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, [O Muḥammad], He who imposed upon you the Qur’ān will take you back to a place of return.[1120] Say, \"My Lord is most knowing of who brings guidance and who is in clear error.\"",
            "english_hilali_khan": "Verily, He Who has given you (O Muhammad صلى الله عليه وسلم) the Qur’an (i.e. ordered you to act on its laws and to preach it to others) will surely bring you back to Ma‘âd (place of return, either to Makkah or to Paradise after your death). Say (O Muhammad صلى الله عليه وسلم): \"My Lord is Aware of him who brings guidance, and of him who is in manifest error.\"",
            "english_rwwad": "Indeed, the One Who has ordained for you the Qur’an will bring you back home [to Makkah]. Say, “My Lord knows best who has come with guidance and who is clearly misguided.”"
        }
    },
    {
        "id": 3337,
        "chapter": 28,
        "verse": 86,
        "arabic_text": "وَمَا كُنتَ تَرۡجُوٓاْ أَن يُلۡقَىٰٓ إِلَيۡكَ ٱلۡكِتَٰبُ إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۖ فَلَا تَكُونَنَّ ظَهِيرٗا لِّلۡكَٰفِرِينَ",
        "phonetic": "28.86 Wa Mā Kunta Tarjū 'An Yulqá 'Ilayka Al-Kitābu 'Illā Raĥmatan Min Rabbika Falā Takūnanna Žahīrāan Lilkāfirīna",
        "footnotes": {
            "english_saheeh": "[1121]- In their religion by making any concessions to their beliefs.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you were not expecting that the Book would be conveyed to you, but [it is] a mercy from your Lord. So do not be an assistant to the disbelievers.[1121]",
            "english_hilali_khan": "And you were not expecting that the Book (this Qur’ân) would be sent down to you, but it is a mercy from your Lord. So never be a supporter of the disbelievers.",
            "english_rwwad": "You were not expecting the Book to be revealed to you, but it was a mercy from your Lord. So never be a supporter to the disbelievers."
        }
    },
    {
        "id": 3338,
        "chapter": 28,
        "verse": 87,
        "arabic_text": "وَلَا يَصُدُّنَّكَ عَنۡ ءَايَٰتِ ٱللَّهِ بَعۡدَ إِذۡ أُنزِلَتۡ إِلَيۡكَۖ وَٱدۡعُ إِلَىٰ رَبِّكَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "28.87 Wa Lā Yaşuddunnaka `An 'Āyāti Allāhi Ba`da 'Idh 'Unzilat 'Ilayka Wa Ad`u 'Ilá Rabbika Wa Lā Takūnanna Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.28:87) i.e: in the Oneness (Tauhîd ) of Allâh - (1) Oneness of the Lordship of Allâh; (2) Oneness of the worship of Allâh; (3) Oneness of the Names and Qualities of Allâh.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And never let them avert you from the verses of Allāh after they have been revealed to you. And invite [people] to your Lord. And never be of those who associate others with Allāh.",
            "english_hilali_khan": "And let them not turn you (O Muhammad صلى الله عليه وسلم) away from (preaching) the Ayât (revelations and verses) of Allâh after they have been sent down to you: and invite (men) to (believe in) your Lord[1] and be not of Al-Mushrikûn (those who associate partners with Allâh, e.g. polytheists, pagans, idolaters, and those who disbelieve in the Oneness of Allâh and deny the Prophethood of Messenger Muhammad صلى الله عليه وسلم).",
            "english_rwwad": "Do not let them turn you away from Allah’s verses after they have been sent down to you. Rather, call people to your Lord, and never be among those who associate partners with Allah."
        }
    },
    {
        "id": 3339,
        "chapter": 28,
        "verse": 88,
        "arabic_text": "وَلَا تَدۡعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۘ لَآ إِلَٰهَ إِلَّا هُوَۚ كُلُّ شَيۡءٍ هَالِكٌ إِلَّا وَجۡهَهُۥۚ لَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ",
        "phonetic": "28.88 Wa Lā Tad`u Ma`a Allāhi 'Ilahāan 'Ākhara Lā 'Ilāha 'Illā Huwa Kullu Shay'in Hālikun 'Illā Wajhahu Lahu Al-Ĥukmu Wa 'Ilayhi Turja`ūna",
        "footnotes": {
            "english_saheeh": "[1122]- i.e., except Himself.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not invoke with Allāh another deity. There is no deity except Him. Everything will be destroyed except His Face.[1122] His is the judgement, and to Him you will be returned.",
            "english_hilali_khan": "And invoke not any other ilâh (god) along with Allâh: Lâ ilâha illa Huwa (none has the right to be worshipped but He). Everything will perish save His Face. His is the Decision, and to Him you (all) shall be returned.",
            "english_rwwad": "Do not supplicate with Allah another god; none has the right to be worshiped except Him. Everything will perish except Him. His is the Judgment and to Him you will all be brought back."
        }
    }
]