[
    {
        "id": 4058,
        "chapter": 39,
        "verse": 1,
        "arabic_text": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ",
        "phonetic": "39.1 Tanzīlu Al-Kitābi Mina Allāhi Al-`Azīzi Al-Ĥakīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The revelation of the Book [i.e., the Qur’ān] is from Allāh, the Exalted in Might, the Wise.",
            "english_hilali_khan": "The revelation of this Book (the Qur’ân) is from Allâh, the All-Mighty, the All-Wise.",
            "english_rwwad": "The revelation of this Book is from Allah, the All-Mighty, All-Wise."
        }
    },
    {
        "id": 4059,
        "chapter": 39,
        "verse": 2,
        "arabic_text": "إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ فَٱعۡبُدِ ٱللَّهَ مُخۡلِصٗا لَّهُ ٱلدِّينَ",
        "phonetic": "39.2 'Innā 'Anzalnā 'Ilayka Al-Kitāba Bil-Ĥaqqi Fā`budi Allāha Mukhlişāan Lahu Ad-Dīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We have sent down to you the Book, [O Muḥammad], in truth. So worship Allāh, [being] sincere to Him in religion.",
            "english_hilali_khan": "Verily We have sent down the Book to you (O Muhammad صلى الله عليه وسلم) in truth: So worship Allâh (Alone) by doing religious deeds sincerely for Allâh’s sake only.",
            "english_rwwad": "Indeed, We have sent down to you [O Prophet] the Book with the truth, so worship Allah with sincere devotion to Him."
        }
    },
    {
        "id": 4060,
        "chapter": 39,
        "verse": 3,
        "arabic_text": "أَلَا لِلَّهِ ٱلدِّينُ ٱلۡخَالِصُۚ وَٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَ مَا نَعۡبُدُهُمۡ إِلَّا لِيُقَرِّبُونَآ إِلَى ٱللَّهِ زُلۡفَىٰٓ إِنَّ ٱللَّهَ يَحۡكُمُ بَيۡنَهُمۡ فِي مَا هُمۡ فِيهِ يَخۡتَلِفُونَۗ إِنَّ ٱللَّهَ لَا يَهۡدِي مَنۡ هُوَ كَٰذِبٞ كَفَّارٞ",
        "phonetic": "39.3 'Alā Lillāhi Ad-Dīnu Al-Khālişu Wa Al-Ladhīna Attakhadhū Min Dūnihi 'Awliyā'a Mā Na`buduhum 'Illā Liyuqarribūnā 'Ilá Allāhi Zulfá 'Inna Allāha Yaĥkumu Baynahum Fī Mā Hum Fīhi Yakhtalifūna 'Inna Allāha Lā Yahdī Man Huwa Kādhibun Kaffārun",
        "footnotes": {
            "english_saheeh": "[1339]- i.e., acceptable to Allāh is that none be associated with Him in worship and obedience.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Unquestionably, for Allāh is the pure religion.[1339] And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allāh in position.\" Indeed, Allāh will judge between them concerning that over which they differ. Indeed, Allāh does not guide he who is a liar and [confirmed] disbeliever.",
            "english_hilali_khan": "Surely the religion (i.e. the worship and the obedience) is for Allâh only. And those who take Auliyâ’ (protectors, helpers, lords, gods) besides Him (say): \"We worship them only that they may bring us near to Allâh.\" Verily Allâh will judge between them concerning that wherein they differ. Truly, Allâh guides not him who is a liar, and a disbeliever.",
            "english_rwwad": "Indeed, sincere devotion is due to Allah alone. As for those who take others as guardians besides Him, [saying], “We only worship them so that they may bring us closer to Allah.” Allah will judge between them concerning that over which they differ. Allah does not guide anyone who is a liar and persistent disbeliever."
        }
    },
    {
        "id": 4061,
        "chapter": 39,
        "verse": 4,
        "arabic_text": "لَّوۡ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَدٗا لَّٱصۡطَفَىٰ مِمَّا يَخۡلُقُ مَا يَشَآءُۚ سُبۡحَٰنَهُۥۖ هُوَ ٱللَّهُ ٱلۡوَٰحِدُ ٱلۡقَهَّارُ",
        "phonetic": "39.4 Law 'Arāda Allāhu 'An Yattakhidha Waladāan Lāşţafá Mimmā Yakhluqu Mā Yashā'u Subĥānahu Huwa Allāhu Al-Wāĥidu Al-Qahhāru",
        "footnotes": {
            "english_saheeh": "[1340]- Refer to footnotes in 12:39.",
            "english_hilali_khan": "(V.39:4) See the footnote of (V.2:116).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If Allāh had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allāh, the One, the Prevailing.[1340]",
            "english_hilali_khan": "Had Allâh willed to take a son (or offspring), He could have chosen whom He willed out of those whom He created. But glory be to Him! (He is above such things). He is Allâh, the One, the Irresistible[1].",
            "english_rwwad": "If Allah had willed to take for Himself a son, He could have chosen whatever He wished from among what He creates. Glory be to Him. He is Allah, the One, the Subjugator."
        }
    },
    {
        "id": 4062,
        "chapter": 39,
        "verse": 5,
        "arabic_text": "خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۖ يُكَوِّرُ ٱلَّيۡلَ عَلَى ٱلنَّهَارِ وَيُكَوِّرُ ٱلنَّهَارَ عَلَى ٱلَّيۡلِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمًّىۗ أَلَا هُوَ ٱلۡعَزِيزُ ٱلۡغَفَّٰرُ",
        "phonetic": "39.5 Khalaqa As-Samāwāti Wa Al-'Arđa Bil-Ĥaqqi Yukawwiru Al-Layla `Alá An-Nahāri Wa Yukawwiru An-Nahāra `Alá Al-Layli Wa Sakhkhara Ash-Shamsa Wa Al-Qamara Kullun Yajrī Li'jalin Musammáan 'Alā Huwa Al-`Azīzu Al-Ghaffāru",
        "footnotes": {
            "english_saheeh": "[1341]- Refer to footnotes in 38:66.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver.[1341]",
            "english_hilali_khan": "He has created the heavens and the earth with truth. He makes the night to go in the day and makes the day to go in the night. And He has subjected the sun and the moon. Each running (on a fixed course) for an appointed term. Verily, He is the All-Mighty, the Oft-Forgiving.",
            "english_rwwad": "He created the heavens and earth for a true purpose. He wraps the night over the day and wraps the day over the night. He has subjected the sun and the moon, each running its course for an appointed term. Indeed, He is the All-Mighty, Most Forgiving."
        }
    },
    {
        "id": 4063,
        "chapter": 39,
        "verse": 6,
        "arabic_text": "خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ ثُمَّ جَعَلَ مِنۡهَا زَوۡجَهَا وَأَنزَلَ لَكُم مِّنَ ٱلۡأَنۡعَٰمِ ثَمَٰنِيَةَ أَزۡوَٰجٖۚ يَخۡلُقُكُمۡ فِي بُطُونِ أُمَّهَٰتِكُمۡ خَلۡقٗا مِّنۢ بَعۡدِ خَلۡقٖ فِي ظُلُمَٰتٖ ثَلَٰثٖۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ لَهُ ٱلۡمُلۡكُۖ لَآ إِلَٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُصۡرَفُونَ",
        "phonetic": "39.6 Khalaqakum Min Nafsin Wāĥidatin Thumma Ja`ala Minhā Zawjahā Wa 'Anzala Lakum Mina Al-'An`ām Thamāniyata 'Azwājin Yakhluqukum Fī Buţūni 'Ummahātikum Khalqāan Min Ba`di Khalqin Fī Žulumātin Thalāthin Dhalikumu Allāhu Rabbukum Lahu Al-Mulku Lā 'Ilāha 'Illā Huwa Fa'anná Tuşrafūna",
        "footnotes": {
            "english_saheeh": "[1342]- See 6:143-144.\n[1343]- i.e., the belly, the womb, and the amniotic membrane.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He created you from one soul. Then He made from it its mate, and He produced for you from the grazing livestock eight mates.[1342] He creates you in the wombs of your mothers, creation after creation, within three darknesses.[1343] That is Allāh, your Lord; to Him belongs dominion. There is no deity except Him, so how are you averted?",
            "english_hilali_khan": "He created you (all) from a single person (Adam); then made from him his wife [Hawwâ’ (Eve)]. And He has sent down for you of cattle eight pairs (of the sheep, two, male and female; of the goats, two, male and female; of the oxen, two, male and female; and of the camels, two, male and female). He creates you in the wombs of your mothers: creation after creation in three veils of darkness. Such is Allâh your Lord. His is the kingdom. Lâ ilâha illâ Huwa (none has the right to be worshipped but He). How then are you turned away?",
            "english_rwwad": "He created you from a single soul, then He made from it its mate, and He created for you eight pairs of livestock. He creates you in the wombs of your mothers [in stages], creation after creation, in three layers of darkness. Such is Allah, your Lord. To Him belongs the dominion; none has the right to be worshiped except Him. So how are you averted?"
        }
    },
    {
        "id": 4064,
        "chapter": 39,
        "verse": 7,
        "arabic_text": "إِن تَكۡفُرُواْ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنكُمۡۖ وَلَا يَرۡضَىٰ لِعِبَادِهِ ٱلۡكُفۡرَۖ وَإِن تَشۡكُرُواْ يَرۡضَهُ لَكُمۡۗ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ",
        "phonetic": "39.7 'In Takfurū Fa'inna Allāha Ghanīyun `Ankum Wa Lā Yarđá Li`ibādihi Al-Kufra Wa 'In Tashkurū Yarđahu Lakum Wa Lā Taziru Wāziratun Wizra 'Ukhrá Thumma 'Ilá Rabbikum Marji`ukum Fayunabbi'ukum Bimā Kuntum Ta`malūna 'Innahu `Alīmun Bidhāti Aş-Şudūri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you disbelieve - indeed, Allāh is Free from need of you. And He does not approve for His servants disbelief. And if you are grateful, He approves [i.e., likes] it for you; and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you about what you used to do. Indeed, He is Knowing of that within the breasts.",
            "english_hilali_khan": "If you disbelieve, then verily, Allâh is not in need of you; He likes not disbelief for His slaves. And if you are grateful (by being believers), He is pleased therewith for you. No bearer of burdens shall bear the burden of another. Then to your Lord is your return, and He will inform you what you used to do. Verily, He is the All-Knower of that which is in (men’s) breasts.",
            "english_rwwad": "If you disbelieve, then Allah is in no need of you, but He does not approve of disbelief for His slaves. If you are grateful, He approves that for you. No bearer of burden can bear the burden of another. Then to your Lord is your return, and He will inform you of what you used to do. He is All-Knowing of what is in the hearts."
        }
    },
    {
        "id": 4065,
        "chapter": 39,
        "verse": 8,
        "arabic_text": "۞ وَإِذَا مَسَّ ٱلۡإِنسَٰنَ ضُرّٞ دَعَا رَبَّهُۥ مُنِيبًا إِلَيۡهِ ثُمَّ إِذَا خَوَّلَهُۥ نِعۡمَةٗ مِّنۡهُ نَسِيَ مَا كَانَ يَدۡعُوٓاْ إِلَيۡهِ مِن قَبۡلُ وَجَعَلَ لِلَّهِ أَندَادٗا لِّيُضِلَّ عَن سَبِيلِهِۦۚ قُلۡ تَمَتَّعۡ بِكُفۡرِكَ قَلِيلًا إِنَّكَ مِنۡ أَصۡحَٰبِ ٱلنَّارِ",
        "phonetic": "39.8 Wa 'Idhā Massa Al-'Insāna Đurrun Da`ā Rabbahu Munībāan 'Ilayhi Thumma 'Idhā Khawwalahu Ni`matan Minhu Nasiya Mā Kāna Yad`ū 'Ilayhi Min Qablu Wa Ja`ala Lillāhi 'Andādāan Liyuđilla `An Sabīlihi Qul Tamatta` Bikufrika Qalīlāan 'Innaka Min 'Aşĥābi An-Nāri",
        "footnotes": {
            "english_saheeh": "[1344]- Or \"that for which he called upon Him before.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before,[1344] and he attributes to Allāh equals to mislead [people] from His way. Say, \"Enjoy your disbelief for a little; indeed, you are of the companions of the Fire.\"",
            "english_hilali_khan": "And when some hurt touches man, he cries to his Lord (Allâh Alone), turning to Him in repentance. But when He bestows a favour upon him from Himself, he forgets that for which he cried for before, and he sets up rivals to Allâh, in order to mislead others from His Path. Say: \"Take pleasure in your disbelief for a while: surely you are (one) of the dwellers of the Fire!\"",
            "english_rwwad": "When adversity befalls man, he calls upon his Lord, turning to Him in repentance. Then when his Lord bestows His favor upon him, he forgets the adversity for which he was calling upon Him before, and sets up rivals to Allah, to mislead others from His way. Say [O Prophet], “Enjoy your disbelief for a little while; you will be one of the people of the Fire.”"
        }
    },
    {
        "id": 4066,
        "chapter": 39,
        "verse": 9,
        "arabic_text": "أَمَّنۡ هُوَ قَٰنِتٌ ءَانَآءَ ٱلَّيۡلِ سَاجِدٗا وَقَآئِمٗا يَحۡذَرُ ٱلۡأٓخِرَةَ وَيَرۡجُواْ رَحۡمَةَ رَبِّهِۦۗ قُلۡ هَلۡ يَسۡتَوِي ٱلَّذِينَ يَعۡلَمُونَ وَٱلَّذِينَ لَا يَعۡلَمُونَۗ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ",
        "phonetic": "39.9 'Amman Huwa Qānitun 'Ānā'a Al-Layli Sājidāan Wa Qā'imāan Yaĥdharu Al-'Ākhirata Wa Yarjū Raĥmata Rabbihi Qul Hal Yastawī Al-Ladhīna Ya`lamūna Wa Al-Ladhīna Lā Ya`lamūna 'Innamā Yatadhakkaru 'Ūlū Al-'Albābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Is one who is devoutly obedient during periods of the night, prostrating and standing [in prayer], fearing the Hereafter and hoping for the mercy of his Lord, [like one who does not]? Say, \"Are those who know equal to those who do not know?\" Only they will remember [who are] people of understanding.",
            "english_hilali_khan": "Is one who is obedient to Allâh, prostrating himself or standing (in prayer) during the hours of the night, fearing the Hereafter and hoping for the Mercy of his Lord (like one who disbelieves)? Say: \"Are those who know equal to those who know not?\" It is only men of understanding who will remember (i.e. get a lesson from Allâh’s Signs and Verses).",
            "english_rwwad": "[Is he better] or the one who constantly worships during the night, prostrating and standing, fearing the Hereafter and hoping for the mercy of his Lord? Say, “Are those who know equal to those who do not know?” It is only the people of understanding who will take heed."
        }
    },
    {
        "id": 4067,
        "chapter": 39,
        "verse": 10,
        "arabic_text": "قُلۡ يَٰعِبَادِ ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ رَبَّكُمۡۚ لِلَّذِينَ أَحۡسَنُواْ فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٞۗ وَأَرۡضُ ٱللَّهِ وَٰسِعَةٌۗ إِنَّمَا يُوَفَّى ٱلصَّٰبِرُونَ أَجۡرَهُم بِغَيۡرِ حِسَابٖ",
        "phonetic": "39.10 Qul Yā `Ibādi Al-Ladhīna 'Āmanū Attaqū Rabbakum Lilladhīna 'Aĥsanū Fī Hadhihi Ad-Dunyā Ĥasanatun Wa 'Arđu Allāhi Wāsi`atun 'Innamā Yuwaffá Aş-Şābirūna 'Ajrahum Bighayri Ĥisābin",
        "footnotes": {
            "english_saheeh": "[1345]- The Prophet (ﷺ) is instructed to say on behalf of Allāh (subḥānahu wa taʿālā) to His believing servants.",
            "english_hilali_khan": "(V.39:10) See the footnote of (V.16:126).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say,[1345] \"O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allāh is spacious. Indeed, the patient will be given their reward without account [i.e., limit].\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"O My slaves who believe (in the Oneness of Allâh - Islâmic Monotheism), be afraid of your Lord (Allâh) and keep your duty to Him. Good is (the reward) for those who do good in this world, and Allâh’s earth is spacious (so if you cannot worship Allâh at a place, then go to another)! Only those who are patient shall receive their reward in full, without reckoning.[1]\"",
            "english_rwwad": "Say, “O My slaves who believe, fear your Lord. Those who do good in this world will have a good return, and Allah’s earth is spacious. Those who observe patience will be given their reward without measure.”"
        }
    },
    {
        "id": 4068,
        "chapter": 39,
        "verse": 11,
        "arabic_text": "قُلۡ إِنِّيٓ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ مُخۡلِصٗا لَّهُ ٱلدِّينَ",
        "phonetic": "39.11 Qul 'Innī 'Umirtu 'An 'A`buda Allāha Mukhlişāan Lahu Ad-Dīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Indeed, I have been commanded to worship Allāh, [being] sincere to Him in religion.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Verily I am commanded to worship Allâh (Alone) by obeying Him and doing religious deeds sincerely for His sake only.",
            "english_rwwad": "Say, “I have been commanded to worship Allah, with sincere devotion to Him,"
        }
    },
    {
        "id": 4069,
        "chapter": 39,
        "verse": 12,
        "arabic_text": "وَأُمِرۡتُ لِأَنۡ أَكُونَ أَوَّلَ ٱلۡمُسۡلِمِينَ",
        "phonetic": "39.12 Wa 'Umirtu Li'n 'Akūna 'Awwala Al-Muslimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And I have been commanded to be the first [among you] of the Muslims.\"",
            "english_hilali_khan": "\"And I am commanded (this) in order that I may be the first of those who submit themselves to Allâh (in Islâm) as Muslims.\"",
            "english_rwwad": "and I have been commanded to be the first of those who submit to Allah.”"
        }
    },
    {
        "id": 4070,
        "chapter": 39,
        "verse": 13,
        "arabic_text": "قُلۡ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ",
        "phonetic": "39.13 Qul 'Innī 'Akhāfu 'In `Aşaytu Rabbī `Adhāba Yawmin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Verily if I disobey my Lord, I am afraid of the torment of a great Day.\"",
            "english_rwwad": "Say, “I truly fear, if I were to disobey my Lord, the punishment of a momentous Day.”"
        }
    },
    {
        "id": 4071,
        "chapter": 39,
        "verse": 14,
        "arabic_text": "قُلِ ٱللَّهَ أَعۡبُدُ مُخۡلِصٗا لَّهُۥ دِينِي",
        "phonetic": "39.14 Quli Allāha 'A`budu Mukhlişāan Lahu Dīni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Allāh [alone] do I worship, sincere to Him in my religion,",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Allâh Alone I worship by doing religious deeds sincerely for His sake only (and not to show off, and not to set up rivals with Him in worship.)\"",
            "english_rwwad": "Say, “It is Allah alone Whom I worship, with sincere devotion to Him."
        }
    },
    {
        "id": 4072,
        "chapter": 39,
        "verse": 15,
        "arabic_text": "فَٱعۡبُدُواْ مَا شِئۡتُم مِّن دُونِهِۦۗ قُلۡ إِنَّ ٱلۡخَٰسِرِينَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ وَأَهۡلِيهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ أَلَا ذَٰلِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِينُ",
        "phonetic": "39.15 Fā`budū Mā Shi'tum Min Dūnihi Qul 'Inna Al-Khāsirīna Al-Ladhīna Khasirū 'Anfusahum Wa 'Ahlīhim Yawma Al-Qiyāmati 'Alā Dhālika Huwa Al-Khusrānu Al-Mubīnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So worship what you will besides Him.\" Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\"",
            "english_hilali_khan": "So worship what you like besides Him. Say (O Muhammad صلى الله عليه وسلم): \"The losers are those who will lose themselves and their families on the Day of Resurrection. Verily, that will be a manifest loss!\"",
            "english_rwwad": "So worship whatever you wish besides Him.” Say, “Indeed, the losers are those who will lose themselves and their families on the Day of Resurrection. That is indeed the clear loss.”"
        }
    },
    {
        "id": 4073,
        "chapter": 39,
        "verse": 16,
        "arabic_text": "لَهُم مِّن فَوۡقِهِمۡ ظُلَلٞ مِّنَ ٱلنَّارِ وَمِن تَحۡتِهِمۡ ظُلَلٞۚ ذَٰلِكَ يُخَوِّفُ ٱللَّهُ بِهِۦ عِبَادَهُۥۚ يَٰعِبَادِ فَٱتَّقُونِ",
        "phonetic": "39.16 Lahum Min Fawqihim Žulalun Mina An-Nāri Wa Min Taĥtihim Žulalun Dhālika Yukhawwifu Allāhu Bihi `Ibādahu Yā `Ibādi Fa Attaqūni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will have canopies [i.e., layers] of fire above them and below them, canopies. By that Allāh threatens [i.e., warns] His servants. O My servants, then fear Me.",
            "english_hilali_khan": "They shall have coverings of Fire, above them and covering (of Fire) beneath them. With this Allâh does frighten His slaves: \"O My slaves, therefore fear Me!\"",
            "english_rwwad": "They will have layers of fire above them and below them. That is how Allah warns His slaves. Then fear Me, O My slaves!"
        }
    },
    {
        "id": 4074,
        "chapter": 39,
        "verse": 17,
        "arabic_text": "وَٱلَّذِينَ ٱجۡتَنَبُواْ ٱلطَّٰغُوتَ أَن يَعۡبُدُوهَا وَأَنَابُوٓاْ إِلَى ٱللَّهِ لَهُمُ ٱلۡبُشۡرَىٰۚ فَبَشِّرۡ عِبَادِ",
        "phonetic": "39.17 Wa Al-Ladhīna Ajtanabū Aţ-Ţāghūta 'An Ya`budūhā Wa 'Anābū 'Ilá Allāhi Lahumu Al-Bushrá Fabashir `Ibādi",
        "footnotes": {
            "english_saheeh": "[1346]- i.e., Satan or any false object of worship.",
            "english_hilali_khan": "(V.39:17) See the footnote of (V.2:256).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who have avoided ṭāghūt,[1346] lest they worship it, and turned back to Allāh - for them are good tidings. So give good tidings to My servants",
            "english_hilali_khan": "Those who avoid At-Tâghût [1] (false deities) by not worshipping them and turn to Allâh (in repentance), for them are glad tidings; so announce the good news to My slaves -",
            "english_rwwad": "But those who shun the worship of false gods and penitently turn to Allah, there are glad tidings for them. So give glad tidings to My slaves,"
        }
    },
    {
        "id": 4075,
        "chapter": 39,
        "verse": 18,
        "arabic_text": "ٱلَّذِينَ يَسۡتَمِعُونَ ٱلۡقَوۡلَ فَيَتَّبِعُونَ أَحۡسَنَهُۥٓۚ أُوْلَٰٓئِكَ ٱلَّذِينَ هَدَىٰهُمُ ٱللَّهُۖ وَأُوْلَٰٓئِكَ هُمۡ أُوْلُواْ ٱلۡأَلۡبَٰبِ",
        "phonetic": "39.18 Al-Ladhīna Yastami`ūna Al-Qawla Fayattabi`ūna 'Aĥsanahu 'Ūlā'ika Al-Ladhīna Hadāhumu Allāhu Wa 'Ūlā'ika Hum 'Ūlū Al-'Albābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:18) Like Zaid bin ‘Amr bin Nufail, Salmân Al-Fârisi and Abû Dharr Al-Ghifârî. [Tafsir Al- Qurtubi, also see the footnote of (V.2:135)].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who listen to speech and follow the best of it. Those are the ones Allāh has guided, and those are people of understanding.",
            "english_hilali_khan": "Those who listen to the Word [good advice Lâ ilâha illallâh - (none has the right to be worshipped but Allâh) and Islâmic Monotheism] and follow the best thereof (i.e. worship Allâh Alone, repent to Him and avoid Tâghût) those are (the ones) whom Allâh has guided and those are men of understanding.[2]",
            "english_rwwad": "those who listen to what is said and follow the best of it. They are the ones whom Allah has guided, and they are the people of understanding."
        }
    },
    {
        "id": 4076,
        "chapter": 39,
        "verse": 19,
        "arabic_text": "أَفَمَنۡ حَقَّ عَلَيۡهِ كَلِمَةُ ٱلۡعَذَابِ أَفَأَنتَ تُنقِذُ مَن فِي ٱلنَّارِ",
        "phonetic": "39.19 'Afaman Ĥaqqa `Alayhi Kalimatu Al-`Adhābi 'Afa'anta Tunqidhu Man Fī An-Nāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, is one who has deserved the decree of punishment [to be guided]? Then, can you save one who is in the Fire?",
            "english_hilali_khan": "Is, then one against whom the Word of punishment is justified (equal to the one who avoids evil)? Will you (O Muhammad صلى الله عليه وسلم) rescue him who is in the Fire?",
            "english_rwwad": "Can you save those against whom the decree of punishment has been passed to be in the Fire?"
        }
    },
    {
        "id": 4077,
        "chapter": 39,
        "verse": 20,
        "arabic_text": "لَٰكِنِ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ لَهُمۡ غُرَفٞ مِّن فَوۡقِهَا غُرَفٞ مَّبۡنِيَّةٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَعۡدَ ٱللَّهِ لَا يُخۡلِفُ ٱللَّهُ ٱلۡمِيعَادَ",
        "phonetic": "39.20 Lakini Al-Ladhīna Attaqaw Rabbahum Lahum Ghurafun Min Fawqihā Ghurafun Mabnīyatun Tajrī Min Taĥtihā Al-'Anhāru Wa`da Allāhi Lā Yukhlifu Allāhu Al-Mī`ād",
        "footnotes": {
            "english_saheeh": "[1347]- i.e., elevated rooms, dwellings or palaces.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who have feared their Lord - for them are chambers,[1347] above them chambers built high, beneath which rivers flow. [This is] the promise of Allāh. Allāh does not fail in [His] promise.",
            "english_hilali_khan": "But those who fear their Lord (Allâh) and keep their duty to Him, for them are built lofty rooms, one above another under which rivers flow (i.e. Paradise). (This is) the Promise of Allâh: and Allâh does not fail in (His) Promise.",
            "english_rwwad": "But those who fear their Lord will have lofty mansions, built one above another, under which rivers flow. This is the promise of Allah; Allah never breaks His promise."
        }
    },
    {
        "id": 4078,
        "chapter": 39,
        "verse": 21,
        "arabic_text": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَلَكَهُۥ يَنَٰبِيعَ فِي ٱلۡأَرۡضِ ثُمَّ يُخۡرِجُ بِهِۦ زَرۡعٗا مُّخۡتَلِفًا أَلۡوَٰنُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَجۡعَلُهُۥ حُطَٰمًاۚ إِنَّ فِي ذَٰلِكَ لَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ",
        "phonetic": "39.21 'Alam Tará 'Anna Allāha 'Anzala Mina As-Samā'i Mā'an Fasalakahu Yanābī`a Fī Al-'Arđi Thumma Yukhriju Bihi Zar`āan Mukhtalifāan 'Alwānuhu Thumma Yahīju Fatarāhu Muşfarrāan Thumma Yaj`aluhu Ĥuţāmāan 'Inna Fī Dhālika Ladhikrá Li'wlī Al-'Albābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do you not see that Allāh sends down rain from the sky and makes it flow as springs [and rivers] in the earth; then He produces thereby crops of varying colors; then they dry and you see them turned yellow; then He makes them [scattered] debris. Indeed in that is a reminder for those of understanding.",
            "english_hilali_khan": "See you not that Allâh sends down water (rain) from the sky, and causes it to penetrate the earth, (and then makes it to spring up) as water-springs, and afterward thereby produces crops of different colours, and afterward they wither and you see them turn yellow; then He makes them dry and broken pieces. Verily, in this is a Reminder for men of understanding.",
            "english_rwwad": "Do you not see that Allah sends down rain from the sky and makes it flow as springs in the earth, then He brings forth thereby crops of various colors; then they whither and you see them turn yellow; then He causes them to crumble? Indeed, there is a reminder in this for people of understanding."
        }
    },
    {
        "id": 4079,
        "chapter": 39,
        "verse": 22,
        "arabic_text": "أَفَمَن شَرَحَ ٱللَّهُ صَدۡرَهُۥ لِلۡإِسۡلَٰمِ فَهُوَ عَلَىٰ نُورٖ مِّن رَّبِّهِۦۚ فَوَيۡلٞ لِّلۡقَٰسِيَةِ قُلُوبُهُم مِّن ذِكۡرِ ٱللَّهِۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ",
        "phonetic": "39.22 'Afaman Sharaĥa Allāhu Şadrahu Lil'islāmi Fahuwa `Alá Nūrin Min Rabbihi Fawaylun Lilqāsiyati Qulūbuhum Min Dhikri Allāhi 'Ūlā'ika Fī Đalālin Mubīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So is one whose breast Allāh has expanded to [accept] Islām and he is upon [i.e., guided by] a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allāh. Those are in manifest error.",
            "english_hilali_khan": "Is he whose breast Allâh has opened to Islâm, so that he is in light from His Lord (as he who is a non-Muslim)? So woe to those whose hearts are hardened against remembrance of Allâh! They are in plain error!",
            "english_rwwad": "Is one whose heart Allah has opened to Islam, so he is enlightened by his Lord [like a disbeliever]? Woe to those whose hearts are hardened upon hearing the reminder of Allah; it is they who are clearly misguided."
        }
    },
    {
        "id": 4080,
        "chapter": 39,
        "verse": 23,
        "arabic_text": "ٱللَّهُ نَزَّلَ أَحۡسَنَ ٱلۡحَدِيثِ كِتَٰبٗا مُّتَشَٰبِهٗا مَّثَانِيَ تَقۡشَعِرُّ مِنۡهُ جُلُودُ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُمۡ ثُمَّ تَلِينُ جُلُودُهُمۡ وَقُلُوبُهُمۡ إِلَىٰ ذِكۡرِ ٱللَّهِۚ ذَٰلِكَ هُدَى ٱللَّهِ يَهۡدِي بِهِۦ مَن يَشَآءُۚ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٍ",
        "phonetic": "39.23 Allāhu Nazzala 'Aĥsana Al-Ĥadīthi Kitābāan Mutashābihāan Mathāniya Taqsha`irru Minhu Julūdu Al-Ladhīna Yakhshawna Rabbahum Thumma Talīnu Julūduhum Wa Qulūbuhum 'Ilá Dhikri Allāhi Dhālika Hudá Allāhi Yahdī Bihi Man Yashā'u Wa Man Yuđlili Allāhu Famā Lahu Min Hādin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance [i.e., mention] of Allāh. That is the guidance of Allāh by which He guides whom He wills. And one whom Allāh sends astray - for him there is no guide.",
            "english_hilali_khan": "Allâh has sent down the Best Statement, a Book (this Qur’ân), its parts resembling each other (in goodness and truth) (and) oft-repeated. The skins of those who fear their Lord shiver from it (when they recite it or hear it). Then their skin and their heart soften to the remembrance of Allâh. That is the guidance of Allâh. He Guides therewith whom He wills; and whomever Allâh sends astray, for him there is no guide.",
            "english_rwwad": "Allah has sent down the best message – a consistent Book of repeated lessons – causing the skins of those who fear their Lord to shiver, then their skins and their hearts soften at the remembrance of Allah. This is the guidance of Allah by which He guides whom He wills. But whoever Allah causes to stray, there is none to guide him."
        }
    },
    {
        "id": 4081,
        "chapter": 39,
        "verse": 24,
        "arabic_text": "أَفَمَن يَتَّقِي بِوَجۡهِهِۦ سُوٓءَ ٱلۡعَذَابِ يَوۡمَ ٱلۡقِيَٰمَةِۚ وَقِيلَ لِلظَّٰلِمِينَ ذُوقُواْ مَا كُنتُمۡ تَكۡسِبُونَ",
        "phonetic": "39.24 'Afaman Yattaqī Biwajhihi Sū'a Al-`Adhābi Yawma Al-Qiyāmati Wa Qīla Lilžžālimīna Dhūqū Mā Kuntum Taksibūna",
        "footnotes": {
            "english_saheeh": "[1348]- Rather than his hands, which will be chained to his neck.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then is he who will shield with his face[1348] the worst of the punishment on the Day of Resurrection [like one secure from it]? And it will be said to the wrongdoers, \"Taste what you used to earn.\"",
            "english_hilali_khan": "Is he then, who will confront with his face the awful torment on the Day of Resurrection (as he who enters peacefully in Paradise)? And it will be said to the Zâlimûn (polytheists and wrong-doers): \"Taste what you used to earn!\"",
            "english_rwwad": "Is one who will shield himself from the terrible punishment with his face on the Day of Resurrection [like someone in Paradise]? And it will be said to the wrongdoers: “Taste what you used to earn.”"
        }
    },
    {
        "id": 4082,
        "chapter": 39,
        "verse": 25,
        "arabic_text": "كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَيۡثُ لَا يَشۡعُرُونَ",
        "phonetic": "39.25 Kadhaba Al-Ladhīna Min Qablihim Fa'atāhumu Al-`Adhābu Min Ĥaythu Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those before them denied, and punishment came upon them from where they did not perceive.",
            "english_hilali_khan": "Those before them belied, and so the torment came on them from directions they perceived not.",
            "english_rwwad": "Those who came before them also disbelieved, so the punishment came upon them from where they could not imagine."
        }
    },
    {
        "id": 4083,
        "chapter": 39,
        "verse": 26,
        "arabic_text": "فَأَذَاقَهُمُ ٱللَّهُ ٱلۡخِزۡيَ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَكۡبَرُۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
        "phonetic": "39.26 Fa'adhāqahumu Allāhu Al-Khizya Fī Al-Ĥayāati Ad-Dunyā Wa La`adhābu Al-'Ākhirati 'Akbaru Law Kānū Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So Allāh made them taste disgrace in worldly life. But the punishment of the Hereafter is greater, if they only knew.",
            "english_hilali_khan": "So Allâh made them to taste the disgrace in the present life, but greater is the torment of the Hereafter if they only knew!",
            "english_rwwad": "Therefore Allah gave them a taste of disgrace in the life of this world, but the punishment of the Hereafter is far greater, if only they knew."
        }
    },
    {
        "id": 4084,
        "chapter": 39,
        "verse": 27,
        "arabic_text": "وَلَقَدۡ ضَرَبۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ لَّعَلَّهُمۡ يَتَذَكَّرُونَ",
        "phonetic": "39.27 Wa Laqad Đarabnā Lilnnāsi Fī Hādhā Al-Qur'āni Min Kulli Mathalin La`allahum Yatadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly presented for the people in this Qur’ān from every [kind of] example - that they might remember.",
            "english_hilali_khan": "And indeed We have put forth for men, in this Qur’ân every kind of similitude in order that they may remember.",
            "english_rwwad": "Indeed, We have presented for mankind all kinds of examples in this Qur’an, so that they may take heed –"
        }
    },
    {
        "id": 4085,
        "chapter": 39,
        "verse": 28,
        "arabic_text": "قُرۡءَانًا عَرَبِيًّا غَيۡرَ ذِي عِوَجٖ لَّعَلَّهُمۡ يَتَّقُونَ",
        "phonetic": "39.28 Qur'ānāan `Arabīyāan Ghayra Dhī `Iwajin La`allahum Yattaqūna",
        "footnotes": {
            "english_saheeh": "[1349]- From the truth.\n[1350]- Through consciousness of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It is] an Arabic Qur’ān, without any deviance[1349] that they might become righteous.[1350]",
            "english_hilali_khan": "An Arabic Qur’ân, without any crookedness (therein) in order that they may avoid all evil which Allâh has ordered them to avoid, fear Him and keep their duty to Him.",
            "english_rwwad": "an Arabic Qur’an, free of flaws and contradictions, so that they may be conscious of Allah."
        }
    },
    {
        "id": 4086,
        "chapter": 39,
        "verse": 29,
        "arabic_text": "ضَرَبَ ٱللَّهُ مَثَلٗا رَّجُلٗا فِيهِ شُرَكَآءُ مُتَشَٰكِسُونَ وَرَجُلٗا سَلَمٗا لِّرَجُلٍ هَلۡ يَسۡتَوِيَانِ مَثَلًاۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "39.29 Đaraba Allāhu Mathalāan Rajulāan Fīhi Shurakā'u Mutashākisūna Wa Rajulāan Salamāan Lirajulin Hal Yastawiyāni Mathalāan Al-Ĥamdu Lillāhi Bal 'Aktharuhum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh presents an example: a man [i.e., slave] owned by quarreling partners and another belonging exclusively to one man - are they equal in comparison? Praise be to Allāh! But most of them do not know.",
            "english_hilali_khan": "Allâh puts forth a similitude: a (slave) man belonging to many partners (like those who worship others along with Allâh) disputing with one another, and a (slave) man belonging entirely to one master (like those who worship Allâh Alone). Are those two equal in comparison? All the praises and thanks be to Allâh! But most of them know not.",
            "english_rwwad": "Allah makes a comparison of a slave owned by several quarrelsome masters, and a slave owned by only one master. Are they equal in comparison? All praise be to Allah. But most of them do not know."
        }
    },
    {
        "id": 4087,
        "chapter": 39,
        "verse": 30,
        "arabic_text": "إِنَّكَ مَيِّتٞ وَإِنَّهُم مَّيِّتُونَ",
        "phonetic": "39.30 'Innaka Mayyitun Wa 'Innahum Mayyitūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, you are to die, and indeed, they are to die.",
            "english_hilali_khan": "Verily you (O Muhammad صلى الله عليه وسلم) will die, and verily they (too) will die.",
            "english_rwwad": "You [O Prophet] will surely die, and they too will die;"
        }
    },
    {
        "id": 4088,
        "chapter": 39,
        "verse": 31,
        "arabic_text": "ثُمَّ إِنَّكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عِندَ رَبِّكُمۡ تَخۡتَصِمُونَ",
        "phonetic": "39.31 Thumma 'Innakum Yawma Al-Qiyāmati `Inda Rabbikum Takhtaşimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then indeed you, on the Day of Resurrection, before your Lord, will dispute.",
            "english_hilali_khan": "Then, on the Day of Resurrection, you will be disputing before your Lord.",
            "english_rwwad": "then on the Day of Resurrection, you will dispute with one another before your Lord."
        }
    },
    {
        "id": 4089,
        "chapter": 39,
        "verse": 32,
        "arabic_text": "۞ فَمَنۡ أَظۡلَمُ مِمَّن كَذَبَ عَلَى ٱللَّهِ وَكَذَّبَ بِٱلصِّدۡقِ إِذۡ جَآءَهُۥٓۚ أَلَيۡسَ فِي جَهَنَّمَ مَثۡوٗى لِّلۡكَٰفِرِينَ",
        "phonetic": "39.32 Faman 'Ažlamu Mimman Kadhaba `Alá Allāhi Wa Kadhaba Biş-Şidqi 'Idh Jā'ahu 'Alaysa Fī Jahannama Mathwáan Lilkāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:32) See the footnote of (V.6:101).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So who is more unjust than one who lies about Allāh and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?",
            "english_hilali_khan": "Then, who does more wrong than one who utters a lie against Allâh,[1] and denies the truth [this Qur’ân, the Prophet (Muhammad صلى الله عليه وسلم) and the Islâmic Monotheism] when it comes to him! Is there not in Hell an abode for the disbelievers?",
            "english_rwwad": "Who is then more unjust than he who tells lies about Allah and rejects the truth when it comes to him? Is there no abode for the disbelievers in Hell?"
        }
    },
    {
        "id": 4090,
        "chapter": 39,
        "verse": 33,
        "arabic_text": "وَٱلَّذِي جَآءَ بِٱلصِّدۡقِ وَصَدَّقَ بِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلۡمُتَّقُونَ",
        "phonetic": "39.33 Wa Al-Ladhī Jā'a Biş-Şidqi Wa Şaddaqa Bihi 'Ūlā'ika Humu Al-Muttaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the one who has brought the truth [i.e., the Prophet (ﷺ)] and [they who] believed in it - those are the righteous.",
            "english_hilali_khan": "And he (Muhammad صلى الله عليه وسلم) who has brought the truth (this Qur’ân and Islâmic Monotheism) and (those who) believed therein (i.e. the true believers of Islâmic Monotheism), those are Al-Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "But the one who came with the truth and believed in it – it is they who are the righteous."
        }
    },
    {
        "id": 4091,
        "chapter": 39,
        "verse": 34,
        "arabic_text": "لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمۡۚ ذَٰلِكَ جَزَآءُ ٱلۡمُحۡسِنِينَ",
        "phonetic": "39.34 Lahum Mā Yashā'ūna `Inda Rabbihim Dhālika Jazā'u Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will have whatever they desire with their Lord. That is the reward of the doers of good -",
            "english_hilali_khan": "They shall have all that they will desire with their Lord. That is the reward of Muhsinûn (good-doers - see the footnote of V.9:120).",
            "english_rwwad": "They will have with their Lord whatever they wish for. Such is the reward of those who do good."
        }
    },
    {
        "id": 4092,
        "chapter": 39,
        "verse": 35,
        "arabic_text": "لِيُكَفِّرَ ٱللَّهُ عَنۡهُمۡ أَسۡوَأَ ٱلَّذِي عَمِلُواْ وَيَجۡزِيَهُمۡ أَجۡرَهُم بِأَحۡسَنِ ٱلَّذِي كَانُواْ يَعۡمَلُونَ",
        "phonetic": "39.35 Liyukaffira Allāhu `Anhum 'Aswa'a Al-Ladhī `Amilū Wa Yajziyahum 'Ajrahum Bi'aĥsani Al-Ladhī Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:35) See the footnote of (V.9:121).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That Allāh may remove from them the worst of what they did and reward them their due for the best of what they used to do.",
            "english_hilali_khan": "So that Allâh may expiate from them the evil of what they did and give them the reward, according to the best of what they used to do.[2]",
            "english_rwwad": "And Allah will absolve them of their worst deeds and reward them according to the best of what they used to do."
        }
    },
    {
        "id": 4093,
        "chapter": 39,
        "verse": 36,
        "arabic_text": "أَلَيۡسَ ٱللَّهُ بِكَافٍ عَبۡدَهُۥۖ وَيُخَوِّفُونَكَ بِٱلَّذِينَ مِن دُونِهِۦۚ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ",
        "phonetic": "39.36 'Alaysa Allāhu Bikāfin `Abdahu Wa Yukhawwifūnaka Bial-Ladhīna Min Dūnihi Wa Man Yuđlili Allāhu Famā Lahu Min Hādin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Is not Allāh sufficient for His Servant [i.e., Prophet Muḥammad (ﷺ)]? And [yet], they threaten you with those [they worship] other than Him. And whoever Allāh leaves astray - for him there is no guide.",
            "english_hilali_khan": "Is not Allâh Sufficient for His slave? Yet they try to frighten you with those (whom they worship) besides Him! And whom Allâh sends astray, for him there will be no guide.",
            "english_rwwad": "Is Allah not sufficient for His slave? Yet they frighten you with those [whom they worship] besides Him. Whoever Allah causes to stray, there is none to guide him."
        }
    },
    {
        "id": 4094,
        "chapter": 39,
        "verse": 37,
        "arabic_text": "وَمَن يَهۡدِ ٱللَّهُ فَمَا لَهُۥ مِن مُّضِلٍّۗ أَلَيۡسَ ٱللَّهُ بِعَزِيزٖ ذِي ٱنتِقَامٖ",
        "phonetic": "39.37 Wa Man Yahdi Allāhu Famā Lahu Min Muđillin 'Alaysa Allāhu Bi`azīzin Dhī Antiqāmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whoever Allāh guides - for him there is no misleader. Is not Allāh Exalted in Might and Owner of Retribution?",
            "english_hilali_khan": "And whomsoever Allâh guides, for him there will be no misleader. Is not Allâh All-Mighty, Possessor of Retribution?",
            "english_rwwad": "And whoever Allah guides, none can lead him astray. Is not Allah All-Mighty, Capable of Retribution?"
        }
    },
    {
        "id": 4095,
        "chapter": 39,
        "verse": 38,
        "arabic_text": "وَلَئِن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ لَيَقُولُنَّ ٱللَّهُۚ قُلۡ أَفَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ إِنۡ أَرَادَنِيَ ٱللَّهُ بِضُرٍّ هَلۡ هُنَّ كَٰشِفَٰتُ ضُرِّهِۦٓ أَوۡ أَرَادَنِي بِرَحۡمَةٍ هَلۡ هُنَّ مُمۡسِكَٰتُ رَحۡمَتِهِۦۚ قُلۡ حَسۡبِيَ ٱللَّهُۖ عَلَيۡهِ يَتَوَكَّلُ ٱلۡمُتَوَكِّلُونَ",
        "phonetic": "39.38 Wa La'in Sa'altahum Man Khalaqa As-Samāwāti Wa Al-'Arđa Layaqūlunna Allāhu Qul 'Afara'aytum Mā Tad`ūna Min Dūni Allāhi 'In 'Arādaniya Allāhu Biđurrin Hal Hunna Kāshifātu Đurrihi 'Aw 'Arādanī Biraĥmatin Hal Hunna Mumsikātu Raĥmatihi Qul Ĥasbiya Allāhu `Alayhi Yatawakkalu Al-Mutawakkilūna",
        "footnotes": {
            "english_saheeh": "[1351]- i.e., \"Tell me about...\"",
            "english_hilali_khan": "(V.39:38) See the footnote of (V.12:67).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you asked them, \"Who created the heavens and the earth?\" they would surely say, \"Allāh.\" Say, \"Then have you considered[1351] what you invoke besides Allāh? If Allāh intended me harm, are they removers of His harm; or if He intended me mercy, are they withholders of His mercy?\" Say, \"Sufficient for me is Allāh; upon Him [alone] rely the [wise] reliers.\"",
            "english_hilali_khan": "And verily, if you ask them: \"Who created the heavens and the earth?\" Surely they will say: \"Allâh (has created them).\" Say: \"Tell me then, the things that you invoke besides Allâh - if Allâh intended some harm for me, could they remove His harm? Or if He (Allâh) intended some mercy for me, could they withhold His Mercy?\" Say: \"Sufficient for me is Allâh; in Him those who trust (i.e. believers) must put their trust.[3]\"",
            "english_rwwad": "If you ask them who created the heavens and earth, they will surely say, “Allah.” Say, “Then tell me about those whom you supplicate besides Allah; if Allah wills to harm me, can they remove His harm? Or if He wills mercy for me, can they withhold His mercy?” Say, “Allah is sufficient for me; in Him alone do the reliant put their trust.”"
        }
    },
    {
        "id": 4096,
        "chapter": 39,
        "verse": 39,
        "arabic_text": "قُلۡ يَٰقَوۡمِ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنِّي عَٰمِلٞۖ فَسَوۡفَ تَعۡلَمُونَ",
        "phonetic": "39.39 Qul Yā Qawmi A`malū `Alá Makānatikum 'Innī `Āmilun Fasawfa Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"O my people, work according to your position, [for] indeed, I am working; and you are going to know",
            "english_hilali_khan": "Say: (O Muhammad صلى الله عليه وسلم) \"O My people! Work according to your way, I am working (according to my way). Then you will come to know",
            "english_rwwad": "Say, “O my people, carry on as you are, and so will I. You will come to know"
        }
    },
    {
        "id": 4097,
        "chapter": 39,
        "verse": 40,
        "arabic_text": "مَن يَأۡتِيهِ عَذَابٞ يُخۡزِيهِ وَيَحِلُّ عَلَيۡهِ عَذَابٞ مُّقِيمٌ",
        "phonetic": "39.40 Man Ya'tīhi `Adhābun Yukhzīhi Wa Yaĥillu `Alayhi `Adhābun Muqīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "To whom will come a torment disgracing him and on whom will descend an enduring punishment.\"",
            "english_hilali_khan": "\"To whom comes a disgracing torment, and on whom descends an everlasting torment.\"",
            "english_rwwad": "who will receive a humiliating punishment, and upon whom will descend an everlasting punishment.”"
        }
    },
    {
        "id": 4098,
        "chapter": 39,
        "verse": 41,
        "arabic_text": "إِنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ لِلنَّاسِ بِٱلۡحَقِّۖ فَمَنِ ٱهۡتَدَىٰ فَلِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۖ وَمَآ أَنتَ عَلَيۡهِم بِوَكِيلٍ",
        "phonetic": "39.41 'Innā 'Anzalnā `Alayka Al-Kitāba Lilnnāsi Bil-Ĥaqqi Famani Ahtadá Falinafsihi Wa Man Đalla Fa'innamā Yađillu `Alayhā Wa Mā 'Anta `Alayhim Biwakīlin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:41) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We sent down to you the Book for the people in truth. So whoever is guided - it is for [the benefit of] his soul; and whoever goes astray only goes astray to its detriment. And you are not a manager [i.e., authority] over them.",
            "english_hilali_khan": "Verily, We have sent down to you (O Muhammad صلى الله عليه وسلم) the Book (this Qur’ân) for mankind in truth. So whosoever accepts the guidance, it is only for his ownself, and whosoever goes astray, he goes astray only for his (own) loss. And you (O Muhammad صلى الله عليه وسلم) are not a Wakîl (trustee or disposer of affairs, or guardian) over them.[1]",
            "english_rwwad": "We have sent down to you the Book with the truth for all mankind. Whoever follows the guidance, it is to his own benefit, and whoever goes astray, it is only to his own loss. You are not a keeper over them."
        }
    },
    {
        "id": 4099,
        "chapter": 39,
        "verse": 42,
        "arabic_text": "ٱللَّهُ يَتَوَفَّى ٱلۡأَنفُسَ حِينَ مَوۡتِهَا وَٱلَّتِي لَمۡ تَمُتۡ فِي مَنَامِهَاۖ فَيُمۡسِكُ ٱلَّتِي قَضَىٰ عَلَيۡهَا ٱلۡمَوۡتَ وَيُرۡسِلُ ٱلۡأُخۡرَىٰٓ إِلَىٰٓ أَجَلٖ مُّسَمًّىۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ",
        "phonetic": "39.42 Allāhu Yatawaffá Al-'Anfusa Ĥīna Mawtihā Wa A-Atī Lam Tamut Fī Manāmihā Fayumsiku Allatī Qađá `Alayhā Al-Mawta Wa Yursilu Al-'Ukhrá 'Ilá 'Ajalin Musammáan 'Inna Fī Dhālika La'āyātin Liqawmin Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought.",
            "english_hilali_khan": "It is Allâh Who takes away the souls at the time of their death, and those that die not during their sleep. He keeps those (souls) for which He has ordained death and sends the rest for a term appointed. Verily, in this are signs for a people who think deeply.",
            "english_rwwad": "Allah takes away the souls at the time of their death and of those who do not die during their sleep. He withholds the souls of those on whom He has decreed death, and releases others until an appointed term. Indeed, there are signs in this for people who reflect."
        }
    },
    {
        "id": 4100,
        "chapter": 39,
        "verse": 43,
        "arabic_text": "أَمِ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ شُفَعَآءَۚ قُلۡ أَوَلَوۡ كَانُواْ لَا يَمۡلِكُونَ شَيۡـٔٗا وَلَا يَعۡقِلُونَ",
        "phonetic": "39.43 'Ami Attakhadhū Min Dūni Allāhi Shufa`ā'a Qul 'Awalaw Kānū Lā Yamlikūna Shay'āan Wa Lā Ya`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or have they taken other than Allāh as intercessors? Say, \"Even though they do not possess [power over] anything, nor do they reason?\"",
            "english_hilali_khan": "Have they taken (others) as intercessors besides Allâh? Say: \"Even if they have power over nothing whatever and have no intelligence?\"",
            "english_rwwad": "Or have they taken besides Allah others as intercessors? Say, “Even though they have no power nor do they understand?”"
        }
    },
    {
        "id": 4101,
        "chapter": 39,
        "verse": 44,
        "arabic_text": "قُل لِّلَّهِ ٱلشَّفَٰعَةُ جَمِيعٗاۖ لَّهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ ثُمَّ إِلَيۡهِ تُرۡجَعُونَ",
        "phonetic": "39.44 Qul Lillāhi Ash-Shafā`atu Jamī`āan Lahu Mulku As-Samāwāti Wa Al-'Arđi Thumma 'Ilayhi Turja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"To Allāh belongs [the right to allow] intercession entirely. To Him belongs the dominion of the heavens and the earth. Then to Him you will be returned.\"",
            "english_hilali_khan": "Say: \"To Allâh belongs all intercession. His is the Sovereignty of the heavens and the earth. Then to Him you shall be brought back.\"",
            "english_rwwad": "Say, “All intercession belongs to Allah alone. To Him belongs the dominion of the heavens and earth, then to Him you will be returned.”"
        }
    },
    {
        "id": 4102,
        "chapter": 39,
        "verse": 45,
        "arabic_text": "وَإِذَا ذُكِرَ ٱللَّهُ وَحۡدَهُ ٱشۡمَأَزَّتۡ قُلُوبُ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِۖ وَإِذَا ذُكِرَ ٱلَّذِينَ مِن دُونِهِۦٓ إِذَا هُمۡ يَسۡتَبۡشِرُونَ",
        "phonetic": "39.45 Wa 'Idhā Dhukira Allāhu Waĥdahu Ashma'azzat Qulūbu Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati Wa 'Idhā Dhukira Al-Ladhīna Min Dūnihi 'Idhā Hum Yastabshirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:45) See the footnote of (V.2:165).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Allāh is mentioned alone, the hearts of those who do not believe in the Hereafter shrink with aversion, but when those [worshipped] other than Him are mentioned, immediately they rejoice.",
            "english_hilali_khan": "And when Allâh Alone is mentioned, the hearts of those who believe not in the Hereafter are filled with disgust (from the Oneness of Allâh توحيد الله) and when those (whom they obey or worship) besides Him [like all false deities other than Allâh, - it may be a Messenger, an angel, a pious man, a jinni, or any other creature even idols, graves of religious people, saints, priests, monks and others.] are mentioned, behold, they rejoice![2]",
            "english_rwwad": "When Allah alone is mentioned, the hearts of those who do not believe in the Hereafter shrink with aversion, but as soon as those other than Him are mentioned, they rejoice."
        }
    },
    {
        "id": 4103,
        "chapter": 39,
        "verse": 46,
        "arabic_text": "قُلِ ٱللَّهُمَّ فَاطِرَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ عَٰلِمَ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ أَنتَ تَحۡكُمُ بَيۡنَ عِبَادِكَ فِي مَا كَانُواْ فِيهِ يَخۡتَلِفُونَ",
        "phonetic": "39.46 Quli Al-Lahumma Fāţira As-Samāwāti Wa Al-'Arđi `Ālima Al-Ghaybi Wa Ash-Shahādati 'Anta Taĥkumu Bayna `Ibādika Fī Mā Kānū Fīhi Yakhtalifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"O Allāh, Creator of the heavens and the earth, Knower of the unseen and the witnessed, You will judge between your servants concerning that over which they used to differ.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"O Allâh! Creator of the heavens and the earth! All-Knower of the Ghaib (Unseen) and the seen! You will judge between your slaves about that wherein they used to differ.\"",
            "english_rwwad": "Say, “O Allah, Originator of the heavens and earth, Knower of the unseen and the seen, it is you who will judge between Your slaves concerning that over which they used to differ."
        }
    },
    {
        "id": 4104,
        "chapter": 39,
        "verse": 47,
        "arabic_text": "وَلَوۡ أَنَّ لِلَّذِينَ ظَلَمُواْ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦ مِن سُوٓءِ ٱلۡعَذَابِ يَوۡمَ ٱلۡقِيَٰمَةِۚ وَبَدَا لَهُم مِّنَ ٱللَّهِ مَا لَمۡ يَكُونُواْ يَحۡتَسِبُونَ",
        "phonetic": "39.47 Wa Law 'Anna Lilladhīna Žalamū Mā Fī Al-'Arđi Jamī`āan Wa Mithlahu Ma`ahu Lāftadaw Bihi Min Sū'i Al-`Adhābi Yawma Al-Qiyāmati Wa Badā Lahum Mina Allāhi Mā Lam Yakūnū Yaĥtasibūna",
        "footnotes": {
            "english_saheeh": "[1352]- Of His anger and punishment.",
            "english_hilali_khan": "(V.39:47) See the footnote of (V.3:91).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if those who did wrong had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby from the worst of the punishment on the Day of Resurrection. And there will appear to them from Allāh that which they had not taken into account.[1352]",
            "english_hilali_khan": "And those who did wrong (the polytheists and disbelievers in the Oneness of Allâh), if they had all that is in earth and therewith as much again, they verily, would offer it to ransom themselves therewith on the Day of Resurrection from the evil torment; and there will become apparent to them from Allâh what they had not been reckoning.[3]",
            "english_rwwad": "If the wrongdoers were to possess all that is on earth and the like of it, they would surely offer it to ransom themselves from the terrible punishment on the Day of Resurrection. There will appear to them from Allah what they had never anticipated."
        }
    },
    {
        "id": 4105,
        "chapter": 39,
        "verse": 48,
        "arabic_text": "وَبَدَا لَهُمۡ سَيِّـَٔاتُ مَا كَسَبُواْ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
        "phonetic": "39.48 Wa Badā Lahum Sayyi'ātu Mā Kasabū Wa Ĥāqa Bihim Mā Kānū Bihi Yastahzi'ūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there will appear to them the evils they had earned, and they will be enveloped by what they used to ridicule.",
            "english_hilali_khan": "And the evils of that which they earned will become apparent to them, and that which they used to mock at will encircle them.",
            "english_rwwad": "The evil consequences of their deeds will become apparent to them, and they will be overwhelmed by what they used to ridicule."
        }
    },
    {
        "id": 4106,
        "chapter": 39,
        "verse": 49,
        "arabic_text": "فَإِذَا مَسَّ ٱلۡإِنسَٰنَ ضُرّٞ دَعَانَا ثُمَّ إِذَا خَوَّلۡنَٰهُ نِعۡمَةٗ مِّنَّا قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمِۭۚ بَلۡ هِيَ فِتۡنَةٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "39.49 Fa'idhā Massa Al-'Insāna Đurrun Da`ānā Thumma 'Idhā Khawwalnāhu Ni`matan Minnā Qāla 'Innamā 'Ūtītuhu `Alá `Ilmin Bal Hiya Fitnatun Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when adversity touches man, he calls upon Us; then when We bestow on him a favor from Us, he says, \"I have only been given it because of [my] knowledge.\" Rather, it is a trial, but most of them do not know.",
            "english_hilali_khan": "When harm touches man, he calls to Us (for help); then when We have (rescued him from that harm and) changed it into a favour from Us, he says: \"Only because of knowledge (that I possess) I obtained it.\" Nay, it is only a trial, but most of them know not!",
            "english_rwwad": "When adversity befalls man, he cries out to Us. Then when We grant him a favor from Us, he says, “I have been granted this only because of my knowledge.” It is rather a test, but most of them do not know."
        }
    },
    {
        "id": 4107,
        "chapter": 39,
        "verse": 50,
        "arabic_text": "قَدۡ قَالَهَا ٱلَّذِينَ مِن قَبۡلِهِمۡ فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "39.50 Qad Qālahā Al-Ladhīna Min Qablihim Famā 'Aghná `Anhum Mā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those before them had already said it, but they were not availed by what they used to earn.",
            "english_hilali_khan": "Verily, those before them said it, yet (all) that they had earned availed them not.",
            "english_rwwad": "It was already said by those before them, but all what they earned was of no avail to them,"
        }
    },
    {
        "id": 4108,
        "chapter": 39,
        "verse": 51,
        "arabic_text": "فَأَصَابَهُمۡ سَيِّـَٔاتُ مَا كَسَبُواْۚ وَٱلَّذِينَ ظَلَمُواْ مِنۡ هَٰٓؤُلَآءِ سَيُصِيبُهُمۡ سَيِّـَٔاتُ مَا كَسَبُواْ وَمَا هُم بِمُعۡجِزِينَ",
        "phonetic": "39.51 Fa'aşābahum Sayyi'ātu Mā Kasabū Wa Al-Ladhīna Žalamū Min Hā'uulā' Sayuşībuhum Sayyi'ātu Mā Kasabū Wa Mā Hum Bimu`jizīna",
        "footnotes": {
            "english_saheeh": "[1353]- i.e., prevent Allāh from what He wills or escape from the punishment.",
            "english_hilali_khan": "(V.39:51) See the footnote of (V.5:90).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the evil consequences of what they earned struck them. And those who have wronged of these [people] will be struck [i.e., afflicted] by the evil consequences of what they earned; and they will not cause failure.[1353]",
            "english_hilali_khan": "So, the evil results of that which they earned overtook them. And those who did wrong of these [people to whom you (Muhammad صلى الله عليه وسلم) have been sent] will also be overtaken by the evil results (torment) for that which they earned; and they will never be able to escape.[1]",
            "english_rwwad": "Therefore the evil consequences of their deeds overtook them, and the wrongdoers among these [pagans] will be overtaken by the evil consequences of their deeds, and they will have no escape."
        }
    },
    {
        "id": 4109,
        "chapter": 39,
        "verse": 52,
        "arabic_text": "أَوَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "39.52 'Awalam Ya`lamū 'Anna Allāha Yabsuţu Ar-Rizqa Liman Yashā'u Wa Yaqdiru 'Inna Fī Dhālika La'āyātin Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not know that Allāh extends provision for whom He wills and restricts [it]? Indeed in that are signs for a people who believe.",
            "english_hilali_khan": "Do they not know that Allâh enlarges the provision for whom He wills, and straitens it (for whom He wills). Verily, in this are signs for the folk who believe!",
            "english_rwwad": "Do they not know that Allah extends provision to whom He wills or restricts it? Indeed, there are signs in this for people who believe."
        }
    },
    {
        "id": 4110,
        "chapter": 39,
        "verse": 53,
        "arabic_text": "۞ قُلۡ يَٰعِبَادِيَ ٱلَّذِينَ أَسۡرَفُواْ عَلَىٰٓ أَنفُسِهِمۡ لَا تَقۡنَطُواْ مِن رَّحۡمَةِ ٱللَّهِۚ إِنَّ ٱللَّهَ يَغۡفِرُ ٱلذُّنُوبَ جَمِيعًاۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ",
        "phonetic": "39.53 Qul Yā `Ibādī Al-Ladhīna 'Asrafū `Alá 'Anfusihim Lā Taqnaţū Min Raĥmati Allāhi 'Inna Allāha Yaghfiru Adh-Dhunūba Jamī`āan 'Innahu Huwa Al-Ghafūru Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "[1354]- For those who repent and correct themselves.",
            "english_hilali_khan": "(V.39:53)\nA) See the footnote of (V.9:121).\nB) See the footnote of (V.22:27).\nC) See the footnote of (V.25:70).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allāh. Indeed, Allāh forgives all sins.[1354] Indeed, it is He who is the Forgiving, the Merciful.\"",
            "english_hilali_khan": "Say: \"O ‘Ibâdî (My slaves) who have transgressed against themselves (by committing evil deeds and sins)! Despair not of the Mercy of Allâh: verily, Allâh forgives all sins. Truly He is Oft-Forgiving, Most Merciful.[2]",
            "english_rwwad": "Say [Allah says], “O My slaves who have transgressed against themselves, do not despair of Allah’s mercy, for indeed Allah forgives all sins. He is indeed the All-Forgiving, the Most Merciful."
        }
    },
    {
        "id": 4111,
        "chapter": 39,
        "verse": 54,
        "arabic_text": "وَأَنِيبُوٓاْ إِلَىٰ رَبِّكُمۡ وَأَسۡلِمُواْ لَهُۥ مِن قَبۡلِ أَن يَأۡتِيَكُمُ ٱلۡعَذَابُ ثُمَّ لَا تُنصَرُونَ",
        "phonetic": "39.54 Wa 'Anībū 'Ilá Rabbikum Wa 'Aslimū Lahu Min Qabli 'An Ya'tiyakumu Al-`Adhābu Thumma Lā Tunşarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped.",
            "english_hilali_khan": "\"And turn in repentance and in obedience with true Faith (Islâmic Monotheism) to your Lord and submit to Him (in Islâm) before the torment comes upon you, (and) then you will not be helped.",
            "english_rwwad": "Turn to your Lord [in repentance] and submit to Him before the punishment comes upon you, for then you will not be helped."
        }
    },
    {
        "id": 4112,
        "chapter": 39,
        "verse": 55,
        "arabic_text": "وَٱتَّبِعُوٓاْ أَحۡسَنَ مَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُم مِّن قَبۡلِ أَن يَأۡتِيَكُمُ ٱلۡعَذَابُ بَغۡتَةٗ وَأَنتُمۡ لَا تَشۡعُرُونَ",
        "phonetic": "39.55 Wa Attabi`ū 'Aĥsana Mā 'Unzila 'Ilaykum Min Rabbikum Min Qabli 'An Ya'tiyakumu Al-`Adhābu Baghtatan Wa 'Antum Lā Tash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And follow the best of what was revealed to you from your Lord [i.e., the Qur’ān] before the punishment comes upon you suddenly while you do not perceive,",
            "english_hilali_khan": "\"And follow the best of that which is sent down to you from your Lord (i.e. this Qur’ân, do what it orders you to do and keep away from what it forbids), before the torment comes on you suddenly while you perceive not!\"",
            "english_rwwad": "Follow the best of what has been sent down to you all from your Lord, before the punishment comes upon you by surprise while you are unaware,"
        }
    },
    {
        "id": 4113,
        "chapter": 39,
        "verse": 56,
        "arabic_text": "أَن تَقُولَ نَفۡسٞ يَٰحَسۡرَتَىٰ عَلَىٰ مَا فَرَّطتُ فِي جَنۢبِ ٱللَّهِ وَإِن كُنتُ لَمِنَ ٱلسَّٰخِرِينَ",
        "phonetic": "39.56 'An Taqūla Nafsun Yā Ĥasratā `Alá Mā Farraţtu Fī Janbi Allāhi Wa 'In Kuntu Lamina As-Sākhirīna",
        "footnotes": {
            "english_saheeh": "[1355]- On the Day of Resurrection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Lest a soul should say,[1355] \"Oh, [how great is] my regret over what I neglected in regard to Allāh and that I was among the mockers.\"",
            "english_hilali_khan": "Lest a person should say: \"Alas, my grief that I was undutiful to Allâh (i.e. I have not done what Allâh has ordered me to do), and I was indeed among those who mocked [at the truth! i.e. Lâ ilâha illallâh (none has the right to be worshipped but Allâh), the Qur’ân, and Muhammad صلى الله عليه وسلم and at the faithful believers]",
            "english_rwwad": "Lest someone should say, “Woe to me for neglecting my duties towards Allah and for being among those who mocked [the truth]”;"
        }
    },
    {
        "id": 4114,
        "chapter": 39,
        "verse": 57,
        "arabic_text": "أَوۡ تَقُولَ لَوۡ أَنَّ ٱللَّهَ هَدَىٰنِي لَكُنتُ مِنَ ٱلۡمُتَّقِينَ",
        "phonetic": "39.57 'Aw Taqūla Law 'Anna Allāha Hadānī Lakuntu Mina Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or [lest] it say, \"If only Allāh had guided me, I would have been among the righteous.\"",
            "english_hilali_khan": "Or (lest) he should say: \"If only Allâh had guided me, I should indeed have been among the Muttaqûn (the pious - See V.2:2).\"",
            "english_rwwad": "or says, “If only Allah had guided me, I would have been among the righteous”;"
        }
    },
    {
        "id": 4115,
        "chapter": 39,
        "verse": 58,
        "arabic_text": "أَوۡ تَقُولَ حِينَ تَرَى ٱلۡعَذَابَ لَوۡ أَنَّ لِي كَرَّةٗ فَأَكُونَ مِنَ ٱلۡمُحۡسِنِينَ",
        "phonetic": "39.58 'Aw Taqūla Ĥīna Tará Al-`Adhāba Law 'Anna Lī Karratan Fa'akūna Mina Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "[1356]- At worldly life.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or [lest] it say when it sees the punishment, \"If only I had another turn[1356] so I could be among the doers of good.\"",
            "english_hilali_khan": "Or (lest) he should say when he sees the torment: \"If only I had another chance (to return to the world), then I should indeed be among the Muhsinûn (good-doers - See V.2:112).\"",
            "english_rwwad": "or says, upon seeing the punishment, “If only I had another chance, I could be among those who do good.”"
        }
    },
    {
        "id": 4116,
        "chapter": 39,
        "verse": 59,
        "arabic_text": "بَلَىٰ قَدۡ جَآءَتۡكَ ءَايَٰتِي فَكَذَّبۡتَ بِهَا وَٱسۡتَكۡبَرۡتَ وَكُنتَ مِنَ ٱلۡكَٰفِرِينَ",
        "phonetic": "39.59 Balá Qad Jā'atka 'Āyātī Fakadhabta Bihā Wa Astakbarta Wa Kunta Mina Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "See the footnote of (V.22:9)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But yes, there had come to you My verses, but you denied them and were arrogant, and you were among the disbelievers.",
            "english_hilali_khan": "Yes! Verily, there came to you My Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and you denied them, and were proud[1] and were among the disbelievers.",
            "english_rwwad": "[Allah will say,] “No indeed! My verses had already come to you, but you rejected them and acted arrogantly, and you were among the disbelievers.”"
        }
    },
    {
        "id": 4117,
        "chapter": 39,
        "verse": 60,
        "arabic_text": "وَيَوۡمَ ٱلۡقِيَٰمَةِ تَرَى ٱلَّذِينَ كَذَبُواْ عَلَى ٱللَّهِ وُجُوهُهُم مُّسۡوَدَّةٌۚ أَلَيۡسَ فِي جَهَنَّمَ مَثۡوٗى لِّلۡمُتَكَبِّرِينَ",
        "phonetic": "39.60 Wa Yawma Al-Qiyāmati Tará Al-Ladhīna Kadhabū `Alá Allāhi Wujūhuhum Muswaddatun 'Alaysa Fī Jahannama Mathwáan Lilmutakabbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And on the Day of Resurrection you will see those who lied about Allāh [with] their faces blackened. Is there not in Hell a residence for the arrogant?",
            "english_hilali_khan": "And on the Day of Resurrection you will see those who lied against Allâh (i.e. attributed to Him sons, partners) - their faces will be black. Is there not in Hell an abode for the arrogant?",
            "english_rwwad": "On the Day of Resurrection you will see those who lied against Allah with their faces darkened. Is there not in Hell an abode for the arrogant?"
        }
    },
    {
        "id": 4118,
        "chapter": 39,
        "verse": 61,
        "arabic_text": "وَيُنَجِّي ٱللَّهُ ٱلَّذِينَ ٱتَّقَوۡاْ بِمَفَازَتِهِمۡ لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمۡ يَحۡزَنُونَ",
        "phonetic": "39.61 Wa Yunajjī Allāhu Al-Ladhīna Attaqaw Bimafāzatihim Lā Yamassuhumu As-Sū'u Wa Lā Hum Yaĥzanūna",
        "footnotes": {
            "english_saheeh": "[1357]- i.e., their success in the trials of worldly life and attainment of Paradise.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh will save those who feared Him by their attainment;[1357] no evil will touch them, nor will they grieve.",
            "english_hilali_khan": "to their places of success (Paradise). Evil shall touch them not, nor shall they grieve.",
            "english_rwwad": "But Allah will save those who fear Him, for they have attained salvation; no harm will touch them, nor will they grieve."
        }
    },
    {
        "id": 4119,
        "chapter": 39,
        "verse": 62,
        "arabic_text": "ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ وَكِيلٞ",
        "phonetic": "39.62 Allāhu Khāliqu Kulli Shay'in Wa Huwa `Alá Kulli Shay'in Wa Kīlun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh is the Creator of all things, and He is, over all things, Disposer of affairs.",
            "english_hilali_khan": "Allâh is the Creator of all things, and He is the Wakîl (Trustee, Disposer of affairs, Guardian) over all things.",
            "english_rwwad": "Allah is the Creator of all things, and He is the Maintainer of everything."
        }
    },
    {
        "id": 4120,
        "chapter": 39,
        "verse": 63,
        "arabic_text": "لَّهُۥ مَقَالِيدُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "39.63 Lahu Maqālīdu As-Samāwāti Wa Al-'Arđi Wa Al-Ladhīna Kafarū Bi'āyāti Allāhi 'Ūlā'ika Humu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allāh - it is those who are the losers.",
            "english_hilali_khan": "To Him belong the keys of the heavens and the earth. And those who disbelieve in the Ayât (proofs, evidence, verses, signs, revelations, etc.) of Allâh, such are they who will be the losers.",
            "english_rwwad": "To Him belong the keys of the heavens and earth. As for those who disbelieve in the verses of Allah, it is they who are the losers."
        }
    },
    {
        "id": 4121,
        "chapter": 39,
        "verse": 64,
        "arabic_text": "قُلۡ أَفَغَيۡرَ ٱللَّهِ تَأۡمُرُوٓنِّيٓ أَعۡبُدُ أَيُّهَا ٱلۡجَٰهِلُونَ",
        "phonetic": "39.64 Qul 'Afaghayra Allāhi Ta'murūnnī 'A`budu 'Ayyuhā Al-Jāhilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Is it other than Allāh that you order me to worship, O ignorant ones?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم to the polytheists): \"Do you order me to worship other than Allâh? O you fools!\"",
            "english_rwwad": "Say [O Prophet], “Do you order me to worship other than Allah, O ignorant people?”"
        }
    },
    {
        "id": 4122,
        "chapter": 39,
        "verse": 65,
        "arabic_text": "وَلَقَدۡ أُوحِيَ إِلَيۡكَ وَإِلَى ٱلَّذِينَ مِن قَبۡلِكَ لَئِنۡ أَشۡرَكۡتَ لَيَحۡبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ ٱلۡخَٰسِرِينَ",
        "phonetic": "39.65 Wa Laqad 'Ūĥiya 'Ilayka Wa 'Ilá Al-Ladhīna Min Qablika La'in 'Ashrakta Layaĥbaţanna `Amaluka Wa Latakūnanna Mina Al-Khāsirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:65)\nA) See the footnote of (V.2:165).\nB) See the footnote of (V.4:135).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it was already revealed to you and to those before you that if you should associate [anything] with Allāh, your work would surely become worthless, and you would surely be among the losers.",
            "english_hilali_khan": "And indeed it has been revealed to you (O Muhammad صلى الله عليه وسلم), as it was to those (Allâh’s Messengers) before you: \"If you join others in worship with Allâh, (then) surely (all) your deeds will be in vain, and you will certainly be among the losers.\"[2]",
            "english_rwwad": "It has already been revealed to you and to those who came before you that if you associate others with Allah, your deeds will surely become worthless, and you will certainly be among the losers."
        }
    },
    {
        "id": 4123,
        "chapter": 39,
        "verse": 66,
        "arabic_text": "بَلِ ٱللَّهَ فَٱعۡبُدۡ وَكُن مِّنَ ٱلشَّٰكِرِينَ",
        "phonetic": "39.66 Bali Allāha Fā`bud Wa Kun Mina Ash-Shākirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Rather, worship [only] Allāh and be among the grateful.",
            "english_hilali_khan": "Nay! But worship Allâh (Alone and none else), and be among the grateful.",
            "english_rwwad": "Rather, worship Allah alone and be among those who are grateful."
        }
    },
    {
        "id": 4124,
        "chapter": 39,
        "verse": 67,
        "arabic_text": "وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦ وَٱلۡأَرۡضُ جَمِيعٗا قَبۡضَتُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ وَٱلسَّمَٰوَٰتُ مَطۡوِيَّٰتُۢ بِيَمِينِهِۦۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
        "phonetic": "39.67 Wa Mā Qadarū Allāha Ĥaqqa Qadrihi Wa Al-'Arđu Jamī`āan Qabđatuhu Yawma Al-Qiyāmati Wa As-Samāwātu Maţwīyātun Biyamīnihi Subĥānahu Wa Ta`ālá `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "[1358]- i.e., appreciation of His attributes.\n[1359]- Literally, \"no more than a handful of His.\"\n[1360]- See footnote to 2:19.",
            "english_hilali_khan": "(V.39:67) See the footnote of (V.35:41).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They have not appraised Allāh with true appraisal,[1358] while the earth entirely will be [within] His grip[1359] on the Day of Resurrection, and the heavens will be folded in His right hand.[1360] Exalted is He and high above what they associate with Him.",
            "english_hilali_khan": "They made not a just estimate of Allâh such as is due to Him. And on the Day of Resurrection the whole of the earth will be grasped by His Hand[3] and the heavens will be rolled up in His Right Hand.Glorified be He, and High be He above all that they associate as partners with Him!",
            "english_rwwad": "They did not revere Allah His true reverence. On the Day of Resurrection, the whole earth will be in His Grip, and the heavens will be rolled up in His Right Hand. Glorified and exalted is He above all what they associate with Him!"
        }
    },
    {
        "id": 4125,
        "chapter": 39,
        "verse": 68,
        "arabic_text": "وَنُفِخَ فِي ٱلصُّورِ فَصَعِقَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۖ ثُمَّ نُفِخَ فِيهِ أُخۡرَىٰ فَإِذَا هُمۡ قِيَامٞ يَنظُرُونَ",
        "phonetic": "39.68 Wa Nufikha Fī Aş-Şūri Faşa`iqa Man Fī As-Samāwāti Wa Man Fī Al-'Arđi 'Illā Man Shā'a Allāhu Thumma Nufikha Fīhi 'Ukhrá Fa'idhā Hum Qiyāmun Yanžurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:68).\na) Narrated Abû Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"I will be the first to raise my head after the second blowing of the Trumpet and will see Mûsâ (Moses) holding or clinging to the Throne; and I will not know whether he had been in that state all the time or after the blowing of the Trumpet.\" (Sahih Al Bukhari, Vol. 6, Hadîth No.337).\nb) Narrated Abû Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Between the two blowings of the Trumpet there will be forty.\" The people said, \"O Abû Hurairah! Forty days?\" I refused to reply. They said, \"Forty years?\" I refused to reply. They said, \"Forty Months?\" I refused to reply and added: Everything of a human body will waste away, perish or decay except the last coccyx bone (of the tail) and from that bone Allâh will reconstruct the whole body. (Sahih Al-Bukhari, Vol. 6, Hadîth No.338).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allāh wills. Then it will be blown again, and at once they will be standing, looking on.",
            "english_hilali_khan": "And the Trumpet will be blown, and all who are in the heavens and all who are on the earth will swoon away, except him whom Allâh wills. Then it will be blown a second time, and behold they will be standing, looking on (waiting).[1]",
            "english_rwwad": "The Trumpet will be blown and all those in the heavens and all those on earth will fall dead, except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on."
        }
    },
    {
        "id": 4126,
        "chapter": 39,
        "verse": 69,
        "arabic_text": "وَأَشۡرَقَتِ ٱلۡأَرۡضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلۡكِتَٰبُ وَجِاْيٓءَ بِٱلنَّبِيِّـۧنَ وَٱلشُّهَدَآءِ وَقُضِيَ بَيۡنَهُم بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ",
        "phonetic": "39.69 Wa 'Ashraqati Al-'Arđu Binūri Rabbihā Wa Wuđi`a Al-Kitābu Wa Jī'a Bin-Nabīyīna Wa Ash-Shuhadā'i Wa Quđiya Baynahum Bil-Ĥaqqi Wa Hum Lā Yužlamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged.",
            "english_hilali_khan": "And the earth will shine with the light of its Lord (Allâh, when He will come to judge among men): and the Book will be placed (open); and the Prophets and the witnesses will be brought forward; and it will be judged between them with truth, and they will not be wronged.",
            "english_rwwad": "The earth will shine with the light of its Lord, the record of deeds will be placed, the prophets and the witnesses will be brought forth, and judgment will be passed between them with fairness, and they will not be wronged."
        }
    },
    {
        "id": 4127,
        "chapter": 39,
        "verse": 70,
        "arabic_text": "وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُوَ أَعۡلَمُ بِمَا يَفۡعَلُونَ",
        "phonetic": "39.70 Wa Wuffiyat Kullu Nafsin Mā `Amilat Wa Huwa 'A`lamu Bimā Yaf`alūna",
        "footnotes": {
            "english_saheeh": "[1361]- With no need for any record or witnesses, which are but means to establish proof to the soul itself in addition to its own knowledge of what it has done.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And every soul will be fully compensated [for] what it did; and He is most knowing[1361] of what they do.",
            "english_hilali_khan": "And each person will be paid in full of what he did; and He is Best Aware of what they do.",
            "english_rwwad": "Every soul will be paid in full for what it has done, for He knows best what they do."
        }
    },
    {
        "id": 4128,
        "chapter": 39,
        "verse": 71,
        "arabic_text": "وَسِيقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ رُسُلٞ مِّنكُمۡ يَتۡلُونَ عَلَيۡكُمۡ ءَايَٰتِ رَبِّكُمۡ وَيُنذِرُونَكُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَاۚ قَالُواْ بَلَىٰ وَلَٰكِنۡ حَقَّتۡ كَلِمَةُ ٱلۡعَذَابِ عَلَى ٱلۡكَٰفِرِينَ",
        "phonetic": "39.71 Wa Sīqa Al-Ladhīna Kafarū 'Ilá Jahannama Zumarāan Ĥattá 'Idhā Jā'ūhā Futiĥat 'Abwābuhā Wa Qāla Lahum Khazanatuhā 'Alam Ya'tikum Rusulun Minkum Yatlūna `Alaykum 'Āyāti Rabbikum Wa Yundhirūnakum Liqā'a Yawmikum Hādhā Qālū Balá Wa Lakin Ĥaqqat Kalimatu Al-`Adhābi `Alá Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.39:71) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who disbelieved will be driven to Hell in groups until, when they reach it, its gates are opened and its keepers will say, \"Did there not come to you messengers from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?\" They will say, \"Yes, but the word [i.e., decree] of punishment has come into effect upon the disbelievers.\"",
            "english_hilali_khan": "And those who disbelieved will be driven to Hell in groups till, when they reach it, the gates thereof will be opened (suddenly like a prison at the arrival of the prisoners). And its keepers will say, \"Did not the Messengers come to you from yourselves, reciting to you the Verses of your Lord, and warning you of the Meeting of this Day of yours?\" They will say: \"Yes, but the Word of torment has been justified against the disbelievers!\"[2]",
            "english_rwwad": "Those who disbelieved will be driven to Hell in groups, until when they reach it, its gates will be opened and its keepers will say to them, “Did there not come to you messengers from among you, reciting the verses of your Lord and warning you of your meeting of this Day?” They will say, “Yes indeed, but the decree of punishment has come to pass against the disbelievers.”"
        }
    },
    {
        "id": 4129,
        "chapter": 39,
        "verse": 72,
        "arabic_text": "قِيلَ ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ",
        "phonetic": "39.72 Qīla Adkhulū 'Abwāba Jahannama Khālidīna Fīhā Fabi'sa Mathwá Al-Mutakabbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[To them] it will be said, \"Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"",
            "english_hilali_khan": "It will be said (to them): \"Enter you the gates of Hell, to abide therein. And (indeed) what an evil abode of the arrogant!\"",
            "english_rwwad": "It will be said, “Enter the gates of Hell, abiding therein forever.” What a terrible abode for the arrogant!"
        }
    },
    {
        "id": 4130,
        "chapter": 39,
        "verse": 73,
        "arabic_text": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ",
        "phonetic": "39.73 Wa Sīqa Al-Ladhīna Attaqaw Rabbahum 'Ilá Al-Jannati Zumarāan Ĥattá 'Idhā Jā'ūhā Wa Futiĥat 'Abwābuhā Wa Qāla Lahum Khazanatuhā Salāmun `Alaykum Ţibtum Fādkhulūhā Khālidīna",
        "footnotes": {
            "english_saheeh": "[1362]- In such honor and joy that is beyond description - thus, the omission of this conclusion in the Arabic text.",
            "english_hilali_khan": "(V.39:73) \"Al-Muttaqûn\" See (V.2:2).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, \"Peace be upon you; you have become pure; so enter it to abide eternally therein,\" [they will enter].[1362]",
            "english_hilali_khan": "And those who kept their duty to their Lord (Al-Muttaqûn[3]) will be led to Paradise in groups, till, when they reach it, and its gates will be opened (before their arrival for their reception) and its keepers will say: Salâmun ‘Alaikum (peace be upon you)! You have done well, so enter here to abide therein.\"",
            "english_rwwad": "But those who feared their Lord will be led to Paradise in groups, until when they reach it, its gates will be wide open, and its keepers will say to them, “Peace be upon you. You have done well, so enter it, abiding forever.”"
        }
    },
    {
        "id": 4131,
        "chapter": 39,
        "verse": 74,
        "arabic_text": "وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي صَدَقَنَا وَعۡدَهُۥ وَأَوۡرَثَنَا ٱلۡأَرۡضَ نَتَبَوَّأُ مِنَ ٱلۡجَنَّةِ حَيۡثُ نَشَآءُۖ فَنِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ",
        "phonetic": "39.74 Wa Qālū Al-Ĥamdu Lillāhi Al-Ladhī Şadaqanā Wa`dahu Wa 'Awrathanā Al-'Arđa Natabawwa'u Mina Al-Jannati Ĥaythu Nashā'u Fani`ma 'Ajru Al-`Āmilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they will say, \"Praise to Allāh, who has fulfilled for us His promise and made us inherit the earth [so] we may settle in Paradise wherever we will. And excellent is the reward of [righteous] workers.\"",
            "english_hilali_khan": "And they will say: \"All the praises and thanks be to Allâh Who has fulfilled His Promise to us and has made us inherit (this) land. We can dwell in Paradise where we will; how excellent a reward for the (pious, good) workers!\"",
            "english_rwwad": "They will say, “All praise be to Allah Who has fulfilled His promise to us, and made us inherit the land to dwell wherever we please in Paradise.” How excellent is the reward of those who do [good]!"
        }
    },
    {
        "id": 4132,
        "chapter": 39,
        "verse": 75,
        "arabic_text": "وَتَرَى ٱلۡمَلَٰٓئِكَةَ حَآفِّينَ مِنۡ حَوۡلِ ٱلۡعَرۡشِ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡۚ وَقُضِيَ بَيۡنَهُم بِٱلۡحَقِّۚ وَقِيلَ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "39.75 Wa Tará Al-Malā'ikata Ĥāffīna Min Ĥawli Al-`Arshi Yusabbiĥūna Biĥamdi Rabbihim Wa Quđiya Baynahum Bil-Ĥaqqi Wa Qīla Al-Ĥamdu Lillāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you will see the angels surrounding the Throne, exalting [Allāh] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise to Allāh, Lord of the worlds.\"",
            "english_hilali_khan": "And you will see the angels surrounding the Throne (of Allâh) from all round, glorifying the praises of their Lord (Allâh). And they (all the creatures) will be judged with truth. And it will be said, \"All the praises and thanks be to Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists).\"",
            "english_rwwad": "You will see the angels surrounding the Throne, glorifying their Lord with His praise, and matters will be settled between them with justice, and it will be said: All praise be to Allah, the Lord of the worlds.”"
        }
    }
]