[
    {
        "id": 4133,
        "chapter": 40,
        "verse": 1,
        "arabic_text": "حمٓ",
        "phonetic": "40.1 Ĥā-Mīm",
        "footnotes": {
            "english_saheeh": "[1364]- See footnote to 2:1.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Ḥā, Meem.[1364]",
            "english_hilali_khan": "Hâ-Mîm.",
            "english_rwwad": "Hā Mīm."
        }
    },
    {
        "id": 4134,
        "chapter": 40,
        "verse": 2,
        "arabic_text": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡعَلِيمِ",
        "phonetic": "40.2 Tanzīlu Al-Kitābi Mina Allāhi Al-`Azīzi Al-`Alīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The revelation of the Book [i.e., the Qur’ān] is from Allāh, the Exalted in Might, the Knowing,",
            "english_hilali_khan": "The revelation of the Book (this Qur’ân) is from Allâh, the All-Mighty, the All-Knower.",
            "english_rwwad": "The revelation of this Book is from Allah, the All-Mighty, the All-Knowing,"
        }
    },
    {
        "id": 4135,
        "chapter": 40,
        "verse": 3,
        "arabic_text": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِيدِ ٱلۡعِقَابِ ذِي ٱلطَّوۡلِۖ لَآ إِلَٰهَ إِلَّا هُوَۖ إِلَيۡهِ ٱلۡمَصِيرُ",
        "phonetic": "40.3 Ghāfiri Adh-Dhanbi Wa Qābili At-Tawbi Shadīdi Al-`Iqābi Dhī Aţ-Ţawli Lā 'Ilāha 'Illā Huwa 'Ilayhi Al-Maşīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The forgiver of sin, acceptor of repentance, severe in punishment, owner of abundance. There is no deity except Him; to Him is the destination.",
            "english_hilali_khan": "The Forgiver of sin, the Acceptor of repentance, the Severe in punishment, the Bestower (of favours). Lâ ilâha illâ Huwa (none has the right to be worshipped but He), to Him is the final return.",
            "english_rwwad": "the Forgiver of sin and Accepter of repentance, the Severe in punishment and Infinite in bounty. None has the right to be worshiped except Him. To Him is the final return."
        }
    },
    {
        "id": 4136,
        "chapter": 40,
        "verse": 4,
        "arabic_text": "مَا يُجَٰدِلُ فِيٓ ءَايَٰتِ ٱللَّهِ إِلَّا ٱلَّذِينَ كَفَرُواْ فَلَا يَغۡرُرۡكَ تَقَلُّبُهُمۡ فِي ٱلۡبِلَٰدِ",
        "phonetic": "40.4 Mā Yujādilu Fī 'Āyāti Allāhi 'Illā Al-Ladhīna Kafarū Falā Yaghrurka Taqallubuhum Fī Al-Bilādi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "No one disputes concerning the signs of Allāh except those who disbelieve, so be not deceived by their [uninhibited] movement throughout the land.",
            "english_hilali_khan": "None disputes in the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh but those who disbelieve. So let not their ability of going about here and there through the land (for their purposes) deceive you [O Muhammad صلى الله عليه وسلم, for their ultimate end will be the Fire of Hell]!",
            "english_rwwad": "None disputes against the signs of Allah except those who disbelieve, so do not be deceived by their movements in the land."
        }
    },
    {
        "id": 4137,
        "chapter": 40,
        "verse": 5,
        "arabic_text": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَٱلۡأَحۡزَابُ مِنۢ بَعۡدِهِمۡۖ وَهَمَّتۡ كُلُّ أُمَّةِۭ بِرَسُولِهِمۡ لِيَأۡخُذُوهُۖ وَجَٰدَلُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّ فَأَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ",
        "phonetic": "40.5 Kadhabat Qablahum Qawmu Nūĥin Wa Al-'Aĥzābu Min Ba`dihim Wa Hammat Kullu 'Ummatin Birasūlihim Liya'khudhūhu Wa Jādalū Bil-Bāţili Liyudĥiđū Bihi Al-Ĥaqqa Fa'akhadhtuhum Fakayfa Kāna `Iqābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The people of Noah denied before them and the [disbelieving] factions after them, and every nation intended [a plot] for their messenger to seize him, and they disputed by [using] falsehood to [attempt to] invalidate thereby the truth. So I seized them, and how [terrible] was My penalty.",
            "english_hilali_khan": "The people of Nûh (Noah) and the Confederates after them denied (their Messengers) before these; and every (disbelieving) nation plotted against their Messenger to seize him, and disputed by means of falsehood to refute therewith the truth. So I seized them (with punishment), and how (terrible) was My punishment!",
            "english_rwwad": "Before them, the people of Noah rejected and so did [other] parties after them. Every nation plotted against its messenger to seize him, and falsely argued to refute the truth with falsehood, so I seized them. How [horrible] was My punishment!"
        }
    },
    {
        "id": 4138,
        "chapter": 40,
        "verse": 6,
        "arabic_text": "وَكَذَٰلِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِينَ كَفَرُوٓاْ أَنَّهُمۡ أَصۡحَٰبُ ٱلنَّارِ",
        "phonetic": "40.6 Wa Kadhalika Ĥaqqat Kalimatu Rabbika `Alá Al-Ladhīna Kafarū 'Annahum 'Aşĥābu An-Nāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:6) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus has the word [i.e., decree] of your Lord come into effect upon those who disbelieved that they are companions of the Fire.",
            "english_hilali_khan": "Thus has the Word of your Lord been justified against those who disbelieved, that they will be the dwellers of the Fire.[1]",
            "english_rwwad": "Thus the decree of your Lord was passed against those who disbelieve, that they will be the people of the Fire."
        }
    },
    {
        "id": 4139,
        "chapter": 40,
        "verse": 7,
        "arabic_text": "ٱلَّذِينَ يَحۡمِلُونَ ٱلۡعَرۡشَ وَمَنۡ حَوۡلَهُۥ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيُؤۡمِنُونَ بِهِۦ وَيَسۡتَغۡفِرُونَ لِلَّذِينَ ءَامَنُواْۖ رَبَّنَا وَسِعۡتَ كُلَّ شَيۡءٖ رَّحۡمَةٗ وَعِلۡمٗا فَٱغۡفِرۡ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمۡ عَذَابَ ٱلۡجَحِيمِ",
        "phonetic": "40.7 Al-Ladhīna Yaĥmilūna Al-`Arsha Wa Man Ĥawlahu Yusabbiĥūna Biĥamdi Rabbihim Wa Yu'uminūna Bihi Wa Yastaghfirūna Lilladhīna 'Āmanū Rabbanā Wasi`ta Kulla Shay'in Raĥmatan Wa `Ilmāan Fāghfir Lilladhīna Tābū Wa Attaba`ū Sabīlaka Wa Qihim `Adhāba Al-Jaĥīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those [angels] who carry the Throne and those around it exalt [Allāh] with praise of their Lord and believe in Him and ask forgiveness for those who have believed, [saying], \"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.",
            "english_hilali_khan": "Those (angels) who bear the Throne (of Allâh) and those around it glorify the praises of their Lord, and believe in Him, and ask forgiveness for those who believe (in the Oneness of Allâh) (saying): \"Our Lord! You comprehend all things in mercy and knowledge, so forgive those who repent and follow Your Way, and save them from the torment of the blazing Fire!",
            "english_rwwad": "Those [angels] who bear the Throne and those around it glorify their Lord with His praise and believe in Him, and seek forgiveness for those who believe, [saying], “Our Lord, Your mercy and knowledge encompass everything, so forgive those who repent and follow Your way, and protect them from the punishment of the Blazing Fire."
        }
    },
    {
        "id": 4140,
        "chapter": 40,
        "verse": 8,
        "arabic_text": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
        "phonetic": "40.8 Rabbanā Wa 'Adkhilhum Jannāti `Adnin Allatī Wa`adtahum Wa Man Şalaĥa Min 'Ābā'ihim Wa 'Azwājihim Wa Dhurrīyātihim 'Innaka 'Anta Al-`Azīzu Al-Ĥakīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Our Lord, and admit them to gardens of perpetual residence which You have promised them and whoever was righteous among their forefathers, their spouses and their offspring. Indeed, it is You who is the Exalted in Might, the Wise.",
            "english_hilali_khan": "8. \"Our Lord! And make them enter the ‘Adn (Eden) Paradise (everlasting Gardens) which you have promised them - and to the righteous among their fathers, their wives, and their offspring! Verily, You are the All-Mighty, the All-Wise.",
            "english_rwwad": "Our Lord, admit them to Gardens of Eternity which You have promised them, and the righteous from among their parents, their spouses and their offspring. Indeed, it is You Who are the All-Mighty, the All-Wise."
        }
    },
    {
        "id": 4141,
        "chapter": 40,
        "verse": 9,
        "arabic_text": "وَقِهِمُ ٱلسَّيِّـَٔاتِۚ وَمَن تَقِ ٱلسَّيِّـَٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "40.9 Wa Qihimu As-Sayyi'āti Wa Man Taqī As-Sayyi'āti Yawma'idhin Faqad Raĥimtahu Wa Dhalika Huwa Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And protect them from the evil consequences [of their deeds]. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.\"",
            "english_hilali_khan": "\"And save them from (the punishment, for what they did of) the sins, and whomsoever You save from (the punishment for what he did of) the sins (i.e. pardon him) that Day, him verily, You have taken into mercy.\" And that is the supreme success.",
            "english_rwwad": "And protect them from the evil consequences [of their sins]. For whoever You protect from the evil consequences on that Day, You have surely bestowed mercy upon him. That is the supreme triumph.”"
        }
    },
    {
        "id": 4142,
        "chapter": 40,
        "verse": 10,
        "arabic_text": "إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ",
        "phonetic": "40.10 'Inna Al-Ladhīna Kafarū Yunādawna Lamaqtu Allāhi 'Akbaru Min Maqtikum 'Anfusakum 'Idh Tud`awna 'Ilá Al-'Īmāni Fatakfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who disbelieve will be addressed, \"The hatred of Allāh for you was [even] greater than your hatred of yourselves [this Day in Hell] when you were invited to faith, but you disbelieved [i.e., refused].\"",
            "english_hilali_khan": "Those who disbelieve will be addressed (at the time of entering the Fire): \"Allâh’s aversion was greater towards you (in the worldly life when you used to reject the Faith) than your aversion towards one another (now in the Fire of Hell, as you are now enemies to one another), when you were called to the Faith but you used to refuse.\"",
            "english_rwwad": "Those who disbelieve will be addressed, “Allah’s abhorrence of you when you were called to believe but you disbelieved was greater than your abhorrence of yourselves [Today].”"
        }
    },
    {
        "id": 4143,
        "chapter": 40,
        "verse": 11,
        "arabic_text": "قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ",
        "phonetic": "40.11 Qālū Rabbanā 'Amattanā Athnatayni Wa 'Aĥyaytanā Athnatayni Fā`tarafnā Bidhunūbinā Fahal 'Ilá Khurūjin Min Sabīlin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will say, \"Our Lord, You made us lifeless twice and gave us life twice, and we have confessed our sins. So is there to an exit any way?\"",
            "english_hilali_khan": "They will say: \"Our Lord! You have made us to die twice (i.e. we were dead in the loins of our fathers and dead after our life in this world), and You have given us life twice (i.e. life when we were born and life when we are Resurrected)! Now we confess our sins, then is there any way to get out (of the Fire)?\" (Tafsir Al-Qurtubi,)",
            "english_rwwad": "They will say, “Our Lord, You have caused us to die twice and brought us to life twice. Now we acknowledge our sins; is there any way out?”"
        }
    },
    {
        "id": 4144,
        "chapter": 40,
        "verse": 12,
        "arabic_text": "ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ",
        "phonetic": "40.12 Dhālikum Bi'annahu 'Idhā Du`iya Allāhu Waĥdahu Kafartum Wa 'In Yushrak Bihi Tu'uminū Fālĥukmu Lillāhi Al-`Alīyi Al-Kabīri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:12) Narrated ‘Abdullâh رضي الله عنه: \"The Prophet صلى الله عليه وسلم said one statement and I said another. The Prophet صلى الله عليه وسلم said: \"Whoever dies while still invoking anything other than Allâh as a rival to Allâh, will enter Hell (Fire).\" And I said, ‘Whoever dies without invoking anything as a rival to Allâh, will enter Paradise.’\" (Sahih Al-Bukhari, Vol. 6, Hadith No. 24).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[They will be told], \"That is because, when Allāh was called upon alone, you disbelieved; but if others were associated with Him, you believed. So the judgement is with Allāh, the Most High, the Grand.\"",
            "english_hilali_khan": "(It will be said): \"This is because, when Allâh Alone was invoked (in worship) you disbelieved (denied), but when partners were joined to Him, you believed! So the judgement is only with Allâh, the Most High, the Most Great![1]\"",
            "english_rwwad": "[They will be told], “This is because when Allah was invoked alone, you disbelieved, but when others were associated with Him, you believed. The judgment belongs to Allah, the Most High, the All-Great.”"
        }
    },
    {
        "id": 4145,
        "chapter": 40,
        "verse": 13,
        "arabic_text": "هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ",
        "phonetic": "40.13 Huwa Al-Ladhī Yurīkum 'Āyātihi Wa Yunazzilu Lakum Mina As-Samā'i Rizqāan Wa Mā Yatadhakkaru 'Illā Man Yunību",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who shows you His signs and sends down to you from the sky, provision. But none will remember except he who turns back [in repentance].",
            "english_hilali_khan": "It is He Who shows you His Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and sends down (rain with which grows) provision for you from the sky. And none remembers but those who turn (to Allâh in obedience and) in repentance (by begging His Pardon and by worshipping and obeying Him Alone and none else).",
            "english_rwwad": "It is He Who shows you His signs and sends down for you provision from the sky, but none will take heed except those who turn to Him."
        }
    },
    {
        "id": 4146,
        "chapter": 40,
        "verse": 14,
        "arabic_text": "فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ",
        "phonetic": "40.14 Fād`ū Allāha Mukhlişīna Lahu Ad-Dīna Wa Law Kariha Al-Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So invoke Allāh, [being] sincere to Him in religion, although the disbelievers dislike it.",
            "english_hilali_khan": "So, call you (O Muhammad صلى الله عليه وسلم and the believers) upon (or invoke) Allâh making (your) worship pure for Him (Alone) (by worshipping none but Him and by doing religious deeds sincerely for Allâh’s sake only and not to show off and not to set up rivals with Him in worship), however much the disbelievers (in the Oneness of Allâh) may hate (it).",
            "english_rwwad": "So call upon Allah with sincere devotion to Him, even if the disbelievers may dislike it."
        }
    },
    {
        "id": 4147,
        "chapter": 40,
        "verse": 15,
        "arabic_text": "رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ",
        "phonetic": "40.15 Rafī`u Ad-Darajāti Dhū Al-`Arshi Yulqī Ar-Rūĥa Min 'Amrihi `Alá Man Yashā'u Min `Ibādihi Liyundhira Yawma At-Talāqi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He is] the Exalted above [all] degrees, Owner of the Throne; He places the inspiration of His command [i.e., revelation] upon whom He wills of His servants to warn of the Day of Meeting.",
            "english_hilali_khan": "(He is Allâh) Owner of High Ranks and Degrees, the Owner of the Throne. He sends the revelation by His Command to any of His slaves He wills, that he (the person who receives revelation) may warn (men) of the Day of Mutual Meeting (i.e. the Day of Resurrection).",
            "english_rwwad": "He is Exalted in Rank, Lord of the Throne. He sends down the revelation by His command to whom He wills of His slaves, in order to warn of the Day of Meeting,"
        }
    },
    {
        "id": 4148,
        "chapter": 40,
        "verse": 16,
        "arabic_text": "يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ",
        "phonetic": "40.16 Yawma Hum Bārizūna Lā Yakhfá `Alá Allāhi Minhum Shay'un Limani Al-Mulku Al-Yawma Lillāhi Al-Wāĥidi Al-Qahhāri",
        "footnotes": {
            "english_saheeh": "[1365]- Refer to footnotes in 12:39.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Day they come forth nothing concerning them will be concealed from Allāh. To whom belongs [all] sovereignty this Day? To Allāh, the One, the Prevailing.[1365]",
            "english_hilali_khan": "The Day when they will (all) come out, nothing of them will be hidden from Allâh. Whose is the kingdom this Day? (Allâh Himself will reply to His Question): It is Allâh’s the One, the Irresistible!",
            "english_rwwad": "the Day when they will be brought forth, nothing about them will be hidden from Allah. [He will say], “To whom does the dominion belong this Day? To Allah, the One, the Subjugator!"
        }
    },
    {
        "id": 4149,
        "chapter": 40,
        "verse": 17,
        "arabic_text": "ٱلۡيَوۡمَ تُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡۚ لَا ظُلۡمَ ٱلۡيَوۡمَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ",
        "phonetic": "40.17 Al-Yawma Tujzá Kullu Nafsin Bimā Kasabat Lā Žulma Al-Yawma 'Inna Allāha Sarī`u Al-Ĥisābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "This Day every soul will be recompensed for what it earned. No injustice today! Indeed, Allāh is swift in account.",
            "english_hilali_khan": "This Day shall every person be recompensed for what he earned. This Day no injustice (shall be done to anybody). Truly, Allâh is Swift in reckoning.",
            "english_rwwad": "Today every soul will be recompensed for what it has earned; no injustice Today! Allah is swift in reckoning.”"
        }
    },
    {
        "id": 4150,
        "chapter": 40,
        "verse": 18,
        "arabic_text": "وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡأٓزِفَةِ إِذِ ٱلۡقُلُوبُ لَدَى ٱلۡحَنَاجِرِ كَٰظِمِينَۚ مَا لِلظَّٰلِمِينَ مِنۡ حَمِيمٖ وَلَا شَفِيعٖ يُطَاعُ",
        "phonetic": "40.18 Wa 'Andhirhum Yawma Al-'Āzifati 'Idhi Al-Qulūbu Ladá Al-Ĥanājiri Kāžimīna Mā Lilžžālimīna Min Ĥamīmin Wa Lā Shafī`in Yuţā`u",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And warn them, [O Muḥammad], of the Approaching Day, when hearts are at the throats, filled [with distress]. For the wrongdoers there will be no devoted friend and no intercessor [who is] obeyed.",
            "english_hilali_khan": "And warn them (O Muhammad صلى الله عليه وسلم) of the Day that is drawing near (i.e. the Day of Resurrection), when the hearts will be choking the throats, and they can neither return them (hearts) to their chests nor can they throw them out. There will be no friend, nor an intercessor for the Zâlimûn (polytheists and wrong-doers), who could be given heed to.",
            "english_rwwad": "Warn them of the approaching Day, when hearts will be at the throats, full of distress. The wrongdoers will have no close friend or intercessor whose word may be heeded."
        }
    },
    {
        "id": 4151,
        "chapter": 40,
        "verse": 19,
        "arabic_text": "يَعۡلَمُ خَآئِنَةَ ٱلۡأَعۡيُنِ وَمَا تُخۡفِي ٱلصُّدُورُ",
        "phonetic": "40.19 Ya`lamu Khā'inata Al-'A`yuni Wa Mā Tukhfī Aş-Şudūru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He knows that which deceives the eyes and what the breasts conceal.",
            "english_hilali_khan": "Allâh knows the fraud of the eyes, and all that the breasts conceal.",
            "english_rwwad": "He knows the sneaky glances of the eyes and what the hearts conceal."
        }
    },
    {
        "id": 4152,
        "chapter": 40,
        "verse": 20,
        "arabic_text": "وَٱللَّهُ يَقۡضِي بِٱلۡحَقِّۖ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَقۡضُونَ بِشَيۡءٍۗ إِنَّ ٱللَّهَ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
        "phonetic": "40.20 Wa Allāhu Yaqđī Bil-Ĥaqqi Wa Al-Ladhīna Yad`ūna Min Dūnihi Lā Yaqđūna Bishay'in 'Inna Allāha Huwa As-Samī`u Al-Başīru",
        "footnotes": {
            "english_saheeh": "[1366]- In worship.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh judges with truth, while those they invoke[1366] besides Him judge not with anything. Indeed, Allāh - He is the Hearing, the Seeing.",
            "english_hilali_khan": "And Allâh judges with truth, while those to whom they invoke besides Him, cannot judge anything. Certainly, Allâh! He is the All-Hearer, the All-Seer.",
            "english_rwwad": "Allah judges with justice, whereas those whom they invoke besides Him cannot judge at all. Indeed, it is Allah Who is the All-Hearing, the All-Seeing."
        }
    },
    {
        "id": 4153,
        "chapter": 40,
        "verse": 21,
        "arabic_text": "۞ أَوَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ كَانُواْ مِن قَبۡلِهِمۡۚ كَانُواْ هُمۡ أَشَدَّ مِنۡهُمۡ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ",
        "phonetic": "40.21 'Awa Lam Yasīrū Fī Al-'Arđi Fayanžurū Kayfa Kāna `Āqibatu Al-Ladhīna Kānū Min Qablihim Kānū Hum 'Ashadda Minhum Qūwatan Wa 'Āthārāan Fī Al-'Arđi Fa'akhadhahumu Allāhu Bidhunūbihim Wa Mā Kāna Lahum Mini Allāhi Min Wāqin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have they not traveled through the land and observed how was the end of those who were before them? They were greater than them in strength and in impression on the land, but Allāh seized them for their sins. And they had not from Allāh any protector.",
            "english_hilali_khan": "Have they not travelled in the land and seen what was the end of those who were before them? They were superior to them in strength, and in the traces (which they left) in the land. But Allâh seized them with punishment for their sins. And none had they to protect them from Allâh.",
            "english_rwwad": "Have they not traveled in the land to see what was the end of those who came before them? They were far superior in strength and left a more impressive marks in the land, but Allah seized them for their sins, and they had none to protect them from Allah."
        }
    },
    {
        "id": 4154,
        "chapter": 40,
        "verse": 22,
        "arabic_text": "ذَٰلِكَ بِأَنَّهُمۡ كَانَت تَّأۡتِيهِمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَكَفَرُواْ فَأَخَذَهُمُ ٱللَّهُۚ إِنَّهُۥ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ",
        "phonetic": "40.22 Dhālika Bi'annahum Kānat Ta'tīhim Rusuluhum Bil-Bayyināti Fakafarū Fa'akhadhahumu Allāhu 'Innahu Qawīyun Shadīdu Al-`Iqābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That was because their messengers were coming to them with clear proofs, but they disbelieved, so Allāh seized them. Indeed, He is Powerful and severe in punishment.",
            "english_hilali_khan": "That was because there came to them their Messengers with clear evidence (proofs and signs) but they disbelieved (in them). So Allâh seized them (with punishment). Verily He is All-Strong, Severe in punishment.",
            "english_rwwad": "That was because their messengers came to them with clear proofs, but they disbelieved; so Allah seized them. He is indeed All-Powerful, Severe in punishment."
        }
    },
    {
        "id": 4155,
        "chapter": 40,
        "verse": 23,
        "arabic_text": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ",
        "phonetic": "40.23 Wa Laqad 'Arsalnā Mūsá Bi'āyātinā Wa Sulţānin Mubīnin",
        "footnotes": {
            "english_saheeh": "[1367]- i.e., evidences from Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We did certainly send Moses with Our signs and a clear authority[1367]",
            "english_hilali_khan": "And indeed We sent Mûsâ (Moses) with Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), and a manifest authority,",
            "english_rwwad": "We sent Moses with Our signs and compelling proof"
        }
    },
    {
        "id": 4156,
        "chapter": 40,
        "verse": 24,
        "arabic_text": "إِلَىٰ فِرۡعَوۡنَ وَهَٰمَٰنَ وَقَٰرُونَ فَقَالُواْ سَٰحِرٞ كَذَّابٞ",
        "phonetic": "40.24 'Ilá Fir`awna Wa Hāmāna Wa Qārūna Faqālū Sāĥirun Kadhābun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "To Pharaoh, Hāmān and Qārūn, but they said, \"[He is] a magician and a liar.\"",
            "english_hilali_khan": "To Fir‘aun (Pharaoh), Hâmân and Qârûn (Korah), but they called (him): \"A sorcerer, a liar!\"",
            "english_rwwad": "to Pharaoh, Hāmān and Korah, but they said, “A magician! An utter liar!”"
        }
    },
    {
        "id": 4157,
        "chapter": 40,
        "verse": 25,
        "arabic_text": "فَلَمَّا جَآءَهُم بِٱلۡحَقِّ مِنۡ عِندِنَا قَالُواْ ٱقۡتُلُوٓاْ أَبۡنَآءَ ٱلَّذِينَ ءَامَنُواْ مَعَهُۥ وَٱسۡتَحۡيُواْ نِسَآءَهُمۡۚ وَمَا كَيۡدُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ",
        "phonetic": "40.25 Falammā Jā'ahum Bil-Ĥaqqi Min `Indinā Qālū Aqtulū 'Abnā'a Al-Ladhīna 'Āmanū Ma`ahu Wa Astaĥyū Nisā'ahum Wa Mā Kaydu Al-Kāfirīna 'Illā Fī Đalālin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he brought them the truth from Us, they said, \"Kill the sons of those who have believed with him and keep their women alive.\" But the plan of the disbelievers is not except in error.",
            "english_hilali_khan": "Then, when he brought them the Truth from Us, they said: \"Kill the sons of those who believe with him and let their women live\"; but the plots of disbelievers are nothing but in vain!",
            "english_rwwad": "When he came to them with the truth from Us, they said, “Kill the sons of those who believe with him and keep their women alive.” However, the plots of the disbelievers are always bound to fail."
        }
    },
    {
        "id": 4158,
        "chapter": 40,
        "verse": 26,
        "arabic_text": "وَقَالَ فِرۡعَوۡنُ ذَرُونِيٓ أَقۡتُلۡ مُوسَىٰ وَلۡيَدۡعُ رَبَّهُۥٓۖ إِنِّيٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمۡ أَوۡ أَن يُظۡهِرَ فِي ٱلۡأَرۡضِ ٱلۡفَسَادَ",
        "phonetic": "40.26 Wa Qāla Fir`awnu Dharūnī 'Aqtul Mūsá Wa Līad`u Rabbahu 'Innī 'Akhāfu 'An Yubaddila Dīnakum 'Aw 'An Yužhira Fī Al-'Arđi Al-Fasāda",
        "footnotes": {
            "english_saheeh": "[1368]- i.e., dissension or civil strife.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Pharaoh said, \"Let me kill Moses and let him call upon his Lord. Indeed, I fear that he will change your religion or that he will cause corruption[1368] in the land.\"",
            "english_hilali_khan": "Fir‘aun (Pharaoh) said: \"Leave me to kill Mûsâ (Moses), and let him call his Lord (to stop me from killing him)! I fear that he may change your religion, or that he may cause mischief to appear in the land!\"",
            "english_rwwad": "Pharaoh said, “Let me kill Moses, and let him call upon his Lord! For I fear that he may change your religion or spread corruption in the land.”"
        }
    },
    {
        "id": 4159,
        "chapter": 40,
        "verse": 27,
        "arabic_text": "وَقَالَ مُوسَىٰٓ إِنِّي عُذۡتُ بِرَبِّي وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرٖ لَّا يُؤۡمِنُ بِيَوۡمِ ٱلۡحِسَابِ",
        "phonetic": "40.27 Wa Qāla Mūsá 'Innī `Udhtu Birabbī Wa Rabbikum Min Kulli Mutakabbirin Lā Yu'uminu Biyawmi Al-Ĥisābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But Moses said, \"Indeed, I have sought refuge in my Lord and your Lord from every arrogant one who does not believe in the Day of Account.\"",
            "english_hilali_khan": "Mûsâ (Moses) said: \"Verily I seek refuge in my Lord and your Lord from every arrogant who believes not in the Day of Reckoning!\"",
            "english_rwwad": "Moses said, “I seek refuge with my Lord and your Lord from every arrogant person who does not believe in the Day of Reckoning.”"
        }
    },
    {
        "id": 4160,
        "chapter": 40,
        "verse": 28,
        "arabic_text": "وَقَالَ رَجُلٞ مُّؤۡمِنٞ مِّنۡ ءَالِ فِرۡعَوۡنَ يَكۡتُمُ إِيمَٰنَهُۥٓ أَتَقۡتُلُونَ رَجُلًا أَن يَقُولَ رَبِّيَ ٱللَّهُ وَقَدۡ جَآءَكُم بِٱلۡبَيِّنَٰتِ مِن رَّبِّكُمۡۖ وَإِن يَكُ كَٰذِبٗا فَعَلَيۡهِ كَذِبُهُۥۖ وَإِن يَكُ صَادِقٗا يُصِبۡكُم بَعۡضُ ٱلَّذِي يَعِدُكُمۡۖ إِنَّ ٱللَّهَ لَا يَهۡدِي مَنۡ هُوَ مُسۡرِفٞ كَذَّابٞ",
        "phonetic": "40.28 Wa Qāla Rajulun Mu'uminun Min 'Āli Fir`awna Yaktumu 'Īmānahu 'Ataqtulūna Rajulāan 'An Yaqūla Rabbiya Allāhu Wa Qad Jā'akum Bil-Bayyināti Min Rabbikum Wa 'In Yaku Kādhibāan Fa`alayhi Kadhibuhu Wa 'In Yaku Şādiqāan Yuşibkum Ba`đu Al-Ladhī Ya`idukum 'Inna Allāha Lā Yahdī Man Huwa Musrifun Kadhābun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And a believing man from the family of Pharaoh who concealed his faith said, \"Do you kill a man [merely] because he says, 'My Lord is Allāh' while he has brought you clear proofs from your Lord? And if he should be lying, then upon him is [the consequence of] his lie; but if he should be truthful, there will strike you some of what he promises you. Indeed, Allāh does not guide one who is a transgressor and a liar.",
            "english_hilali_khan": "And a believing man of Fir‘aun’s (Pharaoh) family, who hid his faith said: \"Would you kill a man because he says: My Lord is Allâh, and he has come to you with clear signs (proofs) from your Lord? And if he is a liar, upon him will be (the sin of) his lie; but if he is telling the truth, then some of that (calamity) wherewith he threatens you will befall on you.\" Verily, Allâh guides not one who is a Musrif (a polytheist, or a murderer who shed blood without a right, or those who commit great sins, oppressor, transgressor), a liar!",
            "english_rwwad": "A believing man from the house of Pharaoh, who was concealing his faith, said, “Would you kill a man simply because he says: ‘My Lord is Allah,’ even though he has come to you with clear proofs from your Lord? If he is a liar, he will suffer the consequences of his lie, but if he is truthful, some of what he is threatening you with will befall you. Surely Allah does not guide anyone who is a transgressor and an utter liar."
        }
    },
    {
        "id": 4161,
        "chapter": 40,
        "verse": 29,
        "arabic_text": "يَٰقَوۡمِ لَكُمُ ٱلۡمُلۡكُ ٱلۡيَوۡمَ ظَٰهِرِينَ فِي ٱلۡأَرۡضِ فَمَن يَنصُرُنَا مِنۢ بَأۡسِ ٱللَّهِ إِن جَآءَنَاۚ قَالَ فِرۡعَوۡنُ مَآ أُرِيكُمۡ إِلَّا مَآ أَرَىٰ وَمَآ أَهۡدِيكُمۡ إِلَّا سَبِيلَ ٱلرَّشَادِ",
        "phonetic": "40.29 Yā Qawmi Lakumu Al-Mulku Al-Yawma Žāhirīna Fī Al-'Arđi Faman Yanşurunā Min Ba'si Allāhi 'In Jā'anā Qāla Fir`awnu Mā 'Urīkum 'Illā Mā 'Ará Wa Mā 'Ahdīkum 'Illā Sabīla Ar-Rashādi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O my people, sovereignty is yours today, [your being] dominant in the land. But who would protect us from the punishment of Allāh if it came to us?\" Pharaoh said, \"I do not show you except what I see, and I do not guide you except to the way of right conduct.\"",
            "english_hilali_khan": "\"O my people! Yours is the kingdom today, you being dominant in the land. But who will save us from the Torment of Allâh, should it befall us?\" Fir‘aun (Pharaoh) said: \"I show you only that which I see (correct), and I guide you only to the path of right policy!\"",
            "english_rwwad": "O my people, the authority is yours today, being dominant in the land. But who would help us against Allah’s punishment, if it came upon us?” Pharaoh said, “I am only telling you what I think is right, and I am only guiding you to the right way.”"
        }
    },
    {
        "id": 4162,
        "chapter": 40,
        "verse": 30,
        "arabic_text": "وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ إِنِّيٓ أَخَافُ عَلَيۡكُم مِّثۡلَ يَوۡمِ ٱلۡأَحۡزَابِ",
        "phonetic": "40.30 Wa Qāla Al-Ladhī 'Āmana Yā Qawmi 'Innī 'Akhāfu `Alaykum Mithla Yawmi Al-'Aĥzābi",
        "footnotes": {
            "english_saheeh": "[1369]- i.e., the days on which Allāh sent His punishment upon those who rejected their prophets in former times.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he who believed said, \"O my people, indeed I fear for you [a fate] like the day of the companies[1369] -",
            "english_hilali_khan": "And he who believed said: \"O my people! Verily, I fear for you a fate like that day (of disaster) of the Confederates (of old)!",
            "english_rwwad": "The man who believed said, “O my people, I fear for you [a fate] like the day of the parties,"
        }
    },
    {
        "id": 4163,
        "chapter": 40,
        "verse": 31,
        "arabic_text": "مِثۡلَ دَأۡبِ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَٱلَّذِينَ مِنۢ بَعۡدِهِمۡۚ وَمَا ٱللَّهُ يُرِيدُ ظُلۡمٗا لِّلۡعِبَادِ",
        "phonetic": "40.31 Mithla Da'bi Qawmi Nūĥin Wa `Ādin Wa Thamūda Wa Al-Ladhīna Min Ba`dihim Wa Mā Allāhu Yurīdu Žulmāan Lil`ibādi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Like the custom of the people of Noah and of ʿAad and Thamūd and those after them. And Allāh wants no injustice for [His] servants.",
            "english_hilali_khan": "\"Like the fate of the people of Nûh (Noah), and ‘Âd, and Thamûd and those who came after them. And Allâh wills no injustice for (His) slaves.",
            "english_rwwad": "like the fate of the people of Noah, ‘Ād and Thamūd, and those who came after them. And Allah does not want injustice to [His] slaves."
        }
    },
    {
        "id": 4164,
        "chapter": 40,
        "verse": 32,
        "arabic_text": "وَيَٰقَوۡمِ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ يَوۡمَ ٱلتَّنَادِ",
        "phonetic": "40.32 Wa Yāqawmi 'Innī 'Akhāfu `Alaykum Yawma At-Tanādi",
        "footnotes": {
            "english_saheeh": "[1370]- i.e., the Day of Judgement, when the criminals will cry out in terror, the people will call to each other (see 7:44-51), and the angels will call out the results of each person's judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And O my people, indeed I fear for you the Day of Calling[1370] -",
            "english_hilali_khan": "\"And, O my people! Verily, I fear for you the Day when there will be mutual calling (between the people of Hell and of Paradise).\"",
            "english_rwwad": "O my people, I fear for you the Day of crying out to one another,"
        }
    },
    {
        "id": 4165,
        "chapter": 40,
        "verse": 33,
        "arabic_text": "يَوۡمَ تُوَلُّونَ مُدۡبِرِينَ مَا لَكُم مِّنَ ٱللَّهِ مِنۡ عَاصِمٖۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ",
        "phonetic": "40.33 Yawma Tuwallūna Mudbirīna Mā Lakum Mina Allāhi Min `Āşimin Wa Man Yuđlili Allāhu Famā Lahu Min Hādin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Day you will turn your backs fleeing; there is not for you from Allāh any protector. And whoever Allāh sends astray - there is not for him any guide.",
            "english_hilali_khan": "A Day when you will turn your backs and flee having no protector from Allâh. And whomsoever Allâh sends astray, for him there is no guide.",
            "english_rwwad": "the Day when you will turn your backs fleeing; having none to protect you from Allah. Whoever Allah causes to stray, he will have no guide."
        }
    },
    {
        "id": 4166,
        "chapter": 40,
        "verse": 34,
        "arabic_text": "وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ",
        "phonetic": "40.34 Wa Laqad Jā'akum Yūsufu Min Qablu Bil-Bayyināti Famā Ziltum Fī Shakkin Mimmā Jā'akum Bihi Ĥattá 'Idhā Halaka Qultum Lan Yab`atha Allāhu Min Ba`dihi Rasūlāan Kadhālika Yuđillu Allāhu Man Huwa Musrifun Murtābun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Joseph had already come to you before with clear proofs, but you remained in doubt of that which he brought to you, until when he died, you said, 'Never will Allāh send a messenger after him.' Thus does Allāh leave astray he who is a transgressor and skeptic.\"",
            "english_hilali_khan": "And indeed Yûsuf (Joseph) did come to you, in times gone by, with clear signs, but you ceased not to doubt in that which he did bring to you: till when he died you said: \"No Messenger will Allâh send after him.\" Thus Allâh leaves astray him who is a Musrif (a polytheist, an oppressor, a criminal, sinner who commit great sins) and a Murtâb (one who doubts Allâh’s Warning and His Oneness).",
            "english_rwwad": "Joseph came to you before with clear proofs, but you never ceased to doubt what he brought you. Then when he died, you said, ‘Allah will never send a messenger after him.’ This is how Allah causes to stray anyone who transgresses and is given to much doubting,"
        }
    },
    {
        "id": 4167,
        "chapter": 40,
        "verse": 35,
        "arabic_text": "ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ",
        "phonetic": "40.35 Al-Ladhīna Yujādilūna Fī 'Āyāti Allāhi Bighayri Sulţānin 'Atāhum Kabura Maqtāan `Inda Allāhi Wa `Inda Al-Ladhīna 'Āmanū Kadhālika Yaţba`u Allāhu `Alá Kulli Qalbi Mutakabbirin Jabbārin",
        "footnotes": {
            "english_saheeh": "[1371]- i.e., evidence.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who dispute concerning the signs of Allāh without an authority[1371] having come to them - great is hatred [of them] in the sight of Allāh and in the sight of those who have believed. Thus does Allāh seal over every heart [belonging to] an arrogant tyrant.",
            "english_hilali_khan": "Those who dispute about the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh, without any authority that has come to them, it is greatly hateful and disgusting to Allâh and to those who believe. Thus does Allâh seal up the heart of every arrogant, tyrant. (So they cannot guide themselves to the Right Path).",
            "english_rwwad": "those who argue against Allah’s signs with no proof given to them. How loathsome is that to Allah and to those who believe! This is how Allah seals the heart of every arrogant tyrant.”"
        }
    },
    {
        "id": 4168,
        "chapter": 40,
        "verse": 36,
        "arabic_text": "وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ",
        "phonetic": "40.36 Wa Qāla Fir`awnu Yā Hāmānu Abni Lī Şarĥāan La`allī 'Ablughu Al-'Asbāba",
        "footnotes": {
            "english_saheeh": "[1372]- Means of ascent, pathways.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Pharaoh said, \"O Hāmān, construct for me a tower that I might reach the ways[1372] -",
            "english_hilali_khan": "And Fir‘aun (Pharaoh) said: \"O Hâmân! Build me a tower that I may arrive at the ways -",
            "english_rwwad": "Pharaoh said, “O Hāmān, build a tower for me so that I may reach the pathways –"
        }
    },
    {
        "id": 4169,
        "chapter": 40,
        "verse": 37,
        "arabic_text": "أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ",
        "phonetic": "40.37 'Asbāba As-Samāwāti Fa'aţţali`a 'Ilá 'Ilahi Mūsá Wa 'Innī La'ažunnuhu Kādhibāan Wa Kadhalika Zuyyina Lifir`awna Sū'u `Amalihi Wa Şudda `Ani As-Sabīli Wa Mā Kaydu Fir`awna 'Illā Fī Tabābin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ways into the heavens - so that I may look at the deity of Moses; but indeed, I think he is a liar.\" And thus was made attractive to Pharaoh the evil of his deed, and he was averted from the [right] way. And the plan of Pharaoh was not except in ruin.",
            "english_hilali_khan": "\"The ways of the heavens, and I may look upon the Ilâh (God) of Mûsâ (Moses): But verily, I think him to be a liar.\" Thus it was made fair-seeming, in Fir‘aun’s (Pharaoh) eyes, the evil of his deeds, and he was hindered from the (Right) Path; and the plot of Fir‘aun (Pharaoh) led to nothing but loss and destruction (for him).",
            "english_rwwad": "the pathways to the heavens so that I have a look at the God of Moses, for I think he is a liar.” This is how Pharaoh’s evil deeds were made appealing to him and he was hindered from the [right] way, and the plan of Pharaoh led only to ruin."
        }
    },
    {
        "id": 4170,
        "chapter": 40,
        "verse": 38,
        "arabic_text": "وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ",
        "phonetic": "40.38 Wa Qāla Al-Ladhī 'Āmana Yā Qawmi Attabi`ūnī 'Ahdikum Sabīla Ar-Rashādi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he who believed said, \"O my people, follow me; I will guide you to the way of right conduct.",
            "english_hilali_khan": "And the man who believed said: \"O my people! Follow me, I will guide you to the way of right conduct [i.e. guide you to Allâh’s religion of Islâmic Monotheism with which Mûsâ (Moses) has been sent].",
            "english_rwwad": "The man who believed said, “O my people, follow me, I will guide you to the right way."
        }
    },
    {
        "id": 4171,
        "chapter": 40,
        "verse": 39,
        "arabic_text": "يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ",
        "phonetic": "40.39 Yā Qawmi 'Innamā Hadhihi Al-Ĥayā Atu Ad-Dunyā Matā`un Wa 'Inna Al-'Ākhirata Hiya Dāru Al-Qarāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O my people, this worldly life is only [temporary] enjoyment, and indeed, the Hereafter - that is the home of [permanent] settlement.",
            "english_hilali_khan": "\"O my people! Truly, this life of the world is nothing but a (quick passing) enjoyment, and verily, the Hereafter that is the home that will remain forever.\"",
            "english_rwwad": "O my people, the life of this world is only a brief enjoyment, whereas the Hereafter is the permanent abode."
        }
    },
    {
        "id": 4172,
        "chapter": 40,
        "verse": 40,
        "arabic_text": "مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ",
        "phonetic": "40.40 Man `Amila Sayyi'atan Falā Yujzá 'Illā Mithlahā Wa Man `Amila Şāliĥāan Min Dhakarin 'Aw 'Unthá Wa Huwa Mu'uminun Fa'ūlā'ika Yadkhulūna Al-Jannata Yurzaqūna Fīhā Bighayri Ĥisābin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever does an evil deed will not be recompensed except by the like thereof; but whoever does righteousness, whether male or female, while he is a believer - those will enter Paradise, being given provision therein without account.",
            "english_hilali_khan": "\"Whosoever does an evil deed, will not be requited except the like thereof; and whosoever does a righteous deed, whether male or female and is a true believer (in the Oneness of Allâh), such will enter Paradise, where they will be provided therein (with all things in abundance) without limit.",
            "english_rwwad": "Whoever does an evil deed will only be recompensed with the like thereof, but whoever does righteous deed, whether male or female, and he is a believer – it is they who will enter Paradise, wherein they will be given provision without measure."
        }
    },
    {
        "id": 4173,
        "chapter": 40,
        "verse": 41,
        "arabic_text": "۞ وَيَٰقَوۡمِ مَا لِيٓ أَدۡعُوكُمۡ إِلَى ٱلنَّجَوٰةِ وَتَدۡعُونَنِيٓ إِلَى ٱلنَّارِ",
        "phonetic": "40.41 Wa Yāqawmi Mā Lī 'Ad`ūkum 'Ilá An-Najāati Wa Tad`ūnanī 'Ilá An-Nāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And O my people, how is it that I invite you to salvation while you invite me to the Fire?",
            "english_hilali_khan": "\"And O my people! How is it that I call you to salvation while you call me to the Fire!",
            "english_rwwad": "O my people, how is it that I call you to salvation while you call me to the Fire?"
        }
    },
    {
        "id": 4174,
        "chapter": 40,
        "verse": 42,
        "arabic_text": "تَدۡعُونَنِي لِأَكۡفُرَ بِٱللَّهِ وَأُشۡرِكَ بِهِۦ مَا لَيۡسَ لِي بِهِۦ عِلۡمٞ وَأَنَا۠ أَدۡعُوكُمۡ إِلَى ٱلۡعَزِيزِ ٱلۡغَفَّٰرِ",
        "phonetic": "40.42 Tad`ūnanī Li'kfura Billāhi Wa 'Ushrika Bihi Mā Laysa Lī Bihi `Ilmun Wa 'Anā 'Ad`ūkum 'Ilá Al-`Azīzi Al-Ghaffāri",
        "footnotes": {
            "english_saheeh": "[1373]- Refer to footnotes in 38:66.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "You invite me to disbelieve in Allāh and associate with Him that of which I have no knowledge, and I invite you to the Exalted in Might, the Perpetual Forgiver.[1373]",
            "english_hilali_khan": "\"You invite me to disbelieve in Allâh (and in His Oneness), and to join partners in worship with Him of which I have no knowledge; and I invite you to the All-Mighty, the Oft-Forgiving!",
            "english_rwwad": "You call me to disbelieve in Allah and associate with Him what I have no knowledge of, while I call you to the All-Mighty, the Most Forgiving."
        }
    },
    {
        "id": 4175,
        "chapter": 40,
        "verse": 43,
        "arabic_text": "لَا جَرَمَ أَنَّمَا تَدۡعُونَنِيٓ إِلَيۡهِ لَيۡسَ لَهُۥ دَعۡوَةٞ فِي ٱلدُّنۡيَا وَلَا فِي ٱلۡأٓخِرَةِ وَأَنَّ مَرَدَّنَآ إِلَى ٱللَّهِ وَأَنَّ ٱلۡمُسۡرِفِينَ هُمۡ أَصۡحَٰبُ ٱلنَّارِ",
        "phonetic": "40.43 Lā Jarama 'Annamā Tad`ūnanī 'Ilayhi Laysa Lahu Da`watun Fī Ad-Dunyā Wa Lā Fī Al-'Ākhirati Wa 'Anna Maraddanā 'Ilá Allāhi Wa 'Anna Al-Musrifīna Hum 'Aşĥābu An-Nāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Assuredly, that to which you invite me has no [response to a] supplication in this world or in the Hereafter; and indeed, our return is to Allāh, and indeed, the transgressors will be companions of the Fire.",
            "english_hilali_khan": "\"No doubt you call me to (worship) one who cannot grant (me) my request (or respond to my invocation) in this world or in the Hereafter. And our return will be to Allâh, and Al-Musrifûn (i.e. polytheists and arrogants, those who commit great sins, the transgressors of Allâh’s set limits): they shall be the dwellers of the Fire!",
            "english_rwwad": "There is no doubt that those [gods] to whom you call me are not worthy of calling upon, neither in this world nor in the Hereafter. Our return is to Allah, and it is the transgressors who are the people of the Fire."
        }
    },
    {
        "id": 4176,
        "chapter": 40,
        "verse": 44,
        "arabic_text": "فَسَتَذۡكُرُونَ مَآ أَقُولُ لَكُمۡۚ وَأُفَوِّضُ أَمۡرِيٓ إِلَى ٱللَّهِۚ إِنَّ ٱللَّهَ بَصِيرُۢ بِٱلۡعِبَادِ",
        "phonetic": "40.44 Fasatadhkurūna Mā 'Aqūlu Lakum Wa 'Ufawwiđu 'Amrī 'Ilá Allāhi 'Inna Allāha Başīrun Bil-`Ibādi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you will remember what I [now] say to you, and I entrust my affair to Allāh. Indeed, Allāh is Seeing of [His] servants.\"",
            "english_hilali_khan": "\"And you will remember what I am telling you, and my affair I leave it to Allâh. Verily, Allâh is the All-Seer of (His) slaves.\"",
            "english_rwwad": "You will remember what I am telling you, and I entrust my affairs to Allah. Allah is All-Seeing of [His] slaves.”"
        }
    },
    {
        "id": 4177,
        "chapter": 40,
        "verse": 45,
        "arabic_text": "فَوَقَىٰهُ ٱللَّهُ سَيِّـَٔاتِ مَا مَكَرُواْۖ وَحَاقَ بِـَٔالِ فِرۡعَوۡنَ سُوٓءُ ٱلۡعَذَابِ",
        "phonetic": "40.45 Fawaqāhu Allāhu Sayyi'āti Mā Makarū Wa Ĥāqa Bi'āli Fir`awna Sū'u Al-`Adhābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So Allāh protected him from the evils they plotted, and the people of Pharaoh were enveloped by the worst of punishment -",
            "english_hilali_khan": "So Allâh saved him from the evils that they plotted (against him), while an evil torment encompassed Fir‘aun’s (Pharaoh) people.",
            "english_rwwad": "So Allah protected him from the evil that they plotted, and the people of Pharaoh were overwhelmed by an evil punishment:"
        }
    },
    {
        "id": 4178,
        "chapter": 40,
        "verse": 46,
        "arabic_text": "ٱلنَّارُ يُعۡرَضُونَ عَلَيۡهَا غُدُوّٗا وَعَشِيّٗاۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ أَدۡخِلُوٓاْ ءَالَ فِرۡعَوۡنَ أَشَدَّ ٱلۡعَذَابِ",
        "phonetic": "40.46 An-Nāru Yu`rađūna `Alayhā Ghudūwāan Wa `Ashīyāan Wa Yawma Taqūmu As-Sā`atu 'Adkhilū 'Āla Fir`awna 'Ashadda Al-`Adhābi",
        "footnotes": {
            "english_saheeh": "[1374]- From the time of their death until the Day of Resurrection, when they will be driven into it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Fire; they are exposed to it morning and evening.[1374] And the Day the Hour appears [it will be said], \"Make the people of Pharaoh enter the severest punishment.\"",
            "english_hilali_khan": "The Fire, they are exposed to it, morning and afternoon. And on the Day when the Hour will be established (it will be said to the angels): \"Cause Fir‘aun’s (Pharaoh) people to enter the severest torment!\"",
            "english_rwwad": "the Fire, which they will be exposed to [in their graves] morning and evening, and on the Day when the Hour takes place [it will be said], “Admit the people of Pharaoh into the most severe punishment.”"
        }
    },
    {
        "id": 4179,
        "chapter": 40,
        "verse": 47,
        "arabic_text": "وَإِذۡ يَتَحَآجُّونَ فِي ٱلنَّارِ فَيَقُولُ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا نَصِيبٗا مِّنَ ٱلنَّارِ",
        "phonetic": "40.47 Wa 'Idh Yataĥājjūna Fī An-Nāri Fayaqūlu Ađ-Đu`afā'u Lilladhīna Astakbarū 'Innā Kunnā Lakum Taba`āan Fahal 'Antum Mughnūna `Annā Naşībāan Mina An-Nāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when they will argue within the Fire, and the weak will say to those who had been arrogant, \"Indeed, we were [only] your followers, so will you relieve us of a share of the Fire?\"",
            "english_hilali_khan": "And, when they will dispute in the Fire, the weak will say to those who were arrogant: \"Verily, we followed you: can you then take from us some portion of the Fire?\"",
            "english_rwwad": "[Imagine] when they will argue in the Fire: the weak will say to those who were arrogant, “We were your followers, can you then relieve us of a portion of the Fire?”"
        }
    },
    {
        "id": 4180,
        "chapter": 40,
        "verse": 48,
        "arabic_text": "قَالَ ٱلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُلّٞ فِيهَآ إِنَّ ٱللَّهَ قَدۡ حَكَمَ بَيۡنَ ٱلۡعِبَادِ",
        "phonetic": "40.48 Qāla Al-Ladhīna Astakbarū 'Innā Kullun Fīhā 'Inna Allāha Qad Ĥakama Bayna Al-`Ibādi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who had been arrogant will say, \"Indeed, all [of us] are in it. Indeed, Allāh has judged between the servants.\"",
            "english_hilali_khan": "Those who were arrogant will say: \"We are all (together) in this (Fire)! Verily, Allâh has judged between (His) slaves!\"",
            "english_rwwad": "Those who were arrogant will say, “We are all in it. Allah has already passed judgment among [His] slaves.”"
        }
    },
    {
        "id": 4181,
        "chapter": 40,
        "verse": 49,
        "arabic_text": "وَقَالَ ٱلَّذِينَ فِي ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدۡعُواْ رَبَّكُمۡ يُخَفِّفۡ عَنَّا يَوۡمٗا مِّنَ ٱلۡعَذَابِ",
        "phonetic": "40.49 Wa Qāla Al-Ladhīna Fī An-Nāri Likhazanati Jahannama Ad`ū Rabbakum Yukhaffif `Annā Yawmāan Mina Al-`Adhābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those in the Fire will say to the keepers of Hell, \"Supplicate your Lord to lighten for us a day from the punishment.\"",
            "english_hilali_khan": "And those in the Fire will say to the keepers (angels) of Hell: \"Call upon your Lord to lighten for us the torment for a day!\"",
            "english_rwwad": "Those who are in the Fire will say to the keepers of Hell, “Pray to your Lord to lighten for us the punishment for just one day.”"
        }
    },
    {
        "id": 4182,
        "chapter": 40,
        "verse": 50,
        "arabic_text": "قَالُوٓاْ أَوَلَمۡ تَكُ تَأۡتِيكُمۡ رُسُلُكُم بِٱلۡبَيِّنَٰتِۖ قَالُواْ بَلَىٰۚ قَالُواْ فَٱدۡعُواْۗ وَمَا دُعَٰٓؤُاْ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٍ",
        "phonetic": "40.50 Qālū 'Awa Lam Taku Ta'tīkum Rusulukum Bil-Bayyināti Qālū Balá Qālū Fād`ū Wa Mā Du`ā'u Al-Kāfirīna 'Illā Fī Đalālin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will say, \"Did there not come to you your messengers with clear proofs?\" They will say, \"Yes.\" They will reply, \"Then supplicate [yourselves], but the supplication of the disbelievers is not except in error [i.e., futility].\"",
            "english_hilali_khan": "They will say: \"Did there not come to you, your Messengers with (clear) evidence (and signs)?\" They will say: \"Yes.\" They will reply: \"Then call (as you like)! And the invocation of the disbelievers is nothing but in vain (as it will not be answered by Allâh)!\"",
            "english_rwwad": "They will say, “Did your messengers not come to you with clear proofs?” They will say, “Yes.” They will say, “Then keep praying! The prayer of the disbelievers is only in vain.”"
        }
    },
    {
        "id": 4183,
        "chapter": 40,
        "verse": 51,
        "arabic_text": "إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِينَ ءَامَنُواْ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيَوۡمَ يَقُومُ ٱلۡأَشۡهَٰدُ",
        "phonetic": "40.51 'Innā Lananşuru Rusulanā Wa Al-Ladhīna 'Āmanū Fī Al-Ĥayāati Ad-Dunyā Wa Yawma Yaqūmu Al-'Ash/hādu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We will support Our messengers and those who believe during the life of this world and on the Day when the witnesses will stand -",
            "english_hilali_khan": "Verily, We will indeed make victorious Our Messengers and those who believe (in the Oneness of Allâh - Islâmic Monotheism) in this world’s life and on the Day when the witnesses will stand forth, (i.e. Day of Resurrection) -",
            "english_rwwad": "We will surely help Our messengers and those who believe in the life of this world and on the Day when the witnesses will come forward,"
        }
    },
    {
        "id": 4184,
        "chapter": 40,
        "verse": 52,
        "arabic_text": "يَوۡمَ لَا يَنفَعُ ٱلظَّٰلِمِينَ مَعۡذِرَتُهُمۡۖ وَلَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ",
        "phonetic": "40.52 Yawma Lā Yanfa`u Až-Žālimīna Ma`dhiratuhum Wa Lahumu Al-La`natu Wa Lahum Sū'u Ad-Dāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Day their excuse will not benefit the wrongdoers, and they will have the curse, and they will have the worst home [i.e., Hell].",
            "english_hilali_khan": "The Day when their excuses will be of no profit to Zâlimûn (polytheists, wrong-doers and disbelievers in the Oneness of Allâh). Theirs will be the curse, and theirs will be the evil abode (i.e. painful torment in Hell-fire).",
            "english_rwwad": "the Day when the excuses of the wrongdoers will be of no benefit to them; and they will be cursed and for them there will be the worst abode."
        }
    },
    {
        "id": 4185,
        "chapter": 40,
        "verse": 53,
        "arabic_text": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡهُدَىٰ وَأَوۡرَثۡنَا بَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡكِتَٰبَ",
        "phonetic": "40.53 Wa Laqad 'Ātaynā Mūsá Al-Hudá Wa 'Awrathnā Banī 'Isrā'īla Al-Kitāba",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly given Moses guidance, and We caused the Children of Israel to inherit the Scripture",
            "english_hilali_khan": "And, indeed We gave Mûsâ (Moses) the guidance, and We caused the Children of Israel to inherit the Scripture [i.e. the Taurât (Torah)] -",
            "english_rwwad": "We gave Moses guidance, and made the Children of Israel inherit the Scripture,"
        }
    },
    {
        "id": 4186,
        "chapter": 40,
        "verse": 54,
        "arabic_text": "هُدٗى وَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ",
        "phonetic": "40.54 Hudáan Wa Dhikrá Li'wlī Al-'Albābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "As guidance and a reminder for those of understanding.",
            "english_hilali_khan": "A guide and a reminder for men of understanding.",
            "english_rwwad": "as a guide and a reminder to people of understanding."
        }
    },
    {
        "id": 4187,
        "chapter": 40,
        "verse": 55,
        "arabic_text": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ بِٱلۡعَشِيِّ وَٱلۡإِبۡكَٰرِ",
        "phonetic": "40.55 Fāşbir 'Inna Wa`da Allāhi Ĥaqqun Wa Astaghfir Lidhanbika Wa Sabbiĥ Biĥamdi Rabbika Bil-`Ashīyi Wa Al-'Ibkāri",
        "footnotes": {
            "english_saheeh": "[1375]- What is intended is \"fault\" or \"error\" in judgement, since all prophets were protected by Allāh from falling into sin.  The implication is that all believers should seek forgiveness for their sins.",
            "english_hilali_khan": "(V.40:55) See the footnote of (V.4:106).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So be patient, [O Muḥammad]. Indeed, the promise of Allāh is truth. And ask forgiveness for your sin[1375] and exalt [Allāh] with praise of your Lord in the evening and the morning.",
            "english_hilali_khan": "So be patient (O Muhammad صلى الله عليه وسلم). Verily, the Promise of Allâh is true, and ask forgiveness for your fault[1] and glorify the praises of your Lord in the ‘Ashî (i.e. the time period after the midnoon till sunset) and in the Ibkâr (i.e. the time period from early morning or sunrise till before midnoon) [it is said that, that means the five compulsory congregational Salât (prayers) or the ‘Asr and Fajr prayers].",
            "english_rwwad": "So be patient, for Allah’s promise is true. Seek forgiveness for your sin, and glorify your Lord with His praise evening and morning."
        }
    },
    {
        "id": 4188,
        "chapter": 40,
        "verse": 56,
        "arabic_text": "إِنَّ ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡ إِن فِي صُدُورِهِمۡ إِلَّا كِبۡرٞ مَّا هُم بِبَٰلِغِيهِۚ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
        "phonetic": "40.56 'Inna Al-Ladhīna Yujādilūna Fī 'Āyāti Allāhi Bighayri Sulţānin 'Atāhum 'In Fī Şudūrihim 'Illā Kibrun Mā Hum Bibālighīhi Fāsta`idh Billāhi 'Innahu Huwa As-Samī`u Al-Başīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:56) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who dispute concerning the signs of Allāh without [any] evidence having come to them - there is not within their breasts except pride, [the extent of] which they cannot reach. So seek refuge in Allāh. Indeed, it is He who is the Hearing, the Seeing.",
            "english_hilali_khan": "Verily those who dispute about the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh, without any authority having come to them, there is nothing else in their breasts except pride [to accept you (Muhammad صلى الله عليه وسلم) as a Messenger of Allâh and to obey you][2]. They will never have it (i.e. Prophethood which Allâh has bestowed upon you). So seek refuge in Allâh (O Muhammad صلى الله عليه وسلم from the arrogants). Verily, it is He Who is the All-Hearer, the All-Seer.",
            "english_rwwad": "Those who argue against the verses of Allah without any proof given to them, there is nothing in their hearts but quest for dominance which they will never attain. So seek refuge with Allah, for He is the All-Hearing, the All-Seeing."
        }
    },
    {
        "id": 4189,
        "chapter": 40,
        "verse": 57,
        "arabic_text": "لَخَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ أَكۡبَرُ مِنۡ خَلۡقِ ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
        "phonetic": "40.57 Lakhalqu As-Samāwāti Wa Al-'Arđi 'Akbaru Min Khalqi An-Nāsi Wa Lakinna 'Akthara An-Nāsi Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The creation of the heavens and earth is greater than the creation of mankind, but most of the people do not know.",
            "english_hilali_khan": "The creation of the heavens and the earth is indeed greater than the creation of mankind; yet, most of mankind know not.",
            "english_rwwad": "The creation of the heavens and earth is far greater than the creation of mankind, but most people do not know."
        }
    },
    {
        "id": 4190,
        "chapter": 40,
        "verse": 58,
        "arabic_text": "وَمَا يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَلَا ٱلۡمُسِيٓءُۚ قَلِيلٗا مَّا تَتَذَكَّرُونَ",
        "phonetic": "40.58 Wa Mā Yastawī Al-'A`má Wa Al-Başīru Wa Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Wa Lā Al-Musī'u Qalīlāan Mā Tatadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And not equal are the blind and the seeing, nor are those who believe and do righteous deeds and the evildoer. Little do you remember.",
            "english_hilali_khan": "And not equal are the blind and those who see; nor are (equal) those who believe (in the Oneness of Allâh - Islâmic Monotheism), and do righteous good deeds, and those who do evil. Little do you remember!",
            "english_rwwad": "The blind and the seeing are not equal, nor are those who believe and do righteous deeds [equal] to those who do evil. Little do you take heed!"
        }
    },
    {
        "id": 4191,
        "chapter": 40,
        "verse": 59,
        "arabic_text": "إِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞ لَّا رَيۡبَ فِيهَا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ",
        "phonetic": "40.59 'Inna As-Sā`ata La'ātiyatun Lā Rayba Fīhā Wa Lakinna 'Akthara An-Nāsi Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the Hour is coming - no doubt about it - but most of the people do not believe.",
            "english_hilali_khan": "Verily, the Hour (Day of Judgement) is surely coming, there is no doubt about it, yet most men believe not.",
            "english_rwwad": "Indeed, the Hour is coming; there is no doubt about it, but most people do not believe."
        }
    },
    {
        "id": 4192,
        "chapter": 40,
        "verse": 60,
        "arabic_text": "وَقَالَ رَبُّكُمُ ٱدۡعُونِيٓ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِينَ يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِي سَيَدۡخُلُونَ جَهَنَّمَ دَاخِرِينَ",
        "phonetic": "40.60 Wa Qāla Rabbukum Ad`ūnī 'Astajib Lakum 'Inna Al-Ladhīna Yastakbirūna `An `Ibādatī Sayadkhulūna Jahannama Dākhirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible.",
            "english_hilali_khan": "And your Lord said: \"Invoke Me, [i.e. believe in My Oneness (Islâmic Monotheism) and ask Me for anything] I will respond to your (invocation). Verily! Those who scorn My worship [i.e. do not invoke Me, and do not believe in My Oneness, (Islâmic Monotheism)] they will surely enter Hell in humiliation!\"",
            "english_rwwad": "Your Lord says, “Call upon Me; I will respond to you. Those who are too proud to worship Me will enter Hell, utterly debased.”"
        }
    },
    {
        "id": 4193,
        "chapter": 40,
        "verse": 61,
        "arabic_text": "ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِتَسۡكُنُواْ فِيهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَشۡكُرُونَ",
        "phonetic": "40.61 Allāhu Al-Ladhī Ja`ala Lakumu Al-Layla Litaskunū Fīhi Wa An-Nahāra Mubşirāan 'Inna Allāha Ladhū Fađlin `Alá An-Nāsi Wa Lakinna 'Akthara An-Nāsi Lā Yashkurūna",
        "footnotes": {
            "english_saheeh": "[1376]- i.e., making things visible.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is Allāh who made for you the night that you may rest therein and the day giving sight.[1376] Indeed, Allāh is the possessor of bounty for the people, but most of them are not grateful.",
            "english_hilali_khan": "Allâh, it is He Who has made the night for you that you may rest therein and the day for you to see. Truly, Allâh is full of Bounty to mankind; yet, most of mankind give no thanks.",
            "english_rwwad": "It is Allah Who has made the night for you to rest therein and the day bright. Indeed, Allah is Most Bountiful to people, but most people are ungrateful."
        }
    },
    {
        "id": 4194,
        "chapter": 40,
        "verse": 62,
        "arabic_text": "ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ خَٰلِقُ كُلِّ شَيۡءٖ لَّآ إِلَٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ",
        "phonetic": "40.62 Dhalikumu Allāhu Rabbukum Khāliqu Kulli Shay'in Lā 'Ilāha 'Illā Huwa Fa'annā Tu'ufakūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is Allāh, your Lord, Creator of all things; there is no deity except Him, so how are you deluded?",
            "english_hilali_khan": "That is Allâh, your Lord, the Creator of all things: Lâ ilâha illâ Huwa (none has the right to be worshipped but He). How then are you turning away (from Allâh, by worshipping others instead of Him)?",
            "english_rwwad": "Such is Allah, your Lord, the Creator of everything; none has the right to be worshiped except Him. How can you be deluded?"
        }
    },
    {
        "id": 4195,
        "chapter": 40,
        "verse": 63,
        "arabic_text": "كَذَٰلِكَ يُؤۡفَكُ ٱلَّذِينَ كَانُواْ بِـَٔايَٰتِ ٱللَّهِ يَجۡحَدُونَ",
        "phonetic": "40.63 Kadhālika Yu'ufaku Al-Ladhīna Kānū Bi'āyāti Allāhi Yajĥadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Thus were those [before you] deluded who were rejecting the signs of Allāh.",
            "english_hilali_khan": "Thus were turned away those who used to deny the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh.",
            "english_rwwad": "This is how deluded are those who rejected Allah’s signs."
        }
    },
    {
        "id": 4196,
        "chapter": 40,
        "verse": 64,
        "arabic_text": "ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ قَرَارٗا وَٱلسَّمَآءَ بِنَآءٗ وَصَوَّرَكُمۡ فَأَحۡسَنَ صُوَرَكُمۡ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ",
        "phonetic": "40.64 Allāhu Al-Ladhī Ja`ala Lakumu Al-'Arđa Qarārāan Wa As-Samā'a Binā'an Wa Şawwarakum Fa'aĥsana Şuwarakum Wa Razaqakum Mina Aţ-Ţayyibāti Dhalikumu Allāhu Rabbukum Fatabāraka Allāhu Rabbu Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is Allāh who made for you the earth a place of settlement and the sky a structure [i.e., ceiling] and formed you and perfected your forms and provided you with good things. That is Allāh, your Lord; then blessed is Allāh, Lord of the worlds.",
            "english_hilali_khan": "Allâh, it is He Who has made for you the earth as a dwelling place and the sky as a canopy, and has given you shape and made your shapes good (looking) and has provided you with good things. That is Allâh, your Lord: so Blessed be Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "It is Allah Who has made the earth a dwelling place for you and the sky a canopy. He shaped you and perfected your form, and provided you with good things. Such is Allah, your Lord; Blessed is Allah, Lord of the worlds."
        }
    },
    {
        "id": 4197,
        "chapter": 40,
        "verse": 65,
        "arabic_text": "هُوَ ٱلۡحَيُّ لَآ إِلَٰهَ إِلَّا هُوَ فَٱدۡعُوهُ مُخۡلِصِينَ لَهُ ٱلدِّينَۗ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "40.65 Huwa Al-Ĥayyu Lā 'Ilāha 'Illā Huwa Fād`ūhu Mukhlişīna Lahu Ad-Dīna Al-Ĥamdu Lillāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[1377]- Whose life is without beginning or end, and upon whom all created life depends.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He is the Ever-Living;[1377] there is no deity except Him, so call upon Him, [being] sincere to Him in religion. [All] praise is [due] to Allāh, Lord of the worlds.",
            "english_hilali_khan": "He is the Ever Living, Lâ ilâha illâ Huwa (none has the right to be worshipped but He); so invoke Him making your worship pure for Him Alone (by worshipping Him Alone, and none else, and by doing righteous deeds sincerely for Allâh’s sake only, and not to show off, and not setting up rivals with Him in worship). All the praises and thanks be to Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "He is the Ever-Living; none has the right to be worshiped except Him. So call upon Him with sincere devotion to Him. All praise be to Allah, the Lord of the worlds."
        }
    },
    {
        "id": 4198,
        "chapter": 40,
        "verse": 66,
        "arabic_text": "۞ قُلۡ إِنِّي نُهِيتُ أَنۡ أَعۡبُدَ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَآءَنِيَ ٱلۡبَيِّنَٰتُ مِن رَّبِّي وَأُمِرۡتُ أَنۡ أُسۡلِمَ لِرَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "40.66 Qul 'Innī Nuhītu 'An 'A`buda Al-Ladhīna Tad`ūna Min Dūni Allāhi Lammā Jā'aniya Al-Bayyinātu Min Rabbī Wa 'Umirtu 'An 'Uslima Lirabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Indeed, I have been forbidden to worship those you call upon besides Allāh once the clear proofs have come to me from my Lord, and I have been commanded to submit to the Lord of the worlds.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I have been forbidden to worship those whom you worship besides Allâh, since there have come to me evidence from my Lord; and I am commanded to submit (in Islâm) to the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "Say [O Prophet], “I have been forbidden to worship those whom you worship besides Allah, since the clear proofs have come to me from my Lord, and I have been commanded to submit to the Lord of the worlds.”"
        }
    },
    {
        "id": 4199,
        "chapter": 40,
        "verse": 67,
        "arabic_text": "هُوَ ٱلَّذِي خَلَقَكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ يُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡ ثُمَّ لِتَكُونُواْ شُيُوخٗاۚ وَمِنكُم مَّن يُتَوَفَّىٰ مِن قَبۡلُۖ وَلِتَبۡلُغُوٓاْ أَجَلٗا مُّسَمّٗى وَلَعَلَّكُمۡ تَعۡقِلُونَ",
        "phonetic": "40.67 Huwa Al-Ladhī Khalaqakum Min Turābin Thumma Min Nuţfatin Thumma Min `Alaqatin Thumma Yukhrijukum Ţiflāan Thumma Litablughū 'Ashuddakum Thumma Litakūnū Shuyūkhāan Wa Minkum Man Yutawaffá Min Qablu Wa Litablughū 'Ajalāan Musammáan Wa La`allakum Ta`qilūna",
        "footnotes": {
            "english_saheeh": "[1378]- The time decreed for your death.",
            "english_hilali_khan": "(V.40:67) See the footnote of (V.22:5).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who created you from dust, then from a sperm-drop, then from a clinging clot; then He brings you out as a child; then [He develops you] that you reach your [time of] maturity, then [further] that you become elders. And among you is he who is taken in death before [that], so that you reach a specified term;[1378] and perhaps you will use reason.",
            "english_hilali_khan": "It is He, Who has created you (Adam) from dust, then from a Nutfah [mixed semen drops of male and female sexual discharge (i.e. Adam’s offspring)] then from a clot (a piece of coagulated blood), then brings you forth as an infant, then (makes you grow) to reach the age of full strength, and afterwards to be old (men and women)- though some among you die before,- and that you reach an appointed term in order that you may understand.[1]",
            "english_rwwad": "It is He Who created you from dust, then from a sperm-drop, then from a clinging clot. Then He brings you out as an infant, so that you may reach your age of full strength, then you become old, even though some of you may die earlier – and so that you may reach an appointed term, and so that you may understand."
        }
    },
    {
        "id": 4200,
        "chapter": 40,
        "verse": 68,
        "arabic_text": "هُوَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُۖ فَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
        "phonetic": "40.68 Huwa Al-Ladhī Yuĥyī Wa Yumītu Fa'idhā Qađá 'Amrāan Fa'innamā Yaqūlu Lahu Kun Fayakūnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He it is who gives life and causes death; and when He decrees a matter, He but says to it, \"Be,\" and it is.",
            "english_hilali_khan": "It is He Who gives life and causes death. And when He decides upon a thing He says to it only: \"Be!\" - and it is.",
            "english_rwwad": "It is He Who gives life and causes death. When He decrees a matter, He only says to it, “Be,” and it is."
        }
    },
    {
        "id": 4201,
        "chapter": 40,
        "verse": 69,
        "arabic_text": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ أَنَّىٰ يُصۡرَفُونَ",
        "phonetic": "40.69 'Alam Tará 'Ilá Al-Ladhīna Yujādilūna Fī 'Āyāti Allāhi 'Anná Yuşrafūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do you not consider those who dispute concerning the signs of Allāh - how are they averted?",
            "english_hilali_khan": "See you not those who dispute about the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh? How are they turning away [from the truth, (i.e. Islâmic Monotheism to the falsehood (i.e. polytheism)]?",
            "english_rwwad": "Do you not see those who dispute concerning the signs of Allah, how can they be turned away?"
        }
    },
    {
        "id": 4202,
        "chapter": 40,
        "verse": 70,
        "arabic_text": "ٱلَّذِينَ كَذَّبُواْ بِٱلۡكِتَٰبِ وَبِمَآ أَرۡسَلۡنَا بِهِۦ رُسُلَنَاۖ فَسَوۡفَ يَعۡلَمُونَ",
        "phonetic": "40.70 Al-Ladhīna Kadhabū Bil-Kitābi Wa Bimā 'Arsalnā Bihi Rusulanā Fasawfa Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who deny the Book [i.e., the Qur’ān] and that with which We sent Our messengers - they are going to know,",
            "english_hilali_khan": "Those who deny the Book (this Qur’ân), and that with which We sent Our Messengers (i.e. to worship none but Allâh Alone sincerely, and to reject all false deities and to confess resurrection after the death for recompense) they will come to know (when they will be cast into the Fire of Hell).",
            "english_rwwad": "those who reject the Book and what We sent Our messengers with. They will soon come to know,"
        }
    },
    {
        "id": 4203,
        "chapter": 40,
        "verse": 71,
        "arabic_text": "إِذِ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَٰقِهِمۡ وَٱلسَّلَٰسِلُ يُسۡحَبُونَ",
        "phonetic": "40.71 'Idhi Al-'Aghlālu Fī 'A`nāqihim Wa As-Salāsilu Yusĥabūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:71) See the footnote of (V.17:97).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "When the shackles are around their necks and the chains; they will be dragged",
            "english_hilali_khan": "When iron collars will be rounded over their necks, and the chains, they shall be dragged along,[2]",
            "english_rwwad": "when the shackles will be around their necks, and with chains they will be dragged"
        }
    },
    {
        "id": 4204,
        "chapter": 40,
        "verse": 72,
        "arabic_text": "فِي ٱلۡحَمِيمِ ثُمَّ فِي ٱلنَّارِ يُسۡجَرُونَ",
        "phonetic": "40.72 Fī Al-Ĥamīmi Thumma Fī An-Nāri Yusjarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:72) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "In boiling water; then in the Fire they will be filled [with flame].",
            "english_hilali_khan": "In the boiling water, then they will be burned in the Fire.[3]",
            "english_rwwad": "into the scalding water, then they will be burned in the Fire."
        }
    },
    {
        "id": 4205,
        "chapter": 40,
        "verse": 73,
        "arabic_text": "ثُمَّ قِيلَ لَهُمۡ أَيۡنَ مَا كُنتُمۡ تُشۡرِكُونَ",
        "phonetic": "40.73 Thumma Qīla Lahum 'Ayna Mā Kuntum Tushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:73) See the footnote of (V.4:135).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then it will be said to them, \"Where is that which you used to associate [with Him in worship]",
            "english_hilali_khan": "Then it will be said to them: \"Where are (all) those whom you used to join in worship as partners[4]",
            "english_rwwad": "Then it will be said to them, “Where are those whom you used to associate as partners"
        }
    },
    {
        "id": 4206,
        "chapter": 40,
        "verse": 74,
        "arabic_text": "مِن دُونِ ٱللَّهِۖ قَالُواْ ضَلُّواْ عَنَّا بَل لَّمۡ نَكُن نَّدۡعُواْ مِن قَبۡلُ شَيۡـٔٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ ٱلۡكَٰفِرِينَ",
        "phonetic": "40.74 Min Dūni Allāhi Qālū Đallū `Annā Bal Lam Nakun Nad`ū Min Qablu Shay'āan Kadhālika Yuđillu Allāhu Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:74) See the footnote of (V.2:165).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Other than Allāh?\" They will say, \"They have departed from us; rather, we did not used to invoke previously anything.\" Thus does Allāh put astray the disbelievers.",
            "english_hilali_khan": "\"Besides Allâh\"? They will say: \"They have vanished from us: Nay, we did not invoke (worship) anything before.\" Thus Allâh leads astray the disbelievers.[5]",
            "english_rwwad": "with Allah?” They will say, “We have lost them; rather, we never used to call upon anything before.” This is how Allah causes the disbelievers to stray."
        }
    },
    {
        "id": 4207,
        "chapter": 40,
        "verse": 75,
        "arabic_text": "ذَٰلِكُم بِمَا كُنتُمۡ تَفۡرَحُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَمۡرَحُونَ",
        "phonetic": "40.75 Dhālikum Bimā Kuntum Tafraĥūna Fī Al-'Arđi Bighayri Al-Ĥaqqi Wa Bimā Kuntum Tamraĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[The angels will say], \"That was because you used to exult upon the earth without right and you used to behave insolently.",
            "english_hilali_khan": "That was because you had been exulting in the earth without any right (by worshipping others instead of Allâh and by committing crimes), and that you used to rejoice extremely (in your error).",
            "english_rwwad": "[They will be told], “This is because you used to rejoice on earth wrongfully, and you used to exult [arrogantly]."
        }
    },
    {
        "id": 4208,
        "chapter": 40,
        "verse": 76,
        "arabic_text": "ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ",
        "phonetic": "40.76 Adkhulū 'Abwāba Jahannama Khālidīna Fīhā Fabi'sa Mathwá Al-Mutakabbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"",
            "english_hilali_khan": "Enter the gates of Hell to abide therein: and (indeed) what an evil abode of the arrogant!",
            "english_rwwad": "Enter the gates of Hell, abiding therein forever. Terrible is indeed the abode of the arrogant!”"
        }
    },
    {
        "id": 4209,
        "chapter": 40,
        "verse": 77,
        "arabic_text": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۚ فَإِمَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِلَيۡنَا يُرۡجَعُونَ",
        "phonetic": "40.77 Fāşbir 'Inna Wa`da Allāhi Ĥaqqun Fa'immā Nuriyannaka Ba`đa Al-Ladhī Na`iduhum 'Aw Natawaffayannaka Fa'ilaynā Yurja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So be patient, [O Muḥammad]; indeed, the promise of Allāh is truth. And whether We show you some of what We have promised them or We take you in death, it is to Us they will be returned.",
            "english_hilali_khan": "So be patient (O Muhammad صلى الله عليه وسلم); verily, the Promise of Allâh is true and whether We show you (O Muhammad صلى الله عليه وسلم in this world) some part of what We have promised them, or We cause you to die then still it is to Us they all shall be returned.",
            "english_rwwad": "So be patient [O Prophet]. Allah’s promise is true; whether We show you some of what We threaten them with, or cause you to die [before that], to Us they will be returned."
        }
    },
    {
        "id": 4210,
        "chapter": 40,
        "verse": 78,
        "arabic_text": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ مِنۡهُم مَّن قَصَصۡنَا عَلَيۡكَ وَمِنۡهُم مَّن لَّمۡ نَقۡصُصۡ عَلَيۡكَۗ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ فَإِذَا جَآءَ أَمۡرُ ٱللَّهِ قُضِيَ بِٱلۡحَقِّ وَخَسِرَ هُنَالِكَ ٱلۡمُبۡطِلُونَ",
        "phonetic": "40.78 Wa Laqad 'Arsalnā Rusulāan Min Qablika Minhum Man Qaşaşnā `Alayka Wa Minhum Man Lam Naqşuş `Alayka Wa Mā Kāna Lirasūlin 'An Ya'tiya Bi'āyatin 'Illā Bi'idhni Allāhi Fa'idhā Jā'a 'Amru Allāhi Quđiya Bil-Ĥaqqi Wa Khasira Hunālika Al-Mubţilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.40:78) There are many Prophets and Messengers of Allâh. About twenty-five of them are mentioned in the Qur’an; out of these twenty-five, only five are of strong will, namely: Muhammad صلى الله عليه وسلم, Nûh (Noah), Ibrâhîm (Abraham), Mûsâ (Moses), and ‘Îsâ (Jesus) - son of Maryam (Mary) عليهم السلام .",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have already sent messengers before you. Among them are those [whose stories] We have related to you, and among them are those [whose stories] We have not related to you. And it was not for any messenger to bring a sign [or verse] except by permission of Allāh. So when the command of Allāh comes, it will be concluded [i.e., judged] in truth, and the falsifiers will thereupon lose [all].",
            "english_hilali_khan": "And, indeed We have sent Messengers before you (O Muhammad صلى الله عليه وسلم): of some of them We have related to you their story.[1] And of some We have not related to you their story, and it was not given to any Messenger that he should bring a sign except by the Leave of Allâh. But, when comes the Commandment of Allâh, the matter will be decided with truth, and the followers of falsehood will then be lost.",
            "english_rwwad": "We have sent messengers before you; of them are some whose stories We have told you, and some We have not. It was not for a messenger to bring a sign except with Allah’s permission. But when the decree of Allah comes, judgment will be passed with justice, thereupon the people of falsehood will be in utter loss."
        }
    },
    {
        "id": 4211,
        "chapter": 40,
        "verse": 79,
        "arabic_text": "ٱللَّهُ ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَنۡعَٰمَ لِتَرۡكَبُواْ مِنۡهَا وَمِنۡهَا تَأۡكُلُونَ",
        "phonetic": "40.79 Allāhu Al-Ladhī Ja`ala Lakumu Al-'An`ām Litarkabū Minhā Wa Minhā Ta'kulūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is Allāh who made for you the grazing animals upon which you ride, and some of them you eat.",
            "english_hilali_khan": "Allâh, it is He Who has made cattle for you, that you may ride on some of them, and of some you eat.",
            "english_rwwad": "Allah is the One Who made the livestock for you, so that you may ride some and eat others,"
        }
    },
    {
        "id": 4212,
        "chapter": 40,
        "verse": 80,
        "arabic_text": "وَلَكُمۡ فِيهَا مَنَٰفِعُ وَلِتَبۡلُغُواْ عَلَيۡهَا حَاجَةٗ فِي صُدُورِكُمۡ وَعَلَيۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ",
        "phonetic": "40.80 Wa Lakum Fīhā Manāfi`u Wa Litablughū `Alayhā Ĥājatan Fī Şudūrikum Wa `Alayhā Wa `Alá Al-Fulki Tuĥmalūna",
        "footnotes": {
            "english_saheeh": "[1379]- i.e., that you may use the animals to carry your loads to distant places, according to need.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And for you therein are [other] benefits and that you may realize upon them a need which is in your breasts;[1379] and upon them and upon ships you are carried.",
            "english_hilali_khan": "And you have (many other) benefits from them, and that you may reach by their means a desire that is in your breasts (i.e. carry your goods, loads, etc.), and on them and on ships you are carried.",
            "english_rwwad": "and you may have other benefits from them, and by them you may fulfill your heartfelt need [to reach distant places], and on them and on the ships you are carried."
        }
    },
    {
        "id": 4213,
        "chapter": 40,
        "verse": 81,
        "arabic_text": "وَيُرِيكُمۡ ءَايَٰتِهِۦ فَأَيَّ ءَايَٰتِ ٱللَّهِ تُنكِرُونَ",
        "phonetic": "40.81 Wa Yurīkum 'Āyātihi Fa'ayya 'Āyāti Allāhi Tunkirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He shows you His signs. So which of the signs of Allāh do you deny?",
            "english_hilali_khan": "And He shows you His Ayât (signs and proofs) (of His Oneness in all the above-mentioned things). Which, then of the Ayât (signs and proofs) of Allâh do you deny?",
            "english_rwwad": "And He shows you His signs; so which of the signs of Allah will you deny?"
        }
    },
    {
        "id": 4214,
        "chapter": 40,
        "verse": 82,
        "arabic_text": "أَفَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَانُوٓاْ أَكۡثَرَ مِنۡهُمۡ وَأَشَدَّ قُوَّةٗ وَءَاثَارٗا فِي ٱلۡأَرۡضِ فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "40.82 'Afalam Yasīrū Fī Al-'Arđi Fayanžurū Kayfa Kāna `Āqibatu Al-Ladhīna Min Qablihim Kānū 'Akthara Minhum Wa 'Ashadda Qūwatan Wa 'Āthārāan Fī Al-'Arđi Famā 'Aghná `Anhum Mā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have they not traveled through the land and observed how was the end of those before them? They were more numerous than themselves and greater in strength and in impression on the land, but they were not availed by what they used to earn.",
            "english_hilali_khan": "Have they not travelled through the earth and seen what was the end of those before them? They were more in number than them and mightier in strength, and in the traces (they have left behind them) in the land; yet all that they used to earn availed them not.",
            "english_rwwad": "Have they not traveled through the land to see what was the end of those who came before them? They were more in number and far superior in strength, and more impressive in marks that they left behind in the land, but all what they had earned was of no avail to them."
        }
    },
    {
        "id": 4215,
        "chapter": 40,
        "verse": 83,
        "arabic_text": "فَلَمَّا جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَرِحُواْ بِمَا عِندَهُم مِّنَ ٱلۡعِلۡمِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
        "phonetic": "40.83 Falammā Jā'at/hum Rusuluhum Bil-Bayyināti Fariĥū Bimā `Indahum Mina Al-`Ilmi Wa Ĥāqa Bihim Mā Kānū Bihi Yastahzi'ūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when their messengers came to them with clear proofs, they [merely] rejoiced in what they had of knowledge, but they were enveloped by what they used to ridicule.",
            "english_hilali_khan": "Then when their Messengers came to them with clear proofs, they were glad (and proud) with that which they had of the knowledge (of worldly things). And that at which they used to mock, surrounded them (i.e. the punishment).",
            "english_rwwad": "When their messengers came to them with clear proofs, they exulted in whatever knowledge they had, and they were overwhelmed by what they used to ridicule."
        }
    },
    {
        "id": 4216,
        "chapter": 40,
        "verse": 84,
        "arabic_text": "فَلَمَّا رَأَوۡاْ بَأۡسَنَا قَالُوٓاْ ءَامَنَّا بِٱللَّهِ وَحۡدَهُۥ وَكَفَرۡنَا بِمَا كُنَّا بِهِۦ مُشۡرِكِينَ",
        "phonetic": "40.84 Falammā Ra'aw Ba'sanā Qālū 'Āmannā Billāhi Waĥdahu Wa Kafarnā Bimā Kunnā Bihi Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they saw Our punishment, they said, \"We believe in Allāh alone and disbelieve in that which we used to associate with Him.\"",
            "english_hilali_khan": "So when they saw Our punishment, they said: \"We believe in Allâh Alone and reject (all) that we used to associate with Him as (His) partners.",
            "english_rwwad": "But when they saw Our punishment, they said, “We believe in Allah alone, and we reject what we used to associate with Him.”"
        }
    },
    {
        "id": 4217,
        "chapter": 40,
        "verse": 85,
        "arabic_text": "فَلَمۡ يَكُ يَنفَعُهُمۡ إِيمَٰنُهُمۡ لَمَّا رَأَوۡاْ بَأۡسَنَاۖ سُنَّتَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ فِي عِبَادِهِۦۖ وَخَسِرَ هُنَالِكَ ٱلۡكَٰفِرُونَ",
        "phonetic": "40.85 Falam Yaku Yanfa`uhum 'Īmānuhum Lammā Ra'aw Ba'sanā Sunnata Allāhi Allatī Qad Khalat Fī `Ibādihi Wa Khasira Hunālika Al-Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But never did their faith benefit them once they saw Our punishment. [It is] the established way of Allāh which has preceded among His servants. And the disbelievers thereupon lost [all].",
            "english_hilali_khan": "Then their Faith (in Islâmic Monotheism) could not avail them when they saw Our punishment. (Like) this has been the way of Allâh in dealing with His slaves. And there the disbelievers lost utterly (when Our Torment covered them).",
            "english_rwwad": "But their faith was of no benefit to them when they saw Our punishment. This has always been Allah’s way with His slaves; whereupon the disbelievers were in utter loss."
        }
    }
]