[
    {
        "id": 4583,
        "chapter": 48,
        "verse": 1,
        "arabic_text": "إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا",
        "phonetic": "48.1 'Innā Fataĥnā Laka Fatĥāan Mubīnāan",
        "footnotes": {
            "english_saheeh": "[1507]- Ibn Masʿūd said, \"You [people] consider the conquest to be that of Makkah, but we consider it to be the Treaty of al-Ḥudaybiyyah.\"  Al-Bukhārī reported a similar quotation from al-Barā’ bin ʿĀzib.  Although initially regarded by the companions as a setback, the treaty, in effect, served to promote the spread of Islām, which led to the conquest of Makkah two years later.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We have given you, [O Muḥammad], a clear conquest[1507]",
            "english_hilali_khan": "Verily, We have given you (O Muhammad صلى الله عليه وسلم) a manifest victory.",
            "english_rwwad": "Indeed, We have given you [O Prophet] a clear victory,"
        }
    },
    {
        "id": 4584,
        "chapter": 48,
        "verse": 2,
        "arabic_text": "لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا",
        "phonetic": "48.2 Liyaghfira Laka Allāhu Mā Taqaddama Min Dhanbika Wa Mā Ta'akhkhara Wa Yutimma Ni`matahu `Alayka Wa Yahdiyaka Şirāţāan Mustaqīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.48:2) Narrated Al-Mughîrah: The Prophet صلى الله عليه وسلم used to offer night prayers till his feet became swollen. Somebody said to him, \"Allah has forgiven you your sins of the past and the future.\" On that, He said, \" Shouldn‘t I be a thankful slave of Allah?\" (Sahih Al-Bukhari, Vol.6, Hadîth No.360).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That Allāh may forgive for you what preceded of your sin [i.e., errors] and what will follow and complete His favor upon you and guide you to a straight path",
            "english_hilali_khan": "That Allâh may forgive you your sins of the past and the future,[1] and complete His Favour on you, and guide you on the Straight Path,",
            "english_rwwad": "so that Allah may forgive you your previous and future sins, complete His favor upon you, and guide you to a straight path,"
        }
    },
    {
        "id": 4585,
        "chapter": 48,
        "verse": 3,
        "arabic_text": "وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا",
        "phonetic": "48.3 Wa Yanşuraka Allāhu Naşrāan `Azīzāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [that] Allāh may aid you with a mighty victory.",
            "english_hilali_khan": "And that Allâh may help you with strong help.",
            "english_rwwad": "and so that Allah may help you with a mighty victory."
        }
    },
    {
        "id": 4586,
        "chapter": 48,
        "verse": 4,
        "arabic_text": "هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَٰنٗا مَّعَ إِيمَٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا",
        "phonetic": "48.4 Huwa Al-Ladhī 'Anzala As-Sakīnata Fī Qulūbi Al-Mu'uminīna Liyazdādū 'Īmānāan Ma`a 'Īmānihim Wa Lillahi Junūdu As-Samāwāti Wa Al-'Arđi Wa Kāna Allāhu `Alīmāan Ĥakīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who sent down tranquility into the hearts of the believers that they would increase in faith along with their [present] faith. And to Allāh belong the soldiers of the heavens and the earth, and ever is Allāh Knowing and Wise.",
            "english_hilali_khan": "He it is Who sent down As-Sakînah (calmness and tranquillity) into the hearts of the believers, that they may grow more in Faith along with their (present) Faith. And to Allâh belong the hosts of the heavens and the earth, and Allâh is Ever All-Knower, All-Wise.",
            "english_rwwad": "It is He Who sent down tranquility into the hearts of the believers so that they may increase in faith along with their faith. To Allah belong the soldiers of the heavens and earth. And Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 4587,
        "chapter": 48,
        "verse": 5,
        "arabic_text": "لِّيُدۡخِلَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَيُكَفِّرَ عَنۡهُمۡ سَيِّـَٔاتِهِمۡۚ وَكَانَ ذَٰلِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِيمٗا",
        "phonetic": "48.5 Liyudkhila Al-Mu'uminīna Wa Al-Mu'umināti Jannātin Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā Wa Yukaffira `Anhum Sayyi'ātihim Wa Kāna Dhālika `Inda Allāhi Fawzāan `Ažīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[And] that He may admit the believing men and the believing women to gardens beneath which rivers flow to abide therein eternally and remove from them their misdeeds - and ever is that, in the sight of Allāh, a great attainment",
            "english_hilali_khan": "That He may admit the believing men and the believing women to Gardens under which rivers flow (i.e. Paradise), to abide therein forever, and He may expiate from them their sins; and that is with Allâh a supreme success,",
            "english_rwwad": "So that He may admit the believing men and women to gardens under which rivers flow, abiding therein forever, and absolve them of their sins; that is a supreme triumph before Allah."
        }
    },
    {
        "id": 4588,
        "chapter": 48,
        "verse": 6,
        "arabic_text": "وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ ٱلظَّآنِّينَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَيۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرٗا",
        "phonetic": "48.6 Wa Yu`adhiba Al-Munāfiqīna Wa Al-Munāfiqāti Wa Al-Mushrikīna Wa Al-Mushrikāti Až-Žānnīna Billāhi Žanna As-Saw'i `Alayhim Dā'iratu As-Saw'i Wa Ghađiba Allāhu `Alayhim Wa La`anahum Wa 'A`adda Lahum Jahannama Wa Sā'at Maşīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.48:6) Al-Mushrikûn: Polytheists, pagans, idolaters, and disbelievers in the Oneness of Allâh and in His Messengerصلى الله عليه وسلم .",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [that] He may punish the hypocrite men and hypocrite women, and the polytheist men and polytheist women - those who assume about Allāh an assumption of evil nature. Upon them is a misfortune of evil nature; and Allāh has become angry with them and has cursed them and prepared for them Hell, and evil it is as a destination.",
            "english_hilali_khan": "And that He may punish the Munâfiqûn (hypocrites), men and women, and also the Mushrikûn[2] men and women, who think evil thoughts about Allâh: for them is a disgraceful torment. And the Anger of Allâh is upon them, and He has cursed them and prepared Hell for them - and worst indeed is that destination.",
            "english_rwwad": "And so that He may punish hypocrite men and women and polytheist men and women, who harbor about Allah evil thoughts. An evil fate will befall them. Allah is angry with them, and has cursed them and prepared for them Hell. What a terrible destination!"
        }
    },
    {
        "id": 4589,
        "chapter": 48,
        "verse": 7,
        "arabic_text": "وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا",
        "phonetic": "48.7 Wa Lillahi Junūdu As-Samāwāti Wa Al-'Arđi Wa Kāna Allāhu `Azīzāan Ĥakīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Allāh belong the soldiers of the heavens and the earth. And ever is Allāh Exalted in Might and Wise.",
            "english_hilali_khan": "And to Allâh belong the hosts of the heavens and the earth. And Allâh is Ever All-Powerful, All-Wise.",
            "english_rwwad": "To Allah belong the soldiers of the heavens and earth, and Allah is All-Mighty, All-Wise."
        }
    },
    {
        "id": 4590,
        "chapter": 48,
        "verse": 8,
        "arabic_text": "إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا",
        "phonetic": "48.8 'Innā 'Arsalnāka Shāhidāan Wa Mubashirāan Wa Nadhīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.48:8) See the footnote of (V.2:42).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We have sent you as a witness and a bringer of good tidings and a warner",
            "english_hilali_khan": "Verily, We have sent you (O Muhammad صلى الله عليه وسلم) as a witness, as a bearer of glad tidings, and as a warner[3].",
            "english_rwwad": "Indeed, We have sent you [O prophet] as a witness, a bearer of glad tidings, and a warner,"
        }
    },
    {
        "id": 4591,
        "chapter": 48,
        "verse": 9,
        "arabic_text": "لِّتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا",
        "phonetic": "48.9 Litu'uminū Billāhi Wa Rasūlihi Wa Tu`azzirūhu Wa Tuwaqqirūhu Wa Tusabbiĥūhu Bukratan Wa 'Aşīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That you [people] may believe in Allāh and His Messenger and honor him and respect him [i.e., the Prophet (ﷺ)] and exalt Him [i.e., Allāh] morning and afternoon.",
            "english_hilali_khan": "In order that you (O mankind) may believe in Allâh and His Messenger (صلى الله عليه وسلم), and that you assist and honour him (صلى الله عليه وسلم), and (that you) glorify (Allâh’s) praises morning and afternoon.",
            "english_rwwad": "so that you may believe in Allah and His Messenger, support and revere him, and glorify Him morning and evening."
        }
    },
    {
        "id": 4592,
        "chapter": 48,
        "verse": 10,
        "arabic_text": "إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوۡقَ أَيۡدِيهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَٰهَدَ عَلَيۡهُ ٱللَّهَ فَسَيُؤۡتِيهِ أَجۡرًا عَظِيمٗا",
        "phonetic": "48.10 'Inna Al-Ladhīna Yubāyi`ūnaka 'Innamā Yubāyi`ūna Allāha Yadu Allāhi Fawqa 'Aydīhim Faman Nakatha Fa'innamā Yankuthu `Alá Nafsihi Wa Man 'Awfá Bimā `Āhada `Alayhu Allāha Fasayu'utīhi 'Ajrāan `Ažīmāan",
        "footnotes": {
            "english_saheeh": "[1508]- See footnote to 2:19.\n[1509]- Meaning that He (subḥānahu wa taʿālā) accepted their pledge.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who pledge allegiance to you, [O Muḥammad] - they are actually pledging allegiance to Allāh. The hand[1508] of Allāh is over their hands.[1509] So he who breaks his word only breaks it to the detriment of himself. And he who fulfills that which he has promised Allāh - He will give him a great reward.",
            "english_hilali_khan": "Verily, those who give Bai‘ah (pledge) to you (O Muhammad صلى الله عليه وسلم) they are giving Bai‘ah (pledge) to Allâh. The Hand of Allâh is over their hands. Then whosoever breaks his pledge, breaks it only to his own harm; and whosoever fulfils what he has covenanted with Allâh, He will bestow on him a great reward.",
            "english_rwwad": "Those who pledge allegiance to you [O Prophet] are indeed pledging allegiance to Allah; Allah’s Hand is over their hands. Whoever breaks his pledge, he only breaks it to his own detriment, but whoever fulfills his covenant with Allah, He will give him a great reward."
        }
    },
    {
        "id": 4593,
        "chapter": 48,
        "verse": 11,
        "arabic_text": "سَيَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَآ أَمۡوَٰلُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ يَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَيۡسَ فِي قُلُوبِهِمۡۚ قُلۡ فَمَن يَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَيۡـًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرَۢا",
        "phonetic": "48.11 Sayaqūlu Laka Al-Mukhallafūna Mina Al-'A`rābi Shaghalatnā 'Amwālunā Wa 'Ahlūnā Fāstaghfir Lanā Yaqūlūna Bi'alsinatihim Mā Laysa Fī Qulūbihim Qul Faman Yamliku Lakum Mina Allāhi Shay'āan 'In 'Arāda Bikum Đarrāan 'Aw 'Arāda Bikum Naf`āan Bal Kāna Allāhu Bimā Ta`malūna Khabīrāan",
        "footnotes": {
            "english_saheeh": "[1510]- See footnote to 9:81.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who remained behind[1510] of the bedouins will say to you, \"Our properties and our families occupied us, so ask forgiveness for us.\" They say with their tongues what is not within their hearts. Say, \"Then who could prevent Allāh at all if He intended for you harm or intended for you benefit? Rather, ever is Allāh, of what you do, Aware.",
            "english_hilali_khan": "Those of the bedouins who lagged behind will say to you: \"Our possessions and our families occupied us, so ask forgiveness for us.\" They say with their tongues what is not in their hearts. Say: \"Who then has any power at all (to intervene) on your behalf with Allâh, if He intends you hurt or intends you benefit? Nay, but Allâh is Ever All-Aware of what you do.",
            "english_rwwad": "Those of the Bedouins who lagged behind will say to you, “We were preoccupied with our wealth and our families, so ask for forgiveness for us.” They say with their tongues what is not in their hearts. Say, “Then who can prevent Allah if He intends to harm or benefit you? Indeed, Allah is All-Aware of what you do."
        }
    },
    {
        "id": 4594,
        "chapter": 48,
        "verse": 12,
        "arabic_text": "بَلۡ ظَنَنتُمۡ أَن لَّن يَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰٓ أَهۡلِيهِمۡ أَبَدٗا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورٗا",
        "phonetic": "48.12 Bal Žanantum 'An Lan Yanqaliba Ar-Rasūlu Wa Al-Mu'uminūna 'Ilá 'Ahlīhim 'Abadāan Wa Zuyyina Dhālika Fī Qulūbikum Wa Žanantum Žanna As-Saw'i Wa Kuntum Qawmāan Būrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But you thought that the Messenger and the believers would never return to their families, ever, and that was made pleasing in your hearts. And you assumed an assumption of evil and became a people ruined.\"",
            "english_hilali_khan": "\"Nay, but you thought that the Messenger (صلى الله عليه وسلم) and the believers would never return to their families, and that was made fair-seeming in your hearts, and you did think an evil thought and you became a useless people going for destruction.\"",
            "english_rwwad": "But you thought that the Messenger and the believers would never return to their families ever, and that was made appealing in your hearts. You harbored evil thoughts, for you are a doomed people.”"
        }
    },
    {
        "id": 4595,
        "chapter": 48,
        "verse": 13,
        "arabic_text": "وَمَن لَّمۡ يُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّآ أَعۡتَدۡنَا لِلۡكَٰفِرِينَ سَعِيرٗا",
        "phonetic": "48.13 Wa Man Lam Yu'umin Billāhi Wa Rasūlihi Fa'innā 'A`tadnā Lilkāfirīna Sa`īrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.48:13) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whoever has not believed in Allāh and His Messenger - then indeed, We have prepared for the disbelievers a Blaze.",
            "english_hilali_khan": "And whosoever does not believe in Allâh and His Messenger (Muhammad صلى الله عليه وسلم), then verily, We have prepared for the disbelievers a blazing Fire.[1]",
            "english_rwwad": "Whoever does not believe in Allah and His Messenger, We have certainly prepared for the disbelievers a Blazing Fire."
        }
    },
    {
        "id": 4596,
        "chapter": 48,
        "verse": 14,
        "arabic_text": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا",
        "phonetic": "48.14 Wa Lillahi Mulku As-Samāwāti Wa Al-'Arđi Yaghfiru Liman Yashā'u Wa Yu`adhibu Man Yashā'u Wa Kāna Allāhu Ghafūrāan Raĥīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Allāh belongs the dominion of the heavens and the earth. He forgives whom He wills and punishes whom He wills. And ever is Allāh Forgiving and Merciful.",
            "english_hilali_khan": "And to Allâh belongs the sovereignty of the heavens and the earth. He forgives whom He wills, and punishes whom He wills. And Allâh is Ever Oft-Forgiving, Most Merciful.",
            "english_rwwad": "To Allah belongs the dominion of the heavens and earth. He forgives whom He wills and punishes whom He wills, and Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 4597,
        "chapter": 48,
        "verse": 15,
        "arabic_text": "سَيَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ يُرِيدُونَ أَن يُبَدِّلُواْ كَلَٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَيَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُواْ لَا يَفۡقَهُونَ إِلَّا قَلِيلٗا",
        "phonetic": "48.15 Sayaqūlu Al-Mukhallafūna 'Idhā Anţalaqtum 'Ilá Maghānima Lita'khudhūhā Dharūnā Nattabi`kum Yurīdūna 'An Yubaddilū Kalāma Allāhi Qul Lan Tattabi`ūnā Kadhālikum Qāla Allāhu Min Qablu Fasayaqūlūna Bal Taĥsudūnanā Bal Kānū Lā Yafqahūna 'Illā Qalīlāan",
        "footnotes": {
            "english_saheeh": "[1511]- See footnote to 9:81.\n[1512]- i.e., they only understood the material aspects of life.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who remained[1511] behind will say when you set out toward the war booty to take it, \"Let us follow you.\" They wish to change the words of Allāh. Say, \"Never will you follow us. Thus did Allāh say before.\" So they will say, \"Rather, you envy us.\" But [in fact] they were not understanding except a little.[1512]",
            "english_hilali_khan": "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you.\" They want to change Allâh’s Words. Say: \"You shall not follow us; thus Allâh has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little.",
            "english_rwwad": "Those who lagged behind will say when you set out to collect the spoils of war, “Let us follow you.” They wish to change the word of Allah. Say, “You will never follow us; this is what Allah has already decreed.” They will then say, “Rather, you are jealous of us.” Rather, they do not understand but a little."
        }
    },
    {
        "id": 4598,
        "chapter": 48,
        "verse": 16,
        "arabic_text": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا",
        "phonetic": "48.16 Qul Lilmukhallafīna Mina Al-'A`rābi Satud`awna 'Ilá Qawmin 'Ūlī Ba'sin Shadīdin Tuqātilūnahum 'Aw Yuslimūna Fa'in Tuţī`ū Yu'utikumu Allāhu 'Ajrāan Ĥasanāan Wa 'In Tatawallaw Kamā Tawallaytum Min Qablu Yu`adhibkum `Adhābāan 'Alīmāan",
        "footnotes": {
            "english_saheeh": "[1513]- To Allāh in Islām.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say to those who remained behind of the bedouins, \"You will be called to [face] a people of great military might; you may fight them, or they will submit.[1513] So if you obey, Allāh will give you a good reward; but if you turn away as you turned away before, He will punish you with a painful punishment.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم) to the bedouins who lagged behind: \"You shall be called to fight against a people given to great warfare, then you shall fight them, or they shall surrender. Then if you obey, Allâh will give you a fair reward; but if you turn away as you did turn away before, He will punish you with a painful torment.\"",
            "english_rwwad": "Say to the Bedouins who lagged behind, “You will be called against a people of great might, whom you will fight unless they submit. Then if you obey, Allah will give you a goodly reward, but if you turn away as you turned away before, He will afflict you with a painful punishment."
        }
    },
    {
        "id": 4599,
        "chapter": 48,
        "verse": 17,
        "arabic_text": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا",
        "phonetic": "48.17 Laysa `Alá Al-'A`má Ĥarajun Wa Lā `Alá Al-'A`raji Ĥarajun Wa Lā `Alá Al-Marīđi Ĥarajun Wa Man Yuţi`i Allāha Wa Rasūlahu Yudkhilhu Jannātin Tajrī Min Taĥtihā Al-'Anhāru Wa Man Yatawalla Yu`adhibhu `Adhābāan 'Alīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There is not upon the blind any guilt or upon the lame any guilt or upon the ill any guilt [for remaining behind]. And whoever obeys Allāh and His Messenger - He will admit him to gardens beneath which rivers flow; but whoever turns away - He will punish him with a painful punishment.",
            "english_hilali_khan": "No blame or sin is there upon the blind, nor is there blame or sin upon the lame, nor is there blame or sin upon the sick (that they go not for fighting). And whosoever obeys Allâh and His Messenger (Muhammad صلى الله عليه وسلم), He will admit him to Gardens beneath which rivers flow (Paradise); and whosoever turns back, He will punish him with a painful torment.",
            "english_rwwad": "There is no blame on the blind, nor on the lame, nor on the sick [for remaining behind]. Whoever obeys Allah and His Messenger, He will admit him into gardens under which rivers flow. But whoever turns away, He will afflict him with a painful punishment."
        }
    },
    {
        "id": 4600,
        "chapter": 48,
        "verse": 18,
        "arabic_text": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا",
        "phonetic": "48.18 Laqad Rađiya Allāhu `Ani Al-Mu'uminīna 'Idh Yubāyi`ūnaka Taĥta Ash-Shajarati Fa`alima Mā Fī Qulūbihim Fa'anzala As-Sakīnata `Alayhim Wa 'Athābahum Fatĥāan Qarībāan",
        "footnotes": {
            "english_saheeh": "[1514]- That of Khaybar, which preceded the conquest of Makkah.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Certainly was Allāh pleased with the believers when they pledged allegiance to you, [O Muḥammad], under the tree, and He knew what was in their hearts, so He sent down tranquility upon them and rewarded them with an imminent conquest[1514]",
            "english_hilali_khan": "Indeed, Allâh was pleased with the believers when they gave the Bai‘ah (pledge) to you (O Muhammad صلى الله عليه وسلم) under the tree: He knew what was in their hearts, and He sent down As-Sakînah (calmness and tranquillity) upon them, and He rewarded them with a near victory.",
            "english_rwwad": "Indeed, Allah was pleased with the believers when they pledged allegiance to you [O Prophet] under the tree. He knew what was in their hearts, so He sent down tranquility upon them and rewarded them with an imminent victory,"
        }
    },
    {
        "id": 4601,
        "chapter": 48,
        "verse": 19,
        "arabic_text": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا",
        "phonetic": "48.19 Wa Maghānima Kathīratan Ya'khudhūnahā Wa Kāna Allāhu `Azīzāan Ĥakīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And much war booty which they will take. And ever is Allāh Exalted in Might and Wise.",
            "english_hilali_khan": "And abundant spoils that they will capture. And Allâh is Ever All-Mighty, All-Wise.",
            "english_rwwad": "and abundant spoils of war they will gain. And Allah is All-Mighty, All-Wise."
        }
    },
    {
        "id": 4602,
        "chapter": 48,
        "verse": 20,
        "arabic_text": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا",
        "phonetic": "48.20 Wa`adakumu Allāhu Maghānima Kathīratan Ta'khudhūnahā Fa`ajjala Lakum Hadhihi Wa Kaffa 'Aydiya An-Nāsi `Ankum Wa Litakūna 'Āyatan Lilmu'uminīna Wa Yahdiyakum Şirāţāan Mustaqīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has promised you much booty that you will take [in the future] and has hastened for you this [victory] and withheld the hands of people from you - that it may be a sign for the believers and [that] He may guide you to a straight path.",
            "english_hilali_khan": "Allâh has promised you abundant spoils that you will capture, and He has hastened for you this, and He has restrained the hands of men from you: that it may be a sign for the believers, and that He may guide you to the Straight Path.",
            "english_rwwad": "Allah has promised you abundant spoils of war that you will gain, and He has hastened for you this [victory], and He has restrained people’s hands from you, so that it may be a sign for the believers, and so that He may guide you to a straight path."
        }
    },
    {
        "id": 4603,
        "chapter": 48,
        "verse": 21,
        "arabic_text": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا",
        "phonetic": "48.21 Wa 'Ukhrá Lam Taqdirū `Alayhā Qad 'Aĥāţa Allāhu Bihā Wa Kāna Allāhu `Alá Kulli Shay'in Qadīrāan",
        "footnotes": {
            "english_saheeh": "[1515]- i.e., prepared for you or decreed.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [He promises] other [victories] that you were [so far] unable to [realize] which Allāh has already encompassed.[1515] And ever is Allāh, over all things, competent.",
            "english_hilali_khan": "And other (victories and much booty He promises you) which are not yet within your power; indeed Allâh compasses them. And Allâh is Ever Able to do all things.",
            "english_rwwad": "And there are other [spoils] that you have not yet been able to gain, but Allah has full control over them, for Allah is Most Capable of all things."
        }
    },
    {
        "id": 4604,
        "chapter": 48,
        "verse": 22,
        "arabic_text": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا",
        "phonetic": "48.22 Wa Law Qātalakumu Al-Ladhīna Kafarū Lawallaw Al-'Adbāra Thumma Lā Yajidūna Walīyāan Wa Lā Naşīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if those [Makkans] who disbelieve had fought you, they would have turned their backs [in flight]. Then they would not find a protector or a helper.",
            "english_hilali_khan": "And if those who disbelieve fight against you, they certainly would have turned their backs; then they would have found neither a Walî (protector, guardian) nor a helper.",
            "english_rwwad": "If the disbelievers were to fight you, they would surely turn their backs, then they would not have any protector or helper."
        }
    },
    {
        "id": 4605,
        "chapter": 48,
        "verse": 23,
        "arabic_text": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا",
        "phonetic": "48.23 Sunnata Allāhi Allatī Qad Khalat Min Qablu Wa Lan Tajida Lisunnati Allāhi Tabdīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[This is] the established way of Allāh which has occurred before. And never will you find in the way of Allāh any change.",
            "english_hilali_khan": "That has been the Way of Allâh already with those who passed away before. And you will not find any change in the Way of Allâh.",
            "english_rwwad": "Such was the way of Allah in the past, and you will not find any change in Allah’s way."
        }
    },
    {
        "id": 4606,
        "chapter": 48,
        "verse": 24,
        "arabic_text": "وَهُوَ ٱلَّذِي كَفَّ أَيۡدِيَهُمۡ عَنكُمۡ وَأَيۡدِيَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَيۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا",
        "phonetic": "48.24 Wa Huwa Al-Ladhī Kaffa 'Aydiyahum `Ankum Wa 'Aydiyakum `Anhum Bibaţni Makkata Min Ba`di 'An 'Ažfarakum `Alayhim Wa Kāna Allāhu Bimā Ta`malūna Başīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who withheld their hands from you and your hands from them within [the area of] Makkah after He caused you to overcome them. And ever is Allāh, of what you do, Seeing.",
            "english_hilali_khan": "And He it is Who has withheld their hands from you and your hands from them in the midst of Makkah, after He had made you victors over them. And Allâh is Ever the All-Seer of what you do.",
            "english_rwwad": "It is He Who restrained their hands from you and your hands from them [in Hudaibiyah] near Mecca, after giving you the upper hand over them. And Allah is All-Seeing of what you do."
        }
    },
    {
        "id": 4607,
        "chapter": 48,
        "verse": 25,
        "arabic_text": "هُمُ ٱلَّذِينَ كَفَرُواْ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡيَ مَعۡكُوفًا أَن يَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالٞ مُّؤۡمِنُونَ وَنِسَآءٞ مُّؤۡمِنَٰتٞ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَـُٔوهُمۡ فَتُصِيبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَيۡرِ عِلۡمٖۖ لِّيُدۡخِلَ ٱللَّهُ فِي رَحۡمَتِهِۦ مَن يَشَآءُۚ لَوۡ تَزَيَّلُواْ لَعَذَّبۡنَا ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابًا أَلِيمًا",
        "phonetic": "48.25 Humu Al-Ladhīna Kafarū Wa Şaddūkum `Ani Al-Masjidi Al-Ĥarāmi Wa Al-Hadya Ma`kūfāan 'An Yablugha Maĥillahu Wa Lawlā Rijālun Mu'uminūna Wa Nisā'un Mu'uminātun Lam Ta`lamūhum 'An Taţa'ūhum Fatuşībakum Minhum Ma`arratun Bighayri `Ilmin Liyudkhila Allāhu Fī Raĥmatihi Man Yashā'u Law Tazayyalū La`adhabnā Al-Ladhīna Kafarū Minhum `Adhābāan 'Alīmāan",
        "footnotes": {
            "english_saheeh": "[1516]- i.e., seventy camels intended for sacrifice and feeding of the poor.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They are the ones who disbelieved and obstructed you from al-Masjid al-Ḥarām while the offering[1516] was prevented from reaching its place of sacrifice. And if not for believing men and believing women whom you did not know - that you might trample [i.e., kill] them and there would befall you because of them dishonor without [your] knowledge - [you would have been permitted to enter Makkah]. [This was so] that Allāh might admit to His mercy whom He willed. If they had been apart [from them], We would have punished those who disbelieved among them with painful punishment",
            "english_hilali_khan": "They are the ones who disbelieved (in the Oneness of Allâh - Islâmic Monotheism) and hindered you from Al-Masjid-al-Harâm (at Makkah) and detained the sacrificial animals from reaching their place of sacrifice. Had there not been believing men and believing women whom you did not know, that you may kill them and on whose account a sin would have been committed by you without (your) knowledge, that Allâh might bring into His Mercy whom He wills - if they (the believers and the disbelievers) had been apart, We verily would have punished those of them who disbelieved with painful torment.",
            "english_rwwad": "It is they who disbelieved and prevented you from the Sacred Mosque, and detained the sacrificial animals from reaching their place of sacrifice. If it had not been for the believing men and women whom you could not identify, so you might have trampled them and thus incurring guilt unknowingly, [We would have let you march to Makkah]. [This was] so that Allah may admit to His mercy whom He wills. If they had been distinct [from the disbelievers], We would have surely inflicted on those who disbelieved among them a painful punishment."
        }
    },
    {
        "id": 4608,
        "chapter": 48,
        "verse": 26,
        "arabic_text": "إِذۡ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلۡحَمِيَّةَ حَمِيَّةَ ٱلۡجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوٓاْ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا",
        "phonetic": "48.26 'Idh Ja`ala Al-Ladhīna Kafarū Fī Qulūbihimu Al-Ĥamīyata Ĥamīyata Al-Jāhilīyati Fa'anzala Allāhu Sakīnatahu `Alá Rasūlihi Wa `Alá Al-Mu'uminīna Wa 'Alzamahum Kalimata At-Taqwá Wa Kānū 'Aĥaqqa Bihā Wa 'Ahlahā Wa Kāna Allāhu Bikulli Shay'in `Alīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "When those who disbelieved had put into their hearts chauvinism - the chauvinism of the time of ignorance. But Allāh sent down His tranquility upon His Messenger and upon the believers and imposed upon them the word of righteousness, and they were more deserving of it and worthy of it. And ever is Allāh, of all things, Knowing.",
            "english_hilali_khan": "When those who disbelieve had put in their hearts pride and haughtiness - the pride and haughtiness of the time of ignorance, - then Allâh sent down His Sakînah (calmness and tranquillity) upon His Messenger (صلى الله عليه وسلم) and upon the believers, and made them stick to the word of piety (i.e. none has the right to be worshipped but Allâh); and they were well entitled to it and worthy of it. And Allâh is the All-Knower of everything.",
            "english_rwwad": "When the disbelievers harbored pride in their hearts – the pride of ignorance – then Allah sent down His tranquility upon His Messenger and upon the believers, and caused them to adhere to the word of piety [declaration of faith], for they were more deserving and worthy of it. And Allah is All-Knowing of everything."
        }
    },
    {
        "id": 4609,
        "chapter": 48,
        "verse": 27,
        "arabic_text": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡيَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمۡ وَمُقَصِّرِينَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُواْ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتۡحٗا قَرِيبًا",
        "phonetic": "48.27 Laqad Şadaqa Allāhu Rasūlahu Ar-Ru'uyā Bil-Ĥaqqi Latadkhulunna Al-Masjida Al-Ĥarāma 'In Shā'a Allāhu 'Āminīna Muĥalliqīna Ru'ūsakum Wa Muqaşşirīna Lā Takhāfūna Fa`alima Mā Lam Ta`lamū Faja`ala Min Dūni Dhālika Fatĥāan Qarībāan",
        "footnotes": {
            "english_saheeh": "[1517]- i.e., having completed the rites of ʿumrah.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Certainly has Allāh showed to His Messenger the vision [i.e., dream] in truth. You will surely enter al-Masjid al-Ḥarām, if Allāh wills, in safety, with your heads shaved and [hair] shortened,[1517] not fearing [anyone]. He knew what you did not know and has arranged before that a conquest near [at hand].",
            "english_hilali_khan": "Indeed Allâh shall fulfil the true vision which He showed to His Messenger (صلى الله عليه وسلم) [i.e. the Prophet صلى الله عليه وسلم saw a dream that he has entered Makkah along with his Companions, having their (head) hair shaved and cut short] in very truth. Certainly, you shall enter Al-Masjid-al-Harâm, if Allâh wills, secure, (some) having your heads shaved, and (some) having your head hair cut short, having no fear. He knew what you knew not, and He granted besides that a near victory.",
            "english_rwwad": "Indeed, Allah has fulfilled His Messenger’s dream in truth: that you will surely enter the Sacred Mosque if Allah wills, in peace and safety, and you will have your heads shaved or shortened, without any fear. He knew what you did not know, and He granted you prior to that an imminent conquest."
        }
    },
    {
        "id": 4610,
        "chapter": 48,
        "verse": 28,
        "arabic_text": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا",
        "phonetic": "48.28 Huwa Al-Ladhī 'Arsala Rasūlahu Bil-Hudá Wa Dīni Al-Ĥaqqi Liyužhirahu `Alá Ad-Dīni Kullihi Wa Kafá Billāhi Shahīdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion. And sufficient is Allāh as Witness.",
            "english_hilali_khan": "He it is Who has sent His Messenger (Muhammad صلى الله عليه وسلم) with guidance and the religion of truth (Islâm), that He may make it (Islâm) superior to all religions. And All-Sufficient is Allâh as a Witness.",
            "english_rwwad": "It is He Who has sent His Messenger with guidance and the religion of truth, to make it prevail over all religions, and sufficient is Allah as a Witness."
        }
    },
    {
        "id": 4611,
        "chapter": 48,
        "verse": 29,
        "arabic_text": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡـَٔهُۥ فَـَٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا",
        "phonetic": "48.29 Muĥammadun Rasūlu Allāhi Wa Al-Ladhīna Ma`ahu 'Ashiddā'u `Alá Al-Kuffāri Ruĥamā'u Baynahum Tarāhum Rukka`āan Sujjadāan Yabtaghūna Fađlāan Mina Allāhi Wa Riđwānāan Sīmāhum Fī Wujūhihim Min 'Athari As-Sujūdi Dhālika Mathaluhum Fī At-Tawrāati Wa Mathaluhum Fī Al-'Injīli Kazar`in 'Akhraja Shaţ'ahu Fa'āzarahu Fāstaghlaža Fāstawá `Alá Sūqihi Yu`jibu Az-Zurrā`a Liyaghīža Bihimu Al-Kuffāra Wa`ada Allāhu Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Minhum Maghfiratan Wa 'Ajrāan `Ažīmāan",
        "footnotes": {
            "english_saheeh": "[1518]- The given examples depict the Prophet (ﷺ) and his companions.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Muḥammad is the Messenger of Allāh; and those with him are forceful against the disbelievers, merciful among themselves. You see them bowing and prostrating [in prayer], seeking bounty from Allāh and [His] pleasure. Their sign is in their faces from the effect of prostration [i.e., prayer]. That is their description in the Torah. And their description in the Gospel is as a plant which produces its offshoots and strengthens them so they grow firm and stand upon their stalks, delighting the sowers - so that He [i.e., Allāh] may enrage by them[1518] the disbelievers. Allāh has promised those who believe and do righteous deeds among them forgiveness and a great reward.",
            "english_hilali_khan": "Muhammad (صلى الله عليه وسلم) is the Messenger of Allâh. And those who are with him are severe against disbelievers, and merciful among themselves. You see them bowing and falling down prostrate (in prayer), seeking Bounty from Allâh and (His) Good Pleasure. The mark of them (i.e. of their Faith) is on their faces (foreheads) from the traces of prostration (during prayers). This is their description in the Taurât (Torah). But their description in the Injeel (Gospel) is like a (sown) seed which sends forth its shoot, then makes it strong, and becomes thick and it stands straight on its stem, delighting the sowers, that He may enrage the disbelievers with them. Allâh has promised those among them who believe (i.e. all those who follow Islâmic Monotheism, the religion of Prophet Muhammad صلى الله عليه وسلم till the Day of Resurrection) and do righteous good deeds, forgiveness and a mighty reward (i.e. Paradise).",
            "english_rwwad": "Muhammad is the Messenger of Allah, and those who are with him are firm against the disbelievers and compassionate among themselves. You see them bowing and prostrating [in prayer], seeking Allah’s grace and pleasure. Their distinguishing sign is on their faces from the effects of prostration. Such is their description in the Torah. And their description in the Gospel is like that of a seed that sprouts its shoot, then makes it strong; then it grows thick and stands straight on its stem, which delights the sowers – so that He may enrage thereby the disbelievers. Allah has promised those among them who believe and do righteous deeds forgiveness and a great reward."
        }
    }
]