[
    {
        "id": 4612,
        "chapter": 49,
        "verse": 1,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ",
        "phonetic": "49.1 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Tuqaddimū Bayna Yadayi Allāhi Wa Rasūlihi Wa Attaqū Allāha 'Inna Allāha Samī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "[1520]- Rather, wait for instruction and follow the way of the Prophet (ﷺ).",
            "english_hilali_khan": "(V.49:1) i.e. hasten not to decide in matters of war or religion before Allah and His Messenger صلى الله عليه وسلم, that you may decide the contrary to what Allah and His Messenger صلى الله عليه وسلم may decide.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, do not put [yourselves] before Allāh and His Messenger[1520] but fear Allāh. Indeed, Allāh is Hearing and Knowing.",
            "english_hilali_khan": "O you who believe! Make not (a decision) in advance[1] before Allâh and His Messenger (صلى الله عليه وسلم), and fear Allâh. Verily! Allâh is All-Hearing, All-Knowing.",
            "english_rwwad": "O you who believe, do not decide [any matter of importance] before Allah and His Messenger, and fear Allah, for Allah is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 4613,
        "chapter": 49,
        "verse": 2,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ",
        "phonetic": "49.2 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Tarfa`ū 'Aşwātakum Fawqa Şawti An-Nabīyi Wa Lā Tajharū Lahu Bil-Qawli Kajahri Ba`đikum Liba`đin 'An Taĥbaţa 'A`mālukum Wa 'Antum Lā Tash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, do not raise your voices above the voice of the Prophet or be loud to him in speech like the loudness of some of you to others, lest your deeds become worthless while you perceive not.",
            "english_hilali_khan": "O you who believe! Raise not your voices above the voice of the Prophet (صلى الله عليه وسلم), nor speak aloud to him in talk as you speak aloud to one another, lest your deeds should be rendered fruitless while you perceive not.",
            "english_rwwad": "O you who believe, do not raise your voices above the voice of the Prophet, nor speak loudly to him as you speak loudly to one another, lest your deeds become worthless without you realizing it."
        }
    },
    {
        "id": 4614,
        "chapter": 49,
        "verse": 3,
        "arabic_text": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ",
        "phonetic": "49.3 'Inna Al-Ladhīna Yaghuđđūna 'Aşwātahum `Inda Rasūli Allāhi 'Ūlā'ika Al-Ladhīna Amtaĥana Allāhu Qulūbahum Lilttaqwá Lahum Maghfiratun Wa 'Ajrun `Ažīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who lower their voices before the Messenger of Allāh - they are the ones whose hearts Allāh has tested for righteousness. For them is forgiveness and great reward.",
            "english_hilali_khan": "Verily, those who lower their voices in the presence of Allâh’s Messenger (صلى الله عليه وسلم), they are the ones whose hearts Allâh has tested for piety. For them is forgiveness and a great reward.",
            "english_rwwad": "Indeed, those who lower their voices in the presence of the Messenger of Allah are those whose hearts Allah has tested for righteousness. For them there is forgiveness and a great reward."
        }
    },
    {
        "id": 4615,
        "chapter": 49,
        "verse": 4,
        "arabic_text": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ",
        "phonetic": "49.4 'Inna Al-Ladhīna Yunādūnaka Min Warā'i Al-Ĥujurāti 'Aktharuhum Lā Ya`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who call you, [O Muḥammad], from behind the chambers - most of them do not use reason.",
            "english_hilali_khan": "Verily those who call you from behind the dwellings, most of them have no sense.",
            "english_rwwad": "As for those who call out to you [O Prophet] from behind the chambers, most of them have no understanding."
        }
    },
    {
        "id": 4616,
        "chapter": 49,
        "verse": 5,
        "arabic_text": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
        "phonetic": "49.5 Wa Law 'Annahum Şabarū Ĥattá Takhruja 'Ilayhim Lakāna Khayrāan Lahum Wa Allāhu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if they had been patient until you [could] come out to them, it would have been better for them. But Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "5. And if they had patience till you could come out to them, it would have been better for them. And Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "If they had been patient until you came out to them, it would have been better for them. But Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 4617,
        "chapter": 49,
        "verse": 6,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ",
        "phonetic": "49.6 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'In Jā'akum Fāsiqun Binaba'iin Fatabayyanū 'An Tuşībū Qawmāan Bijahālatin Fatuşbiĥū `Alá Mā Fa`altum Nādimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful.",
            "english_hilali_khan": "O you who believe! If a Fâsiq (liar - evil person) comes to you with any news, verify it, lest you should harm people in ignorance, and afterwards you become regretful for what you have done.",
            "english_rwwad": "O you who believe, if an evildoer brings you some news, verify it, lest you harm a people unknowingly, then you become regretful for what you did."
        }
    },
    {
        "id": 4618,
        "chapter": 49,
        "verse": 7,
        "arabic_text": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ",
        "phonetic": "49.7 Wa A`lamū 'Anna Fīkum Rasūla Allāhi Law Yuţī`ukum Fī Kathīrin Mina Al-'Amri La`anittum Wa Lakinna Allāha Ĥabbaba 'Ilaykumu Al-'Īmāna Wa Zayyanahu Fī Qulūbikum Wa Karraha 'Ilaykumu Al-Kufra Wa Al-Fusūqa Wa Al-`Işyāna 'Ūlā'ika Humu Ar-Rāshidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And know that among you is the Messenger of Allāh. If he were to obey you in much of the matter, you would be in difficulty, but Allāh has endeared to you the faith and has made it pleasing in your hearts and has made hateful to you disbelief, defiance and disobedience. Those are the [rightly] guided.",
            "english_hilali_khan": "And know that among you there is the Messenger of Allâh (صلى الله عليه وسلم). If he were to obey you (i.e. follow your opinions and desires) in much of the matter, you would surely be in trouble. But Allâh has endeared the Faith to you and has beautified it in your hearts, and has made disbelief, wickedness and disobedience (to Allâh and His Messenger صلى الله عليه وسلم) hateful to you. Such are they who are the rightly guided.",
            "english_rwwad": "Know that the Messenger of Allah is among you. If he were to obey you in many matters, you would surely suffer. But Allah has endeared faith to you and made it pleasing to your hearts, and has made disbelief, wickedness, and disobedience hateful to you. Such are the rightly guided,"
        }
    },
    {
        "id": 4619,
        "chapter": 49,
        "verse": 8,
        "arabic_text": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
        "phonetic": "49.8 Fađlāan Mina Allāhi Wa Ni`matan Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It is] as bounty from Allāh and favor. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "(This is) a Grace from Allâh and His Favour. And Allâh is All-Knowing, All-Wise.",
            "english_rwwad": "by Allah’s grace and favor. And Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 4620,
        "chapter": 49,
        "verse": 9,
        "arabic_text": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ",
        "phonetic": "49.9 Wa 'In Ţā'ifatāni Mina Al-Mu'uminīna Aqtatalū Fa'aşliĥū Baynahumā Fa'in Baghat 'Iĥdāhumā `Alá Al-'Ukhrá Faqātilū Allatī Tabghī Ĥattá Tafī'a 'Ilá 'Amri Allāhi Fa'in Fā'at Fa'aşliĥū Baynahumā Bil-`Adli Wa 'Aqsiţū 'Inna Allāha Yuĥibbu Al-Muqsiţīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if two factions among the believers should fight, then make settlement between the two. But if one of them oppresses the other, then fight against the one that oppresses until it returns to the ordinance of Allāh. And if it returns, then make settlement between them in justice and act justly. Indeed, Allāh loves those who act justly.",
            "english_hilali_khan": "And if two parties or groups among the believers fall to fighting, then make peace between them both. But if one of them outrages against the other, then fight you (all) against the one that which outrages till it complies with the Command of Allâh. Then if it complies, then make reconciliation between them justly, and be equitable. Verily! Allâh loves those who are the equitable.",
            "english_rwwad": "If two groups of the believers fight one another, make peace between them. If one of them transgresses against the other, fight against the transgressing group until they submit to the rule of Allah. Then if they submit, make peace between them with fairness, and be just, for Allah loves those who are just."
        }
    },
    {
        "id": 4621,
        "chapter": 49,
        "verse": 10,
        "arabic_text": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ",
        "phonetic": "49.10 'Innamā Al-Mu'uminūna 'Ikhwatun Fa'aşliĥū Bayna 'Akhawaykum Wa Attaqū Allāha La`allakum Turĥamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The believers are but brothers, so make settlement between your brothers. And fear Allāh that you may receive mercy.",
            "english_hilali_khan": "The believers are nothing else than brothers (in Islâmic religion). So make reconciliation between your brothers, and fear Allâh, that you may receive mercy.",
            "english_rwwad": "The believers are but brothers, so make peace between your brothers. And fear Allah, so that you may be shown mercy."
        }
    },
    {
        "id": 4622,
        "chapter": 49,
        "verse": 11,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
        "phonetic": "49.11 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Yaskhar Qawmun Min Qawmin `Asá 'An Yakūnū Khayrāan Minhum Wa Lā Nisā'un Min Nisā'in `Asá 'An Yakunna Khayrāan Minhunna Wa Lā Talmizū 'Anfusakum Wa Lā Tanābazū Bil-'Alqābi Bi'sa Al-Aismu Al-Fusūqu Ba`da Al-'Īmāni Wa Man Lam Yatub Fa'ūlā'ika Humu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name [i.e., mention] of disobedience after [one's] faith. And whoever does not repent - then it is those who are the wrongdoers.",
            "english_hilali_khan": "O you who believe! Let not a group scoff at another group, it may be that the latter are better than the former. Nor let (some) women scoff at other women, it may be that the latter are better than the former. Nor defame one another, nor insult one another by nicknames. How bad is it to insult one’s brother after having Faith [i.e. to call your Muslim brother (a faithful believer) as: \"O sinner\", or \"O wicked\"]. And whosoever does not repent, then such are indeed Zâlimûn (wrong-doers, etc.).",
            "english_rwwad": "O you who believe, let not some men ridicule others, for it may be that they are better than them; nor let some women ridicule others, for it may be that they are better than them. Do not speak ill of one another, nor call one another by [offensive] nicknames. How evil is the name of wickedness after having faith! And whoever does not repent, it is they who are the wrongdoers."
        }
    },
    {
        "id": 4623,
        "chapter": 49,
        "verse": 12,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ",
        "phonetic": "49.12 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Ajtanibū Kathīrāan Mina Až-Žanni 'Inna Ba`đa Až-Žanni 'Ithmun Wa Lā Tajassasū Wa Lā Yaghtab Ba`đukum Ba`đāan 'Ayuĥibbu 'Aĥadukum 'An Ya'kula Laĥma 'Akhīhi Maytāan Fakarihtumūhu Wa Attaqū Allāha 'Inna Allāha Tawwābun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.49:12).\na) Narrated Abû Hurairah رضي الله عنه Allâh’s Messenger صلى الله عليه وسلم said, \"Beware of suspicion, for suspicion is the worst of false tales; and do not look for other’s faults, and do not do spying on one another, and do not practise Najsh* and do not be jealous of one another and do not hate one another, and do not desert (stop talking to) one another. And O Allâh’s worshippers! Be brothers!\"(Sahih Al-Bukhari, Vol.8, Hadîth No.92).\nb) Narrated Hudhaifah رضي الله عنه: I heard the Prophet صلى الله عليه وسلم saying, \"A Qattât ** will not enter Paradise.\" (Sahih Al-Bukhari, Vol.8, Hadîth No.82).\nc) Backbiting and the Statement of Allâh عز وجل: \"And spy not, neither backbite one another.\"\nNarrated Ibn ‘Abbâs رضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم passed by two graves and said, \"Both of them (persons in the grave) are being tortured, and they are not being tortured for a major sin. This one used not to save himself from being soiled with his urine, and the other used to go about with calumnies (among the people to rouse hostilities, e.g., one goes to a person and tells him that so-and-so says about him such and such evil things).\" The Prophet صلى الله عليه وسلم then asked for a green branch of a date-palm tree, split it into two pieces and planted one on each grave and said, \"It is hoped that their punishment may be abated till those two pieces of the branch get dried.\" *** (Sahih Al-Bukhari, Vol.8, Hadîth No.78).\n* Najsh means to offer a high price for something in order to allure another customer who is interested in the thing.\n**A Qattât is a person who conveys disagreeable, false information from one person to another with the intention of causing harm and enmity between them.\n***This action was a kind of invocation on the part of the Prophet صلى الله عليه وسلم for the deceased persons. [Fath Al-Bari, Vol.1, Page 332].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allāh; indeed, Allāh is Accepting of Repentance and Merciful.",
            "english_hilali_khan": "O you who believe! Avoid much suspicion; indeed some suspicions are sins. And spy not, neither backbite one another. Would one of you like to eat the flesh of his dead brother? You would hate it (so hate backbiting)[1]. And fear Allâh. Verily, Allâh is the One Who forgives and accepts repentance, Most Merciful.",
            "english_rwwad": "O you who believe, avoid much of the suspicion, for some suspicions are sin. Do not spy on one another, nor backbite one another. Would any of you like to eat the flesh of his dead brother? You would surely abhor it. So fear Allah. Indeed, Allah is Accepting of Repentance, Most Merciful."
        }
    },
    {
        "id": 4624,
        "chapter": 49,
        "verse": 13,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ",
        "phonetic": "49.13 Yā 'Ayyuhā An-Nāsu 'Innā Khalaqnākum Min Dhakarin Wa 'Unthá Wa Ja`alnākum Shu`ūbāan Wa Qabā'ila Lita`ārafū 'Inna 'Akramakum `Inda Allāhi 'Atqākum 'Inna Allāha `Alīmun Khabīrun",
        "footnotes": {
            "english_saheeh": "[1521]- Literally, \"he who has the most taqwā,\" i.e., consciousness and fear of Allāh, piety and righteousness.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allāh is the most righteous[1521] of you. Indeed, Allāh is Knowing and Aware.",
            "english_hilali_khan": "O mankind! We have created you from a male and a female, and made you into nations and tribes, that you may know one another. Verily, the most honourable of you with Allâh is that (believer) who has At-Taqwâ [i.e. he is one of the Muttaqûn (the pious. See V.2:2)]. Verily, Allâh is All-Knowing, All-Aware.",
            "english_rwwad": "O mankind, We have created you from a male and a female, and made you into nations and tribes so that you may recognize one another. Indeed, the most noble of you before Allah is the most righteous among you. Indeed, Allah is All-Knowing, All-Aware."
        }
    },
    {
        "id": 4625,
        "chapter": 49,
        "verse": 14,
        "arabic_text": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ",
        "phonetic": "49.14 Qālati Al-'A`rābu 'Āmannā Qul Lam Tu'uminū Wa Lakin Qūlū 'Aslamnā Wa Lammā Yadkhuli Al-'Īmānu Fī Qulūbikum Wa 'In Tuţī`ū Allāha Wa Rasūlahu Lā Yalitkum Min 'A`mālikum Shay'āan 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[1522]- i.e., the reward thereof.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts. And if you obey Allāh and His Messenger, He will not deprive you from your deeds[1522] of anything. Indeed, Allāh is Forgiving and Merciful.\"",
            "english_hilali_khan": "The bedouins say: \"We believe.\" Say: \"You believe not but you only say, ‘We have surrendered (in Islâm),’ for Faith has not yet entered your hearts. But if you obey Allâh and His Messenger (صلى الله عليه وسلم), He will not decrease anything in reward for your deeds. Verily, Allâh is Oft-Forgiving, Most Merciful.\"",
            "english_rwwad": "The Bedouins say, “We have believed.” Say, “You have not believed, but say, ‘We have submitted,’ for faith has not yet entered your hearts. But if you obey Allah and His Messenger, He will not detract anything from the reward of your deeds. Indeed, Allah is All-Forgiving, Most Merciful.”"
        }
    },
    {
        "id": 4626,
        "chapter": 49,
        "verse": 15,
        "arabic_text": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ",
        "phonetic": "49.15 'Innamā Al-Mu'uminūna Al-Ladhīna 'Āmanū Billāhi Wa Rasūlihi Thumma Lam Yartābū Wa Jāhadū Bi'amwālihim Wa 'Anfusihim Fī Sabīli Allāhi 'Ūlā'ika Humu Aş-Şādiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The believers are only the ones who have believed in Allāh and His Messenger and then doubt not but strive with their properties and their lives in the cause of Allāh. It is those who are the truthful.",
            "english_hilali_khan": "Only those are the believers who have believed in Allâh and His Messenger, and afterward doubt not but strive with their wealth and their lives for the Cause of Allâh. Those! They are the truthful.",
            "english_rwwad": "Indeed, the believers are those who believe in Allah and His Messenger, then they do not have doubt, but fight with their wealth and their lives in the way of Allah. It is they who are the truthful."
        }
    },
    {
        "id": 4627,
        "chapter": 49,
        "verse": 16,
        "arabic_text": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ",
        "phonetic": "49.16 Qul 'Atu`allimūna Allāha Bidīnikum Wa Allāhu Ya`lamu Mā Fī As-Samāwāti Wa Mā Fī Al-'Arđi Wa Allāhu Bikulli Shay'in `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Would you acquaint Allāh with your religion while Allāh knows whatever is in the heavens and whatever is on the earth, and Allāh is Knowing of all things?\"",
            "english_hilali_khan": "Say: \"Will you inform Allâh of your religion while Allâh knows all that is in the heavens and all that is in the earth, and Allâh is All-Aware of everything.",
            "english_rwwad": "Say, “Do you inform Allah of your faith, when Allah knows all that is in the heavens and all that is on earth? And Allah is All-Knowing of everything.”"
        }
    },
    {
        "id": 4628,
        "chapter": 49,
        "verse": 17,
        "arabic_text": "يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "49.17 Yamunnūna `Alayka 'An 'Aslamū Qul Lā Tamunnū `Alayya 'Islāmakum Bali Allāhu Yamunnu `Alaykum 'An Hadākum Lil'īmāni 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They consider it a favor to you that they have accepted Islām. Say, \"Do not consider your Islām a favor to me. Rather, Allāh has conferred favor upon you that He has guided you to the faith, if you should be truthful.\"",
            "english_hilali_khan": "They regard as favour to you (O Muhammad صلى الله عليه وسلم) that they have embraced Islâm. Say: \"Count not your Islâm as a favour to me. Nay, but Allâh has conferred a favour upon you that He has guided you to the Faith if you indeed are true.",
            "english_rwwad": "They think that they have done you a favor by embracing Islam. Say, “Do not consider your Islam as a favor to me. Rather, it is Allah Who has done you a favor by guiding you to faith, if you are truthful."
        }
    },
    {
        "id": 4629,
        "chapter": 49,
        "verse": 18,
        "arabic_text": "إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ",
        "phonetic": "49.18 'Inna Allāha Ya`lamu Ghayba As-Samāwāti Wa Al-'Arđi Wa Allāhu Başīrun Bimā Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Allāh knows the unseen [aspects] of the heavens and the earth. And Allāh is Seeing of what you do.",
            "english_hilali_khan": "Verily, Allâh knows the Unseen of the heavens and the earth. And Allâh is the All-Seer of what you do.",
            "english_rwwad": "Indeed, Allah knows all that is unseen of the heavens and earth, and Allah is All-Seeing of what you do.”"
        }
    }
]