[
    {
        "id": 5075,
        "chapter": 57,
        "verse": 1,
        "arabic_text": "سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
        "phonetic": "57.1 Sabbaĥa Lillāhi Mā Fī As-Samāwāti Wa Al-'Arđi Wa Huwa Al-`Azīzu Al-Ĥakīmu",
        "footnotes": {
            "english_saheeh": "[1622]- By praising Him and declaring Him far above and beyond any failure or imperfection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whatever is in the heavens and earth exalts Allāh,[1622] and He is the Exalted in Might, the Wise.",
            "english_hilali_khan": "1. Whatsoever is in the heavens and the earth glorifies Allâh - and He is the All-Mighty, All-Wise.",
            "english_rwwad": "All that is in the heavens and earth glorifies Allah, for He is the All-Mighty, the All-Wise."
        }
    },
    {
        "id": 5076,
        "chapter": 57,
        "verse": 2,
        "arabic_text": "لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ",
        "phonetic": "57.2 Lahu Mulku As-Samāwāti Wa Al-'Arđi Yuĥyī Wa Yumītu Wa Huwa `Alá Kulli Shay'in Qadīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "His is the dominion of the heavens and earth. He gives life and causes death, and He is over all things competent.",
            "english_hilali_khan": "His is the kingdom of the heavens and the earth. It is He Who gives life and causes death: and He is Able to do all things.",
            "english_rwwad": "To Him belongs the dominion of the heavens and earth; He gives life and causes death, and He is Most Capable of all things."
        }
    },
    {
        "id": 5077,
        "chapter": 57,
        "verse": 3,
        "arabic_text": "هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ",
        "phonetic": "57.3 Huwa Al-'Awwalu Wa Al-'Ākhiru Wa Až-Žāhiru Wa Al-Bāţinu Wa Huwa Bikulli Shay'in `Alīmun",
        "footnotes": {
            "english_saheeh": "[1623]- Before whom nothing existed.  Also, He who is supreme, foremost or uppermost.\n[1624]- Enduring eternally when nothing else remains.\n[1625]- Nothing being above Him.  Another meaning is \"the Apparent,\" i.e., evident through His creation and revelation.\n[1626]- Nothing being nearer than Him by way of His knowledge.  Another meaning is \"the Unapparent,\" i.e., concealed from man's physical senses.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He is the First[1623] and the Last,[1624] the Ascendant[1625] and the Intimate,[1626] and He is, of all things, Knowing.",
            "english_hilali_khan": "He is the First (nothing is before Him) and the Last (nothing is after Him), the Most High (nothing is above Him) and the Most Near (nothing is nearer than Him). And He is the All-Knower of every thing.",
            "english_rwwad": "He is the First and the Last, the Manifest and the Hidden, and He is All-Knowing of everything."
        }
    },
    {
        "id": 5078,
        "chapter": 57,
        "verse": 4,
        "arabic_text": "هُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يَعۡلَمُ مَا يَلِجُ فِي ٱلۡأَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعۡرُجُ فِيهَاۖ وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ",
        "phonetic": "57.4 Huwa Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Fī Sittati 'Ayyāmin Thumma Astawá `Alá Al-`Arshi Ya`lamu Mā Yaliju Fī Al-'Arđi Wa Mā Yakhruju Minhā Wa Mā Yanzilu Mina As-Samā'i Wa Mā Ya`ruju Fīhā Wa Huwa Ma`akum 'Ayna Mā Kuntum Wa Allāhu Bimā Ta`malūna Başīrun",
        "footnotes": {
            "english_saheeh": "[1627]- See footnotes to 2:19 and 7:54.\n[1628]- In knowledge - observing and witnessing.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who created the heavens and earth in six days and then established Himself above the Throne.[1627] He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein; and He is with you[1628] wherever you are. And Allāh, of what you do, is Seeing.",
            "english_hilali_khan": "He it is Who created the heavens and the earth in six Days and then rose over (Istawâ) the Throne (in a manner that suits His Majesty). He knows what goes into the earth and what comes forth from it, and what descends from the heaven and what ascends thereto. And He is with you (by His Knowledge) wheresoever you may be. And Allâh is the All-Seer of what you do.",
            "english_rwwad": "It is He Who created the heavens and earth in six days, and then rose over the Throne. He knows all that goes into the earth and all that comes out of it, and all that descends from the heaven and all that ascends to it. He is with you wherever you are, and Allah is All-Seeing of what you do."
        }
    },
    {
        "id": 5079,
        "chapter": 57,
        "verse": 5,
        "arabic_text": "لَّهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ",
        "phonetic": "57.5 Lahu Mulku As-Samāwāti Wa Al-'Arđi Wa 'Ilá Allāhi Turja`u Al-'Umūru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "His is the dominion of the heavens and earth. And to Allāh are returned [all] matters.",
            "english_hilali_khan": "His is the kingdom of the heavens and the earth. And to Allâh return all the matters (for decision).",
            "english_rwwad": "To Him belongs the dominion of the heavens and earth, and to Allah will return all matters."
        }
    },
    {
        "id": 5080,
        "chapter": 57,
        "verse": 6,
        "arabic_text": "يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۚ وَهُوَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ",
        "phonetic": "57.6 Yūliju Al-Layla Fī An-Nahāri Wa Yūliju An-Nahāra Fī Al-Layli Wa Huwa `Alīmun Bidhāti Aş-Şudūri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He causes the night to enter the day and causes the day to enter the night, and He is Knowing of that within the breasts.",
            "english_hilali_khan": "He merges night into day (i.e. the decrease in the hours of the night is added into the hours of the day), and merges day into night (i.e. the decrease in the hours of the day is added into the hours of the night), and He has full knowledge of whatsoever is in the breasts.",
            "english_rwwad": "He causes the night to merge into the day and the day to merge into the night, and He is All-Knowing of what is in the hearts."
        }
    },
    {
        "id": 5081,
        "chapter": 57,
        "verse": 7,
        "arabic_text": "ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَأَنفِقُواْ مِمَّا جَعَلَكُم مُّسۡتَخۡلَفِينَ فِيهِۖ فَٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَأَنفَقُواْ لَهُمۡ أَجۡرٞ كَبِيرٞ",
        "phonetic": "57.7 'Āminū Billāhi Wa Rasūlihi Wa 'Anfiqū Mimmā Ja`alakum Mustakhlafīna Fīhi Fa-Al-Ladhīna 'Āmanū Minkum Wa 'Anfaqū Lahum 'Ajrun Kabīrun",
        "footnotes": {
            "english_saheeh": "[1629]- In ways pleasing to Allāh.",
            "english_hilali_khan": "(V.57:7) See the footnote of (V.4:37).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Believe in Allāh and His Messenger and spend out of that in which He has made you successive inheritors. For those who have believed among you and spent,[1629] there will be a great reward.",
            "english_hilali_khan": "Believe in Allâh and His Messenger (Muhammad صلى الله عليه وسلم), and spend of that whereof He has made you trustees.[1] And such of you as believe and spend (in Allâh’s Way), theirs will be a great reward.",
            "english_rwwad": "Believe in Allah and His Messenger, and spend [in Allah’s cause] out of what He has entrusted you with. For those among you who believe and spend, there will be a great reward."
        }
    },
    {
        "id": 5082,
        "chapter": 57,
        "verse": 8,
        "arabic_text": "وَمَا لَكُمۡ لَا تُؤۡمِنُونَ بِٱللَّهِ وَٱلرَّسُولُ يَدۡعُوكُمۡ لِتُؤۡمِنُواْ بِرَبِّكُمۡ وَقَدۡ أَخَذَ مِيثَٰقَكُمۡ إِن كُنتُم مُّؤۡمِنِينَ",
        "phonetic": "57.8 Wa Mā Lakum Lā Tu'uminūna Billāhi Wa Ar-Rasūlu Yad`ūkum Litu'uminū Birabbikum Wa Qad 'Akhadha Mīthāqakum 'In Kuntum Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And why do you not believe in Allāh while the Messenger invites you to believe in your Lord and He has taken your covenant, if you should [truly] be believers?",
            "english_hilali_khan": "And what is the matter with you that you believe not in Allâh! While the Messenger (Muhammad صلى الله عليه وسلم) invites you to believe in your Lord (Allâh); and He (Allâh) has indeed taken your covenant, if you are real believers.",
            "english_rwwad": "Why is it that you do not believe in Allah when the Messenger is calling you to believe in your Lord, and He has already taken a covenant from you, if you will ever believe?"
        }
    },
    {
        "id": 5083,
        "chapter": 57,
        "verse": 9,
        "arabic_text": "هُوَ ٱلَّذِي يُنَزِّلُ عَلَىٰ عَبۡدِهِۦٓ ءَايَٰتِۭ بَيِّنَٰتٖ لِّيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَإِنَّ ٱللَّهَ بِكُمۡ لَرَءُوفٞ رَّحِيمٞ",
        "phonetic": "57.9 Huwa Al-Ladhī Yunazzilu `Alá `Abdihi 'Āyātin Bayyinātin Liyukhrijakum Mina Až-Žulumāti 'Ilá An-Nūri Wa 'Inna Allāha Bikum Lara'ūfun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who sends down upon His Servant [Muḥammad (ﷺ)] verses of clear evidence that He may bring you out from darknesses into the light. And indeed, Allāh is to you Kind and Merciful.",
            "english_hilali_khan": "It is He Who sends down manifest Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) to His slave (Muhammad صلى الله عليه وسلم) that He may bring you out from darkness into light. And verily, Allâh is to you full of kindness, Most Merciful.",
            "english_rwwad": "It is He Who sends down clear verses to His slave to bring you out of the depths of darkness into the light. Indeed, Allah is Ever Gracious and Most Merciful to you."
        }
    },
    {
        "id": 5084,
        "chapter": 57,
        "verse": 10,
        "arabic_text": "وَمَا لَكُمۡ أَلَّا تُنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا يَسۡتَوِي مِنكُم مَّنۡ أَنفَقَ مِن قَبۡلِ ٱلۡفَتۡحِ وَقَٰتَلَۚ أُوْلَٰٓئِكَ أَعۡظَمُ دَرَجَةٗ مِّنَ ٱلَّذِينَ أَنفَقُواْ مِنۢ بَعۡدُ وَقَٰتَلُواْۚ وَكُلّٗا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ",
        "phonetic": "57.10 Wa Mā Lakum 'Allā Tunfiqū Fī Sabīli Allāhi Wa Lillahi Mīrāthu As-Samāwāti Wa Al-'Arđi Lā Yastawī Minkum Man 'Anfaqa Min Qabli Al-Fatĥi Wa Qātala 'Ūlā'ika 'A`žamu Darajatan Mina Al-Ladhīna 'Anfaqū Min Ba`du Wa Qātalū Wa Kullāan Wa`ada Allāhu Al-Ĥusná Wa Allāhu Bimā Ta`malūna Khabīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And why do you not spend in the cause of Allāh while to Allāh belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]. Those are greater in degree than they who spent afterwards and fought. But to all Allāh has promised the best [reward]. And Allāh, of what you do, is Aware.",
            "english_hilali_khan": "And what is the matter with you that you spend not in the Cause of Allâh? And to Allâh belongs the heritage of the heavens and the earth. Not equal among you are those who spent and fought before the conquering (of Makkah, with those among you who did so later). Such are higher in degree than those who spent and fought afterwards. But to all Allâh has promised the best (reward). And Allâh is All-Aware of what you do.",
            "english_rwwad": "Why is it that you do not spend in the cause of Allah, when Allah alone will inherit the heavens and earth? Those of you who spent and fought before the conquest [of Mecca and those who did not] are not equal. They are much greater in rank than those who spent and fought afterwards. Yet Allah has promised each a fine reward, and Allah is All-Aware of what you do."
        }
    },
    {
        "id": 5085,
        "chapter": 57,
        "verse": 11,
        "arabic_text": "مَّن ذَا ٱلَّذِي يُقۡرِضُ ٱللَّهَ قَرۡضًا حَسَنٗا فَيُضَٰعِفَهُۥ لَهُۥ وَلَهُۥٓ أَجۡرٞ كَرِيمٞ",
        "phonetic": "57.11 Man Dhā Al-Ladhī Yuqriđu Allāha Qarđāan Ĥasanāan Fayuđā`ifahu Lahu Wa Lahu 'Ajrun Karīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who is it that would loan Allāh a goodly loan so He will multiply it for him and he will have a noble reward?",
            "english_hilali_khan": "Who is he that will lend Allâh a goodly loan: then (Allâh) will increase it manifold to his credit (in repaying), and he will have (besides) a good reward (i.e. Paradise).",
            "english_rwwad": "Who is there to lend Allah a goodly loan, so He will multiply it for him, and for him there will be a generous reward?"
        }
    },
    {
        "id": 5086,
        "chapter": 57,
        "verse": 12,
        "arabic_text": "يَوۡمَ تَرَى ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ يَسۡعَىٰ نُورُهُم بَيۡنَ أَيۡدِيهِمۡ وَبِأَيۡمَٰنِهِمۖ بُشۡرَىٰكُمُ ٱلۡيَوۡمَ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "57.12 Yawma Tará Al-Mu'uminīna Wa Al-Mu'umināti Yas`á Nūruhum Bayna 'Aydīhim Wa Bi'aymānihim Bushrākumu Al-Yawma Jannātun Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā Dhālika Huwa Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day you see the believing men and believing women, their light proceeding before them and on their right, [it will be said], \"Your good tidings today are [of] gardens beneath which rivers flow, wherein you will abide eternally.\" That is what is the great attainment.",
            "english_hilali_khan": "On the Day you shall see the believing men and the believing women: their light running forward before them and by their right hands. Glad tidings for you this Day! Gardens under which rivers flow (Paradise), to dwell therein forever! Truly, this is the great success!",
            "english_rwwad": "[Remember] the Day when you will see the believing men and women, with their light streaming ahead of them and on their right. [They will be told], “Glad tidings for you Today: gardens under which rivers flow, abiding therein forever.” That is the supreme triumph."
        }
    },
    {
        "id": 5087,
        "chapter": 57,
        "verse": 13,
        "arabic_text": "يَوۡمَ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ لِلَّذِينَ ءَامَنُواْ ٱنظُرُونَا نَقۡتَبِسۡ مِن نُّورِكُمۡ قِيلَ ٱرۡجِعُواْ وَرَآءَكُمۡ فَٱلۡتَمِسُواْ نُورٗاۖ فَضُرِبَ بَيۡنَهُم بِسُورٖ لَّهُۥ بَابُۢ بَاطِنُهُۥ فِيهِ ٱلرَّحۡمَةُ وَظَٰهِرُهُۥ مِن قِبَلِهِ ٱلۡعَذَابُ",
        "phonetic": "57.13 Yawma Yaqūlu Al-Munāfiqūna Wa Al-Munāfiqātu Lilladhīna 'Āmanū Anžurūnā Naqtabis Min Nūrikum Qīla Arji`ū Warā'akum Fāltamisū Nūrāan Fađuriba Baynahum Bisūrin Lahu Bābun Bāţinuhu Fīhi Ar-Raĥmatu Wa Žāhiruhu Min Qibalihi Al-`Adhābu",
        "footnotes": {
            "english_saheeh": "[1630]- To where light was acquired, i.e., in the worldly life.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the [same] Day the hypocrite men and hypocrite women will say to those who believed, \"Wait for us that we may acquire some of your light.\" It will be said, \"Go back behind you[1630] and seek light.\" And a wall will be placed between them with a door, its interior containing mercy, but on the outside of it is torment.",
            "english_hilali_khan": "On the Day when the hypocrites - men and women - will say to the believers: \"Wait for us! Let us get something from your light!\" It will be said: \"Go back to your rear! Then seek a light!\" So a wall will be put up between them, with a gate therein. Inside it will be mercy, and outside it will be torment.\"",
            "english_rwwad": "On that Day the hypocrite men and women will say to those who believe, “Wait for us, so that we may have some of your light.” It will be said, “Go back and seek light elsewhere.” Then a wall will be placed between them, which will have a gate, on the inside of which there will be mercy and on the outside there will be punishment."
        }
    },
    {
        "id": 5088,
        "chapter": 57,
        "verse": 14,
        "arabic_text": "يُنَادُونَهُمۡ أَلَمۡ نَكُن مَّعَكُمۡۖ قَالُواْ بَلَىٰ وَلَٰكِنَّكُمۡ فَتَنتُمۡ أَنفُسَكُمۡ وَتَرَبَّصۡتُمۡ وَٱرۡتَبۡتُمۡ وَغَرَّتۡكُمُ ٱلۡأَمَانِيُّ حَتَّىٰ جَآءَ أَمۡرُ ٱللَّهِ وَغَرَّكُم بِٱللَّهِ ٱلۡغَرُورُ",
        "phonetic": "57.14 Yunādūnahum 'Alam Nakun Ma`akum Qālū Balá Wa Lakinnakum Fatantum 'Anfusakum Wa Tarabbaştum Wa Artabtum Wa Gharratkumu Al-'Amānīyu Ĥattá Jā'a 'Amru Allāhi Wa Gharrakum Billāhi Al-Gharūru",
        "footnotes": {
            "english_saheeh": "[1631]- By hypocrisy or by falling into temptations.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They [i.e., the hypocrites] will call to them [i.e., the believers], \"Were we not with you?\" They will say, \"Yes, but you afflicted yourselves[1631] and awaited [misfortune for us] and doubted, and wishful thinking deluded you until there came the command of Allāh. And the Deceiver [i.e., Satan] deceived you concerning Allāh.",
            "english_hilali_khan": "(The hypocrites) will call the believers: \"Were we not with you?\" The believers will reply: \"Yes! But you led yourselves into temptations, you looked forward for our destruction; you doubted (in Faith) and you were deceived by false desires, till the Command of Allâh came to pass. And the chief deceiver (Satan) deceived you in respect of Allâh.\"",
            "english_rwwad": "The hypocrites will call out to the believers, “Were we not with you?” They will say, “Yes, but you allowed yourselves to succumb to temptations, you awaited [some misfortune to befall us], you doubted, and you were deceived by false hopes, until Allah’s decree came to pass. Thus the deceiver [Satan] deceived you concerning Allah."
        }
    },
    {
        "id": 5089,
        "chapter": 57,
        "verse": 15,
        "arabic_text": "فَٱلۡيَوۡمَ لَا يُؤۡخَذُ مِنكُمۡ فِدۡيَةٞ وَلَا مِنَ ٱلَّذِينَ كَفَرُواْۚ مَأۡوَىٰكُمُ ٱلنَّارُۖ هِيَ مَوۡلَىٰكُمۡۖ وَبِئۡسَ ٱلۡمَصِيرُ",
        "phonetic": "57.15 Fālyawma Lā Yu'ukhadhu Minkum Fidyatun Wa Lā Mina Al-Ladhīna Kafarū Ma'wākumu An-Nāru Hiya Mawlākum Wa Bi'sa Al-Maşīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So today no ransom will be taken from you or from those who disbelieved. Your refuge is the Fire. It is most worthy of you, and wretched is the destination.\"",
            "english_hilali_khan": "So this Day no ransom shall be taken from you (hypocrites), nor of those who disbelieved, (in the Oneness of Allâh - Islâmic Monotheism). Your abode is the Fire. That is your maulâ (friend - proper place), and worst indeed is that destination.",
            "english_rwwad": "So this Day no ransom will be accepted from you or from the disbelievers. Your abode is the Fire; it is a fitting place for you – what a wretched destination!”"
        }
    },
    {
        "id": 5090,
        "chapter": 57,
        "verse": 16,
        "arabic_text": "۞ أَلَمۡ يَأۡنِ لِلَّذِينَ ءَامَنُوٓاْ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا يَكُونُواْ كَٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلُ فَطَالَ عَلَيۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ",
        "phonetic": "57.16 'Alam Ya'ni Lilladhīna 'Āmanū 'An Takhsha`a Qulūbuhum Lidhikri Allāhi Wa Mā Nazala Mina Al-Ĥaqqi Wa Lā Yakūnū Kālladhīna 'Ūtū Al-Kitāba Min Qablu Faţāla `Alayhimu Al-'Amadu Faqasat Qulūbuhum Wa Kathīrun Minhum Fāsiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allāh and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient.",
            "english_hilali_khan": "Has not the time come for the hearts of those who believe (in the Oneness of Allâh - Islâmic Monotheism) to be affected by Allâh’s Reminder (this Qur’ân), and that which has been revealed of the truth, lest they become as those who received the Scripture [the Taurât (Torah) and the Injeel (Gospel)] before (i.e. Jews and Christians), and the term was prolonged for them and so their hearts were hardened? And many of them were Fâsiqûn (the rebellious, the disobedient to Allâh).",
            "english_rwwad": "Has the time not yet come for those who believe that their hearts should be humbled at the remembrance of Allah and to the truth that has been revealed? And that they should not be like those who were given the Scripture before, whose hearts grew hard after the passage of long time, and many of them were evildoers."
        }
    },
    {
        "id": 5091,
        "chapter": 57,
        "verse": 17,
        "arabic_text": "ٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ قَدۡ بَيَّنَّا لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَعۡقِلُونَ",
        "phonetic": "57.17 A`lamū 'Anna Allāha Yuĥyī Al-'Arđa Ba`da Mawtihā Qad Bayyannā Lakumu Al-'Āyāti La`allakum Ta`qilūna",
        "footnotes": {
            "english_saheeh": "[1632]- That similarly, Allāh (subḥānahu wa taʿālā) can soften a heart after its hardness and guide one who had previously been astray.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Know that Allāh gives life to the earth after its lifelessness. We have made clear to you the signs; perhaps you will understand.[1632]",
            "english_hilali_khan": "Know that Allâh gives life to the earth after its death! Indeed We have made clear the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) to you, if you but understand.",
            "english_rwwad": "Know that Allah revives the earth after its death. We have made the signs clear to you so that you may understand."
        }
    },
    {
        "id": 5092,
        "chapter": 57,
        "verse": 18,
        "arabic_text": "إِنَّ ٱلۡمُصَّدِّقِينَ وَٱلۡمُصَّدِّقَٰتِ وَأَقۡرَضُواْ ٱللَّهَ قَرۡضًا حَسَنٗا يُضَٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرٞ كَرِيمٞ",
        "phonetic": "57.18 'Inna Al-Muşşaddiqīna Wa Al-Muşşaddiqāti Wa 'Aqrađū Allāha Qarđāan Ĥasanāan Yuđā`afu Lahum Wa Lahum 'Ajrun Karīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allāh a goodly loan - it will be multiplied for them, and they will have a noble reward.",
            "english_hilali_khan": "Verily, those who give Sadaqât (i.e. Zakât and alms), men and women, and lend Allâh a goodly loan, it shall be increased manifold (to their credit), and theirs shall be an honourable good reward (i.e. Paradise).",
            "english_rwwad": "Indeed, those men and women who give in charity and lend to Allah a goodly loan, it will be multiplied for them, and for them there will be a generous reward."
        }
    },
    {
        "id": 5093,
        "chapter": 57,
        "verse": 19,
        "arabic_text": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ",
        "phonetic": "57.19 Wa Al-Ladhīna 'Āmanū Billāhi Wa Rusulihi 'Ūlā'ika Humu Aş-Şiddīqūna Wa Ash-Shuhadā'u `Inda Rabbihim Lahum 'Ajruhum Wa Nūruhum Wa Al-Ladhīna Kafarū Wa Kadhabū Bi'āyātinā 'Ūlā'ika 'Aşĥābu Al-Jaĥīmi",
        "footnotes": {
            "english_saheeh": "[1633]- Another accepted meaning is \"And those who have believed in Allāh and His messengers - they are the supporters of truth.  And the martyrs, with their Lord, will have their reward and their light.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who have believed in Allāh and His messengers - those are [in the ranks of] the supporters of truth and the martyrs, with their Lord. For them is their reward and their light.[1633] But those who have disbelieved and denied Our verses - those are the companions of Hellfire.",
            "english_hilali_khan": "And those who believe in (the Oneness of) Allâh and His Messengers - they are the Siddiqûn (i.e. those followers of the Prophets who were first and foremost to believe in them), and the martyrs with their Lord, they shall have their reward and their light. But those who disbelieve (in the Oneness of Allâh - Islâmic Monotheism) and deny Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) - they shall be the dwellers of the blazing Fire.",
            "english_rwwad": "Those who believe in Allah and His messengers, it is they who are the people of the truth. And the martyrs will have their reward and their light with their Lord. As for those who disbelieve and reject Our verses, they are the people of the Blazing Fire."
        }
    },
    {
        "id": 5094,
        "chapter": 57,
        "verse": 20,
        "arabic_text": "ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ",
        "phonetic": "57.20 A`lamū 'Annamā Al-Ĥayāatu Ad-Dunyā La`ibun Wa Lahwun Wa Zīnatun Wa Tafākhurun Baynakum Wa Takāthurun Fī Al-'Amwli Wa Al-'Awlādi Kamathali Ghaythin 'A`jaba Al-Kuffāra Nabātuhu Thumma Yahīju Fatarāhu Muşfarrāan Thumma Yakūnu Ĥuţāmāan Wa Fī Al-'Ākhirati `Adhābun Shadīdun Wa Maghfiratun Mina Allāhi Wa Riđwānun Wa Mā Al-Ĥayāatu Ad-Dunyā 'Illā Matā`u Al-Ghurūri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children - like the example of a rain whose [resulting] plant growth pleases the tillers; then it dries and you see it turned yellow; then it becomes [scattered] debris. And in the Hereafter is severe punishment and forgiveness from Allāh and approval. And what is the worldly life except the enjoyment of delusion.",
            "english_hilali_khan": "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children. (It is) as the likeness of vegetation after rain, thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment (for the disbelievers - evil-doers), and (there is) Forgiveness from Allâh and (His) Good Pleasure (for the believers - good-doers). And the life of this world is only a deceiving enjoyment.",
            "english_rwwad": "Know that the life of this world is no more than play, amusement, adornment, boasting among yourselves, and a competition in wealth and children. It is like plants that flourish after rain, pleasing the sowers, then they wither and you see them turning yellow, then they crumble. And in the Hereafter there will be severe punishment, or forgiveness from Allah and His pleasure. For the life of this world is no more than a fleeting enjoyment."
        }
    },
    {
        "id": 5095,
        "chapter": 57,
        "verse": 21,
        "arabic_text": "سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ",
        "phonetic": "57.21 Sābiqū 'Ilá Maghfiratin Min Rabbikum Wa Jannatin `Arđuhā Ka`arđi As-Samā'i Wa Al-'Arđi 'U`iddat Lilladhīna 'Āmanū Billāhi Wa Rusulihi Dhālika Fađlu Allāhi Yu'utīhi Man Yashā'u Wa Allāhu Dhū Al-Fađli Al-`Ažīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Race [i.e., compete] toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth, prepared for those who believed in Allāh and His messengers. That is the bounty of Allāh which He gives to whom He wills, and Allāh is the possessor of great bounty.",
            "english_hilali_khan": "Race with one another in hastening towards forgiveness from your Lord (Allâh), and Paradise the width whereof is as the width of the heaven and the earth, prepared for those who believe in Allâh and His Messengers. That is the Grace of Allâh which He bestows on whom He is pleased with. And Allâh is the Owner of Great Bounty.",
            "english_rwwad": "Race one another towards forgiveness from your Lord and Paradise the width of which is like the width of the heaven and earth, prepared for those who believe in Allah and His messengers. That is the bounty of Allah which He gives to whom He wills, for Allah is the Lord of great bounty."
        }
    },
    {
        "id": 5096,
        "chapter": 57,
        "verse": 22,
        "arabic_text": "مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ",
        "phonetic": "57.22 Mā 'Aşāba Min Muşībatin Fī Al-'Arđi Wa Lā Fī 'Anfusikum 'Illā Fī Kitābin Min Qabli 'An Nabra'ahā 'Inna Dhālika `Alá Allāhi Yasīrun",
        "footnotes": {
            "english_saheeh": "[1634]- i.e., the Preserved Slate (al-Lawḥ al-Maḥfūẓ).",
            "english_hilali_khan": "(V.57:22) Narrated Ibn ‘Abbas رضي الله عنهما : Once I was behind the Prophet صلى الله عليه وسلم and he said: \"O boy, I will teach you a few words:\n(a) Be loyal and obedient to Allâh [worship Him (Alone)], remember Him always, obey His Orders. He will save you from every evil and will take care of you in all the spheres of life.\n(b) Be loyal and obedient to Allâh, you will find Him near (in front of you) i.e. He will respond to your requests.\n(c) If you ask, ask Allâh.\n(d) If you seek help, seek help from Allâh.\n(e) Know that if all the people get together in order to benefit you with something, they will not be able to benefit you in anything except what Allâh has decreed for you. And if they all get together in order to harm you with something, they will not be able to harm you in anything except what Allâh has decreed for you.\nThe pens have stopped writings [Divine (Allâh’s) Preordainments]. And (the ink over) the papers (Book of Decrees) has dried.\" [This Hadith is quoted in Sahih At-Tirmidhi].\n",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "No disaster strikes upon the earth or among yourselves except that it is in a register[1634] before We bring it into being - indeed that, for Allāh, is easy -",
            "english_hilali_khan": "No calamity befalls on the earth or in yourselves but it is inscribed in the Book of Decrees (Al-Lauh Al-Mahfûz) before We bring it into existence. Verily, that is easy for Allâh.[1]",
            "english_rwwad": "No calamity befalls the earth or yourselves but it is already written in a Record before We bring it into existence. That is indeed easy for Allah –"
        }
    },
    {
        "id": 5097,
        "chapter": 57,
        "verse": 23,
        "arabic_text": "لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ",
        "phonetic": "57.23 Likaylā Ta'saw `Alá Mā Fātakum Wa Lā Tafraĥū Bimā 'Ātākum Wa Allāhu Lā Yuĥibbu Kulla Mukhtālin Fakhūrin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allāh does not like everyone self-deluded and boastful -",
            "english_hilali_khan": "In order that you may not grieve at the things that you fail to get, nor rejoice over that which has been given to you. And Allâh likes not prideful boasters.",
            "english_rwwad": "so that you may not grieve over what you have missed, nor exult over what He has given you, for Allah does not love anyone who is conceited and boastful –"
        }
    },
    {
        "id": 5098,
        "chapter": 57,
        "verse": 24,
        "arabic_text": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ",
        "phonetic": "57.24 Al-Ladhīna Yabkhalūna Wa Ya'murūna An-Nāsa Bil-Bukhli Wa Man Yatawalla Fa'inna Allāha Huwa Al-Ghanīyu Al-Ĥamīdu",
        "footnotes": {
            "english_saheeh": "[1635]- Refusing to spend for Allāh's cause or refusing obedience to Him.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Those] who are stingy and enjoin upon people stinginess. And whoever turns away[1635] - then indeed, Allāh is the Free of need, the Praiseworthy.",
            "english_hilali_khan": "Those who are misers and enjoin upon people miserliness - (Allâh is not in need of their charity). And whosoever turns away (from Faith - Allâh’s Monotheism), then Allâh is Rich (Free of all needs), Worthy of all praise.",
            "english_rwwad": "those who are stingy and promote stinginess among people. And those who turn away, then Allah is the Self-Sufficient, the Praiseworthy."
        }
    },
    {
        "id": 5099,
        "chapter": 57,
        "verse": 25,
        "arabic_text": "لَقَدۡ أَرۡسَلۡنَا رُسُلَنَا بِٱلۡبَيِّنَٰتِ وَأَنزَلۡنَا مَعَهُمُ ٱلۡكِتَٰبَ وَٱلۡمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلۡقِسۡطِۖ وَأَنزَلۡنَا ٱلۡحَدِيدَ فِيهِ بَأۡسٞ شَدِيدٞ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلۡغَيۡبِۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ",
        "phonetic": "57.25 Laqad 'Arsalnā Rusulanā Bil-Bayyināti Wa 'Anzalnā Ma`ahumu Al-Kitāba Wa Al-Mīzāna Liyaqūma An-Nāsu Bil-Qisţi Wa 'Anzalnā Al-Ĥadīda Fīhi Ba'sun Shadīdun Wa Manāfi`u Lilnnāsi Wa Liya`lama Allāhu Man Yanşuruhu Wa Rusulahu Bil-Ghaybi 'Inna Allāha Qawīyun `Azīzun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.57:25) Paradise is under the blades of swords (in Jihâd in Allâh’s cause).\na) Narrated Al-Mughîrah bin Shu‘bah رضي الله عنه : Our Prophet صلى الله عليه وسلم told us about the Message of our Lord that...\"whoever amongst us is killed (in Jihâd in Allâh’s cause) will go to Paradise\". ‘Umar asked the Prophet صلى الله عليه وسلم \" Is it not true that our men who are killed (in Jihâd in Allâh’s cause) will go to Paradise and theirs (i.e. those of the pagan’s) will go to the (Hell) Fire?\" The Prophet صلى الله عليه وسلم said, \"Yes\".\nb) Narrated ‘Abdullâh bin Abî Aufâ رضي الله عنهما ! Allâh’s Messenger صلى الله عليه وسلم said, \"Know that Paradise is under the shades of sword (Jihâd in Allâh’s cause). (Sahih Al-Bukhari, Vol.4, Hadîth No.73 and its chapter No.22).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice. And We sent down iron, wherein is great military might and benefits for the people, and so that Allāh may make evident those who support Him and His messengers unseen. Indeed, Allāh is Powerful and Exalted in Might.",
            "english_hilali_khan": "Indeed We have sent Our Messengers with clear proofs, and revealed with them the Scripture and the Balance (justice) that mankind may keep up justice. And We brought forth iron wherein is mighty power (in matters of war[1]), as well as many benefits for mankind, that Allâh may test who it is that will help Him (His religion) and His Messengers in the unseen. Verily, Allâh is All-Strong, All-Mighty.",
            "english_rwwad": "We have sent Our messengers with clear proofs, and sent down with them the Scripture and the criteria of justice, so that the people may uphold justice. And We sent down iron, in which there is great might and benefits for people, so that Allah may make known those who help His cause and His messengers without seeing Him. Indeed, Allah is All-Powerful, All-Mighty."
        }
    },
    {
        "id": 5100,
        "chapter": 57,
        "verse": 26,
        "arabic_text": "وَلَقَدۡ أَرۡسَلۡنَا نُوحٗا وَإِبۡرَٰهِيمَ وَجَعَلۡنَا فِي ذُرِّيَّتِهِمَا ٱلنُّبُوَّةَ وَٱلۡكِتَٰبَۖ فَمِنۡهُم مُّهۡتَدٖۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ",
        "phonetic": "57.26 Wa Laqad 'Arsalnā Nūĥāan Wa 'Ibrāhīma Wa Ja`alnā Fī Dhurrīyatihimā An-Nubūwata Wa Al-Kitāba Faminhum Muhtadin Wa Kathīrun Minhum Fāsiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have already sent Noah and Abraham and placed in their descendants prophethood and scripture; and among them is he who is guided, but many of them are defiantly disobedient.",
            "english_hilali_khan": "And indeed, We sent Nûh (Noah) and Ibrâhîm (Abraham), and placed in their offspring Prophethood and Scripture. And among them there are some who are guided; but many of them are Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "We sent Noah and Abraham, and gave prophethood and Scripture to their offspring: some among them are guided, but most of them are evildoers."
        }
    },
    {
        "id": 5101,
        "chapter": 57,
        "verse": 27,
        "arabic_text": "ثُمَّ قَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِرُسُلِنَا وَقَفَّيۡنَا بِعِيسَى ٱبۡنِ مَرۡيَمَ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَۖ وَجَعَلۡنَا فِي قُلُوبِ ٱلَّذِينَ ٱتَّبَعُوهُ رَأۡفَةٗ وَرَحۡمَةٗۚ وَرَهۡبَانِيَّةً ٱبۡتَدَعُوهَا مَا كَتَبۡنَٰهَا عَلَيۡهِمۡ إِلَّا ٱبۡتِغَآءَ رِضۡوَٰنِ ٱللَّهِ فَمَا رَعَوۡهَا حَقَّ رِعَايَتِهَاۖ فَـَٔاتَيۡنَا ٱلَّذِينَ ءَامَنُواْ مِنۡهُمۡ أَجۡرَهُمۡۖ وَكَثِيرٞ مِّنۡهُمۡ فَٰسِقُونَ",
        "phonetic": "57.27 Thumma Qaffaynā `Alá 'Āthārihim Birusulinā Wa Qaffaynā Bi`īsá Abni Maryama Wa 'Ātaynāhu Al-'Injīla Wa Ja`alnā Fī Qulūbi Al-Ladhīna Attaba`ūhu Ra'fatan Wa Raĥmatan Wa Rahbānīyatan Abtada`ūhā Mā Katabnāhā `Alayhim 'Illā Abtighā'a Riđwāni Allāhi Famā Ra`awhā Ĥaqqa Ri`āyatihā Fa'ātaynā Al-Ladhīna 'Āmanū Minhum 'Ajrahum Wa Kathīrun Minhum Fāsiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We sent following their footsteps [i.e., traditions] Our messengers and followed [them] with Jesus, the son of Mary, and gave him the Gospel. And We placed in the hearts of those who followed him compassion and mercy and monasticism, which they innovated; We did not prescribe it for them except [that they did so] seeking the approval of Allāh. But they did not observe it with due observance. So We gave the ones who believed among them their reward, but many of them are defiantly disobedient.",
            "english_hilali_khan": "Then, We sent after them Our Messengers, and We sent ‘Îsâ (Jesus) - son of Maryam (Mary), and gave him the Injeel (Gospel). And We ordained in the hearts of those who followed him compassion and mercy. But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allâh therewith, but they did not observe it with the right observance. So We gave those among them who believed their (due) reward; but many of them are Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "Then We sent Our messengers in their footsteps, and We sent after them Jesus, son of Mary; We gave him the Gospel, and instilled kindness and mercy in the hearts of those who followed him. As for monasticism, they invented it – We did not prescribe it for them – seeking thereby Allah’s pleasure, yet they did not observe it faithfully. So We gave those who believed among them their reward, but most of them are evildoers."
        }
    },
    {
        "id": 5102,
        "chapter": 57,
        "verse": 28,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَءَامِنُواْ بِرَسُولِهِۦ يُؤۡتِكُمۡ كِفۡلَيۡنِ مِن رَّحۡمَتِهِۦ وَيَجۡعَل لَّكُمۡ نُورٗا تَمۡشُونَ بِهِۦ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
        "phonetic": "57.28 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Attaqū Allāha Wa 'Āminū Birasūlihi Yu'utikum Kiflayni Min Raĥmatihi Wa Yaj`al Lakum Nūrāan Tamshūna Bihi Wa Yaghfir Lakum Wa Allāhu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.57:28)\n(a) Narrated Abû Buradah’s father: Allâh’s Messenger صلى الله عليه وسلم said, \"Any man who has a slave-girl whom he educates properly, teaches good manners, manumits and marries her will get a double reward. And if any man of the people of the Scriptures (Jews and Christians) believes in his own Prophet and then believes in me (Muhammad صلى الله عليه وسلم) too, he will (also) get a double reward. And any slave who fulfils his duty to his master and to his Lord (Allâh) will (also) get a double reward.\" (Sahih Al-Bukhari, Vol.7, Hadîth No.20).\n(b) It is obligatory to have Belief in the Messengership of the Prophet (Muhammad صلى الله عليه وسلم).\nNarrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"By Him (Allâh) in Whose Hand Muhammad’s soul is, there is none from amongst the Jews and the Christians (of these present nations) who hears about me and then dies without believing in the Message with which I have been sent (i.e. Islâmic Monotheism), but he will be from the dwellers of the (Hell) Fire.\" (Sahih Muslim , the Book of Faith, Vol.1, Chapter No.240) See also (V.3:85) and (V.3:116).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, fear Allāh and believe in His Messenger; He will [then] give you a double portion of His mercy and make for you a light by which you will walk and forgive you; and Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "O you who believe [in Mûsâ (Moses) (i.e. Jews) and ‘Îsâ (Jesus) (i.e. Christians)]! Fear Allâh, and believe in His Messenger (Muhammad صلى الله عليه وسلم), He will give you a double portion of His Mercy, and He will give you a light by which you shall walk (straight). And He will forgive you. And Allâh is Oft-Forgiving, Most Merciful.[2]",
            "english_rwwad": "O you who believe, fear Allah and believe in His Messenger; He will give you a double share of His mercy, and will give you a light by which you walk, and forgive you, for Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 5103,
        "chapter": 57,
        "verse": 29,
        "arabic_text": "لِّئَلَّا يَعۡلَمَ أَهۡلُ ٱلۡكِتَٰبِ أَلَّا يَقۡدِرُونَ عَلَىٰ شَيۡءٖ مِّن فَضۡلِ ٱللَّهِ وَأَنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ",
        "phonetic": "57.29 Li'allā Ya`lama 'Ahlu Al-Kitābi 'Allā Yaqdirūna `Alá Shay'in Min Fađli Allāhi Wa 'Anna Al-Fađla Biyadi Allāhi Yu'utīhi Man Yashā'u Wa Allāhu Dhū Al-Fađli Al-`Ažīmi",
        "footnotes": {
            "english_saheeh": "[1636]- As long as they refuse to believe in the message of Allāh which was conveyed through Muḥammad (ﷺ).\n[1637]- See footnote to 2:19.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of Allāh[1636] and that [all] bounty is in the hand[1637] of Allāh; He gives it to whom He wills. And Allāh is the possessor of great bounty.",
            "english_hilali_khan": "So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allâh, and that (His) Grace is (entirely) in His Hand to bestow it on whomsoever He wills. And Allâh is the Owner of Great Bounty.",
            "english_rwwad": "[This is] so that the People of the Book may know that they have no power over anything of Allah’s bounty, and that all bounty is in the Hands of Allah; He gives it to whom He wills, for Allah is the Lord of great bounty."
        }
    }
]