[
    {
        "id": 789,
        "chapter": 6,
        "verse": 1,
        "arabic_text": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ يَعۡدِلُونَ",
        "phonetic": "6.1 Al-Ĥamdu Lillāhi Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Wa Ja`ala Až-Žulumāti Wa An-Nūra Thumma Al-Ladhīna Kafarū Birabbihim Ya`dilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[All] praise is [due] to Allāh, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.",
            "english_hilali_khan": "1. All praises and thanks be to Allâh, Who (Alone) created the heavens and the earth, and originated the darkness and the light; yet those who disbelieve hold others as equal with their Lord.",
            "english_rwwad": "All praise is for Allah Who created the heavens and earth, and made darkness and light. Yet those who disbelieve set up equals to their Lord."
        }
    },
    {
        "id": 790,
        "chapter": 6,
        "verse": 2,
        "arabic_text": "هُوَ ٱلَّذِي خَلَقَكُم مِّن طِينٖ ثُمَّ قَضَىٰٓ أَجَلٗاۖ وَأَجَلٞ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ",
        "phonetic": "6.2 Huwa Al-Ladhī Khalaqakum Min Ţīnin Thumma Qađá 'Ajalāan Wa 'Ajalun Musammáan `Indahu Thumma 'Antum Tamtarūna",
        "footnotes": {
            "english_saheeh": "[291]- An appointed time for death.\n[292]- For resurrection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who created you from clay and then decreed a term[291] and a specified time [known] to Him;[292] then [still] you are in dispute.",
            "english_hilali_khan": "He it is Who has created you from clay, and then has decreed a (stated) term (for you to die). And there is with Him another determined term (for you to be resurrected), yet you doubt (in the Resurrection).",
            "english_rwwad": "It is He Who created you from clay, then decreed a term [for your life], and another term [for resurrection] known only to Him – yet you still doubt."
        }
    },
    {
        "id": 791,
        "chapter": 6,
        "verse": 3,
        "arabic_text": "وَهُوَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَفِي ٱلۡأَرۡضِ يَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَيَعۡلَمُ مَا تَكۡسِبُونَ",
        "phonetic": "6.3 Wa Huwa Allāhu Fī As-Samāwāti Wa Fī Al-'Arđi Ya`lamu Sirrakum Wa Jahrakum Wa Ya`lamu Mā Taksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He is Allāh, [the only deity] in the heavens and the earth. He knows your secret and what you make public, and He knows that which you earn.",
            "english_hilali_khan": "And He is Allâh (to be worshipped Alone) in the heavens and on the earth; He knows what you conceal and what you reveal, and He knows what you earn (good or bad). (See V.43:84)",
            "english_rwwad": "He is Allah in the heavens and on earth. He knows your secrets and what you reveal, and knows whatever you earn."
        }
    },
    {
        "id": 792,
        "chapter": 6,
        "verse": 4,
        "arabic_text": "وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ",
        "phonetic": "6.4 Wa Mā Ta'tīhim Min 'Āyatin Min 'Āyāti Rabbihim 'Illā Kānū `Anhā Mu`riđīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And no sign comes to them from the signs of their Lord except that they turn away therefrom.",
            "english_hilali_khan": "And never an Ayah (sign) comes to them from the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord, but that they have been turning away from it.",
            "english_rwwad": "No sign ever comes to them from the their Lord except that they turn away from it."
        }
    },
    {
        "id": 793,
        "chapter": 6,
        "verse": 5,
        "arabic_text": "فَقَدۡ كَذَّبُواْ بِٱلۡحَقِّ لَمَّا جَآءَهُمۡ فَسَوۡفَ يَأۡتِيهِمۡ أَنۢبَٰٓؤُاْ مَا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
        "phonetic": "6.5 Faqad Kadhabū Bil-Ĥaqqi Lammā Jā'ahum Fasawfa Ya'tīhim 'Anbā'u Mā Kānū Bihi Yastahzi'ūn",
        "footnotes": {
            "english_saheeh": "[293]- They will experience the reality of what they had denied and the consequence of their denial.",
            "english_hilali_khan": "(V.6:5) See the footnote of (V.3:85) and also see (V.3:116).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For they had denied the truth when it came to them, but there is going to reach them the news of what they used to ridicule.[293]",
            "english_hilali_khan": "Indeed, they rejected the truth (the Qur’ân and Muhammad صلى الله عليه وسلم)[1] when it came to them, but there will come to them the news of that (the torment) which they used to mock at.",
            "english_rwwad": "They have rejected the truth when it came to them, but soon they will face the consequences of what they used to ridicule."
        }
    },
    {
        "id": 794,
        "chapter": 6,
        "verse": 6,
        "arabic_text": "أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَآءَ عَلَيۡهِم مِّدۡرَارٗا وَجَعَلۡنَا ٱلۡأَنۡهَٰرَ تَجۡرِي مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ",
        "phonetic": "6.6 'Alam Yaraw Kam 'Ahlaknā Min Qablihim Min Qarnin Makkannāhum Fī Al-'Arđi Mā Lam Numakkin Lakum Wa 'Arsalnā As-Samā'a `Alayhim Midrārāan Wa Ja`alnā Al-'Anhāra Tajrī Min Taĥtihim Fa'ahlaknāhum Bidhunūbihim Wa 'Ansha'nā Min Ba`dihim Qarnāan 'Ākharīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have they not seen how many generations We destroyed before them which We had established upon the earth as We have not established you? And We sent [rain from] the sky upon them in showers and made rivers flow beneath them; then We destroyed them for their sins and brought forth after them a generation of others.",
            "english_hilali_khan": "Have they not seen how many a generation before them We have destroyed whom We had established on the earth such as We have not established you? And We poured out on them rain from the sky in abundance, and made the rivers flow under them. Yet We destroyed them for their sins, and We created after them other generations.",
            "english_rwwad": "Have they not seen how many generations We destroyed before them? We had made them more powerful in the land than We have made you. We sent down for them abundant rain and made rivers flow beneath them. Yet We destroyed them for their sins and brought forth after them other generations."
        }
    },
    {
        "id": 795,
        "chapter": 6,
        "verse": 7,
        "arabic_text": "وَلَوۡ نَزَّلۡنَا عَلَيۡكَ كِتَٰبٗا فِي قِرۡطَاسٖ فَلَمَسُوهُ بِأَيۡدِيهِمۡ لَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ",
        "phonetic": "6.7 Wa Law Nazzalnā `Alayka Kitābāan Fī Qirţāsin Falamasūhu Bi'aydīhim Laqāla Al-Ladhīna Kafarū 'In Hādhā 'Illā Siĥrun Mubīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And even if We had sent down to you, [O Muḥammad], a written scripture on a page and they touched it with their hands, the disbelievers would say, \"This is not but obvious magic.\"",
            "english_hilali_khan": "And even if We had sent down unto you (O Muhammad صلى الله عليه وسلم) a Message written on paper so that they could touch it with their hands, the disbelievers would have said: \"This is nothing but obvious magic!\"",
            "english_rwwad": "Even if We had sent down to you [O Prophet] a revelation written on paper, and they were to touch it with their hands, the disbelievers would still have said, “This is nothing but clear magic!”"
        }
    },
    {
        "id": 796,
        "chapter": 6,
        "verse": 8,
        "arabic_text": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ مَلَكٞۖ وَلَوۡ أَنزَلۡنَا مَلَكٗا لَّقُضِيَ ٱلۡأَمۡرُ ثُمَّ لَا يُنظَرُونَ",
        "phonetic": "6.8 Wa Qālū Lawlā 'Unzila `Alayhi Malakun Wa Law 'Anzalnā Malakāan Laquđiya Al-'Amru Thumma Lā Yunžarūna",
        "footnotes": {
            "english_saheeh": "[294]- In support of his prophethood (ﷺ).\n[295]- They would have been destroyed immediately with no chance for repentance.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"Why was there not sent down to him an angel?\"[294] But if We had sent down an angel, the matter would have been decided;[295] then they would not be reprieved.",
            "english_hilali_khan": "And they say: \"Why has not an angel been sent down to him?\" Had We sent down an angel, the matter would have been judged at once, and no respite would be granted to them.",
            "english_rwwad": "They say: Why has no angel been sent down to him? If We did send down an angel, the matter would have been decided and then they would not be given any respite."
        }
    },
    {
        "id": 797,
        "chapter": 6,
        "verse": 9,
        "arabic_text": "وَلَوۡ جَعَلۡنَٰهُ مَلَكٗا لَّجَعَلۡنَٰهُ رَجُلٗا وَلَلَبَسۡنَا عَلَيۡهِم مَّا يَلۡبِسُونَ",
        "phonetic": "6.9 Wa Law Ja`alnāhu Malakāan Laja`alnāhu Rajulāan Wa Lalabasnā `Alayhim Mā Yalbisūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if We had made him [i.e., the messenger] an angel, We would have made him [appear as] a man, and We would have covered them with that in which they cover themselves [i.e., confusion and doubt].",
            "english_hilali_khan": "9. And had We appointed him an angel, We indeed would have made him a man, and We would have certainly confused them in which they are already confused (i.e. the Message of Prophet Muhammad صلى الله عليه وسلم).",
            "english_rwwad": "And if We had made him an angel, We would have surely made him [appear as] a man, and We would have caused them confusion just as they are confused."
        }
    },
    {
        "id": 798,
        "chapter": 6,
        "verse": 10,
        "arabic_text": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِينَ سَخِرُواْ مِنۡهُم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ",
        "phonetic": "6.10 Wa Laqadi Astuhzi'a Birusulin Min Qablika Faĥāqa Bial-Ladhīna Sakhirū Minhum Mā Kānū Bihi Yastahzi'ūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And already were messengers ridiculed before you, but those who mocked them were enveloped by that which they used to ridicule.",
            "english_hilali_khan": "And indeed (many) Messengers before you were mocked at, but their scoffers were surrounded by the very thing that they used to mock at.",
            "english_rwwad": "And there were messengers before you [O Prophet] who were ridiculed, but those who mocked them were overwhelmed by what they used to ridicule."
        }
    },
    {
        "id": 799,
        "chapter": 6,
        "verse": 11,
        "arabic_text": "قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ ثُمَّ ٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ",
        "phonetic": "6.11 Qul Sīrū Fī Al-'Arđi Thumma Anžurū Kayfa Kāna `Āqibatu Al-Mukadhibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Travel through the land; then observe how was the end of the deniers.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Travel in the land and see what was the end of those who rejected truth.\"",
            "english_rwwad": "Say, “Travel through the land, then see how was the end of the deniers.”"
        }
    },
    {
        "id": 800,
        "chapter": 6,
        "verse": 12,
        "arabic_text": "قُل لِّمَن مَّا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ قُل لِّلَّهِۚ كَتَبَ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۚ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فَهُمۡ لَا يُؤۡمِنُونَ",
        "phonetic": "6.12 Qul Liman Mā Fī As-Samāwāti Wa Al-'Arđi Qul Lillāhi Kataba `Alá Nafsihi Ar-Raĥmata Layajma`annakum 'Ilá Yawmi Al-Qiyāmati Lā Rayba Fīhi Al-Ladhīna Khasirū 'Anfusahum Fahum Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:12)\nA) Narrated Abu Hurairah رضي الله عنه: I heard Allâh’s Messenger صلى الله عليه وسلم saying, \"Allâh has divided Mercy into one hundred parts, and He kept ninety-nine parts with Him and sent down one part to the earth, and because of that one single part, His creatures are merciful to each other, so that even the mare lifts up its hoof away from its baby animal, lest it should trample on it.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.29).\nB) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"When Allâh completed the creation, He wrote in His Book which is with Him on His Throne: ‘Verily, My Mercy has overcome My Anger.’ \" (Sahih Al-Bukhâri, Vol.4, Hadîth No.416).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"To whom belongs whatever is in the heavens and earth?\" Say, \"To Allāh.\" He has decreed upon Himself mercy. He will surely assemble you for the Day of Resurrection, about which there is no doubt. Those who will lose themselves [that Day] do not believe.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"To whom belongs all that is in the heavens and the earth?\" Say: \"To Allâh. He has prescribed Mercy for Himself.[1] Indeed He will gather you together on the Day of Resurrection, about which there is no doubt. Those who have lost themselves will not believe [in Allâh as being the only Ilâh (God), and Muhammad صلى الله عليه وسلم as being one of His Messengers, and in Resurrection].",
            "english_rwwad": "Say, “To whom belongs all that is in the heavens and earth?” Say, “To Allah.” He has taken it upon Himself to be Merciful. He will surely gather you for the Day of Resurrection about which there is no doubt. Those who have ruined themselves will not believe."
        }
    },
    {
        "id": 801,
        "chapter": 6,
        "verse": 13,
        "arabic_text": "۞ وَلَهُۥ مَا سَكَنَ فِي ٱلَّيۡلِ وَٱلنَّهَارِۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
        "phonetic": "6.13 Wa Lahu Mā Sakana Fī Al-Layli Wa An-Nahāri Wa Huwa As-Samī`u Al-`Alīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Him belongs that which reposes by night and by day, and He is the Hearing, the Knowing.",
            "english_hilali_khan": "And to Him belongs whatsoever exists in the night and the day, and He is the All-Hearing, the All-Knowing.\"",
            "english_rwwad": "To Him belongs all that rests in the night and in the day, and He is the All-Hearing, the All-Knowing."
        }
    },
    {
        "id": 802,
        "chapter": 6,
        "verse": 14,
        "arabic_text": "قُلۡ أَغَيۡرَ ٱللَّهِ أَتَّخِذُ وَلِيّٗا فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَهُوَ يُطۡعِمُ وَلَا يُطۡعَمُۗ قُلۡ إِنِّيٓ أُمِرۡتُ أَنۡ أَكُونَ أَوَّلَ مَنۡ أَسۡلَمَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "6.14 Qul 'Aghayra Allāhi 'Attakhidhu Walīyāan Fāţiri As-Samāwāti Wa Al-'Arđi Wa Huwa Yuţ`imu Wa Lā Yuţ`amu Qul 'Innī 'Umirtu 'An 'Akūna 'Awwala Man 'Aslama Wa Lā Takūnanna Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Is it other than Allāh I should take as a protector, Creator of the heavens and earth, while it is He who feeds and is not fed?\" Say, [O Muḥammad], \"Indeed, I have been commanded to be the first [among you] who submit [to Allāh] and [was commanded], 'Do not ever be of the polytheists.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Shall I take as a Walî (Helper, Protector, Lord or God) any other than Allâh, the Creator of the heavens and the earth? And it is He Who feeds but is not fed.\" Say: \"Verily, I am commanded to be the first of those who submit themselves to Allâh (as Muslims).\" And be not you (O Muhammad صلى الله عليه وسلم) of the Mushrikûn [polytheists, pagans, idolaters and disbelievers in the Oneness of Allâh]. (Tafsir Al-Qurtubi)",
            "english_rwwad": "Say [O Prophet], “Should I take any guardian other than Allah, the Originator of the heavens and earth, Who feeds but is not fed?” Say, “I have been commanded to be the first to submit [to Allah] and not to be one of those who associate partners with Allah.”"
        }
    },
    {
        "id": 803,
        "chapter": 6,
        "verse": 15,
        "arabic_text": "قُلۡ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ",
        "phonetic": "6.15 Qul 'Innī 'Akhāfu 'In `Aşaytu Rabbī `Adhāba Yawmin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
            "english_hilali_khan": "Say: \"I fear, if I disobey my Lord, the torment of a Mighty Day.\"",
            "english_rwwad": "Say, “If I disobey my Lord, I fear the punishment of a momentous Day.”"
        }
    },
    {
        "id": 804,
        "chapter": 6,
        "verse": 16,
        "arabic_text": "مَّن يُصۡرَفۡ عَنۡهُ يَوۡمَئِذٖ فَقَدۡ رَحِمَهُۥۚ وَذَٰلِكَ ٱلۡفَوۡزُ ٱلۡمُبِينُ",
        "phonetic": "6.16 Man Yuşraf `Anhu Yawma'idhin Faqad Raĥimahu Wa Dhalika Al-Fawzu Al-Mubīnu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He from whom it is averted that Day - [Allāh] has granted him mercy. And that is the clear attainment.",
            "english_hilali_khan": "He who is averted from (such a torment) on that Day, (Allâh) has surely been Merciful to him. And that would be the obvious success.",
            "english_rwwad": "Whoever is spared the punishment on that Day is blessed with His mercy. That is the clear triumph."
        }
    },
    {
        "id": 805,
        "chapter": 6,
        "verse": 17,
        "arabic_text": "وَإِن يَمۡسَسۡكَ ٱللَّهُ بِضُرّٖ فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَۖ وَإِن يَمۡسَسۡكَ بِخَيۡرٖ فَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
        "phonetic": "6.17 Wa 'In Yamsaska Allāhu Biđurrin Falā Kāshifa Lahu 'Illā Huwa Wa 'In Yamsaska Bikhayrin Fahuwa `Alá Kulli Shay'in Qadīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if Allāh should touch you with adversity, there is no remover of it except Him. And if He touches you with good - then He is over all things competent.",
            "english_hilali_khan": "And if Allâh touches you with harm, none can remove it but He, and if He touches you with good, then He is Able to do all things.",
            "english_rwwad": "If Allah afflicts you with harm, there is none to remove it except Him; if He grants you good, He is Most Capable of all things."
        }
    },
    {
        "id": 806,
        "chapter": 6,
        "verse": 18,
        "arabic_text": "وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۚ وَهُوَ ٱلۡحَكِيمُ ٱلۡخَبِيرُ",
        "phonetic": "6.18 Wa Huwa Al-Qāhiru Fawqa `Ibādihi Wa Huwa Al-Ĥakīmu Al-Khabīru",
        "footnotes": {
            "english_saheeh": "[296]- Whose wisdom includes precise, perfect and absolute knowledge of all realities and outcomes, according to which He decrees and causes circumstances and occurrences.\n[297]- Fully acquainted and familiar with every hidden thought, intent and condition of His servants.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He is the subjugator over His servants. And He is the Wise,[296] the Aware.[297]",
            "english_hilali_khan": "And He is the Irresistible, (Supreme) above His slaves, and He is the All-Wise, Well-Acquainted with all things.",
            "english_rwwad": "He is the Vanquisher over His slaves, and He is the All-Wise, the All-Aware."
        }
    },
    {
        "id": 807,
        "chapter": 6,
        "verse": 19,
        "arabic_text": "قُلۡ أَيُّ شَيۡءٍ أَكۡبَرُ شَهَٰدَةٗۖ قُلِ ٱللَّهُۖ شَهِيدُۢ بَيۡنِي وَبَيۡنَكُمۡۚ وَأُوحِيَ إِلَيَّ هَٰذَا ٱلۡقُرۡءَانُ لِأُنذِرَكُم بِهِۦ وَمَنۢ بَلَغَۚ أَئِنَّكُمۡ لَتَشۡهَدُونَ أَنَّ مَعَ ٱللَّهِ ءَالِهَةً أُخۡرَىٰۚ قُل لَّآ أَشۡهَدُۚ قُلۡ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ وَإِنَّنِي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ",
        "phonetic": "6.19 Qul 'Ayyu Shay'in 'Akbaru Shahādatan Quli Allāhu Shahīdun Baynī Wa Baynakum Wa 'Ūĥiya 'Ilayya Hādhā Al-Qur'ānu Li'ndhirakum Bihi Wa Man Balagha 'A'innakum Latash/hadūna 'Anna Ma`a Allāhi 'Ālihatan 'Ukhrá Qul Lā 'Ash/hadu Qul 'Innamā Huwa 'Ilahun Wāĥidun Wa 'Innanī Barī'un Mimmā Tushrikūna",
        "footnotes": {
            "english_saheeh": "[298]- At every time and place until the Day of Judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"What thing is greatest in testimony?\" Say, \"Allāh is witness between me and you. And this Qur’ān was revealed to me that I may warn you thereby and whomever it reaches.[298] Do you [truly] testify that with Allāh there are other deities?\" Say, \"I will not testify [with you].\" Say, \"Indeed, He is but one God, and indeed, I am free of what you associate [with Him].\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"What thing is the most great in witness?\" Say: \"Allâh (the Most Great!) is Witness between me and you; this Qur’ân has been revealed to me that I may therewith warn you and whomsoever it may reach. Can you verily bear witness that besides Allâh there are other âlihah (gods)?\" Say \"I bear no (such) witness!\" Say: \"But in truth He (Allâh) is the only one Ilâh (God). And truly I am innocent of what you join in worship with Him.\"",
            "english_rwwad": "Say, “Whose testimony is the greatest?” Say, “Allah is Witness between me and you. This Qur’an has been revealed to me so that I may warn you thereby and whomsoever it reaches. Do you really bear witness that there are other gods besides Allah?” Say, “I do not bear such witness.” Say, “Indeed, He is One God, and I disown all that you associate [with Him].”"
        }
    },
    {
        "id": 808,
        "chapter": 6,
        "verse": 20,
        "arabic_text": "ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡرِفُونَهُۥ كَمَا يَعۡرِفُونَ أَبۡنَآءَهُمُۘ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فَهُمۡ لَا يُؤۡمِنُونَ",
        "phonetic": "6.20 Al-Ladhīna 'Ātaynāhumu Al-Kitāba Ya`rifūnahu Kamā Ya`rifūna 'Abnā'ahumu Al-Ladhīna Khasirū 'Anfusahum Fahum Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "[299]- The Qur’ān.  Also interpreted as \"him,\" meaning Muḥammad (ﷺ).",
            "english_hilali_khan": "(V.6:20) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those to whom We have given the Scripture recognize it[299] as they recognize their [own] sons. Those who will lose themselves [in the Hereafter] do not believe.",
            "english_hilali_khan": "Those to whom We have given the Scripture (Jews and Christians) recognize him (i.e. Muhammad صلى الله عليه وسلم as a Messenger of Allâh, and they also know that there is no Ilâh (God) but Allâh and Islâm is Allâh’s Religion), as they recognize their own sons. Those who have lost (destroyed) themselves will not believe.[1] (Tafsir At-Tabarî).",
            "english_rwwad": "Those to whom We gave the Scripture recognize him [Muhammad] just as they recognize their own sons. Those who have ruined their own souls will not believe."
        }
    },
    {
        "id": 809,
        "chapter": 6,
        "verse": 21,
        "arabic_text": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّٰلِمُونَ",
        "phonetic": "6.21 Wa Man 'Ažlamu Mimmani Aftará `Alá Allāhi Kadhibāan 'Aw Kadhaba Bi'āyātihi 'Innahu Lā Yufliĥu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And who is more unjust than one who invents about Allāh a lie or denies His verses? Indeed, the wrongdoers will not succeed.",
            "english_hilali_khan": "And who does more aggression and wrong than he who invents a lie against Allâh or rejects His Ayât (proofs, evidence, verses, lessons or revelations)? Verily, the Zâlimûn (polytheists and wrong-doers) shall never be successful.",
            "english_rwwad": "Who does greater wrong than one who fabricates lies against Allah or rejects His verses? The wrongdoers will never succeed."
        }
    },
    {
        "id": 810,
        "chapter": 6,
        "verse": 22,
        "arabic_text": "وَيَوۡمَ نَحۡشُرُهُمۡ جَمِيعٗا ثُمَّ نَقُولُ لِلَّذِينَ أَشۡرَكُوٓاْ أَيۡنَ شُرَكَآؤُكُمُ ٱلَّذِينَ كُنتُمۡ تَزۡعُمُونَ",
        "phonetic": "6.22 Wa Yawma Naĥshuruhum Jamī`āan Thumma Naqūlu Lilladhīna 'Ashrakū 'Ayna Shurakā'uukumu Al-Ladhīna Kuntum Taz`umūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention, O Muḥammad], the Day We will gather them all together; then We will say to those who associated others with Allāh, \"Where are your 'partners' that you used to claim [with Him]?\"",
            "english_hilali_khan": "And on the Day when We shall gather them all together, then We shall say to those who joined partners (in worship with Us): \"Where are your partners (false deities) whom you used to assert (as partners in worship with Allâh)?\"",
            "english_rwwad": "On the Day when We will gather them all together, then We will say to those who associated partners with Allah, “Where are your partners whom you claimed [to be equal to Allah]?”"
        }
    },
    {
        "id": 811,
        "chapter": 6,
        "verse": 23,
        "arabic_text": "ثُمَّ لَمۡ تَكُن فِتۡنَتُهُمۡ إِلَّآ أَن قَالُواْ وَٱللَّهِ رَبِّنَا مَا كُنَّا مُشۡرِكِينَ",
        "phonetic": "6.23 Thumma Lam Takun Fitnatuhum 'Illā 'An Qālū Wa Al-Lahi Rabbinā Mā Kunnā Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then there will be no [excuse upon] examination except they will say, \"By Allāh, our Lord, we were not those who associated.\"",
            "english_hilali_khan": "There will then be (left) no Fitnah (excuses or statements or arguments) for them but to say: \"By Allâh, our Lord, we were not those who joined others in worship with Allâh.\"",
            "english_rwwad": "Then they will have no excuse but to say, “By Allah, our Lord, we never associated any partners [with Allah].”"
        }
    },
    {
        "id": 812,
        "chapter": 6,
        "verse": 24,
        "arabic_text": "ٱنظُرۡ كَيۡفَ كَذَبُواْ عَلَىٰٓ أَنفُسِهِمۡۚ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ",
        "phonetic": "6.24 Anžur Kayfa Kadhabū `Alá 'Anfusihim Wa Đalla `Anhum Mā Kānū Yaftarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "See how they will lie about themselves. And lost from them will be what they used to invent.",
            "english_hilali_khan": "Look! How they lie against themselves! But the (lie) which they invented will disappear from them.",
            "english_rwwad": "See how they will lie against themselves, and all what they used to fabricate will vanish from them."
        }
    },
    {
        "id": 813,
        "chapter": 6,
        "verse": 25,
        "arabic_text": "وَمِنۡهُم مَّن يَسۡتَمِعُ إِلَيۡكَۖ وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِن يَرَوۡاْ كُلَّ ءَايَةٖ لَّا يُؤۡمِنُواْ بِهَاۖ حَتَّىٰٓ إِذَا جَآءُوكَ يُجَٰدِلُونَكَ يَقُولُ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ",
        "phonetic": "6.25 Wa Minhum Man Yastami`u 'Ilayka Wa Ja`alnā `Alá Qulūbihim 'Akinnatan 'An Yafqahūhu Wa Fī 'Ādhānihim Waqrāan Wa 'In Yaraw Kulla 'Āyatin Lā Yu'uminū Bihā Ĥattá 'Idhā Jā'ūka Yujādilūnaka Yaqūlu Al-Ladhīna Kafarū 'In Hādhā 'Illā 'Asāţīru Al-'Awwalīna",
        "footnotes": {
            "english_saheeh": "[300]- When you recite the Qur’ān.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them are those who listen to you,[300] but We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if they should see every sign, they will not believe in it. Even when they come to you arguing with you, those who disbelieve say, \"This is not but legends of the former peoples.\"",
            "english_hilali_khan": "And of them there are some who listen to you; but We have set veils on their hearts, so they understand it not, and deafness in their ears; and even if they see every one of the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) they will not believe therein; to the point that when they come to you to argue with you, the disbelievers say: \"These are nothing but tales of the men of old.\"",
            "english_rwwad": "There are some among them who listen to you, but We have placed covers on their hearts so that they do not understand it, and deafness in their ears. Even if they were to see every sign, they would still not believe in them. When they come to you arguing, the disbelievers say, “This is nothing but ancient fables.”"
        }
    },
    {
        "id": 814,
        "chapter": 6,
        "verse": 26,
        "arabic_text": "وَهُمۡ يَنۡهَوۡنَ عَنۡهُ وَيَنۡـَٔوۡنَ عَنۡهُۖ وَإِن يُهۡلِكُونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ",
        "phonetic": "6.26 Wa Hum Yanhawna `Anhu Wa Yan'awna `Anhu Wa 'In Yuhlikūna 'Illā 'Anfusahum Wa Mā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they prevent [others] from him and are [themselves] remote from him. And they do not destroy except themselves, but they perceive [it] not.",
            "english_hilali_khan": "And they prevent others from him (from following Prophet Muhammad صلى الله عليه وسلم) and they themselves keep away from him, and (by doing so) they destroy not but their ownselves, yet they perceive (it) not.",
            "english_rwwad": "They prevent others from him, and they themselves keep away from him; they destroy none but themselves, but they do not realize."
        }
    },
    {
        "id": 815,
        "chapter": 6,
        "verse": 27,
        "arabic_text": "وَلَوۡ تَرَىٰٓ إِذۡ وُقِفُواْ عَلَى ٱلنَّارِ فَقَالُواْ يَٰلَيۡتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِـَٔايَٰتِ رَبِّنَا وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "6.27 Wa Law Tará 'Idh Wuqifū `Alá An-Nāri Faqālū Yā Laytanā Nuraddu Wa Lā Nukadhiba Bi'āyāti Rabbinā Wa Nakūna Mina Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you could but see when they are made to stand before the Fire and will say, \"Oh, would that we could be returned [to life on earth] and not deny the signs of our Lord and be among the believers.\"",
            "english_hilali_khan": "If you could but see when they will be held over the (Hell) Fire! They will say: \"Would that we were but sent back (to the world)! Then we would not deny the Ayât (proofs, evidence, verses, lessons, revelations, etc.) of our Lord, and we would be of the believers!\"",
            "english_rwwad": "If you could only see when they will be made to stand before the Fire, they will say, “If only we were sent back, we would not reject the verses of our Lord, and we would be among the believers.”"
        }
    },
    {
        "id": 816,
        "chapter": 6,
        "verse": 28,
        "arabic_text": "بَلۡ بَدَا لَهُم مَّا كَانُواْ يُخۡفُونَ مِن قَبۡلُۖ وَلَوۡ رُدُّواْ لَعَادُواْ لِمَا نُهُواْ عَنۡهُ وَإِنَّهُمۡ لَكَٰذِبُونَ",
        "phonetic": "6.28 Bal Badā Lahum Mā Kānū Yukhfūna Min Qablu Wa Law Ruddū La`ādū Limā Nuhū `Anhu Wa 'Innahum Lakādhibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But what they concealed before has [now] appeared to them. And even if they were returned, they would return to that which they were forbidden; and indeed, they are liars.",
            "english_hilali_khan": "Nay, it has become manifest to them what they had been concealing before. But if they were returned (to the world), they would certainly revert to that which they were forbidden. And indeed they are liars.",
            "english_rwwad": "But that which they used to conceal before will become apparent to them. And even if they were sent back, they would surely return to what they were forbidden, for they are indeed liars."
        }
    },
    {
        "id": 817,
        "chapter": 6,
        "verse": 29,
        "arabic_text": "وَقَالُوٓاْ إِنۡ هِيَ إِلَّا حَيَاتُنَا ٱلدُّنۡيَا وَمَا نَحۡنُ بِمَبۡعُوثِينَ",
        "phonetic": "6.29 Wa Qālū 'In Hiya 'Illā Ĥayātunā Ad-Dunyā Wa Mā Naĥnu Bimab`ūthīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"There is none but our worldly life, and we will not be resurrected.\"",
            "english_hilali_khan": "And they said: \"There is no (other life) but our (present) life of this world, and never shall we be resurrected (on the Day of Resurrection).\"",
            "english_rwwad": "They say, “There is nothing beyond our life in this world, and we will not be resurrected.”"
        }
    },
    {
        "id": 818,
        "chapter": 6,
        "verse": 30,
        "arabic_text": "وَلَوۡ تَرَىٰٓ إِذۡ وُقِفُواْ عَلَىٰ رَبِّهِمۡۚ قَالَ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۚ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ",
        "phonetic": "6.30 Wa Law Tará 'Idh Wuqifū `Alá Rabbihim Qāla 'Alaysa Hādhā Bil-Ĥaqqi Qālū Balá Wa Rabbinā Qāla Fadhūqū Al-`Adhāba Bimā Kuntum Takfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you could but see when they will be made to stand before their Lord. He will say, \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will [then] say, \"So taste the punishment for what you used to deny.\"",
            "english_hilali_khan": "If you could but see when they will be held (brought and made to stand) in front of their Lord! He will say: \"Is not this (Resurrection and the taking of the accounts) the truth?\" They will say: \"Yes, by our Lord!\" He will then say: \"So taste you the torment because you used not to believe.\"",
            "english_rwwad": "If you could only see when they are made to stand before their Lord. He will say, “Is this not the truth?” They will say, “Yes indeed, by our Lord.” He will say, “So taste the punishment for your disbelief.”"
        }
    },
    {
        "id": 819,
        "chapter": 6,
        "verse": 31,
        "arabic_text": "قَدۡ خَسِرَ ٱلَّذِينَ كَذَّبُواْ بِلِقَآءِ ٱللَّهِۖ حَتَّىٰٓ إِذَا جَآءَتۡهُمُ ٱلسَّاعَةُ بَغۡتَةٗ قَالُواْ يَٰحَسۡرَتَنَا عَلَىٰ مَا فَرَّطۡنَا فِيهَا وَهُمۡ يَحۡمِلُونَ أَوۡزَارَهُمۡ عَلَىٰ ظُهُورِهِمۡۚ أَلَا سَآءَ مَا يَزِرُونَ",
        "phonetic": "6.31 Qad Khasira Al-Ladhīna Kadhabū Biliqā'i Allāhi Ĥattá 'Idhā Jā'at/humu As-Sā`atu Baghtatan Qālū Yā Ĥasratanā `Alá Mā Farraţnā Fīhā Wa Hum Yaĥmilūna 'Awzārahum `Alá Žuhūrihim 'Alā Sā'a Mā Yazirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:31) Narrated Abu Mûsâ رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Whoever loves the Meeting with Allâh, Allâh too loves the Meeting with him; and whoever hates the Meeting with Allâh, Allâh too hates the Meeting with him.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.515).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those will have lost who deny the meeting with Allāh, until when the Hour [of resurrection] comes upon them unexpectedly, they will say, \"Oh, [how great is] our regret over what we neglected concerning it [i.e., the Hour],\" while they bear their burdens [i.e., sins] on their backs. Unquestionably, evil is that which they bear.",
            "english_hilali_khan": "They indeed are losers who denied their Meeting with Allâh,[1] until all of a sudden, the Hour (signs of death) is on them, and they say: \"Alas for us that we gave no thought to it,\" while they will bear their burdens on their backs; and evil indeed are the burdens that they will bear!",
            "english_rwwad": "Losers indeed are those who deny the meeting with Allah, until when the Hour comes upon them by surprise, they will say, “Woe to us for having ignored this!” They will bear their burdens on their backs. Terrible indeed is their burden!"
        }
    },
    {
        "id": 820,
        "chapter": 6,
        "verse": 32,
        "arabic_text": "وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا لَعِبٞ وَلَهۡوٞۖ وَلَلدَّارُ ٱلۡأٓخِرَةُ خَيۡرٞ لِّلَّذِينَ يَتَّقُونَۚ أَفَلَا تَعۡقِلُونَ",
        "phonetic": "6.32 Wa Mā Al-Ĥayāatu Ad-Dunyā 'Illā La`ibun Wa Lahwun Wa Lalddāru Al-'Ākhiratu Khayrun Lilladhīna Yattaqūna 'Afalā Ta`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the worldly life is not but amusement and diversion; but the home of the Hereafter is best for those who fear Allāh, so will you not reason?",
            "english_hilali_khan": "And the life of this world is nothing but play and amusement. But far better is the house in the Hereafter for those who are Al-Muttaqûn (the pious - See V.2:2). Will you not then understand?",
            "english_rwwad": "The life of this world is nothing but play and amusement, but the Home of the Hereafter is far better for those who fear Allah. Do you not then understand?"
        }
    },
    {
        "id": 821,
        "chapter": 6,
        "verse": 33,
        "arabic_text": "قَدۡ نَعۡلَمُ إِنَّهُۥ لَيَحۡزُنُكَ ٱلَّذِي يَقُولُونَۖ فَإِنَّهُمۡ لَا يُكَذِّبُونَكَ وَلَٰكِنَّ ٱلظَّٰلِمِينَ بِـَٔايَٰتِ ٱللَّهِ يَجۡحَدُونَ",
        "phonetic": "6.33 Qad Na`lamu 'Innahu Layaĥzunuka Al-Ladhī Yaqūlūna Fa'innahum Lā Yukadhibūnaka Wa Lakinna Až-Žālimīna Bi'āyāti Allāhi Yajĥadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We know that you, [O Muḥammad], are saddened by what they say. And indeed, they do not call you untruthful, but it is the verses of Allāh that the wrongdoers reject.",
            "english_hilali_khan": "We know indeed the grief which their words cause you (O Muhammad صلى الله عليه وسلم): it is not you that they deny, but it is the Verses (the Qur’ân) of Allâh that the Zâlimûn (polytheists and wrong-doers) deny.",
            "english_rwwad": "We know well that what they say grieves you [O Prophet]. It is not you that they doubt, rather it is the verses of Allah that the wrongdoers deny."
        }
    },
    {
        "id": 822,
        "chapter": 6,
        "verse": 34,
        "arabic_text": "وَلَقَدۡ كُذِّبَتۡ رُسُلٞ مِّن قَبۡلِكَ فَصَبَرُواْ عَلَىٰ مَا كُذِّبُواْ وَأُوذُواْ حَتَّىٰٓ أَتَىٰهُمۡ نَصۡرُنَاۚ وَلَا مُبَدِّلَ لِكَلِمَٰتِ ٱللَّهِۚ وَلَقَدۡ جَآءَكَ مِن نَّبَإِيْ ٱلۡمُرۡسَلِينَ",
        "phonetic": "6.34 Wa Laqad Kudhibat Rusulun Min Qablika Faşabarū `Alá Mā Kudhibū Wa 'Ūdhū Ĥattá 'Atāhum Naşrunā Wa Lā Mubaddila Likalimāti Allāhi Wa Laqad Jā'aka Min Naba'i Al-Mursalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And certainly were messengers denied before you, but they were patient over the denial, and they were harmed until Our victory came to them. And none can alter the words [i.e., decrees] of Allāh. And there has certainly come to you some information about the [previous] messengers.",
            "english_hilali_khan": "Verily, (many) Messengers were denied before you (O Muhammad صلى الله عليه وسلم), but with patience they bore the denial, and they were hurt; till Our Help reached them, and none can alter the Words (Decisions) of Allâh. Surely there has reached you the information (news) about the Messengers (before you).",
            "english_rwwad": "There were messengers rejected before you, but they endured patiently their rejection and persecution until Our help came to them. None can change the words of Allah. You have already received some accounts of those messengers."
        }
    },
    {
        "id": 823,
        "chapter": 6,
        "verse": 35,
        "arabic_text": "وَإِن كَانَ كَبُرَ عَلَيۡكَ إِعۡرَاضُهُمۡ فَإِنِ ٱسۡتَطَعۡتَ أَن تَبۡتَغِيَ نَفَقٗا فِي ٱلۡأَرۡضِ أَوۡ سُلَّمٗا فِي ٱلسَّمَآءِ فَتَأۡتِيَهُم بِـَٔايَةٖۚ وَلَوۡ شَآءَ ٱللَّهُ لَجَمَعَهُمۡ عَلَى ٱلۡهُدَىٰۚ فَلَا تَكُونَنَّ مِنَ ٱلۡجَٰهِلِينَ",
        "phonetic": "6.35 Wa 'In Kāna Kabura `Alayka 'I`rāđuhum Fa'ini Astaţa`ta 'An Tabtaghiya Nafaqāan Fī Al-'Arđi 'Aw Sullamāan Fī As-Samā'i Fata'tiyahum Bi'āyatin Wa Law Shā'a Allāhu Lajama`ahum `Alá Al-Hudá Falā Takūnanna Mina Al-Jāhilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if their evasion is difficult for you, then if you are able to seek a tunnel into the earth or a stairway into the sky to bring them a sign, [then do so]. But if Allāh had willed, He would have united them upon guidance. So never be of the ignorant.",
            "english_hilali_khan": "If their aversion (from you, O Muhammad صلى الله عليه وسلم and from that with which you have been sent) is hard on you, (and you cannot be patient of their harm to you), then if you were able to seek a tunnel in the earth or a ladder to the sky, so that you may bring them a sign (and you cannot do it, so be patient). And had Allâh willed, He could have gathered them together (all) on true guidance, so be not you one of those who are Al-Jâhilûn (the ignorant).",
            "english_rwwad": "If you find their denial hard to bear, then seek – if you can – a tunnel into the earth or a stairway into the sky to bring them a sign. If Allah had willed, He could have brought them all to guidance; so do not be of those who are ignorant."
        }
    },
    {
        "id": 824,
        "chapter": 6,
        "verse": 36,
        "arabic_text": "۞ إِنَّمَا يَسۡتَجِيبُ ٱلَّذِينَ يَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ يَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيۡهِ يُرۡجَعُونَ",
        "phonetic": "6.36 'Innamā Yastajību Al-Ladhīna Yasma`ūna Wa Al-Mawtá Yab`athuhumu Allāhu Thumma 'Ilayhi Yurja`ūna",
        "footnotes": {
            "english_saheeh": "[301]- i.e., the dead of heart, meaning the disbelievers.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Only those who hear will respond. But the dead[301] - Allāh will resurrect them; then to Him they will be returned.",
            "english_hilali_khan": "It is only those who listen (to the Message of Prophet Muhammad صلى الله عليه وسلم), will respond (benefit from it), but as for the dead (i.e. disbelievers), Allâh will raise them up, then to Him they will be returned (for their recompense).",
            "english_rwwad": "Only those who listen will respond. As for the dead, Allah will resurrect them, then to Him they will be returned."
        }
    },
    {
        "id": 825,
        "chapter": 6,
        "verse": 37,
        "arabic_text": "وَقَالُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "6.37 Wa Qālū Lawlā Nuzzila `Alayhi 'Āyatun Min Rabbihi Qul 'Inna Allāha Qādirun `Alá 'An Yunazzila 'Āyatan Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"Why has a sign not been sent down to him from his Lord?\" Say, \"Indeed, Allāh is Able to send down a sign, but most of them do not know.\"",
            "english_hilali_khan": "And they said: \"Why is not a sign sent down to him from his Lord?\" Say: \"Allâh is certainly Able to send down a sign, but most of them know not.\"",
            "english_rwwad": "They say, “Why has no sign been sent down to him from his Lord?” Say, “Allah is Capable to send down a sign,” but most of them do not know [the consequences]."
        }
    },
    {
        "id": 826,
        "chapter": 6,
        "verse": 38,
        "arabic_text": "وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ وَلَا طَٰٓئِرٖ يَطِيرُ بِجَنَاحَيۡهِ إِلَّآ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِي ٱلۡكِتَٰبِ مِن شَيۡءٖۚ ثُمَّ إِلَىٰ رَبِّهِمۡ يُحۡشَرُونَ",
        "phonetic": "6.38 Wa Mā Min Dābbatin Fī Al-'Arđi Wa Lā Ţā'irin Yaţīru Bijanāĥayhi 'Illā 'Umamun 'Amthālukum Mā Farraţnā Fī Al-Kitābi Min Shay'in Thumma 'Ilá Rabbihim Yuĥsharūna",
        "footnotes": {
            "english_saheeh": "[302]- The Preserved Slate (al-Lawḥ al-Maḥfūẓ), in which all things are recorded.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there is no creature on [or within] the earth or bird that flies with its wings except [that they are] communities like you. We have not neglected in the Register[302] a thing. Then unto their Lord they will be gathered.",
            "english_hilali_khan": "There is not a moving (living) creature on earth, nor a bird that flies with its two wings, but are communities like you. We have neglected nothing in the Book, then unto their Lord they (all) shall be gathered.",
            "english_rwwad": "There is no moving creature on earth or a bird flying with its two wings, but are communities like you. We have missed nothing in the Record, then to their Lord they will be gathered."
        }
    },
    {
        "id": 827,
        "chapter": 6,
        "verse": 39,
        "arabic_text": "وَٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا صُمّٞ وَبُكۡمٞ فِي ٱلظُّلُمَٰتِۗ مَن يَشَإِ ٱللَّهُ يُضۡلِلۡهُ وَمَن يَشَأۡ يَجۡعَلۡهُ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
        "phonetic": "6.39 Wa Al-Ladhīna Kadhabū Bi'āyātinā Şummun Wa Bukmun Fī Až-Žulumāti Man Yasha'i Allāhu Yuđlilhu Wa Man Yasha' Yaj`alhu `Alá Şirāţin Mustaqīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who deny Our verses are deaf and dumb within darknesses. Whomever Allāh wills - He sends astray; and whomever He wills - He puts him on a straight path.",
            "english_hilali_khan": "Those who reject Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) are deaf and dumb in the darkness. Allâh sends astray whom He wills and He guides on the Straight Path whom He wills.",
            "english_rwwad": "Those who reject Our verses are deaf and dumb in the depths of darkness. Whomever Allah wills, He causes to stray and whomever He wills, He leads to a straight path."
        }
    },
    {
        "id": 828,
        "chapter": 6,
        "verse": 40,
        "arabic_text": "قُلۡ أَرَءَيۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَيۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "6.40 Qul 'Ara'aytakum 'In 'Atākum `Adhābu Allāhi 'Aw 'Atatkumu As-Sā`atu 'Aghayra Allāhi Tad`ūna 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "[303]- The meaning is understood to be \"Tell me...\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you considered:[303] if there came to you the punishment of Allāh or there came to you the Hour - is it other than Allāh you would invoke, if you should be truthful?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Tell me if Allâh’s Torment comes upon you, or the Hour comes upon you, would you then call upon any one other than Allâh? (Reply) if you are truthful!\"",
            "english_rwwad": "Say, “What do you think, if there comes upon you the punishment of Allah or the Hour comes upon you, would you then call upon anyone other than Allah, if you are truthful?”"
        }
    },
    {
        "id": 829,
        "chapter": 6,
        "verse": 41,
        "arabic_text": "بَلۡ إِيَّاهُ تَدۡعُونَ فَيَكۡشِفُ مَا تَدۡعُونَ إِلَيۡهِ إِن شَآءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ",
        "phonetic": "6.41 Bal 'Īyāhu Tad`ūna Fayakshifu Mā Tad`ūna 'Ilayhi 'In Shā'a Wa Tansawna Mā Tushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "No, it is Him [alone] you would invoke, and He would remove that for which you invoked Him if He willed, and you would forget what you associate [with Him].",
            "english_hilali_khan": "Nay! To Him Alone you would call, and, if He wills, He would remove that (distress) for which you call upon Him, and you would forget at that time whatever partners you joined (with Him in worship)!",
            "english_rwwad": "No, it is Him alone would you call upon. If He willed, He could remove whatever harm made you call upon Him, and you would forget whatever partners you associate with Him.”"
        }
    },
    {
        "id": 830,
        "chapter": 6,
        "verse": 42,
        "arabic_text": "وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَأَخَذۡنَٰهُم بِٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمۡ يَتَضَرَّعُونَ",
        "phonetic": "6.42 Wa Laqad 'Arsalnā 'Ilá 'Umamin Min Qablika Fa'akhadhnāhum Bil-Ba'sā'i Wa Ađ-Đarrā'i La`allahum Yatađarra`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have already sent [messengers] to nations before you, [O Muḥammad]; then We seized them with poverty and hardship that perhaps they might humble themselves [to Us].",
            "english_hilali_khan": "Verily, We sent (Messengers) to many nations before you (O Muhammad صلى الله عليه وسلم). And We seized them with extreme poverty (or loss in wealth) and loss in health (with calamities) so that they might humble themselves (believe with humility).",
            "english_rwwad": "We sent messengers to nations before you and seized them with poverty and hardship, so that they may humble themselves."
        }
    },
    {
        "id": 831,
        "chapter": 6,
        "verse": 43,
        "arabic_text": "فَلَوۡلَآ إِذۡ جَآءَهُم بَأۡسُنَا تَضَرَّعُواْ وَلَٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "6.43 Falawlā 'Idh Jā'ahum Ba'sunā Tađarra`ū Wa Lakin Qasat Qulūbuhum Wa Zayyana Lahumu Ash-Shayţānu Mā Kānū Ya`malūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then why, when Our punishment came to them, did they not humble themselves? But their hearts became hardened, and Satan made attractive to them that which they were doing.",
            "english_hilali_khan": "When Our Torment reached them, why then did they not humble themselves (believe with humility)? But their hearts became hardened, and Shaitân (Satan) made fair-seeming to them that which they used to do.",
            "english_rwwad": "If only they had humbled themselves when Our affliction came upon them, but their hearts were hardened, and Satan made their misdeeds appealing to them."
        }
    },
    {
        "id": 832,
        "chapter": 6,
        "verse": 44,
        "arabic_text": "فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦ فَتَحۡنَا عَلَيۡهِمۡ أَبۡوَٰبَ كُلِّ شَيۡءٍ حَتَّىٰٓ إِذَا فَرِحُواْ بِمَآ أُوتُوٓاْ أَخَذۡنَٰهُم بَغۡتَةٗ فَإِذَا هُم مُّبۡلِسُونَ",
        "phonetic": "6.44 Falammā Nasū Mā Dhukkirū Bihi Fataĥnā `Alayhim 'Abwāba Kulli Shay'in Ĥattá 'Idhā Fariĥū Bimā 'Ūtū 'Akhadhnāhum Baghtatan Fa'idhā Hum Mublisūna",
        "footnotes": {
            "english_saheeh": "[304]- i.e., their trial by poverty and hardship or the warnings of their prophets.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when they forgot that by which they had been reminded,[304] We opened to them the doors of every [good] thing until, when they rejoiced in that which they were given, We seized them suddenly, and they were [then] in despair.",
            "english_hilali_khan": "So, when they forgot (the warning) with which they had been reminded, We opened for them the gates of every (pleasant) thing, until in the midst of their enjoyment in that which they were given, all of a sudden, We took them (in punishment), and lo! They were plunged into destruction with deep regrets and sorrows.",
            "english_rwwad": "When they forgot the reminder that they were given, We opened for them the doors of everything – until when they rejoiced in pride for what they were given, We seized them by surprise, so they fell into utter despair."
        }
    },
    {
        "id": 833,
        "chapter": 6,
        "verse": 45,
        "arabic_text": "فَقُطِعَ دَابِرُ ٱلۡقَوۡمِ ٱلَّذِينَ ظَلَمُواْۚ وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "6.45 Faquţi`a Dābiru Al-Qawmi Al-Ladhīna Žalamū Wa Al-Ĥamdu Lillāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So the people that committed wrong were eliminated. And praise to Allāh, Lord of the worlds.",
            "english_hilali_khan": "So the root of the people who did wrong was cut off. And all the praises and thanks are to Allâh, the Lord of the ‘Âlamîn (mankind, jinn, and all that exists).",
            "english_rwwad": "Then the wrongdoers were totally exterminated. And all praise be to Allah, the Lord of the worlds."
        }
    },
    {
        "id": 834,
        "chapter": 6,
        "verse": 46,
        "arabic_text": "قُلۡ أَرَءَيۡتُمۡ إِنۡ أَخَذَ ٱللَّهُ سَمۡعَكُمۡ وَأَبۡصَٰرَكُمۡ وَخَتَمَ عَلَىٰ قُلُوبِكُم مَّنۡ إِلَٰهٌ غَيۡرُ ٱللَّهِ يَأۡتِيكُم بِهِۗ ٱنظُرۡ كَيۡفَ نُصَرِّفُ ٱلۡأٓيَٰتِ ثُمَّ هُمۡ يَصۡدِفُونَ",
        "phonetic": "6.46 Qul 'Ara'aytum 'In 'Akhadha Allāhu Sam`akum Wa 'Abşārakum Wa Khatama `Alá Qulūbikum Man 'Ilahun Ghayru Allāhi Ya'tīkum Bihi Anžur Kayfa Nuşarrifu Al-'Āyāti Thumma Hum Yaşdifūna",
        "footnotes": {
            "english_saheeh": "[305]- See footnote to verse 40.\n[306]- Repeat in various ways for emphasis and clarification.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you considered:[305] if Allāh should take away your hearing and your sight and set a seal upon your hearts, which deity other than Allāh could bring them [back] to you?\" Look how We diversify[306] the verses; then they [still] turn away.",
            "english_hilali_khan": "Say (to the disbelievers): \"Tell me, if Allâh took away your hearing and your sight, and sealed up your hearts, who is there - an ilâh (a god) other than Allâh who could restore them to you?\" See how variously We explain the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), yet they turn aside.",
            "english_rwwad": "Say, “What do you think, if Allah were to take away your hearing and your sights, and seal up your hearts – which god other than Allah could restore them to you?” See how We diversify the signs, yet they still turn away."
        }
    },
    {
        "id": 835,
        "chapter": 6,
        "verse": 47,
        "arabic_text": "قُلۡ أَرَءَيۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ بَغۡتَةً أَوۡ جَهۡرَةً هَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلظَّٰلِمُونَ",
        "phonetic": "6.47 Qul 'Ara'aytakum 'In 'Atākum `Adhābu Allāhi Baghtatan 'Aw Jahratan Hal Yuhlaku 'Illā Al-Qawmu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "[307]- i.e., before your eyes.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Have you considered: if the punishment of Allāh should come to you unexpectedly or manifestly,[307] will any be destroyed but the wrongdoing people?\"",
            "english_hilali_khan": "Say: \"Tell me, if the punishment of Allâh comes to you suddenly (during the night), or openly (during the day), will any be destroyed except the Zâlimûn (polytheists and wrong-doing people)?\"",
            "english_rwwad": "Say, “What do you think, if the punishment of Allah were to come upon you, suddenly or predictably, who would be destroyed except the wrongdoing people?”"
        }
    },
    {
        "id": 836,
        "chapter": 6,
        "verse": 48,
        "arabic_text": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۖ فَمَنۡ ءَامَنَ وَأَصۡلَحَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ",
        "phonetic": "6.48 Wa Mā Nursilu Al-Mursalīna 'Illā Mubashirīna Wa Mundhirīna Faman 'Āmana Wa 'Aşlaĥa Falā Khawfun `Alayhim Wa Lā Hum Yaĥzanūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We send not the messengers except as bringers of good tidings and warners. So whoever believes and reforms - there will be no fear concerning them, nor will they grieve.",
            "english_hilali_khan": "And We send not the Messengers but as givers of glad tidings and as warners. So whosoever believes and does righteous good deeds, upon such shall come no fear, nor shall they grieve.",
            "english_rwwad": "We do not send the messengers except as bringers of glad tidings and as warners. Those who believe and mend their ways, they will have no fear, nor will they grieve."
        }
    },
    {
        "id": 837,
        "chapter": 6,
        "verse": 49,
        "arabic_text": "وَٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا يَمَسُّهُمُ ٱلۡعَذَابُ بِمَا كَانُواْ يَفۡسُقُونَ",
        "phonetic": "6.49 Wa Al-Ladhīna Kadhabū Bi'āyātinā Yamassuhumu Al-`Adhābu Bimā Kānū Yafsuqūna",
        "footnotes": {
            "english_saheeh": "[308]- i.e., reach and afflict.",
            "english_hilali_khan": "(V.6:49) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who deny Our verses - the punishment will touch[308] them for their defiant disobedience.",
            "english_hilali_khan": "But those who reject Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), the torment will touch them for their disbelief[1] (and for their belying the Message of Muhammad صلى الله عليه وسلم). [Tafsir Al-Qurtubî].",
            "english_rwwad": "But those who reject Our verses, they will be afflicted with the punishment for their evil deeds."
        }
    },
    {
        "id": 838,
        "chapter": 6,
        "verse": 50,
        "arabic_text": "قُل لَّآ أَقُولُ لَكُمۡ عِندِي خَزَآئِنُ ٱللَّهِ وَلَآ أَعۡلَمُ ٱلۡغَيۡبَ وَلَآ أَقُولُ لَكُمۡ إِنِّي مَلَكٌۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُۚ أَفَلَا تَتَفَكَّرُونَ",
        "phonetic": "6.50 Qul Lā 'Aqūlu Lakum `Indī Khazā'inu Allāhi Wa Lā 'A`lamu Al-Ghayba Wa Lā 'Aqūlu Lakum 'Innī Malakun 'In 'Attabi`u 'Illā Mā Yūĥá 'Ilayya Qul Hal Yastawī Al-'A`má Wa Al-Başīru 'Afalā Tatafakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"I do not tell you that I have the depositories [containing the provision] of Allāh or that I know the unseen, nor do I tell you that I am an angel. I only follow what is revealed to me.\" Say, \"Is the blind equivalent to the seeing? Then will you not give thought?\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I don’t tell you that with me are the treasures of Allâh, nor (that) I know the Unseen; nor I tell you that I am an angel. I but follow what is revealed to me.\" Say: \"Are the blind and the one who sees equal? Will you not then take thought?\"",
            "english_rwwad": "Say [O Prophet], “I do not tell you that I have the treasuries of Allah, nor do I know the unseen, nor do I tell you that I am an angel. I only follow what is revealed to me.” Say, “Is the blind equal to the one who can see? Do you not then contemplate?”"
        }
    },
    {
        "id": 839,
        "chapter": 6,
        "verse": 51,
        "arabic_text": "وَأَنذِرۡ بِهِ ٱلَّذِينَ يَخَافُونَ أَن يُحۡشَرُوٓاْ إِلَىٰ رَبِّهِمۡ لَيۡسَ لَهُم مِّن دُونِهِۦ وَلِيّٞ وَلَا شَفِيعٞ لَّعَلَّهُمۡ يَتَّقُونَ",
        "phonetic": "6.51 Wa 'Andhir Bihi Al-Ladhīna Yakhāfūna 'An Yuĥsharū 'Ilá Rabbihim Laysa Lahum Min Dūnihi Wa Līyun Wa Lā Shafī`un La`allahum Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And warn by it [i.e., the Qur’ān] those who fear that they will be gathered before their Lord - for them besides Him will be no protector and no intercessor - that they might become righteous.",
            "english_hilali_khan": "And warn therewith (the Qur’ân) those who fear that they will be gathered before their Lord, when there will be neither a protector nor an intercessor for them besides Him, so that they may fear Allâh and keep their duty to Him (by abstaining from committing sins and by doing all kinds of good deeds which He has ordained).",
            "english_rwwad": "Warn with this [Qur’an] those who fear that they will be gathered before their Lord – having no protector or intercessor other than Him – so that they may become righteous."
        }
    },
    {
        "id": 840,
        "chapter": 6,
        "verse": 52,
        "arabic_text": "وَلَا تَطۡرُدِ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ مَا عَلَيۡكَ مِنۡ حِسَابِهِم مِّن شَيۡءٖ وَمَا مِنۡ حِسَابِكَ عَلَيۡهِم مِّن شَيۡءٖ فَتَطۡرُدَهُمۡ فَتَكُونَ مِنَ ٱلظَّٰلِمِينَ",
        "phonetic": "6.52 Wa Lā Taţrudi Al-Ladhīna Yad`ūna Rabbahum Bil-Ghadāati Wa Al-`Ashīyi Yurīdūna Wajhahu Mā `Alayka Min Ĥisābihim Min Shay'in Wa Mā Min Ĥisābika `Alayhim Min Shay'in Fataţrudahum Fatakūna Mina Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "[309]- No one is held accountable for the deeds or intentions of another.  That is left to Allāh's judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not send away those who call upon their Lord morning and afternoon, seeking His face [i.e., favor]. Not upon you is anything of their account and not upon them is anything of your account.[309] So were you to send them away, you would [then] be of the wrongdoers.",
            "english_hilali_khan": "And turn not away those who invoke their Lord, morning and afternoon seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the Zâlimûn (unjust).",
            "english_rwwad": "Do not send away [O Prophet] those who supplicate their Lord morning and evening, seeking His pleasure. You are not accountable for them whatsoever, nor are they accountable for you whatsoever. If you still send them away, you will be one of the wrongdoers."
        }
    },
    {
        "id": 841,
        "chapter": 6,
        "verse": 53,
        "arabic_text": "وَكَذَٰلِكَ فَتَنَّا بَعۡضَهُم بِبَعۡضٖ لِّيَقُولُوٓاْ أَهَٰٓؤُلَآءِ مَنَّ ٱللَّهُ عَلَيۡهِم مِّنۢ بَيۡنِنَآۗ أَلَيۡسَ ٱللَّهُ بِأَعۡلَمَ بِٱلشَّٰكِرِينَ",
        "phonetic": "6.53 Wa Kadhalika Fatannā Ba`đahum Biba`đin Liyaqūlū 'Ahā'uulā' Manna Allāhu `Alayhim Min Bayninā 'Alaysa Allāhu Bi'a`lama Bish-Shākirīna",
        "footnotes": {
            "english_saheeh": "[310]- Those referred to in verses 52-54 are the poor Muslims who were sincere believers and students of the Prophet (ﷺ).  The influential leaders of Quraysh had disdained to sit with them, saying to Prophet Muḥammad (ﷺ), \"Perhaps if you evicted them, we would follow you.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus We have tried some of them through others that they [i.e., the disbelievers] might say, \"Is it these whom Allāh has favored among us?\" Is not Allāh most knowing of those who are grateful?[310]",
            "english_hilali_khan": "Thus We have tried some of them with others, that they might say: \"Is it these (poor believers) whom Allâh has favoured from amongst us?\" Does not Allâh know best those who are grateful?",
            "english_rwwad": "Thus We have tested some of them by meas of others, so that they may say, “Are these the ones whom Allah has favored among us?” Does Allah not know best those who are grateful?"
        }
    },
    {
        "id": 842,
        "chapter": 6,
        "verse": 54,
        "arabic_text": "وَإِذَا جَآءَكَ ٱلَّذِينَ يُؤۡمِنُونَ بِـَٔايَٰتِنَا فَقُلۡ سَلَٰمٌ عَلَيۡكُمۡۖ كَتَبَ رَبُّكُمۡ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَ أَنَّهُۥ مَنۡ عَمِلَ مِنكُمۡ سُوٓءَۢا بِجَهَٰلَةٖ ثُمَّ تَابَ مِنۢ بَعۡدِهِۦ وَأَصۡلَحَ فَأَنَّهُۥ غَفُورٞ رَّحِيمٞ",
        "phonetic": "6.54 Wa 'Idhā Jā'aka Al-Ladhīna Yu'uminūna Bi'āyātinā Faqul Salāmun `Alaykum Kataba Rabbukum `Alá Nafsihi Ar-Raĥmata 'Annahu Man `Amila Minkum Sū'āan Bijahālatin Thumma Tāba Min Ba`dihi Wa 'Aşlaĥa Fa'annahu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when those come to you who believe in Our verses, say, \"Peace be upon you. Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful.\"",
            "english_hilali_khan": "When those who believe in Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) come to you, say: \"Salâmun ‘Alaikum\" (peace be on you); your Lord has written (prescribed) Mercy for Himself, so that if any of you does evil in ignorance, and thereafter repents and does righteous good deeds (by obeying Allâh), then surely, He is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "When those who believe in Our verses come to you, say, “Peace be upon you. Your Lord has decreed mercy upon Himself; whoever among you commits a sin out of ignorance then repents afterwards and mends his ways, then Allah is indeed All-Forgiving, Most Merciful.”"
        }
    },
    {
        "id": 843,
        "chapter": 6,
        "verse": 55,
        "arabic_text": "وَكَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ وَلِتَسۡتَبِينَ سَبِيلُ ٱلۡمُجۡرِمِينَ",
        "phonetic": "6.55 Wa Kadhalika Nufaşşilu Al-'Āyāti Wa Litastabīna Sabīlu Al-Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus do We detail the verses, and [thus] the way of the criminals will become evident.",
            "english_hilali_khan": "And thus do We explain the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail, that the way of the Mujrimûn (criminals, polytheists, sinners) may become manifest.",
            "english_rwwad": "This is how We explain the verses in detail, so that the way of the evildoers may become known."
        }
    },
    {
        "id": 844,
        "chapter": 6,
        "verse": 56,
        "arabic_text": "قُلۡ إِنِّي نُهِيتُ أَنۡ أَعۡبُدَ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِۚ قُل لَّآ أَتَّبِعُ أَهۡوَآءَكُمۡ قَدۡ ضَلَلۡتُ إِذٗا وَمَآ أَنَا۠ مِنَ ٱلۡمُهۡتَدِينَ",
        "phonetic": "6.56 Qul 'Innī Nuhītu 'An 'A`buda Al-Ladhīna Tad`ūna Min Dūni Allāhi Qul Lā 'Attabi`u 'Ahwā'akum Qad Đalaltu 'Idhāan Wa Mā 'Anā Mina Al-Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, I have been forbidden to worship those you invoke besides Allāh.\" Say, \"I will not follow your desires, for I would then have gone astray, and I would not be of the [rightly] guided.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I have been forbidden to worship those whom you invoke (worship) besides Allâh.\" Say: \"I will not follow your vain desires. If I did, I would go astray, and I would not be one of the rightly guided.\"",
            "english_rwwad": "Say, “I have been forbidden to worship those whom you supplicate besides Allah.” Say, “I do not follow your desires. If I did, I would go astray and I would not be one of those who are guided.”"
        }
    },
    {
        "id": 845,
        "chapter": 6,
        "verse": 57,
        "arabic_text": "قُلۡ إِنِّي عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي وَكَذَّبۡتُم بِهِۦۚ مَا عِندِي مَا تَسۡتَعۡجِلُونَ بِهِۦٓۚ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ يَقُصُّ ٱلۡحَقَّۖ وَهُوَ خَيۡرُ ٱلۡفَٰصِلِينَ",
        "phonetic": "6.57 Qul 'Innī `Alá Bayyinatin Min Rabbī Wa Kadhabtum Bihi Mā `Indī Mā Tasta`jilūna Bihi 'Ini Al-Ĥukmu 'Illā Lillāhi Yaquşşu Al-Ĥaqqa Wa Huwa Khayru Al-Fāşilīna",
        "footnotes": {
            "english_saheeh": "[311]- The disbelievers would challenge the Prophet (ﷺ), telling him to bring on Allāh's punishment if he should be truthful in his warning.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, I am on clear evidence from my Lord, and you have denied it. I do not have that for which you are impatient.[311] The decision is only for Allāh. He relates the truth, and He is the best of deciders.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I am on clear proof from my Lord (Islâmic Monotheism), but you deny it (the truth that has come to me from Allâh). I have not gotten what you are asking for impatiently (the torment). The decision is only for Allâh, He declares the truth, and He is the Best of judges.\"",
            "english_rwwad": "Say [O Prophet], “I am on a clear evidence from my Lord, yet you have denied it. I do not have that [punishment] which you seek to hasten. The decision rests with Allah alone; He tells the truth and He is the Best of Judges.”"
        }
    },
    {
        "id": 846,
        "chapter": 6,
        "verse": 58,
        "arabic_text": "قُل لَّوۡ أَنَّ عِندِي مَا تَسۡتَعۡجِلُونَ بِهِۦ لَقُضِيَ ٱلۡأَمۡرُ بَيۡنِي وَبَيۡنَكُمۡۗ وَٱللَّهُ أَعۡلَمُ بِٱلظَّٰلِمِينَ",
        "phonetic": "6.58 Qul Law 'Anna `Indī Mā Tasta`jilūna Bihi Laquđiya Al-'Amru Baynī Wa Baynakum Wa Allāhu 'A`lamu Biž-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"If I had that for which you are impatient, the matter would have been decided between me and you, but Allāh is most knowing of the wrongdoers.\"",
            "english_hilali_khan": "Say: \"If I had that which you are asking for impatiently (the torment), the matter would have been settled at once between me and you, but Allâh knows best the Zâlimûn (polytheists and wrong-doers).\"",
            "english_rwwad": "Say, “If that which you seek to hasten were within my power, the matter would have already been decided between me and you. But Allah knows best the wrongdoers.”"
        }
    },
    {
        "id": 847,
        "chapter": 6,
        "verse": 59,
        "arabic_text": "۞ وَعِندَهُۥ مَفَاتِحُ ٱلۡغَيۡبِ لَا يَعۡلَمُهَآ إِلَّا هُوَۚ وَيَعۡلَمُ مَا فِي ٱلۡبَرِّ وَٱلۡبَحۡرِۚ وَمَا تَسۡقُطُ مِن وَرَقَةٍ إِلَّا يَعۡلَمُهَا وَلَا حَبَّةٖ فِي ظُلُمَٰتِ ٱلۡأَرۡضِ وَلَا رَطۡبٖ وَلَا يَابِسٍ إِلَّا فِي كِتَٰبٖ مُّبِينٖ",
        "phonetic": "6.59 Wa `Indahu Mafātiĥu Al-Ghaybi Lā Ya`lamuhā 'Illā Huwa Wa Ya`lamu Mā Fī Al-Barri Wa Al-Baĥri Wa Mā Tasquţu Min Waraqatin 'Illā Ya`lamuhā Wa Lā Ĥabbatin Fī Žulumāti Al-'Arđi Wa Lā Raţbin Wa Lā Yā Bisin 'Illā Fī Kitābin Mubīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record.",
            "english_hilali_khan": "And with Him are the keys of the Ghaib (all that is hidden), none knows them but He. And He knows whatever there is in the land and in the sea; not a leaf falls, but he knows it. There is not a grain in the darkness of the earth nor anything fresh or dry, but is written in a Clear Record.",
            "english_rwwad": "He alone has the keys of the unseen; no one knows them except Him. He knows what is in the land and sea. Not a leaf falls without His knowledge, nor a grain in the darkness of the earth, nor anything moist or dry, but is [written] in a Clear Record."
        }
    },
    {
        "id": 848,
        "chapter": 6,
        "verse": 60,
        "arabic_text": "وَهُوَ ٱلَّذِي يَتَوَفَّىٰكُم بِٱلَّيۡلِ وَيَعۡلَمُ مَا جَرَحۡتُم بِٱلنَّهَارِ ثُمَّ يَبۡعَثُكُمۡ فِيهِ لِيُقۡضَىٰٓ أَجَلٞ مُّسَمّٗىۖ ثُمَّ إِلَيۡهِ مَرۡجِعُكُمۡ ثُمَّ يُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "6.60 Wa Huwa Al-Ladhī Yatawaffākum Bil-Layli Wa Ya`lamu Mā Jaraĥtum Bin-Nahāri Thumma Yab`athukum Fīhi Liyuqđá 'Ajalun Musammáan Thumma 'Ilayhi Marji`ukum Thumma Yunabbi'ukum Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[312]- i.e., when you sleep.\n[313]- One's decreed life span.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who takes your souls by night[312] and knows what you have committed by day. Then He revives you therein [i.e., by day] that a specified term[313] may be fulfilled. Then to Him will be your return; then He will inform you about what you used to do.",
            "english_hilali_khan": "It is He Who takes your souls by night (when you are asleep), and has knowledge of all that you have done by day, then He raises (wakes) you up again that a term appointed (your life period) be fulfilled, then (in the end) unto Him will be your return. Then He will inform you of that which you used to do.",
            "english_rwwad": "It is He Who takes your souls by night and knows what you do during daytime, then He raises you up therein so that an appointed term may be fulfilled. Then to Him is your return, and He will inform you of what you used to do."
        }
    },
    {
        "id": 849,
        "chapter": 6,
        "verse": 61,
        "arabic_text": "وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۖ وَيُرۡسِلُ عَلَيۡكُمۡ حَفَظَةً حَتَّىٰٓ إِذَا جَآءَ أَحَدَكُمُ ٱلۡمَوۡتُ تَوَفَّتۡهُ رُسُلُنَا وَهُمۡ لَا يُفَرِّطُونَ",
        "phonetic": "6.61 Wa Huwa Al-Qāhiru Fawqa `Ibādihi Wa Yursilu `Alaykum Ĥafažatan Ĥattá 'Idhā Jā'a 'Aĥadakumu Al-Mawtu Tawaffat/hu Rusulunā Wa Hum Lā Yufarriţūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:61):\na) Whoever intended to do a good deed or a bad deed.\nNarrated Ibn ‘Abbâs رضي الله عنهما: The Prophet صلى الله عليه وسلم narrating about his Lord عز وجل said, \"Allâh ordered (the appointed angels over you) that the good and the bad deeds be written, and He then showed (the way) how (to write). If somebody intends to do a good deed and he does not do it, then Allâh will write for him a full good deed (in his account with Him); and if he intends to do a good deed and actually did it, then Allâh will write for him (in his account) with Him (its reward equal) from ten to seven hundred times, to many more times: and if somebody intended to do a bad deed and he does not do it, then Allâh will write a full good deed (in his account) with Him, and if he intended to do it (a bad deed) and actually did it, then Allâh will write one bad deed (in his account).\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.498).\nb) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Angels come (to you) in succession by night and day, and all of them get together at the time of Fajr and ‘Asr prayers. Then those who have stayed with you overnight, ascend unto Allâh Who asks them (and He knows the answer better than they): \"How have you left My slaves?\" They reply, \"We left them while they were praying and we came to them while they were praying.\" The Prophet صلى الله عليه وسلم added: \"If anyone of you says Amîn (during the prayer at the end of the recitation of Sûrat Al-Fâtihah), and the angels in heaven say the same, and the two sayings coincide, all his past sins will be forgiven.\" (Sahih Al-Bukhâri, Vol.4, Hadîth No. 446)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He is the subjugator over His servants, and He sends over you guardian-angels until, when death comes to one of you, Our messengers [i.e., angels of death] take him, and they do not fail [in their duties].",
            "english_hilali_khan": "He is the Irresistible, (Supreme) over His slaves, and He sends guardians (angels guarding and writing all of one’s good and bad deeds) over you,[1] until when death approaches one of you, Our Messengers (angel of death and his assistants) take his soul, and they never neglect their duty.",
            "english_rwwad": "He is the Subjugator over His servants and sends over you recording-angels until when death comes upon one of you, Our angels take his soul, and they never fall short in their duty."
        }
    },
    {
        "id": 850,
        "chapter": 6,
        "verse": 62,
        "arabic_text": "ثُمَّ رُدُّوٓاْ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۚ أَلَا لَهُ ٱلۡحُكۡمُ وَهُوَ أَسۡرَعُ ٱلۡحَٰسِبِينَ",
        "phonetic": "6.62 Thumma Ruddū 'Ilá Allāhi Mawlāhumu Al-Ĥaqqi 'Alā Lahu Al-Ĥukmu Wa Huwa 'Asra`u Al-Ĥāsibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then they [i.e., His servants] are returned to Allāh, their true Lord. Unquestionably, His is the judgement, and He is the swiftest of accountants.",
            "english_hilali_khan": "Then they are returned to Allâh, their True Maulâ [True Master (God), the Just Lord (to reward them)]. Surely, for Him is the judgement and He is the Swiftest in taking account.",
            "english_rwwad": "Then they will be returned to Allah, their true Lord. Indeed, judgment belongs to Him alone, and He is the Swiftest Reckoner."
        }
    },
    {
        "id": 851,
        "chapter": 6,
        "verse": 63,
        "arabic_text": "قُلۡ مَن يُنَجِّيكُم مِّن ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ تَدۡعُونَهُۥ تَضَرُّعٗا وَخُفۡيَةٗ لَّئِنۡ أَنجَىٰنَا مِنۡ هَٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
        "phonetic": "6.63 Qul Man Yunajjīkum Min Žulumāti Al-Barri Wa Al-Baĥri Tad`ūnahu Tađarru`āan Wa Khufyatan La'in 'Anjānā Min Hadhihi Lanakūnanna Mina Ash-Shākirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Who rescues you from the darknesses of the land and sea [when] you call upon Him imploring [aloud] and privately, 'If He should save us from this [crisis], we will surely be among the thankful.'\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Who rescues you from the darkness of the land and the sea (dangers like storms), (when) you call upon Him in humility and in secret (saying): If He (Allâh) only saves us from this (danger), we shall truly be grateful.\"",
            "english_rwwad": "Say, “Who rescues you from the darkness of the land and sea? You invoke Him humbly and privately, ‘If only He rescues us from this, we will certainly be among those who are grateful.’”"
        }
    },
    {
        "id": 852,
        "chapter": 6,
        "verse": 64,
        "arabic_text": "قُلِ ٱللَّهُ يُنَجِّيكُم مِّنۡهَا وَمِن كُلِّ كَرۡبٖ ثُمَّ أَنتُمۡ تُشۡرِكُونَ",
        "phonetic": "6.64 Quli Allāhu Yunajjīkum Minhā Wa Min Kulli Karbin Thumma 'Antum Tushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"It is Allāh who saves you from it and from every distress; then you [still] associate others with Him.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Allâh rescues you from this and from all (other) distresses, and yet you worship others besides Allâh.\"",
            "english_rwwad": "Say, “Allah rescues you from it and from every distress, yet you associate partners with Him.”"
        }
    },
    {
        "id": 853,
        "chapter": 6,
        "verse": 65,
        "arabic_text": "قُلۡ هُوَ ٱلۡقَادِرُ عَلَىٰٓ أَن يَبۡعَثَ عَلَيۡكُمۡ عَذَابٗا مِّن فَوۡقِكُمۡ أَوۡ مِن تَحۡتِ أَرۡجُلِكُمۡ أَوۡ يَلۡبِسَكُمۡ شِيَعٗا وَيُذِيقَ بَعۡضَكُم بَأۡسَ بَعۡضٍۗ ٱنظُرۡ كَيۡفَ نُصَرِّفُ ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَفۡقَهُونَ",
        "phonetic": "6.65 Qul Huwa Al-Qādiru `Alá 'An Yab`atha `Alaykum `Adhābāan Min Fawqikum 'Aw Min Taĥti 'Arjulikum 'Aw Yalbisakum Shiya`āan Wa Yudhīqa Ba`đakum Ba'sa Ba`đin Anžur Kayfa Nuşarrifu Al-'Āyāti La`allahum Yafqahūna",
        "footnotes": {
            "english_saheeh": "[314]- Following your own inclinations rather than the truth, biased and hostile toward each other.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"He is the [one] Able to send upon you affliction from above you or from beneath your feet or to confuse you [so you become] sects[314] and make you taste the violence of one another.\" Look how We diversify the signs that they might understand.",
            "english_hilali_khan": "Say: \"He has power to send torment on you from above or from under your feet, or to cover you with confusion in party strife, and make you to taste the violence of one another.\" See how variously We explain the Ayât (proofs, evidence, lessons, signs, revelations, etc.), so that they may understand.",
            "english_rwwad": "Say, “He is Capable to send a punishment from above you or from beneath your feet, or split you into factions, and make you suffer at the hands of one another.” See how We diversify the signs, so that they may understand."
        }
    },
    {
        "id": 854,
        "chapter": 6,
        "verse": 66,
        "arabic_text": "وَكَذَّبَ بِهِۦ قَوۡمُكَ وَهُوَ ٱلۡحَقُّۚ قُل لَّسۡتُ عَلَيۡكُم بِوَكِيلٖ",
        "phonetic": "6.66 Wa Kadhaba Bihi Qawmuka Wa Huwa Al-Ĥaqqu Qul Lastu `Alaykum Biwakīlin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But your people have denied it while it is the truth. Say, \"I am not over you a manager [i.e., authority].\"",
            "english_hilali_khan": "But your people (O Muhammad صلى الله عليه وسلم) have denied it (the Qur’ân) though it is the truth. Say: \"I am not a Wakîl (guardian) over you.\"",
            "english_rwwad": "But your people [O Prophet] have rejected this [Qur’an] although it is the truth. Say, “I am not a keeper over you."
        }
    },
    {
        "id": 855,
        "chapter": 6,
        "verse": 67,
        "arabic_text": "لِّكُلِّ نَبَإٖ مُّسۡتَقَرّٞۚ وَسَوۡفَ تَعۡلَمُونَ",
        "phonetic": "6.67 Likulli Naba'iin Mustaqarrun Wa Sawfa Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[315]- Other shades of meaning include \"a permanence,\" \"a realization\" and \"a time of stability.\"",
            "english_hilali_khan": "(V.6:67): i.e. for everything there is an appointed term, and for every deed there is a recompense.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For every news [i.e., happening] is a finality;[315] and you are going to know.",
            "english_hilali_khan": "For every news there is a reality[2] and you will come to know.",
            "english_rwwad": "Every matter has an appointed time, and you will soon come to know."
        }
    },
    {
        "id": 856,
        "chapter": 6,
        "verse": 68,
        "arabic_text": "وَإِذَا رَأَيۡتَ ٱلَّذِينَ يَخُوضُونَ فِيٓ ءَايَٰتِنَا فَأَعۡرِضۡ عَنۡهُمۡ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيۡرِهِۦۚ وَإِمَّا يُنسِيَنَّكَ ٱلشَّيۡطَٰنُ فَلَا تَقۡعُدۡ بَعۡدَ ٱلذِّكۡرَىٰ مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
        "phonetic": "6.68 Wa 'Idhā Ra'ayta Al-Ladhīna Yakhūđūna Fī 'Āyātinā Fa'a`riđ `Anhum Ĥattá Yakhūđū Fī Ĥadīthin Ghayrihi Wa 'Immā Yunsiyannaka Ash-Shayţānu Falā Taq`ud Ba`da Adh-Dhikrá Ma`a Al-Qawmi Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "[316]- i.e., denials or mockery.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when you see those who engage in [offensive] discourse[316] concerning Our verses, then turn away from them until they enter into another conversation. And if Satan should cause you to forget, then do not remain after the reminder with the wrongdoing people.",
            "english_hilali_khan": "And when you (Muhammad صلى الله عليه وسلم) see those who engage in a false conversation about Our Verses (of the Qur’ân) by mocking at them, stay away from them till they turn to another topic. And if Shaitân (Satan) causes you to forget, then after the remembrance sit not you in the company of those people who are the Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "When you see those who ridicule Our verses, turn away from them until they engage in another discourse. If Satan should make you forget, then as soon as you remember, do not remain with the wrongdoing people."
        }
    },
    {
        "id": 857,
        "chapter": 6,
        "verse": 69,
        "arabic_text": "وَمَا عَلَى ٱلَّذِينَ يَتَّقُونَ مِنۡ حِسَابِهِم مِّن شَيۡءٖ وَلَٰكِن ذِكۡرَىٰ لَعَلَّهُمۡ يَتَّقُونَ",
        "phonetic": "6.69 Wa Mā `Alá Al-Ladhīna Yattaqūna Min Ĥisābihim Min Shay'in Wa Lakin Dhikrá La`allahum Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who fear Allāh are not held accountable for them [i.e., the disbelievers] at all, but [only for] a reminder - that perhaps they will fear Him.",
            "english_hilali_khan": "Those who fear Allâh, keep their duty to Him and avoid evil are not responsible for them (the disbelievers) in any case, but (their duty) is to remind them, that they may fear Allah (and refrain from mocking at the Qur’ân). [The provision of this Verse was abrogated by the Verse 4:140].",
            "english_rwwad": "Those who fear Allah are in no way accountable for them; their duty is only to remind, so that they may abstain [from mockery]."
        }
    },
    {
        "id": 858,
        "chapter": 6,
        "verse": 70,
        "arabic_text": "وَذَرِ ٱلَّذِينَ ٱتَّخَذُواْ دِينَهُمۡ لَعِبٗا وَلَهۡوٗا وَغَرَّتۡهُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ وَذَكِّرۡ بِهِۦٓ أَن تُبۡسَلَ نَفۡسُۢ بِمَا كَسَبَتۡ لَيۡسَ لَهَا مِن دُونِ ٱللَّهِ وَلِيّٞ وَلَا شَفِيعٞ وَإِن تَعۡدِلۡ كُلَّ عَدۡلٖ لَّا يُؤۡخَذۡ مِنۡهَآۗ أُوْلَٰٓئِكَ ٱلَّذِينَ أُبۡسِلُواْ بِمَا كَسَبُواْۖ لَهُمۡ شَرَابٞ مِّنۡ حَمِيمٖ وَعَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡفُرُونَ",
        "phonetic": "6.70 Wa Dhari Al-Ladhīna Attakhadhū Dīnahum La`ibāan Wa Lahwan Wa Gharrat/humu Al-Ĥayāatu Ad-Dunyā Wa Dhakkir Bihi 'An Tubsala Nafsun Bimā Kasabat Laysa Lahā Min Dūni Allāhi Wa Līyun Wa Lā Shafī`un Wa 'In Ta`dil Kulla `Adlin Lā Yu'ukhadh Minhā 'Ūlā'ika Al-Ladhīna 'Ubsilū Bimā Kasabū Lahum Sharābun Min Ĥamīmin Wa `Adhābun 'Alīmun Bimā Kānū Yakfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And leave those who take their religion as amusement and diversion and whom the worldly life has deluded. But remind with it [i.e., the Qur’ān], lest a soul be given up to destruction for what it earned; it will have other than Allāh no protector and no intercessor. And if it should offer every compensation, it would not be taken from it [i.e., that soul]. Those are the ones who are given to destruction for what they have earned. For them will be a drink of scalding water and a painful punishment because they used to disbelieve.",
            "english_hilali_khan": "And leave alone those who take their religion as play and amusement, and whom the life of this world has deceived. But remind (them) with it (the Qur’ân) lest a person be given up to destruction for that which he has earned, when he will find for himself no protector or intercessor besides Allâh, and even if he offers every ransom, it will not be accepted from him. Such are they who are given up to destruction because of that which they have earned. For them will be a drink of boiling water and a painful torment because they used to disbelieve.",
            "english_rwwad": "Leave those who take their religion as play and amusement, and are deluded by the life of this world. But admonish them with this [Qur’an], so no soul should be ruined for its misdeeds – having no protector or intercessor other than Allah. Even if they were to offer every form of ransom, it will not be accepted. Such are the ones who will be ruined for their misdeeds. They will have scalding water to drink and a painful punishment for their disbelief."
        }
    },
    {
        "id": 859,
        "chapter": 6,
        "verse": 71,
        "arabic_text": "قُلۡ أَنَدۡعُواْ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُنَا وَلَا يَضُرُّنَا وَنُرَدُّ عَلَىٰٓ أَعۡقَابِنَا بَعۡدَ إِذۡ هَدَىٰنَا ٱللَّهُ كَٱلَّذِي ٱسۡتَهۡوَتۡهُ ٱلشَّيَٰطِينُ فِي ٱلۡأَرۡضِ حَيۡرَانَ لَهُۥٓ أَصۡحَٰبٞ يَدۡعُونَهُۥٓ إِلَى ٱلۡهُدَى ٱئۡتِنَاۗ قُلۡ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلۡهُدَىٰۖ وَأُمِرۡنَا لِنُسۡلِمَ لِرَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "6.71 Qul 'Anad`ū Min Dūni Allāhi Mā Lā Yanfa`unā Wa Lā Yađurrunā Wa Nuraddu `Alá 'A`qābinā Ba`da 'Idh Hadānā Allāhu Kālladhī Astahwat/hu Ash-Shayāţīnu Fī Al-'Arđi Ĥayrāna Lahu 'Aşĥābun Yad`ūnahu 'Ilá Al-Hudá A'tinā Qul 'Inna Hudá Allāhi Huwa Al-Hudá Wa 'Umirnā Linuslima Lirabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[317]- i.e., worship.\n[318]- The example given is of one who has lost his way and is further confused by the evil ones who tempt him to follow various directions, all leading to destruction.  Although his sincere friends call him back to the right path, he ignores them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Shall we invoke[317] instead of Allāh that which neither benefits us nor harms us and be turned back on our heels after Allāh has guided us? [We would then be] like one whom the devils enticed [to wander] upon the earth confused, [while] he has companions inviting him to guidance, [calling], 'Come to us.'\"[318] Say, \"Indeed, the guidance of Allāh is the [only] guidance; and we have been commanded to submit to the Lord of the worlds.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Shall we invoke others besides Allâh (false deities), that can do us neither good nor harm, and shall we turn back on our heels after Allâh has guided us (to true Monotheism)? - like one whom the Shayâtîn (devils) have made to go astray in the land in confusion, his companions calling him to guidance (saying): ‘Come to us.’ \" Say: \"Verily, Allâh’s Guidance is the only guidance, and we have been commanded to submit (ourselves) to the Lord of the ‘Âlamîn (mankind, jinn and all that exists);",
            "english_rwwad": "Say, “Shall we invoke besides Allah that which can neither benefit nor harm us, and shall we turn back to disbelief after being guided by Allah? Just like the one whom devils have tempted in the land leaving him bewildered, although he has companions inviting him to guidance, “Come to us.” Say, “Allah’s guidance is the [true] guidance, and we are commanded to submit to the Lord of the worlds,"
        }
    },
    {
        "id": 860,
        "chapter": 6,
        "verse": 72,
        "arabic_text": "وَأَنۡ أَقِيمُواْ ٱلصَّلَوٰةَ وَٱتَّقُوهُۚ وَهُوَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ",
        "phonetic": "6.72 Wa 'An 'Aqīmū Aş-Şalāata Wa Attaqūhu Wa Huwa Al-Ladhī 'Ilayhi Tuĥsharūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to establish prayer and fear Him.\" And it is He to whom you will be gathered.",
            "english_hilali_khan": "And to perform As-Salât (Iqâmat-as-Salât), and to be obedient to Allâh and fear Him, and it is He to Whom you shall be gathered.",
            "english_rwwad": "and to establish prayer and fear Him, for it is He to Whom you will all be gathered."
        }
    },
    {
        "id": 861,
        "chapter": 6,
        "verse": 73,
        "arabic_text": "وَهُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۖ وَيَوۡمَ يَقُولُ كُن فَيَكُونُۚ قَوۡلُهُ ٱلۡحَقُّۚ وَلَهُ ٱلۡمُلۡكُ يَوۡمَ يُنفَخُ فِي ٱلصُّورِۚ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۚ وَهُوَ ٱلۡحَكِيمُ ٱلۡخَبِيرُ",
        "phonetic": "6.73 Wa Huwa Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Bil-Ĥaqqi Wa Yawma Yaqūlu Kun Fayakūnu Qawluhu Al-Ĥaqqu Wa Lahu Al-Mulku Yawma Yunfakhu Fī Aş-Şūri `Ālimu Al-Ghaybi Wa Ash-Shahādati Wa Huwa Al-Ĥakīmu Al-Khabīr",
        "footnotes": {
            "english_saheeh": "[319]- When interpreted as the \"Day\" (of resurrection), the sentence would read:  \"And the Day He says, 'Be,' and it is, His word will be the truth.\"\n[320]- That which is absent, invisible, or beyond the perception of the senses or of the mind and therefore is unknown to man, except for what Allāh chooses to reveal.\n[321]- What is present, visible and known to man.  The knowledge of Allāh (subḥānahu wa taʿālā) includes the reality of all things and all occurrences, no matter how they might appear to human beings.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who created the heavens and earth in truth. And the day [i.e., whenever] He says, \"Be,\" and it is, His word is the truth.[319] And His is the dominion [on] the Day the Horn is blown. [He is] Knower of the unseen[320] and the witnessed;[321] and He is the Wise, the Aware.",
            "english_hilali_khan": "It is He Who has created the heavens and the earth in truth, and on the Day (i.e. the Day of Resurrection) He will say: \"Be!\", - and it is! His Word is the Truth. His will be the dominion on the Day when the Trumpet will be blown. All-Knower of the unseen and the seen. He is the All-Wise, Well-Aware (of all things).",
            "english_rwwad": "It is He Who created the heavens and earth for a true purpose. On the Day [of Resurrection] He will say, “Be,” and it will be. His word is the truth. His is the dominion on the Day the Trumpet will be blown. He is the Knower of the unseen and the seen, and He is the All-Wise, the All-Aware.”"
        }
    },
    {
        "id": 862,
        "chapter": 6,
        "verse": 74,
        "arabic_text": "۞ وَإِذۡ قَالَ إِبۡرَٰهِيمُ لِأَبِيهِ ءَازَرَ أَتَتَّخِذُ أَصۡنَامًا ءَالِهَةً إِنِّيٓ أَرَىٰكَ وَقَوۡمَكَ فِي ضَلَٰلٖ مُّبِينٖ",
        "phonetic": "6.74 Wa 'Idh Qāla 'Ibrāhīmu Li'abīhi 'Āzara 'Atattakhidhu 'Aşnāmāan 'Ālihatan 'Innī 'Arāka Wa Qawmaka Fī Đalālin Mubīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:74) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"On the Day of Resurrection Ibrâhîm (Abraham) will meet his father Âzar whose face will be dark and covered with dust. (The Prophet) Ibrâhîm (Abraham) will say (to him): ‘Didn’t I tell you not to disobey me?’ His father will reply: ‘Today I will not disobey you.’ Ibrâhîm (Abraham) will say: ‘O Lord! You promised me not to disgrace me on the Day of Resurrection; and what will be more disgraceful to me than cursing and dishonouring my father?’ Then Allâh تعالى will say (to him): ‘I have forbidden Paradise for the disbelievers.’ Then he will be addressed, ‘O Ibrâhîm (Abraham)! Look! What is underneath your feet?’ He will look and there he will see a Dhîkh (Hyena,) blood-stained, which will be caught by the legs and thrown in the (Hell) Fire.\" (Sahih Al-Bukhâri, Vol.4, Hadîth No.569).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention, O Muḥammad], when Abraham said to his father Āzar, \"Do you take idols as deities? Indeed, I see you and your people to be in manifest error.\"",
            "english_hilali_khan": "And (remember) when Ibrâhîm (Abraham) said to his father Âzar: \"Do you take idols as âlihah (gods)? Verily, I see you and your people in manifest error.[1]\"",
            "english_rwwad": "And [remember] when Abraham said to his father, Āzar, “Do you take idols as gods? I see that you and your people are clearly misguided.”"
        }
    },
    {
        "id": 863,
        "chapter": 6,
        "verse": 75,
        "arabic_text": "وَكَذَٰلِكَ نُرِيٓ إِبۡرَٰهِيمَ مَلَكُوتَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلِيَكُونَ مِنَ ٱلۡمُوقِنِينَ",
        "phonetic": "6.75 Wa Kadhalika Nurī 'Ibrāhīma Malakūta As-Samāwāti Wa Al-'Arđi Wa Liyakūna Mina Al-Mūqinīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus did We show Abraham the realm of the heavens and the earth that he would be among the certain [in faith].",
            "english_hilali_khan": "Thus did we show Ibrâhîm (Abraham) the kingdom of the heavens and the earth that he be one of those who have Faith with certainty.",
            "english_rwwad": "Thus We showed Abraham the dominion of the heavens and earth, so that he would be of those who have certain faith."
        }
    },
    {
        "id": 864,
        "chapter": 6,
        "verse": 76,
        "arabic_text": "فَلَمَّا جَنَّ عَلَيۡهِ ٱلَّيۡلُ رَءَا كَوۡكَبٗاۖ قَالَ هَٰذَا رَبِّيۖ فَلَمَّآ أَفَلَ قَالَ لَآ أُحِبُّ ٱلۡأٓفِلِينَ",
        "phonetic": "6.76 Falammā Janna `Alayhi Al-Laylu Ra'á Kawkabāan Qāla Hādhā Rabbī Falammā 'Afala Qāla Lā 'Uĥibbu Al-'Āfilīna",
        "footnotes": {
            "english_saheeh": "[322]- In verses 76-79, beginning from the people's own assertions, Abraham presents a picture of his dissatisfaction as the only logical conclusion one could reach, in order to show them the futility of their false objects of worship.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when the night covered him [with darkness], he saw a star. He said, \"This is my lord.\"[322] But when it set, he said, \"I like not those that set [i.e., disappear].\"",
            "english_hilali_khan": "When the night covered him over with darkness he saw a star. He said: \"This is my lord.\" But when it set, he said: \"I like not those that set.\"",
            "english_rwwad": "When the night grew dark upon him, he saw a star and said, “This is my Lord.” But when it set, he said, “I do not like those that set.”"
        }
    },
    {
        "id": 865,
        "chapter": 6,
        "verse": 77,
        "arabic_text": "فَلَمَّا رَءَا ٱلۡقَمَرَ بَازِغٗا قَالَ هَٰذَا رَبِّيۖ فَلَمَّآ أَفَلَ قَالَ لَئِن لَّمۡ يَهۡدِنِي رَبِّي لَأَكُونَنَّ مِنَ ٱلۡقَوۡمِ ٱلضَّآلِّينَ",
        "phonetic": "6.77 Falammā Ra'á Al-Qamara Bāzighāan Qāla Hādhā Rabbī Falammā 'Afala Qāla La'in Lam Yahdinī Rabbī La'akūnanna Mina Al-Qawmi Ađ-Đāllīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he saw the moon rising, he said, \"This is my lord.\" But when it set, he said, \"Unless my Lord guides me, I will surely be among the people gone astray.\"",
            "english_hilali_khan": "When he saw the moon rising up, he said: \"This is my lord.\" But when it set, he said: \"Unless my Lord guides me, I shall surely be among the people who went astray.\"",
            "english_rwwad": "Then when he saw the moon rising, he said, “This is my Lord.” But when it set, he said, “Unless my Lord guides me, I will surely be among the misguided people.”"
        }
    },
    {
        "id": 866,
        "chapter": 6,
        "verse": 78,
        "arabic_text": "فَلَمَّا رَءَا ٱلشَّمۡسَ بَازِغَةٗ قَالَ هَٰذَا رَبِّي هَٰذَآ أَكۡبَرُۖ فَلَمَّآ أَفَلَتۡ قَالَ يَٰقَوۡمِ إِنِّي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ",
        "phonetic": "6.78 Falammā Ra'á Ash-Shamsa Bāzighatan Qāla Hādhā Rabbī Hādhā 'Akbaru Falammā 'Afalat Qāla Yā Qawmi 'Innī Barī'un Mimmā Tushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when he saw the sun rising, he said, \"This is my lord; this is greater.\" But when it set, he said, \"O my people, indeed I am free from what you associate with Allāh.",
            "english_hilali_khan": "When he saw the sun rising up, he said: \"This is my lord. This is greater.\" But when it set, he said: \"O my people! I am indeed free from all that you join as partners (in worship with Allâh).",
            "english_rwwad": "Then when he saw the sun rising, he said, “This is my Lord; this is greater.” But when it set, he said, “O my people, I disown all what you associate with Allah."
        }
    },
    {
        "id": 867,
        "chapter": 6,
        "verse": 79,
        "arabic_text": "إِنِّي وَجَّهۡتُ وَجۡهِيَ لِلَّذِي فَطَرَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ حَنِيفٗاۖ وَمَآ أَنَا۠ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "6.79 'Innī Wajjahtu Wajhiya Lilladhī Faţara As-Samāwāti Wa Al-'Arđa Ĥanīfāan Wa Mā 'Anā Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, I have turned my face [i.e., self] toward He who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allāh.\"",
            "english_hilali_khan": "Verily, I have turned my face towards Him Who has created the heavens and the earth Hanîfa (Islâmic Monotheism, i.e. worshipping none but Allâh Alone), and I am not of Al-Mushrikûn (See V.2:105)\".",
            "english_rwwad": "I turn my face towards the One Who originated the heavens and earth, inclining to true faith, and I am not one of those who associate partners with Allah.”"
        }
    },
    {
        "id": 868,
        "chapter": 6,
        "verse": 80,
        "arabic_text": "وَحَآجَّهُۥ قَوۡمُهُۥۚ قَالَ أَتُحَٰٓجُّوٓنِّي فِي ٱللَّهِ وَقَدۡ هَدَىٰنِۚ وَلَآ أَخَافُ مَا تُشۡرِكُونَ بِهِۦٓ إِلَّآ أَن يَشَآءَ رَبِّي شَيۡـٔٗاۚ وَسِعَ رَبِّي كُلَّ شَيۡءٍ عِلۡمًاۚ أَفَلَا تَتَذَكَّرُونَ",
        "phonetic": "6.80 Wa Ĥājjahu Qawmuhu Qāla 'Atuĥājjūnī Fī Allāhi Wa Qad Hadāni Wa Lā 'Akhāfu Mā Tushrikūna Bihi 'Illā 'An Yashā'a Rabbī Shay'āan Wasi`a Rabbī Kulla Shay'in `Ilmāan 'Afalā Tatadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And his people argued with him. He said, \"Do you argue with me concerning Allāh while He has guided me? And I fear not what you associate with Him [and will not be harmed] unless my Lord should will something. My Lord encompasses all things in knowledge; then will you not remember?",
            "english_hilali_khan": "His people disputed with him. He said: \"Do you dispute with me concerning Allâh while He has guided me, and I fear not those whom you associate with Him (Allâh) in worship. (Nothing can happen to me) except when my Lord (Allâh) wills something. My Lord comprehends in His Knowledge all things. Will you not then remember?",
            "english_rwwad": "His people argued with him. He said, “Do you argue with me concerning Allah, when He has guided me? I do not fear what you associate with Him, [none can harm me] except what my Lord wills. My Lord encompasses everything in His knowledge. Will you not then take heed?"
        }
    },
    {
        "id": 869,
        "chapter": 6,
        "verse": 81,
        "arabic_text": "وَكَيۡفَ أَخَافُ مَآ أَشۡرَكۡتُمۡ وَلَا تَخَافُونَ أَنَّكُمۡ أَشۡرَكۡتُم بِٱللَّهِ مَا لَمۡ يُنَزِّلۡ بِهِۦ عَلَيۡكُمۡ سُلۡطَٰنٗاۚ فَأَيُّ ٱلۡفَرِيقَيۡنِ أَحَقُّ بِٱلۡأَمۡنِۖ إِن كُنتُمۡ تَعۡلَمُونَ",
        "phonetic": "6.81 Wa Kayfa 'Akhāfu Mā 'Ashraktum Wa Lā Takhāfūna 'Annakum 'Ashraktum Billāhi Mā Lam Yunazzil Bihi `Alaykum Sulţānāan Fa'ayyu Al-Farīqayni 'Aĥaqqu Bil-'Amni 'In Kuntum Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how should I fear what you associate while you do not fear that you have associated with Allāh that for which He has not sent down to you any authority? So which of the two parties has more right to security, if you should know?\"",
            "english_hilali_khan": "\"And how should I fear those whom you associate in worship with Allâh (though they can neither benefit nor harm), while you fear not that you have joined in worship with Allâh things for which He has not sent down to you any authority. (So) which of the two parties has more right to be in security? If you but know.\"",
            "english_rwwad": "Why should I fear what you associate with Him, when you do not fear that you associate with Allah for which He has not sent down any authority? So which of the two parties has more right to feel secure, if you really know?"
        }
    },
    {
        "id": 870,
        "chapter": 6,
        "verse": 82,
        "arabic_text": "ٱلَّذِينَ ءَامَنُواْ وَلَمۡ يَلۡبِسُوٓاْ إِيمَٰنَهُم بِظُلۡمٍ أُوْلَٰٓئِكَ لَهُمُ ٱلۡأَمۡنُ وَهُم مُّهۡتَدُونَ",
        "phonetic": "6.82 Al-Ladhīna 'Āmanū Wa Lam Yalbisū 'Īmānahum Bižulmin 'Ūlā'ika Lahumu Al-'Amnu Wa Hum Muhtadūna",
        "footnotes": {
            "english_saheeh": "[323]- Specifically, the association of others in divinity with Allāh.",
            "english_hilali_khan": "(V.6:82): See the footnote (C) of (V.27:59).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They who believe and do not mix their belief with injustice[323] - those will have security, and they are [rightly] guided.",
            "english_hilali_khan": "It is those who believe (in the Oneness of Allâh and worship none but Him Alone) and confuse not their belief with Zulm (wrong i.e. by worshipping others besides Allâh), for them (only) there is security and they are the guided.[1]",
            "english_rwwad": "Those who believe and do not mix their faith with falsehood are the ones who will be secure, and it is they who are rightly guided."
        }
    },
    {
        "id": 871,
        "chapter": 6,
        "verse": 83,
        "arabic_text": "وَتِلۡكَ حُجَّتُنَآ ءَاتَيۡنَٰهَآ إِبۡرَٰهِيمَ عَلَىٰ قَوۡمِهِۦۚ نَرۡفَعُ دَرَجَٰتٖ مَّن نَّشَآءُۗ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٞ",
        "phonetic": "6.83 Wa Tilka Ĥujjatunā 'Ātaynāhā 'Ibrāhīma `Alá Qawmihi Narfa`u Darajātin Man Nashā'u 'Inna Rabbaka Ĥakīmun `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And that was Our [conclusive] argument which We gave Abraham against his people. We raise by degrees whom We will. Indeed, your Lord is Wise and Knowing.",
            "english_hilali_khan": "And that was Our Proof which We gave Ibrâhîm (Abraham) against his people. We raise whom We will in degrees. Certainly your Lord is All-Wise, All-Knowing.",
            "english_rwwad": "That was Our argument which We gave Abraham against his people. We elevate in ranks whom We will. Your Lord is All-Wise, All-Knowing."
        }
    },
    {
        "id": 872,
        "chapter": 6,
        "verse": 84,
        "arabic_text": "وَوَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَۚ كُلًّا هَدَيۡنَاۚ وَنُوحًا هَدَيۡنَا مِن قَبۡلُۖ وَمِن ذُرِّيَّتِهِۦ دَاوُۥدَ وَسُلَيۡمَٰنَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَىٰ وَهَٰرُونَۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُحۡسِنِينَ",
        "phonetic": "6.84 Wa Wahabnā Lahu 'Isĥāqa Wa Ya`qūba Kullāan Hadaynā Wa Nūĥāan Hadaynā Min Qablu Wa Min Dhurrīyatihi Dāwūda Wa Sulaymāna Wa 'Ayyūba Wa Yūsufa Wa Mūsá Wa Hārūna Wa Kadhalika Najzī Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We gave to him [i.e., Abraham] Isaac and Jacob - all [of them] We guided. And Noah, We guided before; and among his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the doers of good.",
            "english_hilali_khan": "And We bestowed upon him Ishâq (Isaac) and Ya‘qûb (Jacob), each of them We guided, and before him, We guided Nûh (Noah), and among his progeny Dâwûd (David), Sulaimân (Solomon), Ayyûb (Job), Yûsuf (Joseph), Mûsâ (Moses), and Hârûn (Aaron). Thus do We reward Al-Muhsinûn (the good-doers - see the footnote of V.9: 120).",
            "english_rwwad": "We granted him Isaac and Jacob – each of them We guided as We previously guided Noah, and among his descendants: David, Solomon, Job, Joseph, Moses, and Aaron. Thus do We reward those who do good."
        }
    },
    {
        "id": 873,
        "chapter": 6,
        "verse": 85,
        "arabic_text": "وَزَكَرِيَّا وَيَحۡيَىٰ وَعِيسَىٰ وَإِلۡيَاسَۖ كُلّٞ مِّنَ ٱلصَّٰلِحِينَ",
        "phonetic": "6.85 Wa Zakarīyā Wa Yaĥyá Wa `Īsá Wa 'Ilyāsa Kullun Mina Aş-Şāliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Zechariah and John and Jesus and Elias - and all were of the righteous.",
            "english_hilali_khan": "And Zakariyâ (Zachariya), and Yahya (John) and ‘Îsâ (Jesus) and Iliyâs (Elias), each one of them was of the righteous.",
            "english_rwwad": "And Zachariah, John, Jesus, and Elias – each was among the righteous."
        }
    },
    {
        "id": 874,
        "chapter": 6,
        "verse": 86,
        "arabic_text": "وَإِسۡمَٰعِيلَ وَٱلۡيَسَعَ وَيُونُسَ وَلُوطٗاۚ وَكُلّٗا فَضَّلۡنَا عَلَى ٱلۡعَٰلَمِينَ",
        "phonetic": "6.86 Wa 'Ismā`īla Wa Al-Yasa`a Wa Yūnus Wa Lūţāan Wa Kullāan Fađđalnā `Alá Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Ishmael and Elisha and Jonah and Lot - and all [of them] We preferred over the worlds.",
            "english_hilali_khan": "And Ismâ‘îl (Ishmael) and Al-Yasa‘ (Elisha), and Yûnus (Jonah) and Lût (Lot), and each one of them We preferred above the ‘Âlamîn [mankind and jinn (of their times)].",
            "english_rwwad": "Also Ishmael, Elisha, Jonah, and Lot – each of them We preferred over all other people [of their times]."
        }
    },
    {
        "id": 875,
        "chapter": 6,
        "verse": 87,
        "arabic_text": "وَمِنۡ ءَابَآئِهِمۡ وَذُرِّيَّٰتِهِمۡ وَإِخۡوَٰنِهِمۡۖ وَٱجۡتَبَيۡنَٰهُمۡ وَهَدَيۡنَٰهُمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ",
        "phonetic": "6.87 Wa Min 'Ābā'ihim Wa Dhurrīyātihim Wa 'Ikhwānihim Wa Ajtabaynāhum Wa Hadaynāhum 'Ilá Şirāţin Mustaqīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [some] among their fathers and their descendants and their brothers - and We chose them and We guided them to a straight path.",
            "english_hilali_khan": "And also some of their fathers and their progeny and their brethren, We chose them, and We guided them to the Straight Path.",
            "english_rwwad": "And some of their fathers, their descendants, and their brothers – We chose them and guided them to a straight path."
        }
    },
    {
        "id": 876,
        "chapter": 6,
        "verse": 88,
        "arabic_text": "ذَٰلِكَ هُدَى ٱللَّهِ يَهۡدِي بِهِۦ مَن يَشَآءُ مِنۡ عِبَادِهِۦۚ وَلَوۡ أَشۡرَكُواْ لَحَبِطَ عَنۡهُم مَّا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "6.88 Dhālika Hudá Allāhi Yahdī Bihi Man Yashā'u Min `Ibādihi Wa Law 'Ashrakū Laĥabiţa `Anhum Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is the guidance of Allāh by which He guides whomever He wills of His servants. But if they had associated others with Allāh, then worthless for them would be whatever they were doing.",
            "english_hilali_khan": "This is the Guidance of Allâh with which He guides whomsoever He wills of His slaves. But if they had joined in worship others with Allâh, all that they used to do would have been of no benefit to them.",
            "english_rwwad": "This is Allah’s guidance with which He guides whom He wills of His slaves. If they were to associate others with Him, all their deeds would have been nullified."
        }
    },
    {
        "id": 877,
        "chapter": 6,
        "verse": 89,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَۚ فَإِن يَكۡفُرۡ بِهَا هَٰٓؤُلَآءِ فَقَدۡ وَكَّلۡنَا بِهَا قَوۡمٗا لَّيۡسُواْ بِهَا بِكَٰفِرِينَ",
        "phonetic": "6.89 'Ūlā'ika Al-Ladhīna 'Ātaynāhumu Al-Kitāba Wa Al-Ĥukma Wa An-Nubūwata Fa'in Yakfur Bihā Hā'uulā' Faqad Wa Kkalnā Bihā Qawmāan Laysū Bihā Bikāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those are the ones to whom We gave the Scripture and authority and prophethood. But if they [i.e., the disbelievers] deny it, then We have entrusted it to a people who are not therein disbelievers.",
            "english_hilali_khan": "They are those whom We gave the Book, Al-Hukm (understanding of the religious laws), and Prophethood. But if these disbelieve therein (the Book, Al-Hukm and Prophethood), then, indeed We have entrusted it to a people (such as the Companions of Prophet Muhammad صلى الله عليه وسلم) who are not disbelievers therein.",
            "english_rwwad": "They are those whom We gave the Scripture, wisdom and prophethood. But if these [pagans] disbelieve in it, then We have entrusted it to a people who will not disbelieve in it."
        }
    },
    {
        "id": 878,
        "chapter": 6,
        "verse": 90,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ هَدَى ٱللَّهُۖ فَبِهُدَىٰهُمُ ٱقۡتَدِهۡۗ قُل لَّآ أَسۡـَٔلُكُمۡ عَلَيۡهِ أَجۡرًاۖ إِنۡ هُوَ إِلَّا ذِكۡرَىٰ لِلۡعَٰلَمِينَ",
        "phonetic": "6.90 'Ūlā'ika Al-Ladhīna Hadá Allāhu Fabihudāhumu Aqtadihi Qul Lā 'As'alukum `Alayhi 'Ajrāan 'In Huwa 'Illā Dhikrá Lil`ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those are the ones whom Allāh has guided, so from their guidance take an example. Say, \"I ask of you for it [i.e., this message] no payment. It is not but a reminder for the worlds.\"",
            "english_hilali_khan": "They are those whom Allâh had guided. So follow their guidance. Say: \"No reward I ask of you for this (the Qur’ân). It is only a reminder for the ‘Âlamîn (mankind and jinn).\"",
            "english_rwwad": "They are those whom Allah has guided, so follow their guidance. Say, “I do not ask any reward for it. It is but a reminder for the worlds.”"
        }
    },
    {
        "id": 879,
        "chapter": 6,
        "verse": 91,
        "arabic_text": "وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓ إِذۡ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٖ مِّن شَيۡءٖۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَٰبَ ٱلَّذِي جَآءَ بِهِۦ مُوسَىٰ نُورٗا وَهُدٗى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِيسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِيرٗاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوٓاْ أَنتُمۡ وَلَآ ءَابَآؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِي خَوۡضِهِمۡ يَلۡعَبُونَ",
        "phonetic": "6.91 Wa Mā Qadarū Allāha Ĥaqqa Qadrihi 'Idh Qālū Mā 'Anzala Allāhu `Alá Basharin Min Shay'in Qul Man 'Anzala Al-Kitāba Al-Ladhī Jā'a Bihi Mūsá Nūrāan Wa Hudáan Lilnnāsi Taj`alūnahu Qarāţīsa Tubdūnahā Wa Tukhfūna Kathīrāan Wa `Ullimtum Mā Lam Ta`lamū 'Antum Wa Lā 'Ābā'uukum Quli Allāhu Thumma Dharhum Fī Khawđihim Yal`abūna",
        "footnotes": {
            "english_saheeh": "[324]- i.e., they did not appreciate the extent of His ability and wisdom.\n[325]- The Jews, or it may refer to the believers, who are taught by the Qur’ān.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they did not appraise Allāh with true appraisal[324] when they said, \"Allāh did not reveal to a human being anything.\" Say, \"Who revealed the Scripture that Moses brought as light and guidance to the people? You [Jews] make it into pages, disclosing [some of] it and concealing much. And you[325] were taught that which you knew not - neither you nor your fathers.\" Say, \"Allāh [revealed it].\" Then leave them in their [empty] discourse, amusing themselves.",
            "english_hilali_khan": "They (the Jews, Quraish pagans, idolaters) did not estimate Allâh with an estimation due to Him when they said: \"Nothing did Allâh send down to any human being (by revelation).\" Say (O Muhammad صلى الله عليه وسلم): \"Who then sent down the Book which Mûsâ (Moses) brought, a light and a guidance to mankind which you (the Jews) have made into (separate) papersheets, disclosing (some of it) and concealing much. And you (believers in Allâh and His Messenger Muhammad صلى الله عليه وسلم) were taught (through the Qur’ân) that which neither you nor your fathers knew.\" Say: \"Allâh (sent it down).\" Then leave them to play in their vain discussions. (Tafsir Al-Qurtubî).",
            "english_rwwad": "They have not revered Allah His true reverence when they said, “Allah has sent down nothing to human beings.” Say [O Prophet], “Who then sent down the Scripture that Moses brought as a light and guidance for people, but you make it into separate sheets – revealing some and concealing much, although you have been taught [this Qur’an] which neither you nor your forefathers knew?” Say, “Allah [sent it down].” Then leave them to amuse themselves in their falsehood."
        }
    },
    {
        "id": 880,
        "chapter": 6,
        "verse": 92,
        "arabic_text": "وَهَٰذَا كِتَٰبٌ أَنزَلۡنَٰهُ مُبَارَكٞ مُّصَدِّقُ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ يُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ يُحَافِظُونَ",
        "phonetic": "6.92 Wa Hadhā Kitābun 'Anzalnāhu Mubārakun Muşaddiqu Al-Ladhī Bayna Yadayhi Wa Litundhira 'Umma Al-Qurá Wa Man Ĥawlahā Wa Al-Ladhīna Yu'uminūna Bil-'Ākhirati Yu'uminūna Bihi Wa Hum `Alá Şalātihim Yuĥāfižūna",
        "footnotes": {
            "english_saheeh": "[326]- i.e., all other peoples.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And this is a Book which We have sent down, blessed and confirming what was before it, that you may warn the Mother of Cities [i.e., Makkah] and those around it.[326] Those who believe in the Hereafter believe in it, and they are maintaining their prayers.",
            "english_hilali_khan": "And this (the Qur’ân) is a blessed Book which We have sent down, confirming (the revelations) which came before it, so that you may warn the Mother of Towns (i.e. Makkah) and all those around it. Those who believe in the Hereafter believe in it (the Qur’ân), and they are constant in guarding their Salât (prayers).",
            "english_rwwad": "This is a blessed Book which We have sent down – confirming what came before it, so that you will warn the Mother of Cities [Makkah] and all those around it. Those who believe in the Hereafter believe in it and are mindful of their prayers."
        }
    },
    {
        "id": 881,
        "chapter": 6,
        "verse": 93,
        "arabic_text": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ",
        "phonetic": "6.93 Wa Man 'Ažlamu Mimmani Aftará `Alá Allāhi Kadhibāan 'Aw Qāla 'Ūĥiya 'Ilayya Wa Lam Yūĥa 'Ilayhi Shay'un Wa Man Qāla Sa'unzilu Mithla Mā 'Anzala Allāhu Wa Law Tará 'Idhi Až-Žālimūna Fī Ghamarāti Al-Mawti Wa Al-Malā'ikatu Bāsiţū 'Aydīhim 'Akhrijū 'Anfusakumu Al-Yawma Tujzawna `Adhāba Al-Hūni Bimā Kuntum Taqūlūna `Alá Allāhi Ghayra Al-Ĥaqqi Wa Kuntum `An 'Āyātihi Tastakbirūna",
        "footnotes": {
            "english_saheeh": "[327]- Striking them, as they are unwilling to give up their souls for judgement.",
            "english_hilali_khan": "(V.6:93) A. What is said regarding the punishment in the grave. And the Statement of Allâh عز وجل:\n\"If you could but see when the Zâlimûn (polytheists and wrong-doers) are in the agonies of death while the angels are stretching forth their hands (saying): \"Deliver your souls. This day you shall be recompensed with the torment of degradation.\" (V.6:93)\nAnd also the Statement of Allâh تعالى : \"Twice shall We punish them and thereafter, they shall be brought back to a great (horrible) torment.\" (V.9:101).\nAnd also the Statement of Allâh تعالى :\n\"While an evil torment encompassed Fir‘aun (Pharaoh)’s people; the Fire, they are exposed to it morning and afternoon, and on the Day when the Hour will be established (it will be said to the angels): ‘Cause Fir‘aun (Pharaoh)’s people to enter the severest torment.’\" (V.40: 4546).\nNarrated Al-Barâ’ bin ‘Âzib: The Prophet صلى الله عليه وسلم said, \"When a faithful believer is made to sit in his grave, then (the angels) come to him and he testifies that Lâ ilâha illallâh wa Anna Muhammad-ur-Rasuûl Allâh (none has the right to be worshipped but Allâh and Muhammad صلى الله عليه وسلم is the Messenger of Allâh). And that corresponds to Allâh’s Statement: ‘Allâh will keep firm those who believe with the word that stands firm.’ (V.14:27).\" (Sahih Al-Bukhâri, Vol.2, Hadîth No.450).\nB. Narrated Anas رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"When a human being is laid in his grave and his companions return and he even hears their footsteps, two angels come to him and make him sit and ask him: ‘What did you use to say about this man, Muhammad صلى الله عليه وسلم ?’ He will say: ‘I testify that he is Allâh’s slave and His Messenger.’ Then it will be said to him, ‘Look at your place in the Hell-Fire. Allâh has changed for you a place in Paradise instead of it.’\" The Prophet صلى الله عليه وسلم added, \"The dead person will see both his places. But a disbeliever or a hypocrite will say to the angels, ‘I do not know, but I used to say what the people used to say!’ It will be said to him, ‘Neither did you know nor did you take the guidance (by following the Qur’ân).’ Then he will be hit with an iron hammer between his two ears, and he will cry and that cry will be heard by whatsoever is near to him except human beings and jinn.\" (Sahih Al-Bukhâri, Vol.2, Hadîth No.422)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And who is more unjust than one who invents a lie about Allāh or says, \"It has been inspired to me,\" while nothing has been inspired to him, and one who says, \"I will reveal [something] like what Allāh revealed.\" And if you could but see when the wrongdoers are in the overwhelming pangs of death while the angels extend their hands,[327] [saying], \"Discharge your souls! Today you will be awarded the punishment of [extreme] humiliation for what you used to say against Allāh other than the truth and [that] you were, toward His verses, being arrogant.\"",
            "english_hilali_khan": "And who can be more unjust than he who invents a lie against Allâh, or says: \"A revelation has come to me\" whereas no revelation has come to him in anything ; and who says, \"I will reveal the like of what Allâh has revealed.\" And if you could but see when the Zâlimûn (polytheists and wrong-doers) are in the agonies of death, while the angels are stretching forth their hands (saying): \"Deliver your souls! This day you shall be recompensed with the torment of degradation because of what you used to utter against Allâh other than the truth. And you used to reject His Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) with disrespect![1]\"",
            "english_rwwad": "Who does greater wrong than the one who fabricates lies against Allah or says, “A revelation has come to me” – whereas nothing has been revealed to him, or the one who says, “I can send down the like of what Allah has sent down.” If only you could see the wrongdoers in the throes of death while the angels are stretching out their hands [saying], “Give up your souls! Today you will be recompensed with a disgracing punishment, because you used to tell lies against Allah and you arrogantly rejected His verses.”"
        }
    },
    {
        "id": 882,
        "chapter": 6,
        "verse": 94,
        "arabic_text": "وَلَقَدۡ جِئۡتُمُونَا فُرَٰدَىٰ كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةٖ وَتَرَكۡتُم مَّا خَوَّلۡنَٰكُمۡ وَرَآءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمۡتُمۡ أَنَّهُمۡ فِيكُمۡ شُرَكَٰٓؤُاْۚ لَقَد تَّقَطَّعَ بَيۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ",
        "phonetic": "6.94 Wa Laqad Ji'tumūnā Furādá Kamā Khalaqnākum 'Awwala Marratin Wa Taraktum Mā Khawwalnākum Warā'a Žuhūrikum Wa Mā Nará Ma`akum Shufa`ā'akumu Al-Ladhīna Za`amtum 'Annahum Fīkum Shurakā'u Laqad Taqaţţa`a Baynakum Wa Đalla `Ankum Mā Kuntum Taz`umūna",
        "footnotes": {
            "english_saheeh": "[328]- Between yourselves and the claimed associates and intercessors.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It will be said to them], \"And you have certainly come to Us alone [i.e., individually] as We created you the first time, and you have left whatever We bestowed upon you behind you. And We do not see with you your 'intercessors' which you claimed that they were among you associates [of Allāh]. It has [all] been severed between you,[328] and lost from you is what you used to claim.\"",
            "english_hilali_khan": "And truly you have come unto Us alone (without wealth, companions or anything else) as We created you the first time. You have left behind you all that which We had bestowed on you. We see not with you your intercessors whom you claimed to be partners with Allâh. Now all relations between you and them have been cut off, and all that you used to claim has vanished from you.",
            "english_rwwad": "“Now you have come to Us alone just as We created you the first time – leaving behind all that We had bestowed upon you. We do not see with you your intercessors whom you claimed to be associates [with Allah]. Now all your ties have been severed and all your claims have failed you.”"
        }
    },
    {
        "id": 883,
        "chapter": 6,
        "verse": 95,
        "arabic_text": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَمُخۡرِجُ ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ",
        "phonetic": "6.95 'Inna Allāha Fāliqu Al-Ĥabbi Wa An-Nawá Yukhriju Al-Ĥayya Mina Al-Mayyiti Wa Mukhriju Al-Mayyiti Mina Al-Ĥayyi Dhalikumu Allāhu Fa'anná Tu'ufakūna",
        "footnotes": {
            "english_saheeh": "[329]- He (subḥānahu wa taʿālā) causes them to split and sprout.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Allāh is the cleaver of grain and date seeds.[329] He brings the living out of the dead and brings the dead out of the living. That is Allāh; so how are you deluded?",
            "english_hilali_khan": "Verily! It is Allâh Who causes the seed-grain and the fruit-stone (like date-stone) to split and sprout. He brings forth the living from the dead, and it is He Who brings forth the dead from the living. Such is Allâh, then how are you deluded away from the truth?",
            "english_rwwad": "It is Allah Who causes the grain and fruit-stones to sprout. He brings forth the living from the dead and the dead from the living. Such is Allah! So how are you being turned away?"
        }
    },
    {
        "id": 884,
        "chapter": 6,
        "verse": 96,
        "arabic_text": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّيۡلَ سَكَنٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ",
        "phonetic": "6.96 Fāliqu Al-'Işbāĥi Wa Ja`ala Al-Layla Sakanāan Wa Ash-Shamsa Wa Al-Qamara Ĥusbānāan Dhālika Taqdīru Al-`Azīzi Al-`Alīmi",
        "footnotes": {
            "english_saheeh": "[330]- Or \"according to calculation,\" referring to their precise movement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He is] the cleaver of daybreak and has made the night for rest and the sun and moon for calculation.[330] That is the determination of the Exalted in Might, the Knowing.",
            "english_hilali_khan": "(He is the) Cleaver of the daybreak. He has appointed the night for resting, and the sun and the moon for reckoning. Such is the measuring of the All-Mighty, the All-Knowing.",
            "english_rwwad": "It is He Who cleaves the daybreak, and made the night for rest, and the sun and the moon with a precise measurement; that is the design of the All-Mighty, the All-Knowing."
        }
    },
    {
        "id": 885,
        "chapter": 6,
        "verse": 97,
        "arabic_text": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ",
        "phonetic": "6.97 Wa Huwa Al-Ladhī Ja`ala Lakumu An-Nujūma Litahtadū Bihā Fī Žulumāti Al-Barri Wa Al-Baĥri Qad Faşşalnā Al-'Āyāti Liqawmin Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:97) (About the) Stars. Abu Qatâdah mentioned Allâh’s Statement: \"And We have adorned the nearest heaven with lamps,\" (V.67:5) and said, \"The creation of these stars is for three purposes, i.e. as decoration of the (nearest) heaven, as missiles to hit the devils, and as signs to guide travellers. So, if anybody tries to find a different interpretation, he is mistaken and just wastes his efforts, and troubles himself with what is beyond his limited knowledge.\" (Sahih Al-Bukhârî, Vol.4, Chap. 3, P.282).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who placed for you the stars that you may be guided by them through the darknesses of the land and sea. We have detailed the signs for a people who know.",
            "english_hilali_khan": "It is He Who has set the stars[1] for you, so that you may guide your course with their help through the darkness of the land and the sea. We have (indeed) explained in detail Our Ayât (proofs, evidence, verses, lessons, signs, Revelations, etc.) for people who know.",
            "english_rwwad": "And He made the stars as your guide through the darkness of the land and sea. We have made the signs clear for people who know."
        }
    },
    {
        "id": 886,
        "chapter": 6,
        "verse": 98,
        "arabic_text": "وَهُوَ ٱلَّذِيٓ أَنشَأَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ فَمُسۡتَقَرّٞ وَمُسۡتَوۡدَعٞۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَفۡقَهُونَ",
        "phonetic": "6.98 Wa Huwa Al-Ladhī 'Ansha'akum Min Nafsin Wāĥidatin Famustaqarrun Wa Mustawda`un Qad Faşşalnā Al-'Āyāti Liqawmin Yafqahūn",
        "footnotes": {
            "english_saheeh": "[331]- In the earth.  See 77:25-26.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who produced you from one soul and [gave you] a place of dwelling and of storage.[331] We have detailed the signs for a people who understand.",
            "english_hilali_khan": "It is He Who has created you from a single person (Adam), and has given you a place of residing (on the earth or in your mother’s wombs) and a place of storage [in the earth (in your graves) or in your father’s loins]. Indeed, We have explained in detail Our revelations (this Qur’ân) for people who understand.",
            "english_rwwad": "It is He Who originated you from a single soul, then assigned for you a place to stay and a place to rest. We have made the signs clear for people who understand."
        }
    },
    {
        "id": 887,
        "chapter": 6,
        "verse": 99,
        "arabic_text": "وَهُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَيۡءٖ فَأَخۡرَجۡنَا مِنۡهُ خَضِرٗا نُّخۡرِجُ مِنۡهُ حَبّٗا مُّتَرَاكِبٗا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانٞ دَانِيَةٞ وَجَنَّٰتٖ مِّنۡ أَعۡنَابٖ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهٗا وَغَيۡرَ مُتَشَٰبِهٍۗ ٱنظُرُوٓاْ إِلَىٰ ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَيَنۡعِهِۦٓۚ إِنَّ فِي ذَٰلِكُمۡ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "6.99 Wa Huwa Al-Ladhī 'Anzala Mina As-Samā'i Mā'an Fa'akhrajnā Bihi Nabāta Kulli Shay'in Fa'akhrajnā Minhu Khađirāan Nukhriju Minhu Ĥabbāan Mutarākibāan Wa Mina An-Nakhli Min Ţal`ihā Qinwānun Dāniyatun Wa Jannātin Min 'A`nābin Wa Az-Zaytūna Wa Ar-Rummāna Mushtabihāan Wa Ghayra Mutashābihin Anžurū 'Ilá Thamarihi 'Idhā 'Athmara Wa Yan`ihi 'Inna Fī Dhālikum La'āyātin Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who sends down rain from the sky, and We produce thereby the growth of all things. We produce from it greenery from which We produce grains arranged in layers. And from the palm trees - of its emerging fruit are clusters hanging low. And [We produce] gardens of grapevines and olives and pomegranates, similar yet varied. Look at [each of] its fruit when it yields and [at] its ripening. Indeed in that are signs for a people who believe.",
            "english_hilali_khan": "It is He Who sends down water (rain) from the sky, and with it We bring forth vegetation of all kinds, and out of it We bring forth green stalks, from which We bring forth thick clustered grain. And out of the date-palm and its spathe come forth clusters of dates hanging low and near, and gardens of grapes, olives and pomegranates, each similar (in kind) yet different (in variety and taste). Look at their fruits when they begin to bear, and the ripeness thereof. Verily! In these things there are signs for people who believe.",
            "english_rwwad": "It is He Who sends down water from the sky and We produce thereby every kind of plants. We produce from it greenery from which We bring forth clustered grains. From the spathes of palm trees emerging clusters of dates hanging within reach. And gardens of grapevines, olives, and pomegranates – similar [in shape] yet different [in taste]. Look at their fruit when they bear fruit and ripen. Indeed, there are signs in these for people who believe."
        }
    },
    {
        "id": 888,
        "chapter": 6,
        "verse": 100,
        "arabic_text": "وَجَعَلُواْ لِلَّهِ شُرَكَآءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُواْ لَهُۥ بَنِينَ وَبَنَٰتِۭ بِغَيۡرِ عِلۡمٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ",
        "phonetic": "6.100 Wa Ja`alū Lillāhi Shurakā'a Al-Jinna Wa Khalaqahum Wa Kharaqū Lahu Banīna Wa Banātin Bighayri `Ilmin Subĥānahu Wa Ta`ālá `Ammā Yaşifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they have attributed to Allāh partners - the jinn, while He has created them - and have fabricated for Him sons and daughters without knowledge. Exalted is He and high above what they describe.",
            "english_hilali_khan": "Yet, they join the jinn as partners in worship with Allâh, though He has created them (the jinn); and they attribute falsely without knowledge sons and daughters to Him. Be He Glorified and Exalted above all that (evil) they attribute to Him.",
            "english_rwwad": "They regard the jinn as partners of Allah, even though He created them, and they falsely attribute to Him sons and daughters without knowledge. Glorified and Exalted is He far above what they ascribe to Him."
        }
    },
    {
        "id": 889,
        "chapter": 6,
        "verse": 101,
        "arabic_text": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٞ وَلَمۡ تَكُن لَّهُۥ صَٰحِبَةٞۖ وَخَلَقَ كُلَّ شَيۡءٖۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ",
        "phonetic": "6.101 Badī`u As-Samāwāti Wa Al-'Arđi 'Anná Yakūnu Lahu Waladun Wa Lam Takun Lahu Şāĥibatun Wa Khalaqa Kulla Shay'in Wa Huwa Bikulli Shay'in `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:101) See the footnote of (V.2:116)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He is] Originator of the heavens and the earth. How could He have a son when He does not have a companion [i.e., wife] and He created all things? And He is, of all things, Knowing.",
            "english_hilali_khan": "He is the Originator of the heavens and the earth. How can He have children when He has no wife? He created all things and He is the All-Knower of everything[2].",
            "english_rwwad": "The Originator of the heavens and earth. How could He have a son when He never had a companion? He created all things, and He is All-Knowing of everything."
        }
    },
    {
        "id": 890,
        "chapter": 6,
        "verse": 102,
        "arabic_text": "ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡۖ لَآ إِلَٰهَ إِلَّا هُوَۖ خَٰلِقُ كُلِّ شَيۡءٖ فَٱعۡبُدُوهُۚ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ وَكِيلٞ",
        "phonetic": "6.102 Dhalikumu Allāhu Rabbukum Lā 'Ilāha 'Illā Huwa Khāliqu Kulli Shay'in Fā`budūhu Wa Huwa `Alá Kulli Shay'in Wa Kīlun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is Allāh, your Lord; there is no deity except Him, the Creator of all things, so worship Him. And He is Disposer of all things.",
            "english_hilali_khan": "Such is Allâh, your Lord! Lâ ilâha illa Huwa (none has the right to be worshipped but He), the Creator of all things. So worship Him (Alone), and He is the Wakîl (Trustee, Disposer of affairs, Guardian) over all things.",
            "english_rwwad": "Such is Allah, your Lord; none has the right to be worshiped except Him, the Creator of all things. So worship Him, for He is the Maintainer of all things."
        }
    },
    {
        "id": 891,
        "chapter": 6,
        "verse": 103,
        "arabic_text": "لَّا تُدۡرِكُهُ ٱلۡأَبۡصَٰرُ وَهُوَ يُدۡرِكُ ٱلۡأَبۡصَٰرَۖ وَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ",
        "phonetic": "6.103 Lā Tudrikuhu Al-'Abşāru Wa Huwa Yudriku Al-'Abşāra Wa Huwa Al-Laţīfu Al-Khabīr",
        "footnotes": {
            "english_saheeh": "[332]- In the life of this world.  The people of Paradise will be able to see Allāh in the Hereafter.  See 75:22-23.\n[333]- Perceptive of the most precise and unapparent matters and the intricacies of all affairs.  Also, He who benefits His servants in indiscernible ways.\n[334]- See footnote in 6:18.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Vision perceives Him not,[332] but He perceives [all] vision; and He is the Subtle,[333] the Aware.[334]",
            "english_hilali_khan": "No vision can grasp Him, but He grasps all vision. He is Al-Latîf (the Most Subtle and Courteous), Well-Acquainted with all things.",
            "english_rwwad": "No vision can encompass Him, but He encompasses all vision, and He is the Most Subtle, the All-Aware."
        }
    },
    {
        "id": 892,
        "chapter": 6,
        "verse": 104,
        "arabic_text": "قَدۡ جَآءَكُم بَصَآئِرُ مِن رَّبِّكُمۡۖ فَمَنۡ أَبۡصَرَ فَلِنَفۡسِهِۦۖ وَمَنۡ عَمِيَ فَعَلَيۡهَاۚ وَمَآ أَنَا۠ عَلَيۡكُم بِحَفِيظٖ",
        "phonetic": "6.104 Qad Jā'akum Başā'iru Min Rabbikum Faman 'Abşara Falinafsihi Wa Man `Amiya Fa`alayhā Wa Mā 'Anā `Alaykum Biĥafīžin",
        "footnotes": {
            "english_saheeh": "[335]- The Prophet (ﷺ) is directed to disassociate himself from all erroneous belief and practice.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There has come to you enlightenment from your Lord. So whoever will see does so for [the benefit of] his soul, and whoever is blind [does harm] against it. And [say], \"I am not a guardian over you.\"[335]",
            "english_hilali_khan": "Verily, proofs have come to you from your Lord, so whosoever sees, will do so for (the good of) his ownself, and whosoever blinds himself, will do so to his own harm, and I (Muhammad صلى الله عليه وسلم) am not a watcher over you.",
            "english_rwwad": "There have come to you insights from your Lord. Whoever chooses to see [the truth], it is for his own good. But whoever turns a blind eye, it is to his own loss. And [say], “I am not a keeper over you.”"
        }
    },
    {
        "id": 893,
        "chapter": 6,
        "verse": 105,
        "arabic_text": "وَكَذَٰلِكَ نُصَرِّفُ ٱلۡأٓيَٰتِ وَلِيَقُولُواْ دَرَسۡتَ وَلِنُبَيِّنَهُۥ لِقَوۡمٖ يَعۡلَمُونَ",
        "phonetic": "6.105 Wa Kadhalika Nuşarrifu Al-'Āyāti Wa Liyaqūlū Darasta Wa Linubayyinahu Liqawmin Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[336]- Accusing the Prophet (ﷺ) of having learned from the Jews and Christians.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus do We diversify the verses so they [i.e., the disbelievers] will say, \"You have studied,\"[336] and so We may make it [i.e., the Qur’ān] clear for a people who know.",
            "english_hilali_khan": "Thus We explain variously the Verses so that they (the disbelievers) may say: \"You have studied (the Books of the people of the Scripture and brought this Qur’ân from that)\" and that We may make the matter clear for the people who have knowledge.",
            "english_rwwad": "This is how We diversify the verses, so that they may say, “you have studied [previous scriptures]”, and so that We may make it clear for people who know."
        }
    },
    {
        "id": 894,
        "chapter": 6,
        "verse": 106,
        "arabic_text": "ٱتَّبِعۡ مَآ أُوحِيَ إِلَيۡكَ مِن رَّبِّكَۖ لَآ إِلَٰهَ إِلَّا هُوَۖ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِينَ",
        "phonetic": "6.106 Attabi` Mā 'Ūĥiya 'Ilayka Min Rabbika Lā 'Ilāha 'Illā Huwa Wa 'A`riđ `Ani Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:106). Al-Mushrikûn: polytheists, pagans, idolaters and disbelievers in the Oneness of Allâh and His Messenger Muhammad صلى الله عليه وسلم.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Follow, [O Muḥammad], what has been revealed to you from your Lord - there is no deity except Him - and turn away from those who associate others with Allāh.",
            "english_hilali_khan": "Follow what has been revealed to you (O Muhammad صلى الله عليه وسلم) from your Lord, Lâ ilâha illa Huwa (none has the right to be worshipped but He) and turn aside from Al-Mushrikûn [1]",
            "english_rwwad": "Follow [O Prophet] what is revealed to you from your Lord – none has the right to be worshiped except Him – and turn away from those who associate partners with Allah."
        }
    },
    {
        "id": 895,
        "chapter": 6,
        "verse": 107,
        "arabic_text": "وَلَوۡ شَآءَ ٱللَّهُ مَآ أَشۡرَكُواْۗ وَمَا جَعَلۡنَٰكَ عَلَيۡهِمۡ حَفِيظٗاۖ وَمَآ أَنتَ عَلَيۡهِم بِوَكِيلٖ",
        "phonetic": "6.107 Wa Law Shā'a Allāhu Mā 'Ashrakū Wa Mā Ja`alnāka `Alayhim Ĥafīžāan Wa Mā 'Anta `Alayhim Biwakīlin",
        "footnotes": {
            "english_saheeh": "[337]- The Prophet's duty did not go beyond delivery of the message.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if Allāh had willed, they would not have associated. And We have not appointed you over them as a guardian, nor are you a manager over them.[337]",
            "english_hilali_khan": "Had Allâh willed, they would not have taken others besides Him in worship. And We have not made you a watcher over them nor are you a Wakîl (disposer of affairs, guardian, trustee) over them.",
            "english_rwwad": "If Allah had willed, they would not have associated partners with Him. We have not made you a keeper over them, nor are you their trustee."
        }
    },
    {
        "id": 896,
        "chapter": 6,
        "verse": 108,
        "arabic_text": "وَلَا تَسُبُّواْ ٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ فَيَسُبُّواْ ٱللَّهَ عَدۡوَۢا بِغَيۡرِ عِلۡمٖۗ كَذَٰلِكَ زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمۡ ثُمَّ إِلَىٰ رَبِّهِم مَّرۡجِعُهُمۡ فَيُنَبِّئُهُم بِمَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "6.108 Wa Lā Tasubbū Al-Ladhīna Yad`ūna Min Dūni Allāhi Fayasubbū Allāha `Adwan Bighayri `Ilmin Kadhālika Zayyannā Likulli 'Ummatin `Amalahum Thumma 'Ilá Rabbihim Marji`uhum Fayunabbi'uhum Bimā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(6:108) The tale of the cave:\nNarrated Ibn ‘Umar رضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Once three persons (from the previous nations) were travelling, and suddenly it started raining and they took shelter in a cave. The entrance of the cave got closed (suddenly by the falling of a huge rock) while they were inside. They said to each other, ‘O You! Nothing can save you except the truth, so each of you should ask Allâh’s Help by referring to such a deed as he thinks he did sincerely (i.e., just for gaining Allâh’s Pleasure).’ So one of them said, ‘O Allâh! You know that I had a labourer who worked for me for one Faraq (i.e. three Sâ‘)of rice, but he departed, leaving it (i.e. his wages). I sowed that Faraq of rice and with its yield I bought cows (for him). Later on when came to me asking for his wages, I said (to him), ‘Go to those cows and drive them away.’ He said to me, ‘But you have to pay me only a Faraq of rice.’ I said to him, ‘Go to those cows and take them, for they are the product of that Faraq (of rice).’ So he drove them. O Allâh! If you consider that I did that for fear of You, then please remove the rock.’ The rock shifted a bit from the mouth of the cave. The second one said, ‘O Allâh, You know that I had old parents whom I used to provide with the milk of my sheep every night. One night I was delayed and when I came, they had slept, while my wife and children were crying with hunger. I used not to let them (i.e. my family) drink unless my parents had drunk first. So I disliked to wake them up and also disliked that they should sleep without drinking it, I kept on waiting (for them to wake) till it dawned. O Allâh! If You consider that I did that for fear of You, then please remove the rock.’ So the rock shifted and they could see the sky through it. The (third) one said, ‘O Allah! You know that I had a cousin (i.e. my paternal uncle’s daughter) who was most beloved to me and I sought to seduce her, but she refused, unless I paid her one-hundred Dinârs (i.e. gold pieces). So I collected the amount and brought it to her, and she allowed me to sleep with her. But when I sat between her legs, she said, ‘Be afraid of Allâh, and do not deflower me but legally.’ ‘I got up and left the hundred Dinârs (for her). O Allâh! If You consider that I did that for fear of You then please remove the rock.’ So Allâh released them (removed the rock) and they came out (of the cave).\" [This Hadith indicates that one can only ask Allâh for help directly or through his performed good deeds. But to ask Allâh through the dead or absent (prophets, saints, spirits, holy men, angels) is absolutely forbidden in Islâm and it is a kind of polytheism]. (Sahih Al-Bukhâri, Vol.4,Hadith No.671).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not insult those they invoke other than Allāh, lest they insult Allāh in enmity without knowledge. Thus We have made pleasing to every community their deeds. Then to their Lord is their return, and He will inform them about what they used to do.",
            "english_hilali_khan": "And insult not those whom they (disbelievers) worship besides Allâh, lest they insult Allâh wrongfully without knowledge. Thus We have made fair-seeming to each people its own doings; then to their Lord is their return and He shall then inform them of all that they used to do.[2]",
            "english_rwwad": "Do not revile those whom they supplicate besides Allah, lest they revile Allah out of spite and lack of knowledge. This is how We made the deeds of every people appealing to them. Then to their Lord is their return, and He will inform them of what they used to do."
        }
    },
    {
        "id": 897,
        "chapter": 6,
        "verse": 109,
        "arabic_text": "وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَئِن جَآءَتۡهُمۡ ءَايَةٞ لَّيُؤۡمِنُنَّ بِهَاۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِۖ وَمَا يُشۡعِرُكُمۡ أَنَّهَآ إِذَا جَآءَتۡ لَا يُؤۡمِنُونَ",
        "phonetic": "6.109 Wa 'Aqsamū Billāhi Jahda 'Aymānihim La'in Jā'at/hum 'Āyatun Layu'uminunna Bihā Qul 'Innamā Al-'Āyātu `Inda Allāhi Wa Mā Yush`irukum 'Annahā 'Idhā Jā'at Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they swear by Allāh their strongest oaths that if a sign came to them, they would surely believe in it. Say, \"The signs are only with [i.e., from] Allāh.\" And what will make you perceive that even if it [i.e., a sign] came, they would not believe.",
            "english_hilali_khan": "And they swear their strongest oaths by Allâh, that if there came to them a sign, they would surely believe therein. Say: \"Signs are but with Allâh and what will make you (Muslims) perceive that (even) if it (the sign) came, they will not believe?\"",
            "english_rwwad": "They swear by Allah their most solemn oaths that if a sign came to them, they would certainly believe in it. Say [O Prophet], “Signs are only with Allah.” How do you know that even if it came to them, they would still not believe?"
        }
    },
    {
        "id": 898,
        "chapter": 6,
        "verse": 110,
        "arabic_text": "وَنُقَلِّبُ أَفۡـِٔدَتَهُمۡ وَأَبۡصَٰرَهُمۡ كَمَا لَمۡ يُؤۡمِنُواْ بِهِۦٓ أَوَّلَ مَرَّةٖ وَنَذَرُهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ",
        "phonetic": "6.110 Wa Nuqallibu 'Af'idatahum Wa 'Abşārahum Kamā Lam Yu'uminū Bihi 'Awwala Marratin Wa Nadharuhum Fī Ţughyānihim Ya`mahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will turn away their hearts and their eyes just as they refused to believe in it [i.e., the revelation] the first time. And We will leave them in their transgression, wandering blindly.",
            "english_hilali_khan": "And We shall turn their hearts and their eyes away (from guidance), as they refused to believe therein for the first time, and We shall leave them in their trespass to wander blindly.",
            "english_rwwad": "We will turn their hearts and eyes away [from the truth] just as they refused to believe in it the first time, and We will leave them to wander blindly in their obstinacy."
        }
    },
    {
        "id": 899,
        "chapter": 6,
        "verse": 111,
        "arabic_text": "۞ وَلَوۡ أَنَّنَا نَزَّلۡنَآ إِلَيۡهِمُ ٱلۡمَلَٰٓئِكَةَ وَكَلَّمَهُمُ ٱلۡمَوۡتَىٰ وَحَشَرۡنَا عَلَيۡهِمۡ كُلَّ شَيۡءٖ قُبُلٗا مَّا كَانُواْ لِيُؤۡمِنُوٓاْ إِلَّآ أَن يَشَآءَ ٱللَّهُ وَلَٰكِنَّ أَكۡثَرَهُمۡ يَجۡهَلُونَ",
        "phonetic": "6.111 Wa Law 'Annanā Nazzalnā 'Ilayhimu Al-Malā'ikata Wa Kallamahumu Al-Mawtá Wa Ĥasharnā `Alayhim Kulla Shay'in Qubulāan Mā Kānū Liyu'uminū 'Illā 'An Yashā'a Allāhu Wa Lakinna 'Aktharahum Yajhalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And even if We had sent down to them the angels [with the message] and the dead spoke to them [of it] and We gathered together every [created] thing in front of them, they would not believe unless Allāh should will. But most of them, [of that], are ignorant.",
            "english_hilali_khan": "And even if We had sent down unto them angels, and the dead had spoken unto them, and We had gathered together all things before their very eyes, they would not have believed, unless Allâh willed, but most of them behave ignorantly.",
            "english_rwwad": "Even if We did send the angels down to them, and the dead spoke to them, and We gathered before them everything, they would still not believe, unless Allah so willed, but most of them are ignorant."
        }
    },
    {
        "id": 900,
        "chapter": 6,
        "verse": 112,
        "arabic_text": "وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ عَدُوّٗا شَيَٰطِينَ ٱلۡإِنسِ وَٱلۡجِنِّ يُوحِي بَعۡضُهُمۡ إِلَىٰ بَعۡضٖ زُخۡرُفَ ٱلۡقَوۡلِ غُرُورٗاۚ وَلَوۡ شَآءَ رَبُّكَ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا يَفۡتَرُونَ",
        "phonetic": "6.112 Wa Kadhalika Ja`alnā Likulli Nabīyin `Adūwāan Shayāţīna Al-'Insi Wa Al-Jinni Yūĥī Ba`đuhum 'Ilá Ba`đin Zukhrufa Al-Qawli Ghurūrāan Wa Law Shā'a Rabbuka Mā Fa`alūhu Fadharhum Wa Mā Yaftarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion. But if your Lord had willed, they would not have done it, so leave them and that which they invent.",
            "english_hilali_khan": "And so We have appointed for every Prophet enemies - Shayâtîn (devils) among mankind and jinn, inspiring one another with adorned speech as a delusion (or by way of deception). If your Lord had so willed, they would not have done it; so leave them alone with their fabrications. (Tafsîr Qurtubi)",
            "english_rwwad": "Similarly did We make for every prophet enemies, devils from among men and jinn, whispering to one another alluring words of delusion. If Allah had willed, they would not have done so. So leave them to their fabrications,"
        }
    },
    {
        "id": 901,
        "chapter": 6,
        "verse": 113,
        "arabic_text": "وَلِتَصۡغَىٰٓ إِلَيۡهِ أَفۡـِٔدَةُ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ وَلِيَرۡضَوۡهُ وَلِيَقۡتَرِفُواْ مَا هُم مُّقۡتَرِفُونَ",
        "phonetic": "6.113 Wa Litaşghá 'Ilayhi 'Af'idatu Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati Wa Liyarđawhu Wa Liyaqtarifū Mā Hum Muqtarifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [it is] so the hearts of those who disbelieve in the Hereafter will incline toward it [i.e., deceptive speech] and that they will be satisfied with it and that they will commit that which they are committing.",
            "english_hilali_khan": "(And this is in order) that the hearts of those who disbelieve in the Hereafter may incline to such (deceit), and that they may remain pleased with it, and that they may commit what they are committing (all kinds of sins and evil deeds).",
            "english_rwwad": "so that the hearts of those who disbelieve in the Hereafter may incline towards it and be pleased with it, and may commit whatever sins they want."
        }
    },
    {
        "id": 902,
        "chapter": 6,
        "verse": 114,
        "arabic_text": "أَفَغَيۡرَ ٱللَّهِ أَبۡتَغِي حَكَمٗا وَهُوَ ٱلَّذِيٓ أَنزَلَ إِلَيۡكُمُ ٱلۡكِتَٰبَ مُفَصَّلٗاۚ وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡلَمُونَ أَنَّهُۥ مُنَزَّلٞ مِّن رَّبِّكَ بِٱلۡحَقِّۖ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ",
        "phonetic": "6.114 'Afaghayra Allāhi 'Abtaghī Ĥakamāan Wa Huwa Al-Ladhī 'Anzala 'Ilaykumu Al-Kitāba Mufaşşalāan Wa Al-Ladhīna 'Ātaynāhumu Al-Kitāba Ya`lamūna 'Annahu Munazzalun Min Rabbika Bil-Ĥaqqi Falā Takūnanna Mina Al-Mumtarīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Say], \"Then is it other than Allāh I should seek as judge while it is He who has revealed to you the Book [i.e., the Qur’ān] explained in detail?\" And those to whom We [previously] gave the Scripture know that it is sent down from your Lord in truth, so never be among the doubters.",
            "english_hilali_khan": "[Say (O Muhammad صلى الله عليه وسلم)] \"Shall I seek a judge other than Allâh while it is He Who has sent down unto you the Book (the Qur’ân), explained in detail.\" Those unto whom We gave the Scripture [the Taurât (Torah) and the Injeel (Gospel)] know that it is revealed from your Lord in truth. So be not you of those who doubt.",
            "english_rwwad": "[Say], “Should I seek a judge other than Allah when He is the One Who has sent down to you the Book explained in detail?” Those whom We gave the Book know that it has been sent down from your Lord in truth, so never be among those who doubt."
        }
    },
    {
        "id": 903,
        "chapter": 6,
        "verse": 115,
        "arabic_text": "وَتَمَّتۡ كَلِمَتُ رَبِّكَ صِدۡقٗا وَعَدۡلٗاۚ لَّا مُبَدِّلَ لِكَلِمَٰتِهِۦۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
        "phonetic": "6.115 Wa Tammat Kalimatu Rabbika Şidqāan Wa `Adlāan Lā Mubaddila Likalimātihi Wa Huwa As-Samī`u Al-`Alīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the word of your Lord has been fulfilled in truth and in justice. None can alter His words, and He is the Hearing, the Knowing.",
            "english_hilali_khan": "And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.",
            "english_rwwad": "The Word of your Lord is perfect in truthfulness and justice; none can change His Words, and He is the All-Hearing, the All-Knowing."
        }
    },
    {
        "id": 904,
        "chapter": 6,
        "verse": 116,
        "arabic_text": "وَإِن تُطِعۡ أَكۡثَرَ مَن فِي ٱلۡأَرۡضِ يُضِلُّوكَ عَن سَبِيلِ ٱللَّهِۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا يَخۡرُصُونَ",
        "phonetic": "6.116 Wa 'In Tuţi` 'Akthara Man Fī Al-'Arđi Yuđillūka `An Sabīli Allāhi 'In Yattabi`ūna 'Illā Až-Žanna Wa 'In Hum 'Illā Yakhruşūna",
        "footnotes": {
            "english_saheeh": "[338]- Out of ignorance and blind imitation.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you obey most of those upon the earth, they will mislead you from the way of Allāh. They follow not except assumption, and they are not but misjudging.[338]",
            "english_hilali_khan": "And if you obey most of those on the earth, they will mislead you far away from Allâh’s Path. They follow nothing but conjectures, and they do nothing but lie.",
            "english_rwwad": "If you obey most of those on earth, they will lead you away from the way of Allah. They follow nothing but assumptions and they do nothing but lie."
        }
    },
    {
        "id": 905,
        "chapter": 6,
        "verse": 117,
        "arabic_text": "إِنَّ رَبَّكَ هُوَ أَعۡلَمُ مَن يَضِلُّ عَن سَبِيلِهِۦۖ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ",
        "phonetic": "6.117 'Inna Rabbaka Huwa 'A`lamu Man Yađillu `An Sabīlihi Wa Huwa 'A`lamu Bil-Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord is most knowing of who strays from His way, and He is most knowing of the [rightly] guided.",
            "english_hilali_khan": "Verily, your Lord! It is He Who knows best who strays from His Way, and He knows best the rightly guided ones.",
            "english_rwwad": "Your Lord knows best who strays from His way, and He knows best those who are guided."
        }
    },
    {
        "id": 906,
        "chapter": 6,
        "verse": 118,
        "arabic_text": "فَكُلُواْ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَيۡهِ إِن كُنتُم بِـَٔايَٰتِهِۦ مُؤۡمِنِينَ",
        "phonetic": "6.118 Fakulū Mimmā Dhukira Asmu Allāhi `Alayhi 'In Kuntum Bi'āyātihi Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[339]- At the time of slaughter.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So eat of that [meat] upon which the name of Allāh has been mentioned,[339] if you are believers in His verses [i.e., revealed law].",
            "english_hilali_khan": "So eat of that (meat) on which Allâh’s Name has been pronounced (while slaughtering the animal), if you are believers in His Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.).",
            "english_rwwad": "So eat of that [meat] over which the name of Allah is mentioned, if you [truly] believe in his verses."
        }
    },
    {
        "id": 907,
        "chapter": 6,
        "verse": 119,
        "arabic_text": "وَمَا لَكُمۡ أَلَّا تَأۡكُلُواْ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَيۡهِ وَقَدۡ فَصَّلَ لَكُم مَّا حَرَّمَ عَلَيۡكُمۡ إِلَّا مَا ٱضۡطُرِرۡتُمۡ إِلَيۡهِۗ وَإِنَّ كَثِيرٗا لَّيُضِلُّونَ بِأَهۡوَآئِهِم بِغَيۡرِ عِلۡمٍۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِٱلۡمُعۡتَدِينَ",
        "phonetic": "6.119 Wa Mā Lakum 'Allā Ta'kulū Mimmā Dhukira Asmu Allāhi `Alayhi Wa Qad Faşşala Lakum Mā Ĥarrama `Alaykum 'Illā Mā Ađţurirtum 'Ilayhi Wa 'Inna Kathīrāan Layuđillūna Bi'ahwā'ihim Bighayri `Ilmin 'Inna Rabbaka Huwa 'A`lamu Bil-Mu`tadīna",
        "footnotes": {
            "english_saheeh": "[340]- In cases of dire necessity, what is normally prohibited becomes permissible, but only to the extent of the need.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And why should you not eat of that upon which the name of Allāh has been mentioned while He has explained in detail to you what He has forbidden you, excepting that to which you are compelled.[340] And indeed do many lead [others] astray through their [own] inclinations without knowledge. Indeed, your Lord - He is most knowing of the transgressors.",
            "english_hilali_khan": "And why should you not eat of that (meat) on which Allâh’s Name has been pronounced (at the time of slaughtering the animal), while He has explained to you in detail what is forbidden to you, except under compulsion of necessity? And surely many do lead (mankind) astray by their own desires through lack of knowledge. Certainly your Lord knows best the transgressors.",
            "english_rwwad": "Why should you not eat of that over which the name of Allah is mentioned, when He has expounded clearly what is forbidden to you, unless you are compelled by necessity? Indeed, many [deviants] lead others astray by their desires, without any knowledge. Your Lord knows best the transgressors."
        }
    },
    {
        "id": 908,
        "chapter": 6,
        "verse": 120,
        "arabic_text": "وَذَرُواْ ظَٰهِرَ ٱلۡإِثۡمِ وَبَاطِنَهُۥٓۚ إِنَّ ٱلَّذِينَ يَكۡسِبُونَ ٱلۡإِثۡمَ سَيُجۡزَوۡنَ بِمَا كَانُواْ يَقۡتَرِفُونَ",
        "phonetic": "6.120 Wa Dharū Žāhira Al-'Ithmi Wa Bāţinahu 'Inna Al-Ladhīna Yaksibūna Al-'Ithma Sayujzawna Bimā Kānū Yaqtarifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And leave [i.e., desist from] what is apparent of sin and what is concealed thereof. Indeed, those who earn [blame for] sin will be recompensed for that which they used to commit.",
            "english_hilali_khan": "Leave (O mankind, all kinds of) sin, open and secret. Verily, those who commit sin will get due recompense for that which they used to commit.",
            "english_rwwad": "Avoid committing sin, whether openly or in secret. Indeed, those who commit sin will be recompensed for what they used to do."
        }
    },
    {
        "id": 909,
        "chapter": 6,
        "verse": 121,
        "arabic_text": "وَلَا تَأۡكُلُواْ مِمَّا لَمۡ يُذۡكَرِ ٱسۡمُ ٱللَّهِ عَلَيۡهِ وَإِنَّهُۥ لَفِسۡقٞۗ وَإِنَّ ٱلشَّيَٰطِينَ لَيُوحُونَ إِلَىٰٓ أَوۡلِيَآئِهِمۡ لِيُجَٰدِلُوكُمۡۖ وَإِنۡ أَطَعۡتُمُوهُمۡ إِنَّكُمۡ لَمُشۡرِكُونَ",
        "phonetic": "6.121 Wa Lā Ta'kulū Mimmā Lam Yudhkari Asmu Allāhi `Alayhi Wa 'Innahu Lafisqun Wa 'Inna Ash-Shayāţīna Layūĥūna 'Ilá 'Awliyā'ihim Liyujādilūkum Wa 'In 'Aţa`tumūhum 'Innakum Lamushrikūna",
        "footnotes": {
            "english_saheeh": "[341]- i.e., by your obedience to them - obedience being the basis of worship.",
            "english_hilali_khan": "(V.6:121) Narrated by Ahmad, At-Tirmidhi, and Ibn Jarîr: Once while Allâh’s Messenger صلى الله عليه وسلم was reciting the Verse (9:31) ‘Adî bin Hâtim said, \"O Allâh’s Messenger! They do not worship them (i.e., rabbis and monks).\" Allâh’s Messenger صلى الله عليه وسلم said: \"They certainly do. They (i.e., rabbis and monks) made lawful things as unlawful, and unlawful things as lawful, and they (i.e. Jews and Christians) followed them; and by doing so, they really worshipped them.\" (Tafsir At-Tabari ).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not eat of that upon which the name of Allāh has not been mentioned, for indeed, it is grave disobedience. And indeed do the devils inspire their allies [among men] to dispute with you. And if you were to obey them, indeed, you would be associators [of others with Him].[341]",
            "english_hilali_khan": "Eat not (O believers) of that (meat) on which Allâh’s Name has not been pronounced (at the time of the slaughtering of the animal), for sure it is Fisq (a sin and disobedience of Allâh). And certainly, the Shayâtîn (devils) do inspire their friends (from mankind) to dispute with you, and if you obey them[1] [by making Al-Maitah (a dead animal) legal by eating it], then you would indeed be Mushrikûn (polytheists); [because they (devils and their friends) made lawful to you to eat that which Allâh has made unlawful to eat and you obeyed them by considering it lawful to eat, and by doing so you worshipped them; and to worship others besides Allâh is polytheism].",
            "english_rwwad": "Do not eat of that [meat] over which the name of Allah is not mentioned, for this is a grave disobedience. But the devils whisper to their [human] friends to argue with you; if you were to obey them, you would surely become polytheists."
        }
    },
    {
        "id": 910,
        "chapter": 6,
        "verse": 122,
        "arabic_text": "أَوَمَن كَانَ مَيۡتٗا فَأَحۡيَيۡنَٰهُ وَجَعَلۡنَا لَهُۥ نُورٗا يَمۡشِي بِهِۦ فِي ٱلنَّاسِ كَمَن مَّثَلُهُۥ فِي ٱلظُّلُمَٰتِ لَيۡسَ بِخَارِجٖ مِّنۡهَاۚ كَذَٰلِكَ زُيِّنَ لِلۡكَٰفِرِينَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "6.122 'Awaman Kāna Maytāan Fa'aĥyaynāhu Wa Ja`alnā Lahu Nūrāan Yamshī Bihi Fī An-Nāsi Kaman Mathaluhu Fī Až-Žulumāti Laysa Bikhārijin Minhā Kadhālika Zuyyina Lilkāfirīna Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And is one who was dead and We gave him life and made for him light by which to walk among the people like one who is in darkness, never to emerge therefrom? Thus it has been made pleasing to the disbelievers that which they were doing.",
            "english_hilali_khan": "Is he who was dead (without Faith by ignorance and disbelief) and We gave him life (by knowledge and Faith) and set for him a light (of Belief) whereby he can walk amongst men - like him who is in the darkness (of disbelief, polytheism and hypocrisy) from which he can never come out? Thus it is made fair-seeming to the disbelievers that which they used to do.",
            "english_rwwad": "Is the one who was dead and We gave him life [by faith] and gave him a light with which he walks among people like the one in darkness from which he can never escape? This is how the deeds of the disbelievers have been made appealing to them."
        }
    },
    {
        "id": 911,
        "chapter": 6,
        "verse": 123,
        "arabic_text": "وَكَذَٰلِكَ جَعَلۡنَا فِي كُلِّ قَرۡيَةٍ أَكَٰبِرَ مُجۡرِمِيهَا لِيَمۡكُرُواْ فِيهَاۖ وَمَا يَمۡكُرُونَ إِلَّا بِأَنفُسِهِمۡ وَمَا يَشۡعُرُونَ",
        "phonetic": "6.123 Wa Kadhalika Ja`alnā Fī Kulli Qaryatin 'Akābira Mujrimīhā Liyamkurū Fīhā Wa Mā Yamkurūna 'Illā Bi'anfusihim Wa Mā Yash`urūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus We have placed within every city the greatest of its criminals to conspire therein. But they conspire not except against themselves, and they perceive [it] not.",
            "english_hilali_khan": "And thus We have set up in every town great ones of its wicked people to plot therein. But they plot not except against their ownselves, and they perceive (it) not.",
            "english_rwwad": "Thus We have placed in every city the most wicked ones to conspire in it, yet they only conspire against themselves, without even realizing it."
        }
    },
    {
        "id": 912,
        "chapter": 6,
        "verse": 124,
        "arabic_text": "وَإِذَا جَآءَتۡهُمۡ ءَايَةٞ قَالُواْ لَن نُّؤۡمِنَ حَتَّىٰ نُؤۡتَىٰ مِثۡلَ مَآ أُوتِيَ رُسُلُ ٱللَّهِۘ ٱللَّهُ أَعۡلَمُ حَيۡثُ يَجۡعَلُ رِسَالَتَهُۥۗ سَيُصِيبُ ٱلَّذِينَ أَجۡرَمُواْ صَغَارٌ عِندَ ٱللَّهِ وَعَذَابٞ شَدِيدُۢ بِمَا كَانُواْ يَمۡكُرُونَ",
        "phonetic": "6.124 Wa 'Idhā Jā'at/hum 'Āyatun Qālū Lan Nu'umina Ĥattá Nu'utá Mithla Mā 'Ūtiya Rusulu Allāhi Allāhu 'A`lamu Ĥaythu Yaj`alu Risālatahu Sayuşību Al-Ladhīna 'Ajramū Şaghārun `Inda Allāhi Wa `Adhābun Shadīdun Bimā Kānū Yamkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when a sign comes to them, they say, \"Never will we believe until we are given like that which was given to the messengers of Allāh.\" Allāh is most knowing of where [i.e., with whom] He places His message. There will afflict those who committed crimes debasement before Allāh and severe punishment for what they used to conspire.",
            "english_hilali_khan": "And when there comes to them a sign (from Allâh) they say: \"We shall not believe until we receive the like of that which the Messengers of Allâh had received.\" Allâh knows best with whom to place His Message. Humiliation and disgrace from Allâh and a severe torment will overtake the criminals (polytheists, sinners) for that which they used to plot.",
            "english_rwwad": "When a sign comes to them, they say, “We will never believe until we are given the like of what was given to the messengers of Allah.” Allah knows best where to place His message. Those who are wicked will be afflicted with disgrace from Allah and a severe punishment for their plots."
        }
    },
    {
        "id": 913,
        "chapter": 6,
        "verse": 125,
        "arabic_text": "فَمَن يُرِدِ ٱللَّهُ أَن يَهۡدِيَهُۥ يَشۡرَحۡ صَدۡرَهُۥ لِلۡإِسۡلَٰمِۖ وَمَن يُرِدۡ أَن يُضِلَّهُۥ يَجۡعَلۡ صَدۡرَهُۥ ضَيِّقًا حَرَجٗا كَأَنَّمَا يَصَّعَّدُ فِي ٱلسَّمَآءِۚ كَذَٰلِكَ يَجۡعَلُ ٱللَّهُ ٱلرِّجۡسَ عَلَى ٱلَّذِينَ لَا يُؤۡمِنُونَ",
        "phonetic": "6.125 Faman Yuridi Allāhu 'An Yahdiyahu Yashraĥ Şadrahu Lil'islāmi Wa Man Yurid 'An Yuđillahu Yaj`al Şadrahu Đayyiqāan Ĥarajāan Ka'annamā Yaşşa``adu Fī As-Samā'i Kadhālika Yaj`alu Allāhu Ar-Rijsa `Alá Al-Ladhīna Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "[342]- As a result of the person's arrogance and persistence in sin.",
            "english_hilali_khan": "(V.6:125) If Allâh تعالى wants to do good to a person, He makes him comprehend the religion [the understanding of the Qur’ân and the Sunnah (legal ways) of the Prophet صلى الله عليه وسلم].\nNarrated Mu‘âwiya رضي الله عنه in a Khuthah (religious talk): I heard Allâh’s Messenger صلى الله عليه وسلم saying, \"If Allâh wants to do good to a person, He makes him comprehend the religion [the understanding of the Qur’ân and the Sunnah (legal ways) of the Prophet صلى الله عليه وسلم]. I am just a distributor, but the grant is from Allâh. (And remember) that this nation (true Muslims, real followers of Islâmic Monotheism) will remain obedient to Allâh’s Orders [i.e., following strictly Allâh’s Book (the Qur’ân) and the Prophet’s Sunnah (legal ways)] and they will not be harmed by anyone who will oppose them (going on a different path) till Allâh’s Order (Day of Judgement) is established.\" (Sahih Al-Bukhâri, Vol.1, Hadîth No.71).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So whoever Allāh wants to guide - He expands his breast to [contain] Islām; and whoever He wants to send astray[342] - He makes his breast tight and constricted as though he were climbing into the sky. Thus does Allāh place defilement upon those who do not believe.",
            "english_hilali_khan": "And whomsoever Allâh wills to guide, He opens his breast to Islâm; and whomsoever He wills to send astray, He makes his breast closed and constricted, as if he is climbing up to the sky. Thus Allâh puts the wrath on those who believe not.[1]",
            "english_rwwad": "Whoever Allah wills to guide, He opens his heart to Islam; and whoever He wills to lead astray, He make his heart tight and constricted, as if he were climbing up into the sky. This is how Allah punishes those who do not believe."
        }
    },
    {
        "id": 914,
        "chapter": 6,
        "verse": 126,
        "arabic_text": "وَهَٰذَا صِرَٰطُ رَبِّكَ مُسۡتَقِيمٗاۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَذَّكَّرُونَ",
        "phonetic": "6.126 Wa Hadhā Şirāţu Rabbika Mustaqīmāan Qad Faşşalnā Al-'Āyāti Liqawmin Yadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And this is the path of your Lord, [leading] straight. We have detailed the verses for a people who remember.",
            "english_hilali_khan": "And this is the Path of your Lord (the Qur’ân and Islâm) leading Straight. We have detailed Our Revelations for a people who take heed.",
            "english_rwwad": "This is the straight path of your Lord. We have made the verses clear for people who take heed."
        }
    },
    {
        "id": 915,
        "chapter": 6,
        "verse": 127,
        "arabic_text": "۞ لَهُمۡ دَارُ ٱلسَّلَٰمِ عِندَ رَبِّهِمۡۖ وَهُوَ وَلِيُّهُم بِمَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "6.127 Lahum Dāru As-Salāmi `Inda Rabbihim Wa Huwa Walīyuhum Bimā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For them will be the Home of Peace [i.e., Paradise] with their Lord. And He will be their protecting friend because of what they used to do.",
            "english_hilali_khan": "For them will be the home of peace (Paradise) with their Lord. And He will be their Walî (Helper and Protector) because of what they used to do.",
            "english_rwwad": "They will have the Home of Peace with their Lord, and He will be their Protector because of what they used to do."
        }
    },
    {
        "id": 916,
        "chapter": 6,
        "verse": 128,
        "arabic_text": "وَيَوۡمَ يَحۡشُرُهُمۡ جَمِيعٗا يَٰمَعۡشَرَ ٱلۡجِنِّ قَدِ ٱسۡتَكۡثَرۡتُم مِّنَ ٱلۡإِنسِۖ وَقَالَ أَوۡلِيَآؤُهُم مِّنَ ٱلۡإِنسِ رَبَّنَا ٱسۡتَمۡتَعَ بَعۡضُنَا بِبَعۡضٖ وَبَلَغۡنَآ أَجَلَنَا ٱلَّذِيٓ أَجَّلۡتَ لَنَاۚ قَالَ ٱلنَّارُ مَثۡوَىٰكُمۡ خَٰلِدِينَ فِيهَآ إِلَّا مَا شَآءَ ٱللَّهُۚ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٞ",
        "phonetic": "6.128 Wa Yawma Yaĥshuruhum Jamī`āan Yā Ma`shara Al-Jinni Qadi Astakthartum Mina Al-'Insi Wa Qāla 'Awliyā'uuhum Mina Al-'Insi Rabbanā Astamta`a Ba`đunā Biba`đin Wa Balaghnā 'Ajalanā Al-Ladhī 'Ajjalta Lanā Qāla An-Nāru Mathwākum Khālidīna Fīhā 'Illā Mā Shā'a Allāhu 'Inna Rabbaka Ĥakīmun `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention, O Muḥammad], the Day when He will gather them together [and say], \"O company of jinn, you have [misled] many of mankind.\" And their allies among mankind will say, \"Our Lord, some of us made use of others, and we have [now] reached our term which You appointed for us.\" He will say, \"The Fire is your residence, wherein you will abide eternally, except for what Allāh wills. Indeed, your Lord is Wise and Knowing.\"",
            "english_hilali_khan": "And on the Day when He will gather them (all) together (and say): \"O you assembly of jinn! Many did you mislead of men,\" and their Auliyâ’ (friends and helpers) amongst men will say: \"Our Lord! We benefited one from the other, but now we have reached our appointed term which You did appoint for us.\" He will say: \"The Fire be your dwelling-place, you will dwell therein forever, except as Allâh may will. Certainly your Lord is All-Wise, All-Knowing.\"",
            "english_rwwad": "On the Day when He will gather them all together [saying], “O assembly of jinn, you have misled many humans.” Their human friends will say, “Our Lord, we have benefited from one another, but now we have reached our term which You appointed for us.” He will say, “The Fire is your abode, abiding therein forever, except if Allah wills otherwise.” Your Lord is All-Wise, All-Knowing."
        }
    },
    {
        "id": 917,
        "chapter": 6,
        "verse": 129,
        "arabic_text": "وَكَذَٰلِكَ نُوَلِّي بَعۡضَ ٱلظَّٰلِمِينَ بَعۡضَۢا بِمَا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "6.129 Wa Kadhalika Nuwallī Ba`đa Až-Žālimīna Ba`đāan Bimā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "[343]- Another interpretation pertaining to this world is \"And thus do We make some of the wrongdoers allies of others for what they have been earning.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus will We make some of the wrongdoers allies of others for what they used to earn.[343]",
            "english_hilali_khan": "And thus We do make the Zâlimûn (polytheists and wrong-doers) Auliyâ’ (supporters and helpers) of one another (in committing crimes), because of that which they used to earn.",
            "english_rwwad": "This is how We make the wrongdoers take control over one another because of what they used to do."
        }
    },
    {
        "id": 918,
        "chapter": 6,
        "verse": 130,
        "arabic_text": "يَٰمَعۡشَرَ ٱلۡجِنِّ وَٱلۡإِنسِ أَلَمۡ يَأۡتِكُمۡ رُسُلٞ مِّنكُمۡ يَقُصُّونَ عَلَيۡكُمۡ ءَايَٰتِي وَيُنذِرُونَكُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَاۚ قَالُواْ شَهِدۡنَا عَلَىٰٓ أَنفُسِنَاۖ وَغَرَّتۡهُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا وَشَهِدُواْ عَلَىٰٓ أَنفُسِهِمۡ أَنَّهُمۡ كَانُواْ كَٰفِرِينَ",
        "phonetic": "6.130 Yā Ma`shara Al-Jinni Wa Al-'Insi 'Alam Ya'tikum Rusulun Minkum Yaquşşūna `Alaykum 'Āyā Tī Wa Yundhirūnakum Liqā'a Yawmikum Hādhā Qālū Shahidnā `Alá 'Anfusinā Wa Gharrat/humu Al-Ĥayā Atu Ad-Dunyā Wa Shahidū `Alá 'Anfusihim 'Annahum Kānū Kāfirīna",
        "footnotes": {
            "english_saheeh": "[344]- They will be reproached thus at the Judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "\"O company of jinn and mankind,[344] did there not come to you messengers from among you, relating to you My verses and warning you of the meeting of this Day of yours?\" They will say, \"We bear witness against ourselves\"; and the worldly life had deluded them, and they will bear witness against themselves that they were disbelievers.",
            "english_hilali_khan": "O you assembly of jinn and mankind! \"Did not there come to you Messengers from amongst you, reciting unto you My Verses and warning you of the meeting of this Day of yours?\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. And they will bear witness against themselves that they were disbelievers.",
            "english_rwwad": "“O assembly of jinn and humans, did there not come to you messengers from among you, reciting to you My verses and warning you of meeting this Day of yours?” They will say, “We testify against ourselves.” They were deluded by the life of this world, and they will testify against themselves that they were disbelievers."
        }
    },
    {
        "id": 919,
        "chapter": 6,
        "verse": 131,
        "arabic_text": "ذَٰلِكَ أَن لَّمۡ يَكُن رَّبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمٖ وَأَهۡلُهَا غَٰفِلُونَ",
        "phonetic": "6.131 Dhālika 'An Lam Yakun Rabbuka Muhlika Al-Qurá Bižulmin Wa 'Ahluhā Ghāfilūna",
        "footnotes": {
            "english_saheeh": "[345]- Or \"unjustly.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is because your Lord would not destroy the cities for wrongdoing[345] while their people were unaware.",
            "english_hilali_khan": "This is because your Lord would not destroy the (populations of) towns for their wrong-doing (i.e. associating others in worship along with Allâh) while their people were unaware (so the Messengers were sent).",
            "english_rwwad": "This is because your Lord would never destroy a town for their wrongdoing while its people are unaware [of the truth]."
        }
    },
    {
        "id": 920,
        "chapter": 6,
        "verse": 132,
        "arabic_text": "وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۚ وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ",
        "phonetic": "6.132 Wa Likullin Darajātun Mimmā `Amilū Wa Mā Rabbuka Bighāfilin `Ammā Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And for all are degrees [i.e., positions resulting] from what they have done. And your Lord is not unaware of what they do.",
            "english_hilali_khan": "For all there will be degrees (or ranks) according to what they did. And your Lord is not unaware of what they do.",
            "english_rwwad": "Everyone will be assigned ranks according to their deeds, for your Lord is not unaware of what they do."
        }
    },
    {
        "id": 921,
        "chapter": 6,
        "verse": 133,
        "arabic_text": "وَرَبُّكَ ٱلۡغَنِيُّ ذُو ٱلرَّحۡمَةِۚ إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَسۡتَخۡلِفۡ مِنۢ بَعۡدِكُم مَّا يَشَآءُ كَمَآ أَنشَأَكُم مِّن ذُرِّيَّةِ قَوۡمٍ ءَاخَرِينَ",
        "phonetic": "6.133 Wa Rabbuka Al-Ghanīyu Dhū Ar-Raĥmati 'In Yasha' Yudh/hibkum Wa Yastakhlif Min Ba`dikum Mā Yashā'u Kamā 'Ansha'akum Min Dhurrīyati Qawmin 'Ākharīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord is the Free of need, the possessor of mercy. If He wills, He can do away with you and give succession after you to whomever He wills, just as He produced you from the descendants of another people.",
            "english_hilali_khan": "And your Lord is Rich (Free of all needs), full of Mercy; if He wills, He can destroy you, and in your place make whom He wills as your successors, as He raised you from the seed of other people.",
            "english_rwwad": "Your Lord is the Self-Sufficient, Full of Mercy. If He wills, He can take you away and replace you with whoever He wills, just as He brought you forth from the offspring of other people."
        }
    },
    {
        "id": 922,
        "chapter": 6,
        "verse": 134,
        "arabic_text": "إِنَّ مَا تُوعَدُونَ لَأٓتٖۖ وَمَآ أَنتُم بِمُعۡجِزِينَ",
        "phonetic": "6.134 'Inna Mā Tū`adūna La'ātin Wa Mā 'Antum Bimu`jizīna",
        "footnotes": {
            "english_saheeh": "[346]- i.e., You will neither escape nor prevent its occurrence.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, what you are promised is coming, and you will not cause failure [to Allāh].[346]",
            "english_hilali_khan": "Surely, that which you are promised will verily come to pass, and you cannot escape (from the punishment of Allâh).",
            "english_rwwad": "Indeed, what you have been promised will come to pass, and you will have no escape."
        }
    },
    {
        "id": 923,
        "chapter": 6,
        "verse": 135,
        "arabic_text": "قُلۡ يَٰقَوۡمِ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنِّي عَامِلٞۖ فَسَوۡفَ تَعۡلَمُونَ مَن تَكُونُ لَهُۥ عَٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّٰلِمُونَ",
        "phonetic": "6.135 Qul Yā Qawmi A`malū `Alá Makānatikum 'Innī `Āmilun Fasawfa Ta`lamūna Man Takūnu Lahu `Āqibatu Ad-Dāri 'Innahu Lā Yufliĥu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "[347]- i.e., in the land or in the Hereafter.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"O my people, work according to your position; [for] indeed, I am working. And you are going to know who will have succession in the home.[347] Indeed, the wrongdoers will not succeed.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"O my people! Work according to your way, surely, I too am working (in my way), and you will come to know for which of us will be the (happy) end in the Hereafter. Certainly the Zâlimûn (polytheists and wrong-doers) will not be successful.\"",
            "english_rwwad": "Say [O Prophet], “O my people, carry on in your way, and so will I; you will come to know who will have the [best] ultimate abode. Indeed, the wrongdoers will never succeed.”"
        }
    },
    {
        "id": 924,
        "chapter": 6,
        "verse": 136,
        "arabic_text": "وَجَعَلُواْ لِلَّهِ مِمَّا ذَرَأَ مِنَ ٱلۡحَرۡثِ وَٱلۡأَنۡعَٰمِ نَصِيبٗا فَقَالُواْ هَٰذَا لِلَّهِ بِزَعۡمِهِمۡ وَهَٰذَا لِشُرَكَآئِنَاۖ فَمَا كَانَ لِشُرَكَآئِهِمۡ فَلَا يَصِلُ إِلَى ٱللَّهِۖ وَمَا كَانَ لِلَّهِ فَهُوَ يَصِلُ إِلَىٰ شُرَكَآئِهِمۡۗ سَآءَ مَا يَحۡكُمُونَ",
        "phonetic": "6.136 Wa Ja`alū Lillāhi Mimmā Dhara'a Mina Al-Ĥarthi Wa Al-'An`ām Naşībāan Faqālū Hādhā Lillāhi Biza`mihim Wa Hadhā Lishurakā'inā Famā Kāna Lishurakā'ihim Falā Yaşilu 'Ilá Allāhi Wa Mā Kāna Lillāhi Fahuwa Yaşilu 'Ilá Shurakā'ihim Sā'a Mā Yaĥkumūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they [i.e., the polytheists] assign to Allāh from that which He created of crops and livestock a share and say, \"This is for Allāh,\" by their claim, \"and this is for our 'partners' [associated with Him].\" But what is for their \"partners\" does not reach Allāh, while what is for Allāh - this reaches their \"partners.\" Evil is that which they rule.",
            "english_hilali_khan": "And they assign to Allâh a share of the tilth and cattle which He has created, and they say: \"This is for Allâh according to their claim, and this is for our (Allâh’s so-called) partners.\" But the share of their (Allâh’s so-called) \"partners\" reaches not Allâh, while the share of Allâh reaches their (Allâh’s so-called) \"partners\"! Evil is the way they judge!",
            "english_rwwad": "They assign to Allah a portion of the crops and livestock He created, saying, “This is for Allah” – as they claim – “and this is for our partners [idols].” But that which is assigned for their partners does not reach Allah, while that which is assigned for Allah reaches their partners. How unfair is their judgment!"
        }
    },
    {
        "id": 925,
        "chapter": 6,
        "verse": 137,
        "arabic_text": "وَكَذَٰلِكَ زَيَّنَ لِكَثِيرٖ مِّنَ ٱلۡمُشۡرِكِينَ قَتۡلَ أَوۡلَٰدِهِمۡ شُرَكَآؤُهُمۡ لِيُرۡدُوهُمۡ وَلِيَلۡبِسُواْ عَلَيۡهِمۡ دِينَهُمۡۖ وَلَوۡ شَآءَ ٱللَّهُ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا يَفۡتَرُونَ",
        "phonetic": "6.137 Wa Kadhalika Zayyana Likathīrin Mina Al-Mushrikīna Qatla 'Awlādihim Shurakā'uuhum Liyurdūhum Wa Liyalbisū `Alayhim Dīnahum Wa Law Shā'a Allāhu Mā Fa`alūhu Fadharhum Wa Mā Yaftarūna",
        "footnotes": {
            "english_saheeh": "[348]- Their evil associates.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And likewise, to many of the polytheists their partners[348] have made [to seem] pleasing the killing of their children in order to bring about their destruction and to cover them with confusion in their religion. And if Allāh had willed, they would not have done so. So leave them and that which they invent.",
            "english_hilali_khan": "their (Allâh’s so-called) \"partners\" have made fair-seeming the killing of their children, in order to lead them to their own destruction and cause confusion in their religion. And if Allâh had willed, they would not have done so. So leave them alone with their fabrications.",
            "english_rwwad": "Similarly, the evil associates of the pagans have made the killing of their children appealing to them, in order to lead them to destruction and confuse them in their faith. If Allah had willed, they would not have done that. So leave them to their fabrications."
        }
    },
    {
        "id": 926,
        "chapter": 6,
        "verse": 138,
        "arabic_text": "وَقَالُواْ هَٰذِهِۦٓ أَنۡعَٰمٞ وَحَرۡثٌ حِجۡرٞ لَّا يَطۡعَمُهَآ إِلَّا مَن نَّشَآءُ بِزَعۡمِهِمۡ وَأَنۡعَٰمٌ حُرِّمَتۡ ظُهُورُهَا وَأَنۡعَٰمٞ لَّا يَذۡكُرُونَ ٱسۡمَ ٱللَّهِ عَلَيۡهَا ٱفۡتِرَآءً عَلَيۡهِۚ سَيَجۡزِيهِم بِمَا كَانُواْ يَفۡتَرُونَ",
        "phonetic": "6.138 Wa Qālū Hadhihi 'An`āmun Wa Ĥarthun Ĥijrun Lā Yaţ`amuhā 'Illā Man Nashā'u Biza`mihim Wa 'An`āmun Ĥurrimat Žuhūruhā Wa 'An`āmun Lā Yadhkurūna Asma Allāhi `Alayhā Aftirā'an `Alayhi Sayajzīhim Bimā Kānū Yaftarūna",
        "footnotes": {
            "english_saheeh": "[349]- The four categories of grazing livestock called \"anʿām\" collectively.\n[350]- See 5:103.\n[351]- At the time of slaughter.  Rather, they are dedicated to others among their \"deities.\"\n[352]- i.e., false assertions that such practices are part of Allāh's religion.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"These animals[349] and crops are forbidden; no one may eat from them except whom we will,\" by their claim. And there are those [camels] whose backs are forbidden [by them][350] and those upon which the name of Allāh is not mentioned[351] - [all of this] an invention of untruth about Him.[352] He will punish them for what they were inventing.",
            "english_hilali_khan": "And according to their claim, they say that such and such cattle and crops are forbidden, and none should eat of them except those whom we allow. And (they say) there are cattle forbidden to be used for burden (or any other work), and cattle on which (at slaughtering) the Name of Allâh is not pronounced; lying against Him (Allâh). He will recompense them for what they used to fabricate.",
            "english_rwwad": "They say, “These livestock and crops are reserved, none may eat them except those whom we wish,” – as they claim – and there are livestock whose backs are forbidden [from labor], and livestock over whom they do not mention the name of Allah [while slaughtering] – fabricating lies against Him. He will punish them for their lies."
        }
    },
    {
        "id": 927,
        "chapter": 6,
        "verse": 139,
        "arabic_text": "وَقَالُواْ مَا فِي بُطُونِ هَٰذِهِ ٱلۡأَنۡعَٰمِ خَالِصَةٞ لِّذُكُورِنَا وَمُحَرَّمٌ عَلَىٰٓ أَزۡوَٰجِنَاۖ وَإِن يَكُن مَّيۡتَةٗ فَهُمۡ فِيهِ شُرَكَآءُۚ سَيَجۡزِيهِمۡ وَصۡفَهُمۡۚ إِنَّهُۥ حَكِيمٌ عَلِيمٞ",
        "phonetic": "6.139 Wa Qālū Mā Fī Buţūni Hadhihi Al-'An`āmi Khālişatun Lidhukūrinā Wa Muĥarramun `Alá 'Azwājinā Wa 'In Yakun Maytatan Fahum Fīhi Shurakā'u Sayajzīhim Waşfahum 'Innahu Ĥakīmun `Alīmun",
        "footnotes": {
            "english_saheeh": "[353]- i.e., their milk and offspring.\n[354]- Of what is lawful and unlawful according to their whims.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"What is in the bellies of these animals[353] is exclusively for our males and forbidden to our females. But if it is [born] dead, then all of them have shares therein.\" He will punish them for their description.[354] Indeed, He is Wise and Knowing.",
            "english_hilali_khan": "And they say: \"What is in the bellies of such and such cattle (milk or foetus) is for our males alone, and forbidden to our females (girls and women), but if it is born dead, then all have shares therein.\" He will punish them for their attribution (of such false orders to Allâh). Verily, He is All-Wise, All-Knower. (Tafsir At-Tabarî).",
            "english_rwwad": "They also say, “What is in the bellies of these livestock is exclusively for our males and forbidden to our females, but if it is stillborn, they all will have share in it. He will punish them for what they attribute. He is All-Wise, All-Knowing."
        }
    },
    {
        "id": 928,
        "chapter": 6,
        "verse": 140,
        "arabic_text": "قَدۡ خَسِرَ ٱلَّذِينَ قَتَلُوٓاْ أَوۡلَٰدَهُمۡ سَفَهَۢا بِغَيۡرِ عِلۡمٖ وَحَرَّمُواْ مَا رَزَقَهُمُ ٱللَّهُ ٱفۡتِرَآءً عَلَى ٱللَّهِۚ قَدۡ ضَلُّواْ وَمَا كَانُواْ مُهۡتَدِينَ",
        "phonetic": "6.140 Qad Khasira Al-Ladhīna Qatalū 'Awlādahum Safahāan Bighayri `Ilmin Wa Ĥarramū Mā Razaqahumu Allāhu Aftirā'an `Alá Allāhi Qad Đallū Wa Mā Kānū Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will have lost who killed their children in foolishness without knowledge and prohibited what Allāh had provided for them, inventing untruth about Allāh. They have gone astray and were not [rightly] guided.",
            "english_hilali_khan": "Indeed lost are they who have killed their children, foolishly, without knowledge, and have forbidden that which Allâh has provided for them, inventing a lie against Allâh. They have indeed gone astray and were not guided.",
            "english_rwwad": "Losers indeed are those who kill their children foolishly out of ignorance, and prohibit what Allah has provided for them – fabricating lies against Him. They have gone astray and are not guided."
        }
    },
    {
        "id": 929,
        "chapter": 6,
        "verse": 141,
        "arabic_text": "۞ وَهُوَ ٱلَّذِيٓ أَنشَأَ جَنَّٰتٖ مَّعۡرُوشَٰتٖ وَغَيۡرَ مَعۡرُوشَٰتٖ وَٱلنَّخۡلَ وَٱلزَّرۡعَ مُخۡتَلِفًا أُكُلُهُۥ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُتَشَٰبِهٗا وَغَيۡرَ مُتَشَٰبِهٖۚ كُلُواْ مِن ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَءَاتُواْ حَقَّهُۥ يَوۡمَ حَصَادِهِۦۖ وَلَا تُسۡرِفُوٓاْۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡرِفِينَ",
        "phonetic": "6.141 Wa Huwa Al-Ladhī 'Ansha'a Jannātin Ma`rūshātin Wa Ghayra Ma`rūshātin Wa An-Nakhla Wa Az-Zar`a Mukhtalifāan 'Ukuluhu Wa Az-Zaytūna Wa Ar-Rummāna Mutashābihāan Wa Ghayra Mutashābihin Kulū Min Thamarihi 'Idhā 'Athmara Wa 'Ātū Ĥaqqahu Yawma Ĥaşādihi Wa Lā Tusrifū 'Innahu Lā Yuĥibbu Al-Musrifīna",
        "footnotes": {
            "english_saheeh": "[355]- In eating, as well as in all things generally.",
            "english_hilali_khan": "(V.6:141): See the footnote of (V.4:5).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He it is who causes gardens to grow, [both] trellised and untrellised, and palm trees and crops of different [kinds of] food and olives and pomegranates, similar and dissimilar. Eat of [each of] its fruit when it yields and give its due [zakāh] on the day of its harvest. And be not excessive.[355] Indeed, He does not like those who commit excess.",
            "english_hilali_khan": "And it is He Who produces gardens trellised and untrellised, and date-palms, and crops of different shape and taste (their fruits and their seeds) and olives, and pomegranates, similar (in kind) and different (in taste). Eat of their fruit when they ripen, but pay the due thereof (its Zakât according to Allâh’s Orders 1/10th or 1/20th) on the day of its harvest, and waste not by extravagance[1]. Verily, He likes not Al-Musrifûn (those who waste by extravagance),",
            "english_rwwad": "It is He Who brings into being gardens – trellised and untrellised – and palm trees and crops of different flavors, and olives and pomegranates – similar [in shape] yet different [in taste]. Eat of their fruit when they bear fruit and give out its due on the day of harvest. But do not be wasteful, for He does not like those who are wasteful."
        }
    },
    {
        "id": 930,
        "chapter": 6,
        "verse": 142,
        "arabic_text": "وَمِنَ ٱلۡأَنۡعَٰمِ حَمُولَةٗ وَفَرۡشٗاۚ كُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ",
        "phonetic": "6.142 Wa Mina Al-'An`āmi Ĥamūlatan Wa Farshāan Kulū Mimmā Razaqakumu Allāhu Wa Lā Tattabi`ū Khuţuwāti Ash-Shayţāni 'Innahu Lakum `Adūwun Mubīnun",
        "footnotes": {
            "english_saheeh": "[356]- As the disbelievers have done in making their own rulings about what is permissible and what is prohibited.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of the grazing livestock are carriers [of burdens] and those [too] small. Eat of what Allāh has provided for you and do not follow the footsteps of Satan.[356] Indeed, he is to you a clear enemy.",
            "english_hilali_khan": "And of the cattle (are some) for burden (like camels) and (some are) small (unable to carry burden like sheep and goats - for food, meat, milk and wool). Eat of what Allâh has provided for you, and follow not the footsteps of Shaitân (Satan). Surely he is to you an open enemy.",
            "english_rwwad": "Among livestock are some that carry loads and others not. Eat of what Allah has provided for you, and do not follow the footsteps of Satan, for He is your sworn enemy."
        }
    },
    {
        "id": 931,
        "chapter": 6,
        "verse": 143,
        "arabic_text": "ثَمَٰنِيَةَ أَزۡوَٰجٖۖ مِّنَ ٱلضَّأۡنِ ٱثۡنَيۡنِ وَمِنَ ٱلۡمَعۡزِ ٱثۡنَيۡنِۗ قُلۡ ءَآلذَّكَرَيۡنِ حَرَّمَ أَمِ ٱلۡأُنثَيَيۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَيۡهِ أَرۡحَامُ ٱلۡأُنثَيَيۡنِۖ نَبِّـُٔونِي بِعِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "6.143 Thamāniyata 'Azwājin Mina Ađ-Đa'ni Athnayni Wa Mina Al-Ma`zi Athnayni Qul 'Āldhakarayni Ĥarrama 'Ami Al-'Unthayayni 'Ammā Ashtamalat `Alayhi 'Arĥāmu Al-'Unthayayni Nabbi'ūnī Bi`ilmin 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:143) Narrated Abu Hurairah رضي الله عنه: I heard Allâh’s Messenger صلى الله عليه وسلم saying, \"While a shepherd was amongst his sheep, a wolf attacked them and took away one sheep. When the shepherd chased the wolf, the wolf turned towards him and said, ‘Who will be their guard on the day of wild animals when nobody except I will be their shepherd’*. And while a man was driving a cow with a load on it, it turned towards him and spoke to him saying, ‘I have not been created for this purpose, but for ploughing.’\" The people said, \"Glorified be Allâh.\" The Prophetصلى الله عليه وسلم said, \"But I believe in it and so does Abu Bakr and ‘Umar رضي الله عنهم.\" (Sahih Al-Bukhâri, Vol.5, Hadîth No.15).\n* It has been written that a wolf also spoke to a shepherd during the Prophet’s lifetime near Al-Madinah, as narrated in Musnad Imam Ahmad in the Musnad of Abu Sa‘îd Al-Khudri رضي الله عنه (Vol.3, Page 83): Narrated Abu Sa‘îd Al-Khudri رضي الله عنه: (While a shepherd was in his hered of sheep), suddenly a wolf attacked a sheep and took it away, the shepherd chased the wolf and took back the sheep, the wolf sat on its tail and addressed the shepherd saying: \"Be afraid of Allâh, you have taken the provision from me which Allâh gave me.\" The shepherd said: \"What an amazing thing! A wolf sitting on its tail speaks to me in the language of a human being.\" The wolf said: \"Shall I tell you something more amazing than this? There is Muhammad صلى الله عليه وسلم the Messenger of Allâh in Yathrib (Al-Madinah) informing the people about the news of the past.\" Then the shepherd (after hearing that) proceeded (towards Al-Madinah) driving his sheep till he entered Al-Madinah, cornered his sheep in a place, and came to Allâh’s Messenger (Muhammad صلى الله عليه وسلم and informed the whole story. Allâh’s Messenger صلى الله عليه وسلم ordered for the proclamation of a congregational salat (صلاة جامعة) then he صلى الله عليه وسلم came out and asked the shepherd to inform the people (about the story), and he informed them. Then Allâh’s Messenger صلى الله عليه وسلم said: \"He (the shepherd) has spoken the truth. By Him (Allâh) in Whose Hands my soul is, the Day of Resurrection will not be established till beasts of prey (سباع) speak to the human beings, and the stick lash and the shoe-laces of a person speak to him and his thigh inform him about his family as to what happened to them after him.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[They are] eight mates - of the sheep, two and of the goats, two. Say, \"Is it the two males He has forbidden or the two females or that which the wombs of the two females contain? Inform me with knowledge, if you should be truthful.\"",
            "english_hilali_khan": "Eight pairs: of the sheep two (male and female),[1] and of the goats two (male and female). Say: \"Has He forbidden the two males or the two females, or (the young) which the wombs of the two females enclose? Inform me with knowledge if you are truthful.\"",
            "english_rwwad": "[They are] eight [in four] pairs: a pair of sheep and a pair of goats. Say, “Has He forbidden the two males or the two females, or what the wombs of the two females contain? Tell me on the basis of knowledge if you are truthful.”"
        }
    },
    {
        "id": 932,
        "chapter": 6,
        "verse": 144,
        "arabic_text": "وَمِنَ ٱلۡإِبِلِ ٱثۡنَيۡنِ وَمِنَ ٱلۡبَقَرِ ٱثۡنَيۡنِۗ قُلۡ ءَآلذَّكَرَيۡنِ حَرَّمَ أَمِ ٱلۡأُنثَيَيۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَيۡهِ أَرۡحَامُ ٱلۡأُنثَيَيۡنِۖ أَمۡ كُنتُمۡ شُهَدَآءَ إِذۡ وَصَّىٰكُمُ ٱللَّهُ بِهَٰذَاۚ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا لِّيُضِلَّ ٱلنَّاسَ بِغَيۡرِ عِلۡمٍۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ",
        "phonetic": "6.144 Wa Mina Al-'Ibili Athnayni Wa Mina Al-Baqari Athnayni Qul 'Āldhakarayni Ĥarrama 'Ami Al-'Unthayayni 'Ammā Ashtamalat `Alayhi 'Arĥāmu Al-'Unthayayni 'Am Kuntum Shuhadā'a 'Idh Waşşākumu Allāhu Bihadhā Faman 'Ažlamu Mimmani Aftará `Alá Allāhi Kadhibāan Liyuđilla An-Nāsa Bighayri `Ilmin 'Inna Allāha Lā Yahdī Al-Qawma Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of the camels, two and of the cattle, two. Say, \"Is it the two males He has forbidden or the two females or that which the wombs of the two females contain? Or were you witnesses when Allāh charged you with this? Then who is more unjust than one who invents a lie about Allāh to mislead the people by [something] other than knowledge? Indeed, Allāh does not guide the wrongdoing people.\"",
            "english_hilali_khan": "And of the camels two (male and female), and of oxen two (male and female). Say: \"Has He forbidden the two males or the two females or (the young) which the wombs of the two females enclose? Or were you present when Allâh ordered you such a thing? Then who does more wrong than one who invents a lie against Allâh, to lead mankind astray without knowledge. Certainly Allâh guides not the people who are Zâlimûn (polytheists and wrong-doers).\"",
            "english_rwwad": "Likewise, a pair of camels and a pair of cattle. Say, “Has He forbidden the two males or the two females, or what the wombs of the two females contain? Or were you present when Allah gave you this commandment?” So who does greater wrong than the one who fabricates lies against Allah in order to mislead people without knowledge? Allah does not guide the wrongdoing people."
        }
    },
    {
        "id": 933,
        "chapter": 6,
        "verse": 145,
        "arabic_text": "قُل لَّآ أَجِدُ فِي مَآ أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَىٰ طَاعِمٖ يَطۡعَمُهُۥٓ إِلَّآ أَن يَكُونَ مَيۡتَةً أَوۡ دَمٗا مَّسۡفُوحًا أَوۡ لَحۡمَ خِنزِيرٖ فَإِنَّهُۥ رِجۡسٌ أَوۡ فِسۡقًا أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۚ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ رَبَّكَ غَفُورٞ رَّحِيمٞ",
        "phonetic": "6.145 Qul Lā 'Ajidu Fī Mā 'Ūĥiya 'Ilayya Muĥarramāan `Alá Ţā`imin Yaţ`amuhu 'Illā 'An Yakūna Maytatan 'Aw Damāan Masfūĥāan 'Aw Laĥma Khinzīrin Fa'innahu Rijsun 'Aw Fisqāan 'Uhilla Lighayri Allāhi Bihi Famani Ađţurra Ghayra Bāghin Wa Lā `Ādin Fa'inna Rabbaka Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[357]- Refer to 2:173 and 5:3.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"I do not find within that which was revealed to me [anything] forbidden to one who would eat it unless it be a dead animal or blood spilled out or the flesh of swine - for indeed, it is impure - or it be [that slaughtered in] disobedience, dedicated to other than Allāh.[357] But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit], then indeed, your Lord is Forgiving and Merciful.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I find not in that which has been revealed to me anything forbidden to be eaten by one who wishes to eat it, unless it be Maitah (a dead animal) or blood poured forth (by slaughtering or the like), or the flesh of swine (pork); for that surely is impure or impious (unlawful) meat (of an animal) which is slaughtered as a sacrifice for others than Allâh (or has been slaughtered for idols, or on which Allâh’s Name has not been mentioned while slaughtering). But whosoever is forced by necessity without wilful disobedience, nor transgressing due limits; (for him) certainly, your Lord is Oft-Forgiving, Most Merciful.\"",
            "english_rwwad": "Say [O Prophet], “I do not find in what has been revealed to me anything forbidden to eat except carrion, running blood or the swine flesh – which is impure – or a sinful offering in the name of other than Allah. However, if someone is compelled by necessity – neither driven by desire nor transgressing due limit – then your Lord is All-Forgiving, Most Merciful.”"
        }
    },
    {
        "id": 934,
        "chapter": 6,
        "verse": 146,
        "arabic_text": "وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا كُلَّ ذِي ظُفُرٖۖ وَمِنَ ٱلۡبَقَرِ وَٱلۡغَنَمِ حَرَّمۡنَا عَلَيۡهِمۡ شُحُومَهُمَآ إِلَّا مَا حَمَلَتۡ ظُهُورُهُمَآ أَوِ ٱلۡحَوَايَآ أَوۡ مَا ٱخۡتَلَطَ بِعَظۡمٖۚ ذَٰلِكَ جَزَيۡنَٰهُم بِبَغۡيِهِمۡۖ وَإِنَّا لَصَٰدِقُونَ",
        "phonetic": "6.146 Wa `Alá Al-Ladhīna Hādū Ĥarramnā Kulla Dhī Žufurin Wa Mina Al-Baqari Wa Al-Ghanami Ĥarramnā `Alayhim Shuĥūmahumā 'Illā Mā Ĥamalat Žuhūruhumā 'Awi Al-Ĥawāyā 'Aw Mā Akhtalaţa Bi`ažmin Dhālika Jazaynāhum Bibaghyihim Wa 'Innā Laşādiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to those who are Jews We prohibited every animal of uncloven hoof; and of the cattle and the sheep We prohibited to them their fat, except what adheres to their backs or the entrails or what is joined with bone. [By] that We repaid them for their transgression. And indeed, We are truthful.",
            "english_hilali_khan": "And unto those who are Jews, We forbade every (animal) with undivided hoof, and We forbade them the fat of the ox and the sheep except what adheres to their backs or their entrails, or is mixed up with a bone. Thus We recompensed them for their rebellion [committing crimes like murdering the Prophets and eating of Ribâ (usury)]. And verily, We are Truthful.",
            "english_rwwad": "To the Jews We forbade every animal of undivided hooves, and of the cattle and sheep, We forbade their fat except what attaches to their backs or intestines, or what sticks to their bones. This is how We recompensed them for their transgression, and We are Truthful."
        }
    },
    {
        "id": 935,
        "chapter": 6,
        "verse": 147,
        "arabic_text": "فَإِن كَذَّبُوكَ فَقُل رَّبُّكُمۡ ذُو رَحۡمَةٖ وَٰسِعَةٖ وَلَا يُرَدُّ بَأۡسُهُۥ عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِينَ",
        "phonetic": "6.147 Fa'in Kadhabūka Faqul Rabbukum Dhū Raĥmatin Wāsi`atin Wa Lā Yuraddu Ba'suhu `Ani Al-Qawmi Al-Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So if they deny you, [O Muḥammad], say, \"Your Lord is the possessor of vast mercy; but His punishment cannot be repelled from the people who are criminals.\"",
            "english_hilali_khan": "If they (Jews) belie you (Muhammad صلى الله عليه وسلم) say: \"Your Lord is the Owner of Vast Mercy, and never will His Wrath be turned back from the people who are Mujrimûn (criminals, polytheists or sinners).\"",
            "english_rwwad": "But if they reject you [O Prophet], then say, “Your Lord is the possessor of infinite mercy, but His punishment cannot be averted from the wicked people.”"
        }
    },
    {
        "id": 936,
        "chapter": 6,
        "verse": 148,
        "arabic_text": "سَيَقُولُ ٱلَّذِينَ أَشۡرَكُواْ لَوۡ شَآءَ ٱللَّهُ مَآ أَشۡرَكۡنَا وَلَآ ءَابَآؤُنَا وَلَا حَرَّمۡنَا مِن شَيۡءٖۚ كَذَٰلِكَ كَذَّبَ ٱلَّذِينَ مِن قَبۡلِهِمۡ حَتَّىٰ ذَاقُواْ بَأۡسَنَاۗ قُلۡ هَلۡ عِندَكُم مِّنۡ عِلۡمٖ فَتُخۡرِجُوهُ لَنَآۖ إِن تَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ أَنتُمۡ إِلَّا تَخۡرُصُونَ",
        "phonetic": "6.148 Sayaqūlu Al-Ladhīna 'Ashrakū Law Shā'a Allāhu Mā 'Ashraknā Wa Lā 'Ābā'uunā Wa Lā Ĥarramnā Min Shay'in Kadhālika Kadhaba Al-Ladhīna Min Qablihim Ĥattá Dhāqū Ba'sanā Qul Hal `Indakum Min `Ilmin Fatukhrijūhu Lanā 'In Tattabi`ūna 'Illā Až-Žanna Wa 'In 'Antum 'Illā Takhruşūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who associated [others] with Allāh will say, \"If Allāh had willed, we would not have associated [anything] and neither would our fathers, nor would we have prohibited anything.\" Likewise did those before deny until they tasted Our punishment. Say, \"Do you have any knowledge that you can produce for us? You follow not except assumption, and you are not but misjudging.\"",
            "english_hilali_khan": "Those who took partners (in worship) with Allâh will say: \"If Allâh had willed, we would not have taken partners (in worship) with Him, nor would our fathers, and we would not have forbidden anything (against His Will).\" Likewise belied those who were before them, (they argued falsely with Allâh’s Messengers), till they tasted Our Wrath. Say: \"Have you any knowledge (proof) that you can produce before us? Verily, you follow nothing but guess and you do nothing but lie.\"",
            "english_rwwad": "Those who associate partners with Allah will say, “If Allah had willed, neither we nor our forefathers would have associated anything with Him, nor would we have made anything forbidden.” Likewise, those who came before them rejected the truth until they tasted Our punishment. Say, “Do you have any knowledge that you can present to us? You follow nothing but assumption and you do nothing but lie."
        }
    },
    {
        "id": 937,
        "chapter": 6,
        "verse": 149,
        "arabic_text": "قُلۡ فَلِلَّهِ ٱلۡحُجَّةُ ٱلۡبَٰلِغَةُۖ فَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ",
        "phonetic": "6.149 Qul Falillāhi Al-Ĥujjatu Al-Bālighatu Falaw Shā'a Lahadākum 'Ajma`īna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"With Allāh is the far-reaching [i.e., conclusive] argument. If He had willed, He would have guided you all.\"",
            "english_hilali_khan": "Say: \"With Allâh is the perfect proof and argument, (i.e. the Oneness of Allâh, the sending of His Messengers and His Holy Books to mankind); had He so willed, He would indeed have guided you all.\"",
            "english_rwwad": "Say, “Allah alone has the most conclusive argument. If He had willed, He could have guided you all.”"
        }
    },
    {
        "id": 938,
        "chapter": 6,
        "verse": 150,
        "arabic_text": "قُلۡ هَلُمَّ شُهَدَآءَكُمُ ٱلَّذِينَ يَشۡهَدُونَ أَنَّ ٱللَّهَ حَرَّمَ هَٰذَاۖ فَإِن شَهِدُواْ فَلَا تَشۡهَدۡ مَعَهُمۡۚ وَلَا تَتَّبِعۡ أَهۡوَآءَ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا وَٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ وَهُم بِرَبِّهِمۡ يَعۡدِلُونَ",
        "phonetic": "6.150 Qul Halumma Shuhadā'akumu Al-Ladhīna Yash/hadūna 'Anna Allāha Ĥarrama Hādhā Fa'in Shahidū Falā Tash/had Ma`ahum Wa Lā Tattabi` 'Ahwā'a Al-Ladhīna Kadhabū Bi'āyātinā Wa Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati Wa Hum Birabbihim Ya`dilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Bring forward your witnesses who will testify that Allāh has prohibited this.\" And if they testify, do not testify with them. And do not follow the desires of those who deny Our verses and those who do not believe in the Hereafter, while they equate [others] with their Lord.",
            "english_hilali_khan": "Say: \"Bring forward your witnesses, who can testify that Allâh has forbidden this. Then if they testify, testify not you (O Muhammad صلى الله عليه وسلم) with them. And you should not follow the vain desires of such as treat Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) as falsehoods, and such as believe not in the Hereafter, and they hold others as equal (in worship) with their Lord.\"",
            "english_rwwad": "Say [O Prophet], “Bring your witnesses who can testify that Allah has forbidden all this.” If they testify, do not testify with them. Do not follow the desires of those who reject Our verses, and who disbelieve in the Hereafter, and they set up equals to their Lord."
        }
    },
    {
        "id": 939,
        "chapter": 6,
        "verse": 151,
        "arabic_text": "۞ قُلۡ تَعَالَوۡاْ أَتۡلُ مَا حَرَّمَ رَبُّكُمۡ عَلَيۡكُمۡۖ أَلَّا تُشۡرِكُواْ بِهِۦ شَيۡـٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗاۖ وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُم مِّنۡ إِمۡلَٰقٖ نَّحۡنُ نَرۡزُقُكُمۡ وَإِيَّاهُمۡۖ وَلَا تَقۡرَبُواْ ٱلۡفَوَٰحِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَۖ وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۚ ذَٰلِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ",
        "phonetic": "6.151 Qul Ta`ālaw 'Atlu Mā Ĥarrama Rabbukum `Alaykum 'Allā Tushrikū Bihi Shay'āan Wa Bil-Wālidayni 'Iĥsānāan Wa Lā Taqtulū 'Awlādakum Min 'Imlāqin Naĥnu Narzuqukum Wa 'Īyāhum Wa Lā Taqrabū Al-Fawāĥisha Mā Žahara Minhā Wa Mā Baţana Wa Lā Taqtulū An-Nafsa Allatī Ĥarrama Allāhu 'Illā Bil-Ĥaqqi Dhālikum Waşşākum Bihi La`allakum Ta`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Come, I will recite what your Lord has prohibited to you. [He commands] that you not associate anything with Him, and to parents, good treatment, and do not kill your children out of poverty; We will provide for you and them. And do not approach immoralities - what is apparent of them and what is concealed. And do not kill the soul which Allāh has forbidden [to be killed] except by [legal] right. This has He instructed you that you may use reason.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Come, I will recite what your Lord has prohibited you from: Join not anything in worship with Him; be good and dutiful to your parents; kill not your children because of poverty - We provide sustenance for you and for them; come not near to Al-Fawâhish (shameful sins, illegal sexual intercourse) whether committed openly or secretly; and kill not anyone whom Allâh has forbidden, except for a just cause (according to Islâmic law). This He has commanded you that you may understand.",
            "english_rwwad": "Say [O Prophet], “Come, I will recite to you what your Lord has forbidden to you: do not associate any partners with Him, and honor your parents. Do not kill your children for fear of poverty, for We provide for you and for them. Do not approach shameful acts, whether openly or in secret. Do not kill the soul sanctified by Allah, except lawfully. This is what He commands you, so that you may understand."
        }
    },
    {
        "id": 940,
        "chapter": 6,
        "verse": 152,
        "arabic_text": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ ٱلۡكَيۡلَ وَٱلۡمِيزَانَ بِٱلۡقِسۡطِۖ لَا نُكَلِّفُ نَفۡسًا إِلَّا وُسۡعَهَاۖ وَإِذَا قُلۡتُمۡ فَٱعۡدِلُواْ وَلَوۡ كَانَ ذَا قُرۡبَىٰۖ وَبِعَهۡدِ ٱللَّهِ أَوۡفُواْۚ ذَٰلِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَذَكَّرُونَ",
        "phonetic": "6.152 Wa Lā Taqrabū Māla Al-Yatīmi 'Illā Bi-Atī Hiya 'Aĥsanu Ĥattá Yablugha 'Ashuddahu Wa 'Awfū Al-Kayla Wa Al-Mīzāna Bil-Qisţi Lā Nukallifu Nafsāan 'Illā Wus`ahā Wa 'Idhā Qultum Fā`dilū Wa Law Kāna Dhā Qurbá Wa Bi`ahdi Allāhi 'Awfū Dhālikum Waşşākum Bihi La`allakum Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:152):\nA) See the footnotes of (V.3:130).\nB) See the footnote of (V.4:135).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not approach the orphan's property except in a way that is best [i.e., intending improvement] until he reaches maturity. And give full measure and weight in justice. We do not charge any soul except [with that within] its capacity. And when you speak [i.e., testify], be just, even if [it concerns] a near relative. And the covenant of Allāh fulfill. This has He instructed you that you may remember.",
            "english_hilali_khan": "\"And come not near to the orphan’s property, except to improve it, until he (or she) attains the age of full strength; and give full measure and full weight with justice. We burden not any person, but that which he can bear. And whenever you give your word (i.e. judge between men or give evidence), say the truth even if a near relative is concerned, and fulfil the Covenant of Allâh. This He commands you, that you may remember[1].",
            "english_rwwad": "Do not approach the orphan’s property, except to improve it, until he attains maturity. Give full measure and weight with justice. We do not burden any soul beyond what it can bear. And maintain justice when you speak, even if it be about a close relative. And fulfill the covenant of Allah. This is what He commands you, so that you may take heed."
        }
    },
    {
        "id": 941,
        "chapter": 6,
        "verse": 153,
        "arabic_text": "وَأَنَّ هَٰذَا صِرَٰطِي مُسۡتَقِيمٗا فَٱتَّبِعُوهُۖ وَلَا تَتَّبِعُواْ ٱلسُّبُلَ فَتَفَرَّقَ بِكُمۡ عَن سَبِيلِهِۦۚ ذَٰلِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَتَّقُونَ",
        "phonetic": "6.153 Wa 'Anna Hādhā Şirāţī Mustaqīmāan Fa Attabi`ūhu Wa Lā Tattabi`ū As-Subula Fatafarraqa Bikum `An Sabīlihi Dhālikum Waşşākum Bihi La`allakum Tattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And, [moreover], this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way. This has He instructed you that you may become righteous.",
            "english_hilali_khan": "is My Straight Path, so follow it, and follow not (other) paths, for they will separate you away from His Path. This He has ordained for you that you may become Al-Muttaqûn (the pious - see V.2:2).\"",
            "english_rwwad": "This is My straight path; follow it and do not follow other ways, lest they lead you away from His way. This is what He commands you, so that you may become righteous.”"
        }
    },
    {
        "id": 942,
        "chapter": 6,
        "verse": 154,
        "arabic_text": "ثُمَّ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ تَمَامًا عَلَى ٱلَّذِيٓ أَحۡسَنَ وَتَفۡصِيلٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ لَّعَلَّهُم بِلِقَآءِ رَبِّهِمۡ يُؤۡمِنُونَ",
        "phonetic": "6.154 Thumma 'Ātaynā Mūsá Al-Kitāba Tamāmāan `Alá Al-Ladhī 'Aĥsana Wa Tafşīlāan Likulli Shay'in Wa Hudáan Wa Raĥmatan La`allahum Biliqā'i Rabbihim Yu'uminūna",
        "footnotes": {
            "english_saheeh": "[358]- Meaning \"additionally\" or \"moreover,\" not denoting time sequence.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then[358] We gave Moses the Scripture, making complete [Our favor] upon the one who did good [i.e., Moses] and as a detailed explanation of all things and as guidance and mercy that perhaps in the meeting with their Lord they would believe.",
            "english_hilali_khan": "Then, We gave Mûsâ (Moses) the Book [the Taurât (Torah)] to complete (Our Favour) upon those who would do right, and explaining all things in detail and a guidance and a mercy that they might believe in the meeting with their Lord.",
            "english_rwwad": "Then We gave Moses the Scripture, completing [Our favor] upon those who do good, and explaining everything in detail, and as a guidance and a mercy, so that they may believe in their meeting with their Lord."
        }
    },
    {
        "id": 943,
        "chapter": 6,
        "verse": 155,
        "arabic_text": "وَهَٰذَا كِتَٰبٌ أَنزَلۡنَٰهُ مُبَارَكٞ فَٱتَّبِعُوهُ وَٱتَّقُواْ لَعَلَّكُمۡ تُرۡحَمُونَ",
        "phonetic": "6.155 Wa Hadhā Kitābun 'Anzalnāhu Mubārakun Fa Attabi`ūhu Wa Attaqū La`allakum Turĥamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And this [Qur’ān] is a Book We have revealed [which is] blessed, so follow it and fear Allāh that you may receive mercy.",
            "english_hilali_khan": "And this is a blessed Book (the Qur’ân) which We have sent down, so follow it and fear Allâh (i.e. do not disobey His Orders), that you may receive mercy (i.e. be saved from the torment of Hell).",
            "english_rwwad": "This [Qur’an] is a blessed Book which We have sent down, so follow it and fear Allah, so that you may be shown mercy."
        }
    },
    {
        "id": 944,
        "chapter": 6,
        "verse": 156,
        "arabic_text": "أَن تَقُولُوٓاْ إِنَّمَآ أُنزِلَ ٱلۡكِتَٰبُ عَلَىٰ طَآئِفَتَيۡنِ مِن قَبۡلِنَا وَإِن كُنَّا عَن دِرَاسَتِهِمۡ لَغَٰفِلِينَ",
        "phonetic": "6.156 'An Taqūlū 'Innamā 'Unzila Al-Kitābu `Alá Ţā'ifatayni Min Qablinā Wa 'In Kunnā `An Dirāsatihim Laghāfilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[We revealed it] lest you say, \"The Scripture was only sent down to two groups before us, but we were of their study unaware,\"",
            "english_hilali_khan": "Lest you (pagan Arabs) should say: \"The Book was sent down only to two sects before us (the Jews and the Christians), and for our part, we were in fact unaware of what they studied.\"",
            "english_rwwad": "You [pagans] may no longer say, “Scriptures were only sent down to two groups before us, and we were unaware of their teachings.”"
        }
    },
    {
        "id": 945,
        "chapter": 6,
        "verse": 157,
        "arabic_text": "أَوۡ تَقُولُواْ لَوۡ أَنَّآ أُنزِلَ عَلَيۡنَا ٱلۡكِتَٰبُ لَكُنَّآ أَهۡدَىٰ مِنۡهُمۡۚ فَقَدۡ جَآءَكُم بَيِّنَةٞ مِّن رَّبِّكُمۡ وَهُدٗى وَرَحۡمَةٞۚ فَمَنۡ أَظۡلَمُ مِمَّن كَذَّبَ بِـَٔايَٰتِ ٱللَّهِ وَصَدَفَ عَنۡهَاۗ سَنَجۡزِي ٱلَّذِينَ يَصۡدِفُونَ عَنۡ ءَايَٰتِنَا سُوٓءَ ٱلۡعَذَابِ بِمَا كَانُواْ يَصۡدِفُونَ",
        "phonetic": "6.157 'Aw Taqūlū Law 'Annā 'Unzila `Alaynā Al-Kitābu Lakunnā 'Ahdá Minhum Faqad Jā'akum Bayyinatun Min Rabbikum Wa Hudáan Wa Raĥmatun Faman 'Ažlamu Mimman Kadhaba Bi'āyāti Allāhi Wa Şadafa `Anhā Sanajzī Al-Ladhīna Yaşdifūna `An 'Āyātinā Sū'a Al-`Adhābi Bimā Kānū Yaşdifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or lest you say, \"If only the Scripture had been revealed to us, we would have been better guided than they.\" So there has [now] come to you a clear evidence from your Lord and a guidance and mercy. Then who is more unjust than one who denies the verses of Allāh and turns away from them? We will recompense those who turn away from Our verses with the worst of punishment for their having turned away.",
            "english_hilali_khan": "Or lest you (pagan Arabs) should say: \"If only the Book had been sent down to us, we would surely have been better guided than they (Jews and Christians).\" So now has come unto you a clear proof (the Qur’ân) from your Lord, and a guidance and a mercy. Who then does more wrong than one who rejects the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh and turns away therefrom? We shall requite those who turn away from Our Ayât with an evil torment, because of their turning away (from them). [Tafsir At-Tabari]",
            "english_rwwad": "Or you would say, “If only the Scriptures had been sent down to us, we would have been better guided than they.” Now there has come to you a clear proof from your Lord, a guidance and a mercy. Who does greater wrong than he who denies the verses of Allah and turns away from them? We will recompense those who turn away from Our verses with the worst punishment, for their turning away."
        }
    },
    {
        "id": 946,
        "chapter": 6,
        "verse": 158,
        "arabic_text": "هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ رَبُّكَ أَوۡ يَأۡتِيَ بَعۡضُ ءَايَٰتِ رَبِّكَۗ يَوۡمَ يَأۡتِي بَعۡضُ ءَايَٰتِ رَبِّكَ لَا يَنفَعُ نَفۡسًا إِيمَٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِيٓ إِيمَٰنِهَا خَيۡرٗاۗ قُلِ ٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ",
        "phonetic": "6.158 Hal Yanžurūna 'Illā 'An Ta'tiyahumu Al-Malā'ikatu 'Aw Ya'tiya Rabbuka 'Aw Ya'tiya Ba`đu 'Āyāti Rabbika Yawma Ya'tī Ba`đu 'Āyāti Rabbika Lā Yanfa`u Nafsāan 'Īmānuhā Lam Takun 'Āmanat Min Qablu 'Aw Kasabat Fī 'Īmānihā Khayrāan Qul Antažirū 'Innā Muntažirūna",
        "footnotes": {
            "english_saheeh": "[359]- Those denoting the approach of the Last Hour.",
            "english_hilali_khan": "(V.6:158):\nA) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"The Hour will not be established until the sun rises from the west; and when the people see it, then whoever will be living on the surface of the earth, will have faith, and that is (the time) when no good will it do to a person to believe then, if he believed not before.\" (6:158) (Sahih Al-Bukhârî, Vol.6, Hadîth No.159).\nB) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said; \"When the following three signs appear, no good will it do to a person to believe then if he believed not before:\n1) Rising of the sun from the west.\n2) (The coming of Al-Masîh) Ad-Dajjal.\n3) (The coming out of the) Dâbbat-ul-Ard (i.e. a beast from the earth).\" (Sahih Muslim - The Book of Fitan - The Signs of the coming of the Hour).\nC). Narrated Anas رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"No Prophet was sent but that he warned his followers against the one-eyed liar (Al-Masîh-Ad-Dajjâl). Beware! He is blind in one eye, and your Lord is not so, and there will be written between his (Al-Masîh Ad-Dajiâl’s) eyes (the word) Kâfir (i.e., disbeliever).\" [This Hadîth is also quoted by Abu Hurairah and Ibn ‘Abbâs. (Sahih Al-Bukhârî, Vol.9, Hadîth No.245)].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they [then] wait for anything except that the angels should come to them or your Lord should come or that there come some of the signs[359] of your Lord? The Day that some of the signs of your Lord will come no soul will benefit from its faith as long as it had not believed before or had earned through its faith some good. Say, \"Wait. Indeed, we [also] are waiting.\"",
            "english_hilali_khan": "Do they then wait for anything other than that the angels should come to them, or that your Lord (Allâh) should come, or that some of the Signs of your Lord should come (i.e. portents of the Hour e.g., rising of the sun from the west)! The day that some of the Signs of your Lord do come, no good will it do to a person to believe then, if he believed not before, nor earned good (by performing deeds of righteousness) through his Faith. Say: \"Wait you! we (too) are waiting.\"[1]",
            "english_rwwad": "Are they waiting for the coming of the angels, or the coming of your Lord, or the coming of some of your Lord’s signs? On the Day when some of your Lord’s signs come, belief will be of no benefit to those who did not believe before, or those who did not do some good through their faith. Say, “Wait then; we too are waiting.”"
        }
    },
    {
        "id": 947,
        "chapter": 6,
        "verse": 159,
        "arabic_text": "إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗا لَّسۡتَ مِنۡهُمۡ فِي شَيۡءٍۚ إِنَّمَآ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُواْ يَفۡعَلُونَ",
        "phonetic": "6.159 'Inna Al-Ladhīna Farraqū Dīnahum Wa Kānū Shiya`āan Lasta Minhum Fī Shay'in 'Innamā 'Amruhum 'Ilá Allāhi Thumma Yunabbi'uhum Bimā Kānū Yaf`alūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.6:159) It is said that the Prophet صلى الله عليه وسلم recited this Verse and said: \"These people are those who invent new things (Bid‘ah) in religion and the followers of the vain desires of this Muslim nation, and their repentance will not be accepted by Allâh.\" (TafsirAl-Qurtubi).\n[It has been narrated in the Hadîth Books (At-Tirmidhi, Ibn Mâjah and Abu Dâwûd) that the Prophet صلى الله عليه وسلم said: \"The Jews and the Christians will be divided into seventy-one or seventy-two religious sects and this nation will be divided into seventy-three religious sects, - all in Hell, except one, and that one is: on which I and my Companions are today, i.e. following the Qur’ân and the Prophet’s Sunnah (legal ways, orders, acts of worship, statements)\"].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have divided their religion and become sects - you, [O Muḥammad], are not [associated] with them in anything. Their affair is only [left] to Allāh; then He will inform them about what they used to do.",
            "english_hilali_khan": "Verily, those who divide their religion and break up into sects (all kinds of religious sects)[2], you (O Muhammad صلى الله عليه وسلم) have no concern in them in the least. Their affair is only with Allâh, Who then will tell them what they used to do.",
            "english_rwwad": "Those who have made divisions in their religion and turned into factions, you have nothing to do with them. Their case rests with Allah alone; He will inform them of what they used to do."
        }
    },
    {
        "id": 948,
        "chapter": 6,
        "verse": 160,
        "arabic_text": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَا وَهُمۡ لَا يُظۡلَمُونَ",
        "phonetic": "6.160 Man Jā'a Bil-Ĥasanati Falahu `Ashru 'Amthālihā Wa Man Jā'a Bis-Sayyi'ati Falā Yujzá 'Illā Mithlahā Wa Hum Lā Yužlamūna",
        "footnotes": {
            "english_saheeh": "[360]- i.e., treated unjustly.",
            "english_hilali_khan": "(V.6:160) See the footnote of (V.6:61).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged.[360]",
            "english_hilali_khan": "Whoever brings a good deed (Islâmic Monotheism and deeds of obedience to Allâh and His Messenger صلى الله عليه وسلم) shall have ten times the like thereof to his credit, and whoever brings an evil deed (polytheism, disbelief, hypocrisy, and deeds of disobedience to Allâh and His Messenger صلى الله عليه وسلم) shall have only the recompense of the like thereof, and they will not be wronged.[3]",
            "english_rwwad": "Whoever comes with a good deed will be rewarded tenfold, but whoever comes with an evil deed will only be punished with its like; and none will be wronged."
        }
    },
    {
        "id": 949,
        "chapter": 6,
        "verse": 161,
        "arabic_text": "قُلۡ إِنَّنِي هَدَىٰنِي رَبِّيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ دِينٗا قِيَمٗا مِّلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "6.161 Qul 'Innanī Hadānī Rabbī 'Ilá Şirāţin Mustaqīmin Dīnāan Qiyamāan Millata 'Ibrāhīma Ĥanīfāan Wa Mā Kāna Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, my Lord has guided me to a straight path - a correct religion - the way of Abraham, inclining toward truth. And he was not among those who associated others with Allāh.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Truly, my Lord has guided me to a Straight Path, a right religion, the religion of Ibrâhîm (Abraham), Hanîfa [i.e. the true Islâmic Monotheism - to believe in One God (Allâh i.e. to worship none but Allâh, Alone)] and he was not of Al-Mushrikûn (See V.2:105).\"",
            "english_rwwad": "Say [O Prophet], “Indeed, my Lord has guided me to a straight path, an upright religion, the faith of Abraham, inclining to true faith, and he was not one of those who associate partners with Allah.”"
        }
    },
    {
        "id": 950,
        "chapter": 6,
        "verse": 162,
        "arabic_text": "قُلۡ إِنَّ صَلَاتِي وَنُسُكِي وَمَحۡيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "6.162 Qul 'Inna Şalātī Wa Nusukī Wa Maĥyāya Wa Mamātī Lillāhi Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allāh, Lord of the worlds.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Verily, my Salât (prayer), my sacrifice, my living, and my dying are for Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "Say, “Indeed, my prayer, my sacrifice, my living and my dying are all for Allah, Lord of the worlds."
        }
    },
    {
        "id": 951,
        "chapter": 6,
        "verse": 163,
        "arabic_text": "لَا شَرِيكَ لَهُۥۖ وَبِذَٰلِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِينَ",
        "phonetic": "6.163 Lā Sharīka Lahu Wa Bidhalika 'Umirtu Wa 'Anā 'Awwalu Al-Muslimīna",
        "footnotes": {
            "english_saheeh": "[361]- i.e., those who submit to the will of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "No partner has He. And this I have been commanded, and I am the first [among you] of the Muslims.\"[361]",
            "english_hilali_khan": "\"He has no partner. And of this I have been commanded, and I am the first of the Muslims.\"",
            "english_rwwad": "He has no partner. This is what I have been commanded, and I am the first to submit to Allah.”"
        }
    },
    {
        "id": 952,
        "chapter": 6,
        "verse": 164,
        "arabic_text": "قُلۡ أَغَيۡرَ ٱللَّهِ أَبۡغِي رَبّٗا وَهُوَ رَبُّ كُلِّ شَيۡءٖۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ",
        "phonetic": "6.164 Qul 'Aghayra Allāhi 'Abghī Rabbāan Wa Huwa Rabbu Kulli Shay'in Wa Lā Taksibu Kullu Nafsin 'Illā `Alayhā Wa Lā Taziru Wāziratun Wizra 'Ukhrá Thumma 'Ilá Rabbikum Marji`ukum Fayunabbi'ukum Bimā Kuntum Fīhi Takhtalifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Is it other than Allāh I should desire as a lord while He is the Lord of all things? And every soul earns not [blame] except against itself, and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you concerning that over which you used to differ.\"",
            "english_hilali_khan": "Say: \"Shall I seek a lord other than Allâh, while He is the Lord of all things? No person earns any (sin) except against himself (only), and no bearer of burdens shall bear the burden of another. Then unto your Lord is your return, so He will tell you that wherein you have been differing.\"",
            "english_rwwad": "Say [O Prophet], “Should I seek a lord other than Allah, when He is the Lord of everything?” Every soul will face the consequence of its actions. No bearer of burden will bear the burden of another. Then to your Lord is your return, and He will inform you concerning that over which you used to differ."
        }
    },
    {
        "id": 953,
        "chapter": 6,
        "verse": 165,
        "arabic_text": "وَهُوَ ٱلَّذِي جَعَلَكُمۡ خَلَٰٓئِفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمُۢ",
        "phonetic": "6.165 Wa Huwa Al-Ladhī Ja`alakum Khalā'ifa Al-'Arđi Wa Rafa`a Ba`đakum Fawqa Ba`đin Darajātin Liyabluwakum Fī Mā 'Ātākum 'Inna Rabbaka Sarī`u Al-`Iqābi Wa 'Innahu Laghafūrun Raĥīmun ",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who has made you successors upon the earth and has raised some of you above others in degrees [of rank] that He may try you through what He has given you. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful.",
            "english_hilali_khan": "And it is He Who has made you generations coming after generations, replacing each other on the earth. And He has raised you in ranks, some above others that He may try you in that which He has bestowed on you. Surely your Lord is Swift in retribution, and certainly He is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "It is He Who has made you successors on earth and raised some of you over others in ranks, so that He may test you with that which He has given you. Your Lord is swift in punishment, and He is All-Forgiving, Most Merciful."
        }
    }
]