[
    {
        "id": 5217,
        "chapter": 65,
        "verse": 1,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا",
        "phonetic": "65.1 Yā 'Ayyuhā An-Nabīyu 'Idhā Ţallaqtumu An-Nisā' Faţalliqūhunna Li`iddatihinna Wa 'Aĥşū Al-`Iddata Wa Attaqū Allāha Rabbakum Lā Tukhrijūhunna Min Buyūtihinna Wa Lā Yakhrujna 'Illā 'An Ya'tīna Bifāĥishatin Mubayyinatin Wa Tilka Ĥudūdu Allāhi Wa Man Yata`adda Ĥudūda Allāhi Faqad Žalama Nafsahu Lā Tadrī La`alla Allāha Yuĥdithu Ba`da Dhālika 'Amrāan",
        "footnotes": {
            "english_saheeh": "[1697]- See rulings in 2:228-233.  A wife should not be divorced except after the completion of her menstrual period but before sexual intercourse has occurred, or else during a confirmed pregnancy.  The pronouncement of divorce begins her waiting period (ʿiddah).\n[1698]- Such as regret or renewed desire for the wife.",
            "english_hilali_khan": "(V.65:1) Narrated ‘Abdullâh bin ‘Umar رضي الله عنهما that he had divorced his wife while she was menstruating during the lifetime of Allâh’s Messenger صلى الله عليه وسلم . ‘Umar bin Al-Khattâb رضي الله عنه asked Allâh’s Messenger صلى الله عليه وسلم about that. Allâh’s Messenger صلى الله عليه وسلم said, \"Order him (your son) to take her back and keep her till she is clean from her menses and then to wait till she gets her next period and becomes clean again, whereupon, if he wishes to keep her, he can do so, and if he wishes to divorce her he can divorce her before having sexual intercourse with her; and that is the ‘Iddah (prescribed period) which Allâh has fixed for the women meant to be divorced.\" (Sahih Al Bukhari, Vol.7, Hadîth No.178).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Prophet, when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period and keep count of the waiting period,[1697] and fear Allāh, your Lord. Do not turn them out of their [husbands'] houses, nor should they [themselves] leave [during that period] unless they are committing a clear immorality. And those are the limits [set by] Allāh. And whoever transgresses the limits of Allāh has certainly wronged himself. You know not; perhaps Allāh will bring about after that a [different] matter.[1698]",
            "english_hilali_khan": "1. O Prophet (صلى الله عليه وسلم)! When you divorce women, divorce them at their ‘Iddah (prescribed periods) and count (accurately) their ‘Iddah (periods[1]). And fear Allâh your Lord (O Muslims). And turn them not out of their (husband’s) homes nor shall they (themselves) leave, except in case they are guilty of some open illegal sexual intercourse. And those are the set limits of Allâh. And whosoever transgresses the set limits of Allâh, then indeed he has wronged himself. You (the one who divorces his wife) know not it may be that Allâh will afterward bring some new thing to pass (i.e. to return her back to you if that was the first or second divorce).",
            "english_rwwad": "O Prophet, when you [believers] divorce women, divorce them with concern to their waiting period and keep an accurate count of the waiting period, and fear Allah, your Lord. Do not force them out of their houses, nor should they leave unless they commit a clear shameful act. Such are the limits ordained by Allah. Whoever transgresses the limits ordained by Allah has truly wronged himself. You never know, perhaps Allah will bring about a change [of heart] later."
        }
    },
    {
        "id": 5218,
        "chapter": 65,
        "verse": 2,
        "arabic_text": "فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا",
        "phonetic": "65.2 Fa'idhā Balaghna 'Ajalahunna Fa'amsikūhunna Bima`rūfin 'Aw Fāriqūhunna Bima`rūfin Wa 'Ash/hidū Dhaway `Adlin Minkum Wa 'Aqīmū Ash-Shahādata Lillāhi Dhālikum Yū`ažu Bihi Man Kāna Yu'uminu Billāhi Wa Al-Yawmi Al-'Ākhiri Wa Man Yattaqi Allāha Yaj`al Lahu Makhrajāan",
        "footnotes": {
            "english_saheeh": "[1699]- i.e., relief from distress.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they have [nearly] fulfilled their term, either retain them according to acceptable terms or part with them according to acceptable terms. And bring to witness two just men from among you and establish the testimony for [the acceptance of] Allāh. That is instructed to whoever should believe in Allāh and the Last Day. And whoever fears Allāh - He will make for him a way out[1699]",
            "english_hilali_khan": "Then when they are about to attain their term appointed, either take them back in a good manner or part with them in a good manner. And take as witness two just persons from among you (Muslims). And establish the testimony for Allâh. That will be an admonition given to him who believes in Allâh and the Last Day. And whosoever fears Allâh and keeps his duty to Him, He will make a way for him to get out (from every difficulty).",
            "english_rwwad": "Then when they have approached the end of their waiting period, either retain them honorably or part with them honorably. Call two just men from among yourselves as witnesses, and give true testimony for the sake of Allah. This is an exhortation for those who believe in Allah and the Last Day. Whoever fears Allah, He will make a way out for him,"
        }
    },
    {
        "id": 5219,
        "chapter": 65,
        "verse": 3,
        "arabic_text": "وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا",
        "phonetic": "65.3 Wa Yarzuqhu Min Ĥaythu Lā Yaĥtasibu Wa Man Yatawakkal `Alá Allāhi Fahuwa Ĥasbuhu 'Inna Allāha Bālighu 'Amrihi Qad Ja`ala Allāhu Likulli Shay'in Qadrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And will provide for him from where he does not expect. And whoever relies upon Allāh - then He is sufficient for him. Indeed, Allāh will accomplish His purpose. Allāh has already set for everything a [decreed] extent.",
            "english_hilali_khan": "And He will provide him from (sources) he never could imagine. And whosoever puts his trust in Allâh, then He will suffice him. Verily, Allâh will accomplish his purpose. Indeed Allâh has set a measure for all things.",
            "english_rwwad": "and He will provide for him from where he does not expect. Whoever puts his trust in Allah, He is sufficient for him. Indeed, Allah will surely accomplish His purpose, for Allah has set a destiny for everything."
        }
    },
    {
        "id": 5220,
        "chapter": 65,
        "verse": 4,
        "arabic_text": "وَٱلَّٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا",
        "phonetic": "65.4 Wa Al-Lā'ī Ya'isna Mina Al-Maĥīđi Min Nisā'ikum 'Ini Artabtum Fa`iddatuhunna Thalāthatu 'Ash/hurin Wa Al-Lā'ī Lam Yaĥiđna Wa 'Ūlātu Al-'Aĥmāli 'Ajaluhunna 'An Yađa`na Ĥamlahunna Wa Man Yattaqi Allāha Yaj`al Lahu Min 'Amrihi Yusrāan",
        "footnotes": {
            "english_saheeh": "[1700]- The ruling concerning pregnancy applies also in the case of the husband's death.",
            "english_hilali_khan": "(V.65:4) See the Our’ân, Verse 2:234.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth.[1700] And whoever fears Allāh - He will make for him of his matter ease.",
            "english_hilali_khan": "And those of your women as have passed the age of monthly courses, for them the ‘Iddah (prescribed period), if you have doubt (about their periods), is three months; and for those who have no courses [(i.e. they are still immature) their ‘Iddah (prescribed period) is three months likewise, except in case of death][2]. And for those who are pregnant (whether they are divorced or their husbands are dead), their ‘Iddah (prescribed period) is until they lay down their burden; and whosoever fears Allâh and keeps his duty to Him, He will make his matter easy for him.",
            "english_rwwad": "As for those women from among you who reached their menopause, in case you doubt, their waiting period is three months, as well as of those who have not yet menstruated. As for pregnant women, their waiting period ends with delivery. And whoever fears Allah, He will make his matters easy for him."
        }
    },
    {
        "id": 5221,
        "chapter": 65,
        "verse": 5,
        "arabic_text": "ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّـَٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا",
        "phonetic": "65.5 Dhālika 'Amru Allāhi 'Anzalahu 'Ilaykum Wa Man Yattaqi Allāha Yukaffir `Anhu Sayyi'ātihi Wa Yu`žim Lahu 'Ajrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is the command of Allāh, which He has sent down to you; and whoever fears Allāh - He will remove for him his misdeeds and make great for him his reward.",
            "english_hilali_khan": "That is the Command of Allâh, which He has sent down to you; and whosoever fears Allâh and keeps his duty to Him, He will expiate from him his sins, and will enlarge his reward.",
            "english_rwwad": "This is the commandment of Allah that He has sent down to you. Whoever fears Allah, He will absolve him of his bad deeds and will reward him immensely."
        }
    },
    {
        "id": 5222,
        "chapter": 65,
        "verse": 6,
        "arabic_text": "أَسۡكِنُوهُنَّ مِنۡ حَيۡثُ سَكَنتُم مِّن وُجۡدِكُمۡ وَلَا تُضَآرُّوهُنَّ لِتُضَيِّقُواْ عَلَيۡهِنَّۚ وَإِن كُنَّ أُوْلَٰتِ حَمۡلٖ فَأَنفِقُواْ عَلَيۡهِنَّ حَتَّىٰ يَضَعۡنَ حَمۡلَهُنَّۚ فَإِنۡ أَرۡضَعۡنَ لَكُمۡ فَـَٔاتُوهُنَّ أُجُورَهُنَّ وَأۡتَمِرُواْ بَيۡنَكُم بِمَعۡرُوفٖۖ وَإِن تَعَاسَرۡتُمۡ فَسَتُرۡضِعُ لَهُۥٓ أُخۡرَىٰ",
        "phonetic": "65.6 'Askinūhunna Min Ĥaythu Sakantum Min Wujdikum Wa Lā Tuđārrūhunna Lituđayyiqū `Alayhinna Wa 'In Kunna 'Ūlāti Ĥamlin Fa'anfiqū `Alayhinna Ĥattá Yađa`na Ĥamlahunna Fa'in 'Arđa`na Lakum Fa'ātūhunna 'Ujūrahunna Wa 'Tamirū Baynakum Bima`rūfin Wa 'In Ta`āsartum Fasaturđi`u Lahu 'Ukhrá",
        "footnotes": {
            "english_saheeh": "[1701]- During their waiting period (referring to wives whose divorce has been pronounced).\n[1702]- So that they would be forced to leave or to ransom themselves.\n[1703]- See 2:233.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Lodge them[1701] [in a section] of where you dwell out of your means and do not harm them in order to oppress them.[1702] And if they should be pregnant, then spend on them until they give birth. And if they breastfeed for you, then give them their payment and confer among yourselves in the acceptable way; but if you are in discord, then there may breastfeed for him [i.e., the father] another woman.[1703]",
            "english_hilali_khan": "6. Lodge them (the divorced women) where you dwell, according to your means, and do not harm them so as to straiten them (that they be obliged to leave your house). And if they are pregnant, then spend on them till they lay down their burden. Then if they give suck to the children for you, give them their due payment, and let each of you accept the advice of the other in a just way. But if you make difficulties for one another, then some other woman may give suck for him (the father of the child).",
            "english_rwwad": "Let them live where you live [during their waiting period], according to your means, and do not harass them to make their stay unbearable. If they are pregnant, maintain them until they deliver, and if they suckle your child, compensate them, and graciously settle the question of compensation by mutual understanding. But if you fail to reach an agreement, then another woman may suckle the child."
        }
    },
    {
        "id": 5223,
        "chapter": 65,
        "verse": 7,
        "arabic_text": "لِيُنفِقۡ ذُو سَعَةٖ مِّن سَعَتِهِۦۖ وَمَن قُدِرَ عَلَيۡهِ رِزۡقُهُۥ فَلۡيُنفِقۡ مِمَّآ ءَاتَىٰهُ ٱللَّهُۚ لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا مَآ ءَاتَىٰهَاۚ سَيَجۡعَلُ ٱللَّهُ بَعۡدَ عُسۡرٖ يُسۡرٗا",
        "phonetic": "65.7 Liyunfiq Dhū Sa`atin Min Sa`atihi Wa Man Qudira `Alayhi Rizquhu Falyunfiq Mimmā 'Ātāhu Allāhu Lā Yukallifu Allāhu Nafsāan 'Illā Mā 'Ātāhā Sayaj`alu Allāhu Ba`da `Usrin Yusrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allāh has given him. Allāh does not charge a soul except [according to] what He has given it. Allāh will bring about, after hardship, ease [i.e., relief].",
            "english_hilali_khan": "Let the rich man spend according to his means; and the man whose resources are restricted, let him spend according to what Allâh has given him. Allâh puts no burden on any person beyond what He has given him. Allâh will grant after hardship, ease.",
            "english_rwwad": "Let the wealthy man spend according to his means. As for the one with limited resources, he should spend according to whatever Allah has given him. Allah does not burden any soul beyond what He has given him. Allah will bring about ease after hardship."
        }
    },
    {
        "id": 5224,
        "chapter": 65,
        "verse": 8,
        "arabic_text": "وَكَأَيِّن مِّن قَرۡيَةٍ عَتَتۡ عَنۡ أَمۡرِ رَبِّهَا وَرُسُلِهِۦ فَحَاسَبۡنَٰهَا حِسَابٗا شَدِيدٗا وَعَذَّبۡنَٰهَا عَذَابٗا نُّكۡرٗا",
        "phonetic": "65.8 Wa Ka'ayyin Min Qaryatin `Atat `An 'Amri Rabbihā Wa Rusulihi Faĥāsabnāhā Ĥisābāan Shadīdāan Wa `Adhabnāhā `Adhābāan Nukrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how many a city was insolent toward the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment.",
            "english_hilali_khan": "And many a town (population) revolted against the Command of its Lord and His Messengers; and We called it to a severe account (i.e. torment in this worldly life), and We shall punish it with a horrible torment (in Hell in the Hereafter).",
            "english_rwwad": "And [imagine] how many towns rebelled against the commandments of their Lord and His messengers, so We called them to a severe account and punished them with a horrendous punishment."
        }
    },
    {
        "id": 5225,
        "chapter": 65,
        "verse": 9,
        "arabic_text": "فَذَاقَتۡ وَبَالَ أَمۡرِهَا وَكَانَ عَٰقِبَةُ أَمۡرِهَا خُسۡرًا",
        "phonetic": "65.9 Fadhāqat Wabāla 'Amrihā Wa Kāna `Āqibatu 'Amrihā Khusrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it tasted the bad consequence of its affair [i.e., rebellion], and the outcome of its affair was loss.",
            "english_hilali_khan": "So it tasted the evil result of its affair (disbelief), and the consequence of its affair (disbelief) was loss (destruction in this life and an eternal punishment in the Hereafter).",
            "english_rwwad": "Thus they tasted the evil consequence of their deeds, and the outcome of their deeds was a total loss."
        }
    },
    {
        "id": 5226,
        "chapter": 65,
        "verse": 10,
        "arabic_text": "أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابٗا شَدِيدٗاۖ فَٱتَّقُواْ ٱللَّهَ يَٰٓأُوْلِي ٱلۡأَلۡبَٰبِ ٱلَّذِينَ ءَامَنُواْۚ قَدۡ أَنزَلَ ٱللَّهُ إِلَيۡكُمۡ ذِكۡرٗا",
        "phonetic": "65.10 'A`adda Allāhu Lahum `Adhābāan Shadīdāan Fa Attaqū Allāha Yā 'Ūlī Al-'Albābi Al-Ladhīna 'Āmanū Qad 'Anzala Allāhu 'Ilaykum Dhikrāan",
        "footnotes": {
            "english_saheeh": "[1704]- Some scholars have interpreted \"dhikr\" here as \"a reminder,\" meaning the Messenger (ﷺ), since he is mentioned in the following verse.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has prepared for them a severe punishment; so fear Allāh, O you of understanding who have believed. Allāh has sent down to you a message [i.e., the Qur’ān].[1704]",
            "english_hilali_khan": "Allâh has prepared for them a severe torment. So fear Allâh and keep your duty to Him, O men of understanding who have believed! Allâh has indeed sent down to you a Reminder (this Qur’ân).",
            "english_rwwad": "Allah has prepared for them a severe punishment. So fear Allah O people of understanding who have faith. Allah has sent down to you a Reminder,"
        }
    },
    {
        "id": 5227,
        "chapter": 65,
        "verse": 11,
        "arabic_text": "رَّسُولٗا يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِ ٱللَّهِ مُبَيِّنَٰتٖ لِّيُخۡرِجَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَمَن يُؤۡمِنۢ بِٱللَّهِ وَيَعۡمَلۡ صَٰلِحٗا يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ قَدۡ أَحۡسَنَ ٱللَّهُ لَهُۥ رِزۡقًا",
        "phonetic": "65.11 Rasūlāan Yatlū `Alaykum 'Āyāti Allāhi Mubayyinātin Liyukhrija Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Mina Až-Žulumāti 'Ilá An-Nūri Wa Man Yu'umin Billāhi Wa Ya`mal Şāliĥāan Yudkhilhu Jannātin Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā 'Abadāan Qad 'Aĥsana Allāhu Lahu Rizqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He sent] a Messenger [i.e., Muḥammad (ﷺ)] reciting to you the distinct verses of Allāh that He may bring out those who believe and do righteous deeds from darknesses into the light. And whoever believes in Allāh and does righteousness - He will admit him into gardens beneath which rivers flow to abide therein forever. Allāh will have perfected for him a provision.",
            "english_hilali_khan": "(And has also sent to you) a Messenger (Muhammad صلى الله عليه وسلم), who recites to you the Verses of Allâh (the Qur’ân) containing clear explanations, that He may take out those who believe and do righteous good deeds, from the darkness (of polytheism and disbelief) to the light (of Islamic Monotheism). And whosoever believes in Allâh and performs righteous good deeds, He will admit him into Gardens under which rivers flow (Paradise) to dwell therein forever. Allâh has indeed granted for him an excellent provision.",
            "english_rwwad": "a Messenger who recites to you the clear verses of Allah, so that He may bring those who believe and do righteous deeds out of the depths of darkness into the light. Whoever believes in Allah and does righteous deeds, He will admit him to gardens under which rivers flow, abiding therein forever. Allah has prepared for him a good provision."
        }
    },
    {
        "id": 5228,
        "chapter": 65,
        "verse": 12,
        "arabic_text": "ٱللَّهُ ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ وَمِنَ ٱلۡأَرۡضِ مِثۡلَهُنَّۖ يَتَنَزَّلُ ٱلۡأَمۡرُ بَيۡنَهُنَّ لِتَعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ وَأَنَّ ٱللَّهَ قَدۡ أَحَاطَ بِكُلِّ شَيۡءٍ عِلۡمَۢا",
        "phonetic": "65.12 Allāhu Al-Ladhī Khalaqa Sab`a Samāwātin Wa Mina Al-'Arđi Mithlahunna Yatanazzalu Al-'Amru Baynahunna Lita`lamū 'Anna Allāha `Alá Kulli Shay'in Qadīrun Wa 'Anna Allāha Qad 'Aĥāţa Bikulli Shay'in `Ilmāan",
        "footnotes": {
            "english_saheeh": "[1705]- i.e., a similar number:  seven.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is Allāh who has created seven heavens and of the earth, the like of them.[1705] [His] command descends among them so you may know that Allāh is over all things competent and that Allāh has encompassed all things in knowledge.",
            "english_hilali_khan": "It is Allâh Who has created seven heavens and of the earth the like thereof (i.e. seven). His Command descends between them (heavens and earth), that you may know that Allâh has power over all things, and that Allâh surrounds all things in (His) Knowledge.",
            "english_rwwad": "Allah is the One who has created seven heavens, and likewise for the earth. The Command descends between them so that you may know that Allah is Most Capable of all things, and that Allah has encompassed everything in knowledge."
        }
    }
]