[
    {
        "id": 5475,
        "chapter": 73,
        "verse": 1,
        "arabic_text": "يَٰٓأَيُّهَا ٱلۡمُزَّمِّلُ",
        "phonetic": "73.1 Yā 'Ayyuhā Al-Muzzammilu",
        "footnotes": {
            "english_saheeh": "[1778]- Allāh (subḥānahu wa taʿālā) addresses the Prophet (ﷺ), who was asleep, wrapped in his garments.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who wraps himself [in clothing][1778]",
            "english_hilali_khan": "O you wrapped in garments (i.e. Prophet Muhammad صلى الله عليه وسلم)!",
            "english_rwwad": "O you the enwrapped one,"
        }
    },
    {
        "id": 5476,
        "chapter": 73,
        "verse": 2,
        "arabic_text": "قُمِ ٱلَّيۡلَ إِلَّا قَلِيلٗا",
        "phonetic": "73.2 Qumi Al-Layla 'Illā Qalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Arise [to pray] the night, except for a little -",
            "english_hilali_khan": "Stand (to pray) all night, except a little -",
            "english_rwwad": "Stand up in prayer at night except a little,"
        }
    },
    {
        "id": 5477,
        "chapter": 73,
        "verse": 3,
        "arabic_text": "نِّصۡفَهُۥٓ أَوِ ٱنقُصۡ مِنۡهُ قَلِيلًا",
        "phonetic": "73.3 Nişfahu 'Aw Anquş Minhu Qalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Half of it - or subtract from it a little",
            "english_hilali_khan": "Half of it or a little less than that,",
            "english_rwwad": "half of it, or a little less,"
        }
    },
    {
        "id": 5478,
        "chapter": 73,
        "verse": 4,
        "arabic_text": "أَوۡ زِدۡ عَلَيۡهِ وَرَتِّلِ ٱلۡقُرۡءَانَ تَرۡتِيلًا",
        "phonetic": "73.4 'Aw Zid `Alayhi Wa Rattili Al-Qur'āna Tartīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.73:4) See the footnote of (V.29:51).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or add to it, and recite the Qur’ān with measured recitation.",
            "english_hilali_khan": "Or a little more. And recite the Qur’ân (aloud) in a slow, (pleasant tone and) style.[1]",
            "english_rwwad": "or a little more, and recite the Qur’an at a measured pace."
        }
    },
    {
        "id": 5479,
        "chapter": 73,
        "verse": 5,
        "arabic_text": "إِنَّا سَنُلۡقِي عَلَيۡكَ قَوۡلٗا ثَقِيلًا",
        "phonetic": "73.5 'Innā Sanulqī `Alayka Qawlāan Thaqīlāan",
        "footnotes": {
            "english_saheeh": "[1779]- i.e., the revelation, which when descending on the Prophet (ﷺ) bore down upon him with a great weight.  Another meaning is \"important ordinances.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We will cast upon you a heavy word.[1779]",
            "english_hilali_khan": "Verily, We shall send down to you a weighty Word (i.e. obligations, laws).",
            "english_rwwad": "We will send down upon you a heavy revelation."
        }
    },
    {
        "id": 5480,
        "chapter": 73,
        "verse": 6,
        "arabic_text": "إِنَّ نَاشِئَةَ ٱلَّيۡلِ هِيَ أَشَدُّ وَطۡـٔٗا وَأَقۡوَمُ قِيلًا",
        "phonetic": "73.6 'Inna Nāshi'ata Al-Layli Hiya 'Ashaddu Waţ'āan Wa 'Aqwamu Qīlāan",
        "footnotes": {
            "english_saheeh": "[1780]- Another accepted interpretation of the same words is \"Indeed, arising at night is more difficult...,\" meaning that it will only be done by sincere believers and not others.\n[1781]- i.e., for recitation of the Qur’ān and for hearing and understanding it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue][1780] and more suitable for words.[1781]",
            "english_hilali_khan": "Verily, the rising by night (for Tahajjud prayer) is very hard and most potent and good for governing oneself, and most suitable for (understanding) the Word (of Allâh).",
            "english_rwwad": "Indeed, prayer at night is more effective and more conducive to proper recitation."
        }
    },
    {
        "id": 5481,
        "chapter": 73,
        "verse": 7,
        "arabic_text": "إِنَّ لَكَ فِي ٱلنَّهَارِ سَبۡحٗا طَوِيلٗا",
        "phonetic": "73.7 'Inna Laka Fī Aalnnahāri Sabĥāan Ţawīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, for you by day is prolonged occupation.",
            "english_hilali_khan": "Verily, there is for you by day prolonged occupation with ordinary duties.",
            "english_rwwad": "In daytime, you have plenty of time for your worldly matters."
        }
    },
    {
        "id": 5482,
        "chapter": 73,
        "verse": 8,
        "arabic_text": "وَٱذۡكُرِ ٱسۡمَ رَبِّكَ وَتَبَتَّلۡ إِلَيۡهِ تَبۡتِيلٗا",
        "phonetic": "73.8 Wa Adhkur Asma Rabbika Wa Tabattal 'Ilayhi Tabtīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And remember the name of your Lord and devote yourself to Him with [complete] devotion.",
            "english_hilali_khan": "And remember the Name of your Lord and devote yourself to Him with a complete devotion.",
            "english_rwwad": "And remember the Name of your Lord, and devote yourself completely to Him."
        }
    },
    {
        "id": 5483,
        "chapter": 73,
        "verse": 9,
        "arabic_text": "رَّبُّ ٱلۡمَشۡرِقِ وَٱلۡمَغۡرِبِ لَآ إِلَٰهَ إِلَّا هُوَ فَٱتَّخِذۡهُ وَكِيلٗا",
        "phonetic": "73.9 Rabbu Al-Mashriqi Wa Al-Maghribi Lā 'Ilāha 'Illā Huwa Fa Attakhidh/hu Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "[1782]- i.e., trust in Allāh and rely upon Him.",
            "english_hilali_khan": "(V.73:9) See the (V.3:173) and its footnotes.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.[1782]",
            "english_hilali_khan": "(He Alone is) the Lord of the east and the west; Lâ ilâha illâ Huwa (none has the right to be worshipped but He). So take Him Alone as Wakîl (Disposer of your affairs).[2]",
            "english_rwwad": "[He is] Lord of the east and the west; none has the right to be worshiped except Him, so take Him as Disposer of your affairs."
        }
    },
    {
        "id": 5484,
        "chapter": 73,
        "verse": 10,
        "arabic_text": "وَٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَٱهۡجُرۡهُمۡ هَجۡرٗا جَمِيلٗا",
        "phonetic": "73.10 Wa Aşbir `Alá Mā Yaqūlūna Wa Ahjurhum Hajrāan Jamīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And be patient over what they say and avoid them with gracious avoidance.",
            "english_hilali_khan": "And be patient (O Muhammad صلى الله عليه وسلم) with what they say, and keep away from them in a good way.",
            "english_rwwad": "Bear patiently what they say, and avoid them in a gracious manner."
        }
    },
    {
        "id": 5485,
        "chapter": 73,
        "verse": 11,
        "arabic_text": "وَذَرۡنِي وَٱلۡمُكَذِّبِينَ أُوْلِي ٱلنَّعۡمَةِ وَمَهِّلۡهُمۡ قَلِيلًا",
        "phonetic": "73.11 Wa Dharnī Wa Al-Mukadhibīna 'Ūlī An-Na`mati Wa Mahhilhum Qalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.",
            "english_hilali_khan": "And leave Me Alone to deal with the beliers (those who deny My Verses), those who are in possession of good things of life. And give them respite for a little while.",
            "english_rwwad": "Leave to Me the deniers who are having a life of luxury, and bear with them for a little while."
        }
    },
    {
        "id": 5486,
        "chapter": 73,
        "verse": 12,
        "arabic_text": "إِنَّ لَدَيۡنَآ أَنكَالٗا وَجَحِيمٗا",
        "phonetic": "73.12 'Inna Ladaynā 'Ankālāan Wa Jaĥīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, with Us [for them] are shackles and burning fire.",
            "english_hilali_khan": "Verily, with Us are fetters (to bind them), and a raging Fire.",
            "english_rwwad": "Indeed, We have heavy shackles and a Blazing Fire,"
        }
    },
    {
        "id": 5487,
        "chapter": 73,
        "verse": 13,
        "arabic_text": "وَطَعَامٗا ذَا غُصَّةٖ وَعَذَابًا أَلِيمٗا",
        "phonetic": "73.13 Wa Ţa`āmāan Dhā Ghuşşatin Wa `Adhābāan 'Alīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And food that chokes and a painful punishment -",
            "english_hilali_khan": "And a food that chokes, and a painful torment.",
            "english_rwwad": "and food that chokes, and a painful punishment,"
        }
    },
    {
        "id": 5488,
        "chapter": 73,
        "verse": 14,
        "arabic_text": "يَوۡمَ تَرۡجُفُ ٱلۡأَرۡضُ وَٱلۡجِبَالُ وَكَانَتِ ٱلۡجِبَالُ كَثِيبٗا مَّهِيلًا",
        "phonetic": "73.14 Yawma Tarjufu Al-'Arđu Wa Al-Jibālu Wa Kānati Al-Jibālu Kathībāan Mahīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.",
            "english_hilali_khan": "On the Day when the earth and the mountains will be in violent shake, and the mountains will be a heap of sand poured out.",
            "english_rwwad": "on the Day when the earth and the mountains will convulse, and the mountains will be like dunes of loose sand."
        }
    },
    {
        "id": 5489,
        "chapter": 73,
        "verse": 15,
        "arabic_text": "إِنَّآ أَرۡسَلۡنَآ إِلَيۡكُمۡ رَسُولٗا شَٰهِدًا عَلَيۡكُمۡ كَمَآ أَرۡسَلۡنَآ إِلَىٰ فِرۡعَوۡنَ رَسُولٗا",
        "phonetic": "73.15 'Innā 'Arsalnā 'Ilaykum Rasūlāan Shāhidāan `Alaykum Kamā 'Arsalnā 'Ilá Fir`awna Rasūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.73:15) See the footnotes of (V.2:252).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.",
            "english_hilali_khan": "Verily, We have sent to you (O men) a Messenger (Muhammad صلى الله عليه وسلم) to be a witness over you, as We did send a Messenger [Mûsâ (Moses)] to Fir‘aun (Pharaoh).[3]",
            "english_rwwad": "Indeed, We have sent to you a Messenger to be a witness over you, just as We sent to Pharaoh a messenger."
        }
    },
    {
        "id": 5490,
        "chapter": 73,
        "verse": 16,
        "arabic_text": "فَعَصَىٰ فِرۡعَوۡنُ ٱلرَّسُولَ فَأَخَذۡنَٰهُ أَخۡذٗا وَبِيلٗا",
        "phonetic": "73.16 Fa`aşá Fir`awnu Ar-Rasūla Fa'akhadhnāhu 'Akhdhāan Wabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.",
            "english_hilali_khan": "But Fir‘aun (Pharaoh) disobeyed the Messenger [Mûsâ (Moses)]; so We seized him with a severe punishment.",
            "english_rwwad": "But Pharaoh disobeyed the messenger, so We seized him with a severe punishment."
        }
    },
    {
        "id": 5491,
        "chapter": 73,
        "verse": 17,
        "arabic_text": "فَكَيۡفَ تَتَّقُونَ إِن كَفَرۡتُمۡ يَوۡمٗا يَجۡعَلُ ٱلۡوِلۡدَٰنَ شِيبًا",
        "phonetic": "73.17 Fakayfa Tattaqūna 'In Kafartum Yawmāan Yaj`alu Al-Wildāna Shībāan",
        "footnotes": {
            "english_saheeh": "[1783]- Another meaning is \"How can you avoid [punishment]\" on such a Day?",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then how can you fear, if you disbelieve, a Day that will make the children white-haired?[1783]",
            "english_hilali_khan": "Then how can you avoid the punishment, if you disbelieve, on a Day (i.e. the Day of Resurrection) that will make the children grey-headed?",
            "english_rwwad": "If you disbelieve, then how will you protect yourselves against a Day that will turn children’s hair gray?"
        }
    },
    {
        "id": 5492,
        "chapter": 73,
        "verse": 18,
        "arabic_text": "ٱلسَّمَآءُ مُنفَطِرُۢ بِهِۦۚ كَانَ وَعۡدُهُۥ مَفۡعُولًا",
        "phonetic": "73.18 As-Samā'u Munfaţirun Bihi Kāna Wa`duhu Maf`ūlāan",
        "footnotes": {
            "english_saheeh": "[1784]- From the terror of that Day.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The heaven will break apart therefrom;[1784] ever is His promise fulfilled.",
            "english_hilali_khan": "Whereon the heaven will be cleft asunder? His Promise is certainly to be accomplished.",
            "english_rwwad": "It will cause the sky to break asunder. His promise will certainly be fulfilled."
        }
    },
    {
        "id": 5493,
        "chapter": 73,
        "verse": 19,
        "arabic_text": "إِنَّ هَٰذِهِۦ تَذۡكِرَةٞۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
        "phonetic": "73.19 'Inna Hadhihi Tadhkiratun Faman Shā'a Attakhadha 'Ilá Rabbihi Sabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, this is a reminder, so whoever wills may take to his Lord a way.",
            "english_hilali_khan": "Verily, this is an admonition: therefore whosoever will, let him take a Path to His Lord!",
            "english_rwwad": "Indeed, this is a reminder; so whoever wills may take a way to his Lord."
        }
    },
    {
        "id": 5494,
        "chapter": 73,
        "verse": 20,
        "arabic_text": "۞ إِنَّ رَبَّكَ يَعۡلَمُ أَنَّكَ تَقُومُ أَدۡنَىٰ مِن ثُلُثَيِ ٱلَّيۡلِ وَنِصۡفَهُۥ وَثُلُثَهُۥ وَطَآئِفَةٞ مِّنَ ٱلَّذِينَ مَعَكَۚ وَٱللَّهُ يُقَدِّرُ ٱلَّيۡلَ وَٱلنَّهَارَۚ عَلِمَ أَن لَّن تُحۡصُوهُ فَتَابَ عَلَيۡكُمۡۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنَ ٱلۡقُرۡءَانِۚ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرۡضَىٰ وَءَاخَرُونَ يَضۡرِبُونَ فِي ٱلۡأَرۡضِ يَبۡتَغُونَ مِن فَضۡلِ ٱللَّهِ وَءَاخَرُونَ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنۡهُۚ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَقۡرِضُواْ ٱللَّهَ قَرۡضًا حَسَنٗاۚ وَمَا تُقَدِّمُواْ لِأَنفُسِكُم مِّنۡ خَيۡرٖ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَيۡرٗا وَأَعۡظَمَ أَجۡرٗاۚ وَٱسۡتَغۡفِرُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمُۢ",
        "phonetic": "73.20 'Inna Rabbaka Ya`lamu 'Annaka Taqūmu 'Adná Min Thuluthayi Al-Layli Wa Nişfahu Wa Thuluthahu Wa Ţā'ifatun Mina Al-Ladhīna Ma`aka Wa Allāhu Yuqaddiru Al-Layla Wa An-Nahāra `Alima 'An Lan Tuĥşūhu Fatāba `Alaykum Fāqra'ū Mā Tayassara Mina Al-Qur'āni `Alima 'An Sayakūnu Minkum Marđá Wa 'Ākharūna Yađribūna Fī Al-'Arđi Yabtaghūna Min Fađli Allāhi Wa 'Ākharūna Yuqātilūna Fī Sabīli Allāhi Fāqra'ū Mā Tayassara Minhu Wa 'Aqīmū Aş-Şalāata Wa 'Ātū Az-Zakāata Wa 'Aqriđū Allāha Qarđāan Ĥasanāan Wa Mā Tuqaddimū Li'nfusikum Min Khayrin Tajidūhu `Inda Allāhi Huwa Khayrāan Wa 'A`žama 'Ajrāan Wa Astaghfirū Allāha 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[1785]- Allāh has known that if they were to continue in such long periods of worship each night, the people would be caused much hardship.\n[1786]- In the form of charities and contributions to His cause.",
            "english_hilali_khan": "(V.73:20) See the footnotes of (V.50:39).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord knows, [O Muḥammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allāh determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it[1785] and has turned to you in forgiveness, so recite what is easy [for you] of the Qur’ān. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allāh and others fighting for the cause of Allāh. So recite what is easy from it and establish prayer and give zakāh and loan Allāh a goodly loan.[1786] And whatever good you put forward for yourselves - you will find it with Allāh. It is better and greater in reward. And seek forgiveness of Allāh. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "Verily, your Lord knows that you do stand (to pray at night) a little less than two thirds of the night, or half the night, or a third of the night, and also a party of those with you. And Allâh measures the night and the day. He knows that you are unable to pray the whole night, so He has turned to you (in mercy). So, recite you of the Qur’ân as much as may be easy for you. He knows that there will be some among you sick, others travelling through the land, seeking of Allâh’s Bounty, yet others fighting in Allâh’s Cause. So recite as much of the Qur’ân as may be easy (for you), and perform As-Salât (Iqâmat-as-Salât ) and give Zakât, and lend to Allâh a goodly loan. And whatever good you send before you for yourselves (i.e. Nawâfil non-obligatory acts of worship: prayers, charity, fasting, Hajj and ‘Umrah), you will certainly find it with Allâh, better and greater in reward. And seek Forgiveness of Allâh. Verily, Allâh is Oft-Forgiving, Most-Merciful[1].",
            "english_rwwad": "Indeed, your Lord knows that you [O Prophet] stand up in prayer for nearly two-thirds of the night, or half of it, or one-third of it, as do others among your companions. Allah determines the night and the day; He knows that you [Muslims] cannot keep an accurate count of it, so He pardoned you. Recite then as much of the Qur’an as is easy for you [in the night prayers]. He knows that there are some among you who will be ill, and others traveling in the land, seeking the grace of Allah, and others fighting in Allah’s way. So recite as much of it as is easy for you; establish prayer and give zakah; and lend to Allah a goodly loan. Whatever good you send forth for yourselves, you will find it with Allah, much better in condition and much greater in reward. And seek forgiveness of Allah, for indeed Allah is All-Forgiving, Most-Merciful."
        }
    }
]