[
    {
        "id": 1160,
        "chapter": 8,
        "verse": 1,
        "arabic_text": "يَسۡـَٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ",
        "phonetic": "8.1 Yas'alūnaka `Ani Al-'Anfāl Quli Al-'Anfāli Lillāhi Wa Ar-Rasūli Fa Attaqū Allāha Wa 'Aşliĥū Dhāta Baynikum Wa 'Aţī`ū Allāha Wa Rasūlahu 'In Kuntum Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They ask you, [O Muḥammad], about the bounties [of war]. Say, \"The [decision concerning] bounties is for Allāh and the Messenger.\" So fear Allāh and amend that which is between you and obey Allāh and His Messenger, if you should be believers.",
            "english_hilali_khan": "They ask you (O Muhammad صلى الله عليه وسلم) about the spoils of war. Say: \"The spoils are for Allâh and the Messenger.\" So fear Allâh and adjust all matters of difference among you, and obey Allâh and His Messenger (Muhammad صلى الله عليه وسلم), if you are believers.",
            "english_rwwad": "They ask you [O Prophet] about the spoils of war. Say, “The spoils of war belong to Allah and the Messenger. So fear Allah, settle your affairs among yourselves, and obey Allah and His Messenger, if you are [true] believers.”"
        }
    },
    {
        "id": 1161,
        "chapter": 8,
        "verse": 2,
        "arabic_text": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ",
        "phonetic": "8.2 'Innamā Al-Mu'uminūna Al-Ladhīna 'Idhā Dhukira Allāhu Wajilat Qulūbuhum Wa 'Idhā Tuliyat `Alayhim 'Āyātuhu Zādat/hum 'Īmānāan Wa `Alá Rabbihim Yatawakkalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The believers are only those who, when Allāh is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely -",
            "english_hilali_khan": "The believers are only those who, when Allâh is mentioned, feel a fear in their hearts and when His Verses (this Qur’ân) are recited unto them, they (i.e. the Verses) increase their Faith; and they put their trust in their Lord (Alone);",
            "english_rwwad": "The true believers are those whose hearts are filled with awe when Allah is mentioned, and their faith increases when His verses are recited to them, and they put their trust only in their Lord;"
        }
    },
    {
        "id": 1162,
        "chapter": 8,
        "verse": 3,
        "arabic_text": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
        "phonetic": "8.3 Al-Ladhīna Yuqīmūna Aş-Şalāata Wa Mimmā Razaqnāhum Yunfiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ones who establish prayer, and from what We have provided them, they spend.",
            "english_hilali_khan": "Who perform As-Salât (Iqâmat-as-Salât) and spend out of that We have provided them.",
            "english_rwwad": "those who establish prayer and spend out of what We have provided for them."
        }
    },
    {
        "id": 1163,
        "chapter": 8,
        "verse": 4,
        "arabic_text": "أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُمۡ دَرَجَٰتٌ عِندَ رَبِّهِمۡ وَمَغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ",
        "phonetic": "8.4 'Ūlā'ika Humu Al-Mu'uminūna Ĥaqqāan Lahum Darajātun `Inda Rabbihim Wa Maghfiratun Wa Rizqun Karīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those are the believers, truly. For them are degrees [of high position] with their Lord and forgiveness and noble provision.",
            "english_hilali_khan": "It is they who are the believers in truth. For them are grades of dignity with their Lord, and Forgiveness and a generous provision (Paradise).",
            "english_rwwad": "Such are the true believers; they will have high ranks with their Lord, and forgiveness and an honorable provision."
        }
    },
    {
        "id": 1164,
        "chapter": 8,
        "verse": 5,
        "arabic_text": "كَمَآ أَخۡرَجَكَ رَبُّكَ مِنۢ بَيۡتِكَ بِٱلۡحَقِّ وَإِنَّ فَرِيقٗا مِّنَ ٱلۡمُؤۡمِنِينَ لَكَٰرِهُونَ",
        "phonetic": "8.5 Kamā 'Akhrajaka Rabbuka Min Baytika Bil-Ĥaqqi Wa 'Inna Farīqāan Mina Al-Mu'uminīna Lakārihūna",
        "footnotes": {
            "english_saheeh": "[437]- Referring to a dispute which occurred among the Muslims over distribution of war booty.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It[437] is] just as when your Lord brought you out of your home [for the battle of Badr] in truth, while indeed, a party among the believers were unwilling,",
            "english_hilali_khan": "As your Lord caused you (O Muhammad صلى الله عليه وسلم) to go out from your home with the truth; and verily, a party among the believers disliked it,",
            "english_rwwad": "Just as your Lord brought you [O Prophet] out of your home for a just cause, even though a group of the believers were averse to it."
        }
    },
    {
        "id": 1165,
        "chapter": 8,
        "verse": 6,
        "arabic_text": "يُجَٰدِلُونَكَ فِي ٱلۡحَقِّ بَعۡدَ مَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى ٱلۡمَوۡتِ وَهُمۡ يَنظُرُونَ",
        "phonetic": "8.6 Yujādilūnaka Fī Al-Ĥaqqi Ba`damā Tabayyana Ka'annamā Yusāqūna 'Ilá Al-Mawti Wa Hum Yanžurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Arguing with you concerning the truth after it had become clear, as if they were being driven toward death while they were looking on.",
            "english_hilali_khan": "Disputing with you concerning the truth after it was made manifest, as if they were being driven to death, while they were looking (at it).",
            "english_rwwad": "They disputed with you concerning the truth after it had become clear to them, as if they were being driven towards death while they were looking on."
        }
    },
    {
        "id": 1166,
        "chapter": 8,
        "verse": 7,
        "arabic_text": "وَإِذۡ يَعِدُكُمُ ٱللَّهُ إِحۡدَى ٱلطَّآئِفَتَيۡنِ أَنَّهَا لَكُمۡ وَتَوَدُّونَ أَنَّ غَيۡرَ ذَاتِ ٱلشَّوۡكَةِ تَكُونُ لَكُمۡ وَيُرِيدُ ٱللَّهُ أَن يُحِقَّ ٱلۡحَقَّ بِكَلِمَٰتِهِۦ وَيَقۡطَعَ دَابِرَ ٱلۡكَٰفِرِينَ",
        "phonetic": "8.7 Wa 'Idh Ya`idukumu Allāhu 'Iĥdá Aţ-Ţā'ifatayni 'Annahā Lakum Wa Tawaddūna 'Anna Ghayra Dhāti Ash-Shawkati Takūnu Lakum Wa Yurīdu Allāhu 'An Yuĥiqqa Al-Ĥaqqa Bikalimātihi Wa Yaqţa`a Dābira Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "[438]- i.e., either the caravan of Quraysh or their army.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember, O believers], when Allāh promised you one of the two groups[438] - that it would be yours - and you wished that the unarmed one would be yours. But Allāh intended to establish the truth by His words and to eliminate the disbelievers",
            "english_hilali_khan": "And (remember) when Allâh promised you (Muslims) one of the two parties (of the enemy i.e. either the army or the caravan) that it should be yours; you wished that the one not armed (the caravan) should be yours, but Allâh willed to justify the truth by His Words and to cut off the roots of the disbelievers (i.e. in the battle of Badr).",
            "english_rwwad": "And [remember, O believers], when Allah promised you one of the two parties, that it would fall to you, and you wished that the unarmed one would fall to you. But it was Allah’s Will to establish the truth by His Words and exterminate the disbelievers,"
        }
    },
    {
        "id": 1167,
        "chapter": 8,
        "verse": 8,
        "arabic_text": "لِيُحِقَّ ٱلۡحَقَّ وَيُبۡطِلَ ٱلۡبَٰطِلَ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ",
        "phonetic": "8.8 Liyuĥiqqa Al-Ĥaqqa Wa Yubţila Al-Bāţila Wa Law Kariha Al-Mujrimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That He should establish the truth and abolish falsehood, even if the criminals disliked it.",
            "english_hilali_khan": "That He might cause the truth to triumph and bring falsehood to nothing, even though the Mujrimûn (disbelievers, polytheists, sinners, criminals) hate it.",
            "english_rwwad": "so that He might establish the truth and nullify the falsehood, even though the wicked are averse to it."
        }
    },
    {
        "id": 1168,
        "chapter": 8,
        "verse": 9,
        "arabic_text": "إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُرۡدِفِينَ",
        "phonetic": "8.9 'Idh Tastaghīthūna Rabbakum Fāstajāba Lakum 'Annī Mumiddukum Bi'alfin Mina Al-Malā'ikati Murdifīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember] when you were asking help of your Lord, and He answered you, \"Indeed, I will reinforce you with a thousand from the angels, following one another.\"",
            "english_hilali_khan": "9. (Remember) when you sought help of your Lord and He answered you (saying): \"I will help you with a thousand of the angels each behind the other (following one another) in succession.\"",
            "english_rwwad": "[Remember] when you were seeking help of your Lord [at Badr] and He responded to you, “I will reinforce you with a thousand angels, following one another in succession.”"
        }
    },
    {
        "id": 1169,
        "chapter": 8,
        "verse": 10,
        "arabic_text": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ وَلِتَطۡمَئِنَّ بِهِۦ قُلُوبُكُمۡۚ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
        "phonetic": "8.10 Wa Mā Ja`alahu Allāhu 'Illā Bushrá Wa Litaţma'inna Bihi Qulūbukum Wa Mā An-Naşru 'Illā Min `Indi Allāhi 'Inna Allāha `Azīzun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh made it not but good tidings and so that your hearts would be assured thereby. And victory is not but from Allāh. Indeed, Allāh is Exalted in Might and Wise.",
            "english_hilali_khan": "Allâh made it only as glad tidings, and that your hearts be at rest therewith. And there is no victory except from Allâh. Verily, Allâh is All-Mighty, All-Wise.",
            "english_rwwad": "Allah granted this only as glad tidings and to reassure your hearts, for victory only comes from Allah. Indeed, Allah is All-Mighty, All-Wise."
        }
    },
    {
        "id": 1170,
        "chapter": 8,
        "verse": 11,
        "arabic_text": "إِذۡ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةٗ مِّنۡهُ وَيُنَزِّلُ عَلَيۡكُم مِّنَ ٱلسَّمَآءِ مَآءٗ لِّيُطَهِّرَكُم بِهِۦ وَيُذۡهِبَ عَنكُمۡ رِجۡزَ ٱلشَّيۡطَٰنِ وَلِيَرۡبِطَ عَلَىٰ قُلُوبِكُمۡ وَيُثَبِّتَ بِهِ ٱلۡأَقۡدَامَ",
        "phonetic": "8.11 'Idh Yughashīkumu An-Nu`āsa 'Amanatan Minhu Wa Yunazzilu `Alaykum Mina As-Samā'i Mā'an Liyuţahhirakum Bihi Wa Yudh/hiba `Ankum Rijza Ash-Shayţāni Wa Liyarbiţa `Alá Qulūbikum Wa Yuthabbita Bihi Al-'Aqdāma",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember] when He overwhelmed you with drowsiness [giving] security from Him and sent down upon you from the sky, rain by which to purify you and remove from you the evil [suggestions] of Satan and to make steadfast your hearts and plant firmly thereby your feet.",
            "english_hilali_khan": "(Remember) when He covered you with a slumber as a security from Him, and He caused water (rain) to descend on you from the sky, to clean you thereby and to remove from you the Rijz (whispering, evil-suggestions) of Shaitân(Satan), and to strengthen your hearts, and make your feet firm thereby.",
            "english_rwwad": "[Remember] when He caused drowsiness to overcome you as an assurance from Him, and He sent down rain from the sky to purify you and to remove Satan’s whispers from you, and to strengthen your hearts and to steady your footsteps."
        }
    },
    {
        "id": 1171,
        "chapter": 8,
        "verse": 12,
        "arabic_text": "إِذۡ يُوحِي رَبُّكَ إِلَى ٱلۡمَلَٰٓئِكَةِ أَنِّي مَعَكُمۡ فَثَبِّتُواْ ٱلَّذِينَ ءَامَنُواْۚ سَأُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ فَٱضۡرِبُواْ فَوۡقَ ٱلۡأَعۡنَاقِ وَٱضۡرِبُواْ مِنۡهُمۡ كُلَّ بَنَانٖ",
        "phonetic": "8.12 'Idh Yūĥī Rabbuka 'Ilá Al-Malā'ikati 'Annī Ma`akum Fathabbitū Al-Ladhīna 'Āmanū Sa'ulqī Fī Qulūbi Al-Ladhīna Kafarū Ar-Ru`ba Fāđribū Fawqa Al-'A`nāqi Wa Ađribū Minhum Kulla Banānin",
        "footnotes": {
            "english_saheeh": "[439]- By which they grasp and manipulate their weapons.  Also interpreted as \"all extremities,\" i.e., their hands and feet.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip.\"[439]",
            "english_hilali_khan": "(Remember) when your Lord revealed to the angels, \"Verily, I am with you, so keep firm those who have believed. I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes.\"",
            "english_rwwad": "[Remember] when your Lord inspired the angels, “I am with you, so make firm the feet of those who believe. I will cast terror into the hearts of those who disbelieve. So strike their necks and strike all their limbs.”"
        }
    },
    {
        "id": 1172,
        "chapter": 8,
        "verse": 13,
        "arabic_text": "ذَٰلِكَ بِأَنَّهُمۡ شَآقُّواْ ٱللَّهَ وَرَسُولَهُۥۚ وَمَن يُشَاقِقِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ",
        "phonetic": "8.13 Dhālika Bi'annahum Shāqqū Allāha Wa Rasūlahu Wa Man Yushāqiqi Allāha Wa Rasūlahu Fa'inna Allāha Shadīdu Al-`Iqābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is because they opposed Allāh and His Messenger. And whoever opposes Allāh and His Messenger - indeed, Allāh is severe in penalty.",
            "english_hilali_khan": "This is because they defied and disobeyed Allâh and His Messenger. And whoever defies and disobeys Allâh and His Messenger, then verily, Allâh is Severe in punishment.",
            "english_rwwad": "That is because they opposed Allah and His Messenger. Whoever opposes Allah and His Messenger, Allah is indeed severe in punishment."
        }
    },
    {
        "id": 1173,
        "chapter": 8,
        "verse": 14,
        "arabic_text": "ذَٰلِكُمۡ فَذُوقُوهُ وَأَنَّ لِلۡكَٰفِرِينَ عَذَابَ ٱلنَّارِ",
        "phonetic": "8.14 Dhālikum Fadhūqūhu Wa 'Anna Lilkāfirīna `Adhāba An-Nāri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "\"That [is yours], so taste it.\" And indeed for the disbelievers is the punishment of the Fire.",
            "english_hilali_khan": "This is (the torment), so taste it; and surely for the disbelievers is the torment of the Fire.",
            "english_rwwad": "That is for you, so taste it, and for the disbelievers there will be the punishment of the Fire."
        }
    },
    {
        "id": 1174,
        "chapter": 8,
        "verse": 15,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ زَحۡفٗا فَلَا تُوَلُّوهُمُ ٱلۡأَدۡبَارَ",
        "phonetic": "8.15 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Idhā Laqītumu Al-Ladhīna Kafarū Zaĥfāan Falā Tuwallūhumu Al-'Adbāra",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, when you meet those who disbelieve advancing [in battle], do not turn to them your backs [in flight].",
            "english_hilali_khan": "O you who believe! When you meet those who disbelieve, in a battle-field, never turn your backs to them.",
            "english_rwwad": "O you who believe, when you confront the disbelievers in battle, do not turn your backs to them."
        }
    },
    {
        "id": 1175,
        "chapter": 8,
        "verse": 16,
        "arabic_text": "وَمَن يُوَلِّهِمۡ يَوۡمَئِذٖ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفٗا لِّقِتَالٍ أَوۡ مُتَحَيِّزًا إِلَىٰ فِئَةٖ فَقَدۡ بَآءَ بِغَضَبٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ",
        "phonetic": "8.16 Wa Man Yuwallihim Yawma'idhin Duburahu 'Illā Mutaĥarrifāan Liqitālin 'Aw Mutaĥayyizāan 'Ilá Fi'atin Faqad Bā'a Bighađabin Mina Allāhi Wa Ma'wāhu Jahannamu Wa Bi'sa Al-Maşīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whoever turns his back to them on such a day, unless swerving [as a strategy] for war or joining [another] company, has certainly returned with anger [upon him] from Allāh, and his refuge is Hell - and wretched is the destination.",
            "english_hilali_khan": "And whoever turns his back to them on such a day - unless it be a stratagem of war, or to retreat to a troop (of his own), - he indeed has drawn upon himself wrath from Allâh. And his abode is Hell, and worst indeed is that destination!",
            "english_rwwad": "Whoever turns his back to them on such a day – unless it is for tactical reasons or joining another group – he will incur the wrath of Allah and his abode will be Hell. What a terrible destination!"
        }
    },
    {
        "id": 1176,
        "chapter": 8,
        "verse": 17,
        "arabic_text": "فَلَمۡ تَقۡتُلُوهُمۡ وَلَٰكِنَّ ٱللَّهَ قَتَلَهُمۡۚ وَمَا رَمَيۡتَ إِذۡ رَمَيۡتَ وَلَٰكِنَّ ٱللَّهَ رَمَىٰ وَلِيُبۡلِيَ ٱلۡمُؤۡمِنِينَ مِنۡهُ بَلَآءً حَسَنًاۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ",
        "phonetic": "8.17 Falam Taqtulūhum Wa Lakinna Allāha Qatalahum Wa Mā Ramayta 'Idh Ramayta Wa Lakinna Allāha Ramá Wa Liyubliya Al-Mu'uminīna Minhu Balā'an Ĥasanāan 'Inna Allāha Samī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "[440]- i.e., Your strength was insufficient to overcome them, but Allāh supported you and gave you victory.\n[441]- When the Prophet (ﷺ) threw a handful of dust into the faces of the disbelievers, Allāh caused it to fill the eyes and nose of every soldier, preventing their advance.\n[442]- So that they would appreciate Allāh's favor to them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you did not kill them, but it was Allāh who killed them.[440] And you threw not, [O Muḥammad], when you threw, but it was Allāh who threw[441] that He might test the believers with a good test.[442] Indeed, Allāh is Hearing and Knowing.",
            "english_hilali_khan": "You killed them not, but Allâh killed them. And you (Muhammad صلى الله عليه وسلم) threw not when you did throw, but Allâh threw, that He might test the believers by a fair trial from Him. Verily, Allâh is All-Hearer, All-Knower.",
            "english_rwwad": "It was not you who killed them, but it was Allah Who killed them; and it was not you [O Prophet] who threw when you threw [a handful of sand] but it was Allah Who threw, so that He might test the believers with a great test. Allah is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 1177,
        "chapter": 8,
        "verse": 18,
        "arabic_text": "ذَٰلِكُمۡ وَأَنَّ ٱللَّهَ مُوهِنُ كَيۡدِ ٱلۡكَٰفِرِينَ",
        "phonetic": "8.18 Dhālikum Wa 'Anna Allāha Mūhinu Kaydi Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That [is so], and [also] that Allāh will weaken the plot of the disbelievers.",
            "english_hilali_khan": "This (is the fact) and surely, Allâh weakens the deceitful plots of the disbelievers.",
            "english_rwwad": "As such, Allah undermines the plans of the disbelievers."
        }
    },
    {
        "id": 1178,
        "chapter": 8,
        "verse": 19,
        "arabic_text": "إِن تَسۡتَفۡتِحُواْ فَقَدۡ جَآءَكُمُ ٱلۡفَتۡحُۖ وَإِن تَنتَهُواْ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَعُودُواْ نَعُدۡ وَلَن تُغۡنِيَ عَنكُمۡ فِئَتُكُمۡ شَيۡـٔٗا وَلَوۡ كَثُرَتۡ وَأَنَّ ٱللَّهَ مَعَ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "8.19 'In Tastaftiĥū Faqad Jā'akumu Al-Fatĥu Wa 'In Tantahū Fahuwa Khayrun Lakum Wa 'In Ta`ūdū Na`ud Wa Lan Tughniya `Ankum Fi'atukum Shay'āan Wa Law Kathurat Wa 'Anna Allāha Ma`a Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you [disbelievers] seek the decision [i.e., victory] - the decision [i.e., defeat] has come to you. And if you desist [from hostilities], it is best for you; but if you return [to war], We will return, and never will you be availed by your [large] company at all, even if it should increase; and [that is] because Allāh is with the believers.",
            "english_hilali_khan": "(O disbelievers) if you ask for a judgement, now has the judgement come unto you; and if you cease (to do wrong), it will be better for you, and if you return (to the attack), so shall We return, and your forces will be of no avail to you, however numerous they be; and verily, Allâh is with the believers.",
            "english_rwwad": "If you [disbelievers] were seeking the decision, it has come to you. If you desist, it will be better for you, but if you return [to war], We too will return. And your forces – no matter how great in number they are – will not avail you anything, for Allah is with the believers."
        }
    },
    {
        "id": 1179,
        "chapter": 8,
        "verse": 20,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَوَلَّوۡاْ عَنۡهُ وَأَنتُمۡ تَسۡمَعُونَ",
        "phonetic": "8.20 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Aţī`ū Allāha Wa Rasūlahu Wa Lā Tawallaw `Anhu Wa 'Antum Tasma`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, obey Allāh and His Messenger and do not turn from him while you hear [his order].",
            "english_hilali_khan": "O you who believe! Obey Allâh and His Messenger, and turn not away from him (i.e. Messenger Muhammad صلى الله عليه وسلم) while you are hearing.",
            "english_rwwad": "O you who believe, obey Allah and His Messenger, and do not turn away from him after hearing [his command]."
        }
    },
    {
        "id": 1180,
        "chapter": 8,
        "verse": 21,
        "arabic_text": "وَلَا تَكُونُواْ كَٱلَّذِينَ قَالُواْ سَمِعۡنَا وَهُمۡ لَا يَسۡمَعُونَ",
        "phonetic": "8.21 Wa Lā Takūnū Kālladhīna Qālū Sami`nā Wa Hum Lā Yasma`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not be like those who say, \"We have heard,\" while they do not hear.",
            "english_hilali_khan": "And be not like those who say: \"We have heard,\" but they hear not.",
            "english_rwwad": "And do not be like those who say, “We hear,” while they do not actually listen."
        }
    },
    {
        "id": 1181,
        "chapter": 8,
        "verse": 22,
        "arabic_text": "۞ إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلصُّمُّ ٱلۡبُكۡمُ ٱلَّذِينَ لَا يَعۡقِلُونَ",
        "phonetic": "8.22 'Inna Sharra Ad-Dawābbi `Inda Allāhi Aş-Şummu Al-Bukmu Al-Ladhīna Lā Ya`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the worst of living creatures in the sight of Allāh are the deaf and dumb who do not use reason [i.e., the disbelievers].",
            "english_hilali_khan": "Verily! The worst of (moving) living creatures with Allâh are the deaf and the dumb, who understand not (i.e. the disbelievers).",
            "english_rwwad": "The worst of creatures before Allah are those that are deaf and dumb, who do not understand."
        }
    },
    {
        "id": 1182,
        "chapter": 8,
        "verse": 23,
        "arabic_text": "وَلَوۡ عَلِمَ ٱللَّهُ فِيهِمۡ خَيۡرٗا لَّأَسۡمَعَهُمۡۖ وَلَوۡ أَسۡمَعَهُمۡ لَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ",
        "phonetic": "8.23 Wa Law `Alima Allāhu Fīhim Khayrāan La'asma`ahum Wa Law 'Asma`ahum Latawallaw Wa Hum Mu`riđūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Had Allāh known any good in them, He would have made them hear. And if He had made them hear, they would [still] have turned away, while they were refusing.",
            "english_hilali_khan": "Had Allâh known of any good in them, He would indeed have made them listen; and even if He had made them listen, they would but have turned away with aversion (to the truth).",
            "english_rwwad": "If Allah had known any good in them, He would have made them hear, but even if He had made them hear, they would have turned away in aversion."
        }
    },
    {
        "id": 1183,
        "chapter": 8,
        "verse": 24,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمۡ لِمَا يُحۡيِيكُمۡۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَحُولُ بَيۡنَ ٱلۡمَرۡءِ وَقَلۡبِهِۦ وَأَنَّهُۥٓ إِلَيۡهِ تُحۡشَرُونَ",
        "phonetic": "8.24 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Astajībū Lillāhi Wa Lilrrasūli 'Idhā Da`ākum Limā Yuĥyīkum Wa A`lamū 'Anna Allāha Yaĥūlu Bayna Al-Mar'i Wa Qalbihi Wa 'Annahu 'Ilayhi Tuĥsharūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "[1] (V.8:24) See the footnote of (V.1:2).\n[2] (V.8:24) i.e., one is alive, - a true believer (of Islâmic Monotheism) who is obedient to Allâh and His Messenger (Muhammad صلى الله عليه وسلم) and follows the Qur’ân and Prophet’s Sunnah practically, and he goes out for Jihâd in Allâh’s Cause; in case he is martyred, that is not a death but an eternal life (in Paradise) forever, unlike to a disbeliever who is dead (as regards faith), and will be punished in Hell forever (neither alive nor dead).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, respond to Allāh and to the Messenger when he calls you to that which gives you life. And know that Allāh intervenes between a man and his heart and that to Him you will be gathered.",
            "english_hilali_khan": "O you who believe! Answer Allâh (by obeying Him) and (His) Messenger when he (صلى الله عليه وسلم) calls you[1] to that which will give you life,[2] and know that Allâh comes in between a person and his heart (i.e. He prevents an evil person to decide anything). And verily to Him you shall (all) be gathered.",
            "english_rwwad": "O you who believe, respond to Allah and the Messenger when He calls you to what gives you life, and know that Allah comes between a person and his heart, and it is to Him that you will all be gathered."
        }
    },
    {
        "id": 1184,
        "chapter": 8,
        "verse": 25,
        "arabic_text": "وَٱتَّقُواْ فِتۡنَةٗ لَّا تُصِيبَنَّ ٱلَّذِينَ ظَلَمُواْ مِنكُمۡ خَآصَّةٗۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ",
        "phonetic": "8.25 Wa Attaqū Fitnatan Lā Tuşībanna Al-Ladhīna Žalamū Minkum Khāşşatan Wa A`lamū 'Anna Allāha Shadīdu Al-`Iqābi",
        "footnotes": {
            "english_saheeh": "[443]- i.e., an affliction or punishment during life upon this earth.  When corruption spreads among a people, its consequences will affect everyone.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And fear a trial[443] which will not strike those who have wronged among you exclusively, and know that Allāh is severe in penalty.",
            "english_hilali_khan": "And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people), and know that Allâh is Severe in punishment.",
            "english_rwwad": "Beware of a trial that will not only befall the wrongdoers among you, and know that Allah is severe in punishment."
        }
    },
    {
        "id": 1185,
        "chapter": 8,
        "verse": 26,
        "arabic_text": "وَٱذۡكُرُوٓاْ إِذۡ أَنتُمۡ قَلِيلٞ مُّسۡتَضۡعَفُونَ فِي ٱلۡأَرۡضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ ٱلنَّاسُ فَـَٔاوَىٰكُمۡ وَأَيَّدَكُم بِنَصۡرِهِۦ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِ لَعَلَّكُمۡ تَشۡكُرُونَ",
        "phonetic": "8.26 Wa Adhkurū 'Idh 'Antum Qalīlun Mustađ`afūna Fī Al-'Arđi Takhāfūna 'An Yatakhaţţafakumu An-Nāsu Fa'āwākum Wa 'Ayyadakum Binaşrihi Wa Razaqakum Mina Aţ-Ţayyibāti La`allakum Tashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And remember when you were few and oppressed in the land, fearing that people might abduct you, but He sheltered you, supported you with His victory, and provided you with good things - that you might be grateful.",
            "english_hilali_khan": "And remember when you were few and were reckoned weak in the land, and were afraid that men might kidnap you, but He provided a safe place for you, strengthened you with His Help, and provided you with good things so that you might be grateful.",
            "english_rwwad": "And remember when you were few in number and oppressed in the land, fearing that the people would snatch you away. Then He sheltered you, and strengthened you with His help, and provided you with good things, so that you may give thanks."
        }
    },
    {
        "id": 1186,
        "chapter": 8,
        "verse": 27,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوٓاْ أَمَٰنَٰتِكُمۡ وَأَنتُمۡ تَعۡلَمُونَ",
        "phonetic": "8.27 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Takhūnū Allāha Wa Ar-Rasūla Wa Takhūnū 'Amānātikum Wa 'Antum Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.8:27) See the footnote (A) of (V.3:164).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, do not betray Allāh and the Messenger or betray your trusts while you know [the consequence].",
            "english_hilali_khan": "O you who believe! Betray not Allâh and His Messenger, nor betray knowingly your Amânât (things entrusted to you, and all the duties which Allâh has ordained for you).[1]",
            "english_rwwad": "O you who believe, do not betray Allah and the Messenger, nor betray your trusts knowingly."
        }
    },
    {
        "id": 1187,
        "chapter": 8,
        "verse": 28,
        "arabic_text": "وَٱعۡلَمُوٓاْ أَنَّمَآ أَمۡوَٰلُكُمۡ وَأَوۡلَٰدُكُمۡ فِتۡنَةٞ وَأَنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ",
        "phonetic": "8.28 Wa A`lamū 'Annamā 'Amwālukum Wa 'Awlādukum Fitnatun Wa 'Anna Allāha `Indahu 'Ajrun `Ažīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And know that your properties and your children are but a trial and that Allāh has with Him a great reward.",
            "english_hilali_khan": "And know that your possessions and your children are but a trial and that surely with Allâh is a mighty reward.",
            "english_rwwad": "Know that your wealth and your children are only a trial and that with Allah is an immense reward."
        }
    },
    {
        "id": 1188,
        "chapter": 8,
        "verse": 29,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَتَّقُواْ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ",
        "phonetic": "8.29 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'In Tattaqū Allāha Yaj`al Lakum Furqānāan Wa Yukaffir `Ankum Sayyi'ātikum Wa Yaghfir Lakum Wa Allāhu Dhū Al-Fađli Al-`Ažīmi",
        "footnotes": {
            "english_saheeh": "[444]- By which to judge between truth and falsehood.  Also interpreted as a \"way out\" of difficulties.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, if you fear Allāh, He will grant you a criterion[444] and will remove from you your misdeeds and forgive you. And Allāh is the possessor of great bounty.",
            "english_hilali_khan": "O you who believe! If you obey and fear Allâh, He will grant you Furqân [(a criterion to judge between right and wrong), or (Makhraj, i.e. a way for you to get out from every difficulty)], and will expiate for you your sins, and forgive you; and Allâh is the Owner of the Great Bounty.",
            "english_rwwad": "O you who believe, if you fear Allah, He will provide you with an insight to distinguish between right and wrong, absolve you of your sins and forgive you, for Allah is the Lord of great bounty."
        }
    },
    {
        "id": 1189,
        "chapter": 8,
        "verse": 30,
        "arabic_text": "وَإِذۡ يَمۡكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ لِيُثۡبِتُوكَ أَوۡ يَقۡتُلُوكَ أَوۡ يُخۡرِجُوكَۚ وَيَمۡكُرُونَ وَيَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ",
        "phonetic": "8.30 Wa 'Idh Yamkuru Bika Al-Ladhīna Kafarū Liyuthbitūka 'Aw Yaqtulūka 'Aw Yukhrijūka Wa Yamkurūna Wa Yamkuru Allāhu Wa Allāhu Khayru Al-Mākirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [remember, O Muḥammad], when those who disbelieved plotted against you to restrain you or kill you or evict you [from Makkah]. But they plan, and Allāh plans. And Allāh is the best of planners.",
            "english_hilali_khan": "And (remember) when the disbelievers plotted against you (O Muhammad صلى الله عليه وسلم) to imprison you, or to kill you, or to get you out (from your home, i.e. Makkah); they were plotting and Allâh too was plotting; and Allâh is the Best of those who plot.",
            "english_rwwad": "And [remember] when the disbelievers plotted against you, to take you as captive, kill you or expel you. They plan, and Allah also plans, but Allah is the Best of those who plan."
        }
    },
    {
        "id": 1190,
        "chapter": 8,
        "verse": 31,
        "arabic_text": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا قَالُواْ قَدۡ سَمِعۡنَا لَوۡ نَشَآءُ لَقُلۡنَا مِثۡلَ هَٰذَآ إِنۡ هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ",
        "phonetic": "8.31 Wa 'Idhā Tutlá `Alayhim 'Āyātunā Qālū Qad Sami`nā Law Nashā'u Laqulnā Mithla Hādhā 'In Hādhā 'Illā 'Asāţīru Al-'Awwalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Our verses are recited to them, they say, \"We have heard. If we willed, we could say [something] like this. This is not but legends of the former peoples.\"",
            "english_hilali_khan": "And when Our Verses (of the Qur’ân) are recited to them, they say: \"We have heard (the Qur’ân); if we wish we can say the like of this. This is nothing but the tales of the ancients.\"",
            "english_rwwad": "When Our verses are recited to them, they say, “We have heard. If we wished, we could say something like this. This is nothing but ancient fables.”"
        }
    },
    {
        "id": 1191,
        "chapter": 8,
        "verse": 32,
        "arabic_text": "وَإِذۡ قَالُواْ ٱللَّهُمَّ إِن كَانَ هَٰذَا هُوَ ٱلۡحَقَّ مِنۡ عِندِكَ فَأَمۡطِرۡ عَلَيۡنَا حِجَارَةٗ مِّنَ ٱلسَّمَآءِ أَوِ ٱئۡتِنَا بِعَذَابٍ أَلِيمٖ",
        "phonetic": "8.32 Wa 'Idh Qālū Al-Lahumma 'In Kāna Hādhā Huwa Al-Ĥaqqa Min `Indika Fa'amţir `Alaynā Ĥijāratan Mina As-Samā'i 'Aw A'tinā Bi`adhābin 'Alīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [remember] when they said, \"O Allāh, if this should be the truth from You, then rain down upon us stones from the sky or bring us a painful punishment.\"",
            "english_hilali_khan": "And (remember) when they said: \"O Allâh! If this (the Qur’ân) is indeed the truth (revealed) from You, then rain down stones on us from the sky or bring on us a painful torment.\"",
            "english_rwwad": "And [remember] when they said, “O Allah, if this is indeed the truth from You, then rain down upon us stones from the heaven or bring upon us a painful punishment.”"
        }
    },
    {
        "id": 1192,
        "chapter": 8,
        "verse": 33,
        "arabic_text": "وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمۡ وَأَنتَ فِيهِمۡۚ وَمَا كَانَ ٱللَّهُ مُعَذِّبَهُمۡ وَهُمۡ يَسۡتَغۡفِرُونَ",
        "phonetic": "8.33 Wa Mā Kāna Allāhu Liyu`adhibahum Wa 'Anta Fīhim Wa Mā Kāna Allāhu Mu`adhibahum Wa Hum Yastaghfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But Allāh would not punish them while you, [O Muḥammad], are among them, and Allāh would not punish them while they seek forgiveness.",
            "english_hilali_khan": "And Allâh would not punish them while you (Muhammad صلى الله عليه وسلم) are amongst them, nor will He punish them while they seek (Allâh’s) Forgiveness.",
            "english_rwwad": "But Allah would not punish them while you [O Prophet] are among them, nor would Allah punish them as long as they seek forgiveness."
        }
    },
    {
        "id": 1193,
        "chapter": 8,
        "verse": 34,
        "arabic_text": "وَمَا لَهُمۡ أَلَّا يُعَذِّبَهُمُ ٱللَّهُ وَهُمۡ يَصُدُّونَ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَمَا كَانُوٓاْ أَوۡلِيَآءَهُۥٓۚ إِنۡ أَوۡلِيَآؤُهُۥٓ إِلَّا ٱلۡمُتَّقُونَ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "8.34 Wa Mā Lahum 'Allā Yu`adhibahumu Allāhu Wa Hum Yaşuddūna `Ani Al-Masjidi Al-Ĥarāmi Wa Mā Kānū 'Awliyā'ahu 'In 'Awliyā'uuhu 'Illā Al-Muttaqūna Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But why should Allāh not punish them while they obstruct [people] from al-Masjid al-Ḥarām and they were not [fit to be] its guardians? Its [true] guardians are not but the righteous, but most of them do not know.",
            "english_hilali_khan": "And why should not Allâh punish them while they hinder (men) from Al-Masjid-Al-Harâm, and they are not its guardians? None can be its guardians except Al-Muttaqûn (the pious - See V.2:2), but most of them know not.",
            "english_rwwad": "Why should Allah not punish them when they prevent [people] from the Sacred Mosque, although they are not its rightful guardians? Its rightful guardians are only those who fear Allah, but most of them do not know."
        }
    },
    {
        "id": 1194,
        "chapter": 8,
        "verse": 35,
        "arabic_text": "وَمَا كَانَ صَلَاتُهُمۡ عِندَ ٱلۡبَيۡتِ إِلَّا مُكَآءٗ وَتَصۡدِيَةٗۚ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ",
        "phonetic": "8.35 Wa Mā Kāna Şalātuhum `Inda Al-Bayti 'Illā Mukā'an Wa Taşdiyatan Fadhūqū Al-`Adhāba Bimā Kuntum Takfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And their prayer at the House [i.e., the Kaʿbah] was not except whistling and handclapping. So taste the punishment for what you disbelieved [i.e., practiced of deviations].",
            "english_hilali_khan": "Their Salât (prayer) at the House (of Allâh, i.e. the Ka‘bah at Makkah) was nothing but whistling and clapping of hands. Therefore taste the punishment because you used to disbelieve.",
            "english_rwwad": "Their prayer at the Sacred House was nothing but whistling and clapping. So taste the punishment for your disbelief."
        }
    },
    {
        "id": 1195,
        "chapter": 8,
        "verse": 36,
        "arabic_text": "إِنَّ ٱلَّذِينَ كَفَرُواْ يُنفِقُونَ أَمۡوَٰلَهُمۡ لِيَصُدُّواْ عَن سَبِيلِ ٱللَّهِۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيۡهِمۡ حَسۡرَةٗ ثُمَّ يُغۡلَبُونَۗ وَٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ يُحۡشَرُونَ",
        "phonetic": "8.36 'Inna Al-Ladhīna Kafarū Yunfiqūna 'Amwālahum Liyaşuddū `An Sabīli Allāhi Fasayunfiqūnahā Thumma Takūnu `Alayhim Ĥasratan Thumma Yughlabūna Wa Al-Ladhīna Kafarū 'Ilá Jahannama Yuĥsharūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who disbelieve spend their wealth to avert [people] from the way of Allāh. So they will spend it; then it will be for them a [source of] regret; then they will be overcome. And those who have disbelieved - unto Hell they will be gathered.",
            "english_hilali_khan": "Verily, those who disbelieve spend their wealth to hinder (men) from the Path of Allâh, and so will they continue to spend it; but in the end it will become an anguish for them. Then they will be overcome. And those who disbelieve will be gathered unto Hell.",
            "english_rwwad": "The disbelievers spend their wealth to prevent [people] from the way of Allah. They will continue to spend it, then it will be a source of regret for them, then they will be defeated, and those who disbelieve will be gathered into Hell,"
        }
    },
    {
        "id": 1196,
        "chapter": 8,
        "verse": 37,
        "arabic_text": "لِيَمِيزَ ٱللَّهُ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجۡعَلَ ٱلۡخَبِيثَ بَعۡضَهُۥ عَلَىٰ بَعۡضٖ فَيَرۡكُمَهُۥ جَمِيعٗا فَيَجۡعَلَهُۥ فِي جَهَنَّمَۚ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "8.37 Liyamīza Allāhu Al-Khabītha Mina Aţ-Ţayyibi Wa Yaj`ala Al-Khabītha Ba`đahu `Alá Ba`đin Fayarkumahu Jamī`āan Fayaj`alahu Fī Jahannama 'Ūlā'ika Humu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It is] so that Allāh may distinguish the wicked from the good and place the wicked some of them upon others and heap them all together and put them into Hell. It is those who are the losers.",
            "english_hilali_khan": "In order that Allâh may distinguish the wicked (disbelievers, polytheists and doers of evil deeds) from the good (believers of Islâmic Monotheism and doers of righteous deeds), and put the wicked (disbelievers, polytheists and doers of evil deeds) one over another, heap them together and cast them into Hell. Those! it is they who are the losers.",
            "english_rwwad": "so that Allah may separate the wicked from the good, and pile up the wicked all together and then cast them into Hell. It is they who are the losers."
        }
    },
    {
        "id": 1197,
        "chapter": 8,
        "verse": 38,
        "arabic_text": "قُل لِّلَّذِينَ كَفَرُوٓاْ إِن يَنتَهُواْ يُغۡفَرۡ لَهُم مَّا قَدۡ سَلَفَ وَإِن يَعُودُواْ فَقَدۡ مَضَتۡ سُنَّتُ ٱلۡأَوَّلِينَ",
        "phonetic": "8.38 Qul Lilladhīna Kafarū 'In Yantahū Yughfar Lahum Mā Qad Salafa Wa 'In Ya`ūdū Faqad Mađat Sunnatu Al-'Awwalīna",
        "footnotes": {
            "english_saheeh": "[445]- This is a warning that punishment is always the result of rebellion against Allāh and His messengers.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say to those who have disbelieved [that] if they cease, what has previously occurred will be forgiven for them. But if they return [to hostility] - then the precedent of the former [rebellious] peoples has already taken place.[445]",
            "english_hilali_khan": "Say to those who have disbelieved, if they cease (from disbelief), their past will be forgiven. But if they return (thereto), then the examples of those (punished) before them have already preceded (as a warning).",
            "english_rwwad": "Say to those who disbelieve that if they desist, their past will be forgiven, but if they persist, then they have a precedent in those who have passed before them."
        }
    },
    {
        "id": 1198,
        "chapter": 8,
        "verse": 39,
        "arabic_text": "وَقَٰتِلُوهُمۡ حَتَّىٰ لَا تَكُونَ فِتۡنَةٞ وَيَكُونَ ٱلدِّينُ كُلُّهُۥ لِلَّهِۚ فَإِنِ ٱنتَهَوۡاْ فَإِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ بَصِيرٞ",
        "phonetic": "8.39 Wa Qātilūhum Ĥattá Lā Takūna Fitnatun Wa Yakūna Ad-Dīnu Kulluhu Lillāhi Fa'ini Antahaw Fa'inna Allāha Bimā Ya`malūna Başīrun",
        "footnotes": {
            "english_saheeh": "[446]- Persecution.  See footnote to 2:191.\n[447]- i.e., until polytheism is no longer dominant.",
            "english_hilali_khan": "[1] (V.8:39) It is mentioned by some of the Islâmic religious scholars that, that will be at the time when ‘Îsâ (Jesus), son of Maryam (Mary) عليهما السلام, will descend on the earth, and he will not accept any other religion except Islâm - The True Religion of Allâh - Islâmic Monotheism).\n[2] (V.8:39)\nA) See the footnote of (V.2:193).\nB) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"By Him (Allâh) in whose Hand my soul is, surely, the son of Maryam (Mary) [‘Îsâ (Jesus)] عليهما السلامwill shortly descend amongst you people (Muslims), and will judge mankind justly by the Law of the Qur’ân (as a just ruler), and will break the cross and kill the pigs and abolish the Jizyah [a tax taken from the people of the Scripture (Jews and Christians) who are under the protection of a Muslim government. This Jizyah tax will not be accepted by ‘Îsâ (Jesus) عليه السلام and all mankind will be required to embrace Islâm with no other alternative]. Then there will be abundance of money and nobody will accept charitable gifts.\" (See Fath Al-Bari, Vol. 7, Pages No.304 and 305 for details). (Sahih Al-Bukhâri, Vol.3 Hadîth No.425).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And fight against them until there is no fitnah[446] and [until] the religion [i.e., worship], all of it, is for Allāh.[447] And if they cease - then indeed, Allāh is Seeing of what they do.",
            "english_hilali_khan": "And fight them until there is no more Fitnah (disbelief and polytheism, i.e. worshipping others besides Allâh) and the religion (worship) will all be for Allâh Alone [in the whole of the world[1]]. But if they cease (worshipping others besides Allâh), then certainly, Allâh is All-Seer of what they do.[2]",
            "english_rwwad": "Fight them until there is no more persecution and the religion is entirely for Allah; but if they desist, then Allah is All-Seeing of what they do."
        }
    },
    {
        "id": 1199,
        "chapter": 8,
        "verse": 40,
        "arabic_text": "وَإِن تَوَلَّوۡاْ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَوۡلَىٰكُمۡۚ نِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِيرُ",
        "phonetic": "8.40 Wa 'In Tawallaw Fā`lamū 'Anna Allāha Mawlākum Ni`ma Al-Mawlá Wa Ni`ma An-Naşīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they turn away - then know that Allāh is your protector. Excellent is the protector, and excellent is the helper.",
            "english_hilali_khan": "And if they turn away, then know that Allâh is your Maulâ (Patron, Lord, Protector and Supporter) - (what) an Excellent Maulâ and (what) an Excellent Helper!",
            "english_rwwad": "But if they turn away, then know that Allah is your Protector. What an excellent Protector and an excellent Helper!"
        }
    },
    {
        "id": 1200,
        "chapter": 8,
        "verse": 41,
        "arabic_text": "۞ وَٱعۡلَمُوٓاْ أَنَّمَا غَنِمۡتُم مِّن شَيۡءٖ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلۡنَا عَلَىٰ عَبۡدِنَا يَوۡمَ ٱلۡفُرۡقَانِ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ",
        "phonetic": "8.41 Wa A`lamū 'Annamā Ghanimtum Min Shay'in Fa'anna Lillāhi Khumusahu Wa Lilrrasūli Wa Lidhī Al-Qurbá Wa Al-Yatāmá Wa Al-Masākīni Wa Abni As-Sabīli 'In Kuntum 'Āmantum Billāhi Wa Mā 'Anzalnā `Alá `Abdinā Yawma Al-Furqāni Yawma At-Taqá Al-Jam`āni Wa Allāhu `Alá Kulli Shay'in Qadīrun",
        "footnotes": {
            "english_saheeh": "[448]- To be spent in Allāh's cause.\n[449]- The tribes of Banū Hāshim and Banū Muṭṭalib, who were not eligible for zakāh.\n[450]- The remaining four fifths are divided among the soldiers.\n[451]- Prophet Muḥammad (ﷺ).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And know that anything you obtain of war booty - then indeed, for Allāh is one fifth of it and for the Messenger[448] and for [his] near relatives[449] and the orphans, the needy, and the [stranded] traveler,[450] if you have believed in Allāh and in that which We sent down to Our Servant[451] on the day of criterion [i.e., decisive encounter] - the day when the two armies met [at Badr]. And Allāh, over all things, is competent.",
            "english_hilali_khan": "And know that whatever of war-booty that you may gain, verily one-fifth (1/5th) of it is assigned to Allâh, and to the Messenger, and to the near relatives [of the Messenger (Muhammad صلى الله عليه وسلم)], (and also) the orphans, Al-Masâkîn (the poor) and the wayfarer, if you have believed in Allâh and in that which We sent down to Our slave (Muhammad صلى الله عليه وسلم) on the Day of criterion (between right and wrong), the Day when the two forces met (the battle of Badr); And Allâh is able to do all things.",
            "english_rwwad": "Know that whatever spoils you obtain, one-fifth belongs to Allah and the Messenger, to his close relatives, the orphans, the needy and the [stranded] travelers – if you truly believe in Allah and in what We sent down to Our slave on the day of Criterion – the day when the two armies met [at Badr]. And Allah is Most Capable of all things."
        }
    },
    {
        "id": 1201,
        "chapter": 8,
        "verse": 42,
        "arabic_text": "إِذۡ أَنتُم بِٱلۡعُدۡوَةِ ٱلدُّنۡيَا وَهُم بِٱلۡعُدۡوَةِ ٱلۡقُصۡوَىٰ وَٱلرَّكۡبُ أَسۡفَلَ مِنكُمۡۚ وَلَوۡ تَوَاعَدتُّمۡ لَٱخۡتَلَفۡتُمۡ فِي ٱلۡمِيعَٰدِ وَلَٰكِن لِّيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗا لِّيَهۡلِكَ مَنۡ هَلَكَ عَنۢ بَيِّنَةٖ وَيَحۡيَىٰ مَنۡ حَيَّ عَنۢ بَيِّنَةٖۗ وَإِنَّ ٱللَّهَ لَسَمِيعٌ عَلِيمٌ",
        "phonetic": "8.42 'Idh 'Antum Bil-`Udwati Ad-Dunyā Wa Hum Bil-`Udwati Al-Quşwá Wa Ar-Rakbu 'Asfala Minkum Wa Law Tawā`adttum Lākhtalaftum Fī Al-Mī`ādi Wa Lakin Liyaqđiya Allāhu 'Amrāan Kāna Maf`ūlāan Liyahlika Man Halaka `An Bayyinatin Wa Yaĥyá Man Ĥayya `An Bayyinatin Wa 'Inna Allāha Lasamī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember] when you were on the near side of the valley, and they were on the farther side, and the caravan was lower [in position] than you. If you had made an appointment [to meet], you would have missed the appointment. But [it was] so that Allāh might accomplish a matter already destined - that those who perished [through disbelief] would perish upon evidence and those who lived [in faith] would live upon evidence; and indeed, Allāh is Hearing and Knowing.",
            "english_hilali_khan": "(And remember) when you (the Muslim army) were on the near side of the valley, and they on the farther side, and the caravan on the ground lower than you. Even if you had made a mutual appointment to meet, you would certainly have failed in the appointment, but (you met) that Allâh might accomplish a matter already ordained (in His Knowledge), so that those who were to be destroyed (for their rejecting the Faith) might be destroyed after a clear evidence, and those who were to live (i.e. believers) might live after a clear evidence. And surely, Allâh is All-Hearer, All-Knower.",
            "english_rwwad": "[Remember] when you were on the near side of the valley [of Badr], and they were on the far side, and the caravan was on the lower ground beneath you. If you had made prior arrangements to encounter, you would have failed to keep that appointment. But [it happened] so that Allah might accomplish what had already been decreed, and so that those who chose to perish would perish after seeing clear evidence, and those who chose to survive would survive after seeing clear evidence. Indeed, Allah is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 1202,
        "chapter": 8,
        "verse": 43,
        "arabic_text": "إِذۡ يُرِيكَهُمُ ٱللَّهُ فِي مَنَامِكَ قَلِيلٗاۖ وَلَوۡ أَرَىٰكَهُمۡ كَثِيرٗا لَّفَشِلۡتُمۡ وَلَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَلَٰكِنَّ ٱللَّهَ سَلَّمَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ",
        "phonetic": "8.43 'Idh Yurīkahumu Allāhu Fī Manāmika Qalīlāan Wa Law 'Arākahum Kathīrāan Lafashiltum Wa Latanāza`tum Fī Al-'Amri Wa Lakinna Allāha Sallama 'Innahu `Alīmun Bidhāti Aş-Şudūri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember, O Muḥammad], when Allāh showed them to you in your dream as few; and if He had shown them to you as many, you [believers] would have lost courage and would have disputed in the matter [of whether to fight], but Allāh saved [you from that]. Indeed, He is Knowing of that within the breasts.",
            "english_hilali_khan": "(And remember) when Allâh showed them to you as few in your (i.e. Muhammad’s صلى الله عليه وسلم) dream; if He had shown them to you as many, you would surely have been discouraged, and you would surely have disputed in making a decision. But Allâh saved (you). Certainly, He is the All-Knower of what is in the breasts.",
            "english_rwwad": "[Remember] when Allah showed them to you in your dream as few in number; if He had shown them to you as many, you [believers] would have lost courage and disputed in the matter. But Allah spared you [of that], for He is All-Knowing of what is in the hearts."
        }
    },
    {
        "id": 1203,
        "chapter": 8,
        "verse": 44,
        "arabic_text": "وَإِذۡ يُرِيكُمُوهُمۡ إِذِ ٱلۡتَقَيۡتُمۡ فِيٓ أَعۡيُنِكُمۡ قَلِيلٗا وَيُقَلِّلُكُمۡ فِيٓ أَعۡيُنِهِمۡ لِيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗاۗ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ",
        "phonetic": "8.44 Wa 'Idh Yurīkumūhum 'Idhi At-Taqaytum Fī 'A`yunikum Qalīlāan Wa Yuqallilukum Fī 'A`yunihim Liyaqđiya Allāhu 'Amrāan Kāna Maf`ūlāan Wa 'Ilá Allāhi Turja`u Al-'Umūru ",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [remember] when He showed them to you, when you met, as few in your eyes, and He made you [appear] as few in their eyes so that Allāh might accomplish a matter already destined. And to Allāh are [all] matters returned.",
            "english_hilali_khan": "And (remember) when you met (the army of the disbelievers on the Day of the battle of Badr), He showed them to you as few in your eyes and He made you appear as few in their eyes, so that Allâh might accomplish a matter already ordained (in His Knowledge), and to Allâh return all matters (for decision).",
            "english_rwwad": "And [remember] when you met, He made them appear as few in your eyes, and made you appear as few in their eyes, so that Allah may accomplish what was already decreed. And to Allah will return all matters."
        }
    },
    {
        "id": 1204,
        "chapter": 8,
        "verse": 45,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ",
        "phonetic": "8.45 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Idhā Laqītum Fi'atan Fāthbutū Wa Adhkurū Allāha Kathīrāan La`allakum Tufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, when you encounter a company [from the enemy forces], stand firm and remember Allāh much that you may be successful.",
            "english_hilali_khan": "O you who believe! When you meet (an enemy) force, take a firm stand against them and remember the Name of Allâh much (both with tongue and mind), so that you may be successful.",
            "english_rwwad": "O you who believe, when you encounter a group [in battle], stand firm and remember Allah much, so that you may triumph."
        }
    },
    {
        "id": 1205,
        "chapter": 8,
        "verse": 46,
        "arabic_text": "وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ",
        "phonetic": "8.46 Wa 'Aţī`ū Allāha Wa Rasūlahu Wa Lā Tanāza`ū Fatafshalū Wa Tadh/haba Rīĥukum Wa Aşbirū 'Inna Allāha Ma`a Aş-Şābirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And obey Allāh and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allāh is with the patient.",
            "english_hilali_khan": "And obey Allâh and His Messenger, and do not dispute (with one another) lest you lose courage and your strength departs, and be patient. Surely, Allâh is with those who are As-Sâbirûn (the patient).",
            "english_rwwad": "Obey Allah and His Messenger, and do not dispute with one another, or else you will lose courage and your strength will weaken. And be steadfast, for Allah is with those who are steadfast."
        }
    },
    {
        "id": 1206,
        "chapter": 8,
        "verse": 47,
        "arabic_text": "وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ",
        "phonetic": "8.47 Wa Lā Takūnū Kālladhīna Kharajū Min Diyārihim Baţarāan Wa Ri'ā'a An-Nāsi Wa Yaşuddūna `An Sabīli Allāhi Wa Allāhu Bimā Ya`malūna Muĥīţun",
        "footnotes": {
            "english_saheeh": "[452]- In knowledge.  See footnote to 2:19.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not be like those who came forth from their homes insolently and to be seen by people and avert [them] from the way of Allāh. And Allāh is encompassing[452] of what they do.",
            "english_hilali_khan": "And be not like those who come out of their homes boastfully and to be seen of men, and hinder (men) from the Path of Allâh; and Allâh is Muhîtun (encircling and thoroughly comprehending) all that they do.",
            "english_rwwad": "Do not be like those who came out of their homes insolently, showing off to people, and preventing others from Allah’s way, for Allah is All-Encompassing of what they do."
        }
    },
    {
        "id": 1207,
        "chapter": 8,
        "verse": 48,
        "arabic_text": "وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ",
        "phonetic": "8.48 Wa 'Idh Zayyana Lahumu Ash-Shayţānu 'A`mālahum Wa Qāla Lā Ghāliba Lakumu Al-Yawma Mina An-Nāsi Wa 'Innī Jārun Lakum Falammā Tarā'ati Al-Fi'atāni Nakaşa `Alá `Aqibayhi Wa Qāla 'Innī Barī'un Minkum 'Innī 'Ará Mā Lā Tarawna 'Inniyi 'Akhāfu Allāha Wa Allāhu Shadīdu Al-`Iqābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [remember] when Satan made their deeds pleasing to them and said, \"No one can overcome you today from among the people, and indeed, I am your protector.\" But when the two armies sighted each other, he turned on his heels and said, \"Indeed, I am disassociated from you. Indeed, I see what you do not see; indeed, I fear Allāh. And Allāh is severe in penalty.\"",
            "english_hilali_khan": "And (remember) when Shaitân (Satan) made their (evil) deeds seem fair to them and said, \"No one of mankind can overcome you this Day (of the battle of Badr) and verily, I am your neighbour (for each and every help).\" But when the two forces came in sight of each other, he ran away and said \"Verily, I have nothing to do with you. Verily! I see what you see not. Verily! I fear Allâh for Allâh is Severe in punishment.\"",
            "english_rwwad": "And [remember] when Satan made their misdeeds appealing to them, and said, “No one can overcome you today, and I am your protector.” But when the two armies faced each other, he turned on his heels and said, “I have nothing to do with you, for I see what you do not see. I surely fear Allah, for Allah is severe in punishment.”"
        }
    },
    {
        "id": 1208,
        "chapter": 8,
        "verse": 49,
        "arabic_text": "إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ",
        "phonetic": "8.49 'Idh Yaqūlu Al-Munāfiqūna Wa Al-Ladhīna Fī Qulūbihim Marađun Gharra Hā'uulā' Dīnuhum Wa Man Yatawakkal `Alá Allāhi Fa'inna Allāha `Azīzun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Remember] when the hypocrites and those in whose hearts was disease [i.e., arrogance and disbelief] said, \"Their religion has deluded those [Muslims].\" But whoever relies upon Allāh - then indeed, Allāh is Exalted in Might and Wise.",
            "english_hilali_khan": "When the hypocrites and those in whose hearts was a disease (of disbelief) said: \"These people (Muslims) are deceived by their religion.\" But whoever puts his trust in Allâh, then surely, Allâh is All-Mighty, All-Wise.",
            "english_rwwad": "And [remember] when the hypocrites and those who have sickness in their hearts said, “These [believers] are deluded by their religion.” But whoever puts his trust in Allah, Allah is indeed All-Mighty, All-Wise."
        }
    },
    {
        "id": 1209,
        "chapter": 8,
        "verse": 50,
        "arabic_text": "وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ",
        "phonetic": "8.50 Wa Law Tará 'Idh Yatawaffá Al-Ladhīna Kafarū Al-Malā'ikatu Yađribūna Wujūhahum Wa 'Adbārahum Wa Dhūqū `Adhāba Al-Ĥarīqi",
        "footnotes": {
            "english_saheeh": "[453]- This sentence is left incomplete for additional effect.  Its conclusion is left to the imagination of the reader or listener and estimated as \"...you would see a dreadful sight.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you could but see when the angels take the souls of those who disbelieved...[453] They are striking their faces and their backs and [saying], \"Taste the punishment of the Burning Fire.",
            "english_hilali_khan": "And if you could see when the angels take away the souls of those who disbelieve (at death); they smite their faces and their backs, (saying): \"Taste the punishment of the blazing Fire.\"",
            "english_rwwad": "If only you could see when the angels take the souls of the disbelievers, beating their faces and their backs, “Taste the punishment of the scorching fire!"
        }
    },
    {
        "id": 1210,
        "chapter": 8,
        "verse": 51,
        "arabic_text": "ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ",
        "phonetic": "8.51 Dhālika Bimā Qaddamat 'Aydīkum Wa 'Anna Allāha Laysa Bižallāmin Lil`abīdi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is for what your hands have put forth [of evil] and because Allāh is not ever unjust to [His] servants.\"",
            "english_hilali_khan": "\"This is because of that which your hands had forwarded. And verily, Allâh is not unjust to His slaves.\"",
            "english_rwwad": "This is because of what your hands have sent forth, for Allah is never unjust to [His] slaves.”"
        }
    },
    {
        "id": 1211,
        "chapter": 8,
        "verse": 52,
        "arabic_text": "كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ",
        "phonetic": "8.52 Kada'bi 'Āli Fir`awna Wa Al-Ladhīna Min Qablihim Kafarū Bi'āyāti Allāhi Fa'akhadhahumu Allāhu Bidhunūbihim 'Inna Allāha Qawīyun Shadīdu Al-`Iqābi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Theirs is] like the custom of the people of Pharaoh and of those before them. They disbelieved in the signs of Allāh, so Allāh seized them for their sins. Indeed, Allāh is Powerful and severe in penalty.",
            "english_hilali_khan": "Similar to the behaviour of the people of Fir‘aun (Pharaoh), and of those before them - they rejected the Ayât (proofs, verses, etc.) of Allâh, so Allâh punished them for their sins. Verily, Allâh is All-Strong, Severe in punishment.",
            "english_rwwad": "Their case is like the people of Pharaoh and those who came before them. They disbelieved in the signs of Allah, so Allah seized them for their sins. Indeed, Allah is All-Powerful, Severe in Punishment."
        }
    },
    {
        "id": 1212,
        "chapter": 8,
        "verse": 53,
        "arabic_text": "ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمۡ يَكُ مُغَيِّرٗا نِّعۡمَةً أَنۡعَمَهَا عَلَىٰ قَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ",
        "phonetic": "8.53 Dhālika Bi'anna Allāha Lam Yaku Mughayyirāan Ni`matan 'An`amahā `Alá Qawmin Ĥattá Yughayyirū Mā Bi'anfusihim Wa 'Anna Allāha Samī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is because Allāh would not change a favor which He had bestowed upon a people until they change what is within themselves. And indeed, Allāh is Hearing and Knowing.",
            "english_hilali_khan": "That is so because Allâh will never change a grace which He has bestowed on a people until they change what is in their ownselves. And verily, Allâh is All-Hearer, All-Knower.",
            "english_rwwad": "This is because Allah would never change the blessings He has bestowed upon a people until they change their own attitude and conduct. Indeed, Allah is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 1213,
        "chapter": 8,
        "verse": 54,
        "arabic_text": "كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِـَٔايَٰتِ رَبِّهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَۚ وَكُلّٞ كَانُواْ ظَٰلِمِينَ",
        "phonetic": "8.54 Kada'bi 'Āli Fir`awna Wa Al-Ladhīna Min Qablihim Kadhabū Bi'āyāti Rabbihim Fa'ahlaknāhum Bidhunūbihim Wa 'Aghraqnā 'Āla Fir`awna Wa Kullun Kānū Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Theirs is] like the custom of the people of Pharaoh and of those before them. They denied the signs of their Lord, so We destroyed them for their sins, and We drowned the people of Pharaoh. And all [of them] were wrongdoers.",
            "english_hilali_khan": "Similar to the behaviour of the people of Fir‘aun (Pharaoh), and those before them. They belied the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord, so We destroyed them for their sins, and We drowned the people of Fir‘aun (Pharaoh) for they were all Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "Their case is like the people of Pharaoh and those who came before them. They rejected the signs of their Lord, so We destroyed them for their sins and drowned the people of Pharaoh; they were all wrongdoers."
        }
    },
    {
        "id": 1214,
        "chapter": 8,
        "verse": 55,
        "arabic_text": "إِنَّ شَرَّ ٱلدَّوَآبِّ عِندَ ٱللَّهِ ٱلَّذِينَ كَفَرُواْ فَهُمۡ لَا يُؤۡمِنُونَ",
        "phonetic": "8.55 'Inna Sharra Ad-Dawābbi `Inda Allāhi Al-Ladhīna Kafarū Fahum Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.8:55) i.e. disbelieve in their Lord (Allâh), deny His Oneness, worship others besides Him, deny His Messengers, and believe not in the Divine Revelation.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the worst of living creatures in the sight of Allāh are those who have disbelieved, and they will not [ever] believe-",
            "english_hilali_khan": "Verily, The worst of moving (living) creatures before Allâh are those who disbelieve[1], - so they shall not believe.",
            "english_rwwad": "The worst of moving creatures before Allah are those who persist in disbelief, so they do not believe,"
        }
    },
    {
        "id": 1215,
        "chapter": 8,
        "verse": 56,
        "arabic_text": "ٱلَّذِينَ عَٰهَدتَّ مِنۡهُمۡ ثُمَّ يَنقُضُونَ عَهۡدَهُمۡ فِي كُلِّ مَرَّةٖ وَهُمۡ لَا يَتَّقُونَ",
        "phonetic": "8.56 Al-Ladhīna `Āhadta Minhum Thumma Yanquđūna `Ahdahum Fī Kulli Marratin Wa Hum Lā Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ones with whom you made a treaty but then they break their pledge every time, and they do not fear Allāh.",
            "english_hilali_khan": "They are those with whom you made a covenant, but they break their covenant every time and they do not fear Allâh.",
            "english_rwwad": "those with whom you [O Prophet] made a treaty, but they break their treaty every time, and they do not fear Allah."
        }
    },
    {
        "id": 1216,
        "chapter": 8,
        "verse": 57,
        "arabic_text": "فَإِمَّا تَثۡقَفَنَّهُمۡ فِي ٱلۡحَرۡبِ فَشَرِّدۡ بِهِم مَّنۡ خَلۡفَهُمۡ لَعَلَّهُمۡ يَذَّكَّرُونَ",
        "phonetic": "8.57 Fa'immā Tathqafannahum Fī Al-Ĥarbi Fasharrid Bihim Man Khalfahum La`allahum Yadhakkarūna",
        "footnotes": {
            "english_saheeh": "[454]- i.e., kill them and make an example of them to discourage those who follow them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So if you, [O Muḥammad], gain dominance over them in war, disperse by [means of] them those behind them that perhaps they will be reminded.[454]",
            "english_hilali_khan": "So if you gain the mastery over them in war, punish them severely in order to disperse those who are behind them, so that they may learn a lesson.",
            "english_rwwad": "If you encounter them in battle, make a fearsome example of them for those who are behind them, so that they may be deterred."
        }
    },
    {
        "id": 1217,
        "chapter": 8,
        "verse": 58,
        "arabic_text": "وَإِمَّا تَخَافَنَّ مِن قَوۡمٍ خِيَانَةٗ فَٱنۢبِذۡ إِلَيۡهِمۡ عَلَىٰ سَوَآءٍۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡخَآئِنِينَ",
        "phonetic": "8.58 Wa 'Immā Takhāfanna Min Qawmin Khiyānatan Fānbidh 'Ilayhim `Alá Sawā'in 'Inna Allāha Lā Yuĥibbu Al-Khā'inīna",
        "footnotes": {
            "english_saheeh": "[455]- When you see signs of treachery from those with whom you have made a treaty, announce to them its dissolution so they will know exactly where they stand.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you [have reason to] fear from a people betrayal, throw [their treaty] back to them, [putting you] on equal terms.[455] Indeed, Allāh does not like traitors.",
            "english_hilali_khan": "If you (O Muhammad صلى الله عليه وسلم) fear treachery from any people throw back (their covenant) to them (so as to be) on equal terms (that there will be no more covenant between you and them). Certainly Allâh likes not the treacherous.",
            "english_rwwad": "If you fear betrayal from any people, throw their treaty back at them openly, for Allah does not like the treacherous."
        }
    },
    {
        "id": 1218,
        "chapter": 8,
        "verse": 59,
        "arabic_text": "وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُواْ سَبَقُوٓاْۚ إِنَّهُمۡ لَا يُعۡجِزُونَ",
        "phonetic": "8.59 Wa Lā Yaĥsabanna Al-Ladhīna Kafarū Sabaqū 'Innahum Lā Yu`jizūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And let not those who disbelieve think they will escape. Indeed, they will not cause failure [to Allāh].",
            "english_hilali_khan": "And let not those who disbelieve think that they can outstrip (escape from the punishment). Verily, they will never be able to save themselves (from Allâh’s Punishment).",
            "english_rwwad": "The disbelievers should not think that they are unreachable; they cannot escape."
        }
    },
    {
        "id": 1219,
        "chapter": 8,
        "verse": 60,
        "arabic_text": "وَأَعِدُّواْ لَهُم مَّا ٱسۡتَطَعۡتُم مِّن قُوَّةٖ وَمِن رِّبَاطِ ٱلۡخَيۡلِ تُرۡهِبُونَ بِهِۦ عَدُوَّ ٱللَّهِ وَعَدُوَّكُمۡ وَءَاخَرِينَ مِن دُونِهِمۡ لَا تَعۡلَمُونَهُمُ ٱللَّهُ يَعۡلَمُهُمۡۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فِي سَبِيلِ ٱللَّهِ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ",
        "phonetic": "8.60 Wa 'A`iddū Lahum Mā Astaţa`tum Min Qūwatin Wa Min Ribāţi Al-Khayli Turhibūna Bihi `Adūwa Allāhi Wa `Adūwakum Wa 'Ākharīna Min Dūnihim Lā Ta`lamūnahumu Allāhu Ya`lamuhum Wa Mā Tunfiqū Min Shay'in Fī Sabīli Allāhi Yuwaffa 'Ilaykum Wa 'Antum Lā Tužlamūna",
        "footnotes": {
            "english_saheeh": "[456]- Or equipment which serves the same purpose.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And prepare against them whatever you are able of power and of steeds of war[456] by which you may terrify the enemy of Allāh and your enemy and others besides them whom you do not know [but] whom Allāh knows. And whatever you spend in the cause of Allāh will be fully repaid to you, and you will not be wronged.",
            "english_hilali_khan": "And make ready against them all you can of power, including steeds of war (tanks, planes, missiles, artillery) to threaten the enemy of Allâh and your enemy, and others besides whom, you may not know but whom Allâh does know. And whatever you shall spend in the Cause of Allâh shall be repaid unto you, and you shall not be treated unjustly.",
            "english_rwwad": "Prepare against them whatever force you can and cavalry, to deter Allah’s enemies and your enemies, and others besides them whom you do not know, but Allah knows them. Whatever you spend in the cause of Allah will be repaid to you in full, and you will not be wronged."
        }
    },
    {
        "id": 1220,
        "chapter": 8,
        "verse": 61,
        "arabic_text": "۞ وَإِن جَنَحُواْ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
        "phonetic": "8.61 Wa 'In Janaĥū Lilssalmi Fājnaĥ Lahā Wa Tawakkal `Alá Allāhi 'Innahu Huwa As-Samī`u Al-`Alīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if they incline to peace, then incline to it [also] and rely upon Allāh. Indeed, it is He who is the Hearing, the Knowing.",
            "english_hilali_khan": "But if they incline to peace, you also incline to it, and (put your) trust in Allâh. Verily, He is the All-Hearer, the All-Knower.",
            "english_rwwad": "If they incline to peace, then incline to it, and put your trust in Allah, for He is the All-Hearing, the All-Knowing."
        }
    },
    {
        "id": 1221,
        "chapter": 8,
        "verse": 62,
        "arabic_text": "وَإِن يُرِيدُوٓاْ أَن يَخۡدَعُوكَ فَإِنَّ حَسۡبَكَ ٱللَّهُۚ هُوَ ٱلَّذِيٓ أَيَّدَكَ بِنَصۡرِهِۦ وَبِٱلۡمُؤۡمِنِينَ",
        "phonetic": "8.62 Wa 'In Yurīdū 'An Yakhda`ūka Fa'inna Ĥasbaka Allāhu Huwa Al-Ladhī 'Ayyadaka Binaşrihi Wa Bil-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they intend to deceive you - then sufficient for you is Allāh. It is He who supported you with His help and with the believers",
            "english_hilali_khan": "And if they intend to deceive you, then verily, Allâh is All-Sufficient for you. He it is Who has supported you with His Help and with the believers.",
            "english_rwwad": "But if they intend to deceive you, then Allah is sufficient for you; it is He Who supported you with His help and with that of the believers."
        }
    },
    {
        "id": 1222,
        "chapter": 8,
        "verse": 63,
        "arabic_text": "وَأَلَّفَ بَيۡنَ قُلُوبِهِمۡۚ لَوۡ أَنفَقۡتَ مَا فِي ٱلۡأَرۡضِ جَمِيعٗا مَّآ أَلَّفۡتَ بَيۡنَ قُلُوبِهِمۡ وَلَٰكِنَّ ٱللَّهَ أَلَّفَ بَيۡنَهُمۡۚ إِنَّهُۥ عَزِيزٌ حَكِيمٞ",
        "phonetic": "8.63 Wa 'Allafa Bayna Qulūbihim Law 'Anfaqta Mā Fī Al-'Arđi Jamī`āan Mā 'Allafta Bayna Qulūbihim Wa Lakinna Allāha 'Allafa Baynahum 'Innahu `Azīzun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allāh brought them together. Indeed, He is Exalted in Might and Wise.",
            "english_hilali_khan": "And He has united their (i.e. believers’) hearts. If you had spent all that is in the earth, you could not have united their hearts, but Allâh has united them. Certainly He is All-Mighty, All-Wise.",
            "english_rwwad": "He brought their hearts together, even if you had spent all that is on earth, you could not have brought their hearts together, but Allah has brought them together, for He is All-Mighty, All-Wise."
        }
    },
    {
        "id": 1223,
        "chapter": 8,
        "verse": 64,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّبِيُّ حَسۡبُكَ ٱللَّهُ وَمَنِ ٱتَّبَعَكَ مِنَ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "8.64 Yā 'Ayyuhā An-Nabīyu Ĥasbuka Allāhu Wa Mani Attaba`aka Mina Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Prophet, sufficient for you is Allāh and for whoever follows you of the believers.",
            "english_hilali_khan": "O Prophet (Muhammad صلى الله عليه وسلم)! Allâh is Sufficient for you and for the believers who follow you.",
            "english_rwwad": "O Prophet, Allah is sufficient for you and for the believers who follow you."
        }
    },
    {
        "id": 1224,
        "chapter": 8,
        "verse": 65,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّبِيُّ حَرِّضِ ٱلۡمُؤۡمِنِينَ عَلَى ٱلۡقِتَالِۚ إِن يَكُن مِّنكُمۡ عِشۡرُونَ صَٰبِرُونَ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُم مِّاْئَةٞ يَغۡلِبُوٓاْ أَلۡفٗا مِّنَ ٱلَّذِينَ كَفَرُواْ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ",
        "phonetic": "8.65 Yā 'Ayyuhā An-Nabīyu Ĥarriđi Al-Mu'uminīna `Alá Al-Qitāli 'In Yakun Minkum `Ishrūna Şābirūna Yaghlibū Miā'atayni Wa 'In Yakun Minkum Miā'atun Yaghlibū 'Alfāan Mina Al-Ladhīna Kafarū Bi'annahum Qawmun Lā Yafqahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Prophet, urge the believers to battle. If there are among you twenty [who are] steadfast, they will overcome two hundred. And if there are among you one hundred [who are steadfast], they will overcome a thousand of those who have disbelieved because they are a people who do not understand.",
            "english_hilali_khan": "O Prophet (Muhammad صلى الله عليه وسلم)! Urge the believers to fight. If there are twenty steadfast persons amongst you, they will overcome two hundreds, and if there be a hundred steadfast persons they will overcome a thousand of those who disbelieve, because they (the disbelievers) are people who do not understand.",
            "english_rwwad": "O Prophet, urge the believers to fight. If there are twenty steadfast among you, they will overcome two hundred; and if there are a hundred of you, they will overcome a thousand of the disbelievers, for they are a people who do not understand."
        }
    },
    {
        "id": 1225,
        "chapter": 8,
        "verse": 66,
        "arabic_text": "ٱلۡـَٰٔنَ خَفَّفَ ٱللَّهُ عَنكُمۡ وَعَلِمَ أَنَّ فِيكُمۡ ضَعۡفٗاۚ فَإِن يَكُن مِّنكُم مِّاْئَةٞ صَابِرَةٞ يَغۡلِبُواْ مِاْئَتَيۡنِۚ وَإِن يَكُن مِّنكُمۡ أَلۡفٞ يَغۡلِبُوٓاْ أَلۡفَيۡنِ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ",
        "phonetic": "8.66 Al-'Āna Khaffafa Allāhu `Ankum Wa `Alima 'Anna Fīkum Đa`fāan Fa'in Yakun Minkum Miā'atun Şābiratun Yaghlibū Miā'atayni Wa 'In Yakun Minkum 'Alfun Yaghlibū 'Alfayni Bi'idhni Allāhi Wa Allāhu Ma`a Aş-Şābirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Now, Allāh has lightened [the hardship] for you, and He knows that among you is weakness. So if there are from you one hundred [who are] steadfast, they will overcome two hundred. And if there are among you a thousand, they will overcome two thousand by permission of Allāh. And Allāh is with the steadfast.",
            "english_hilali_khan": "Now Allâh has lightened your (task), for He knows that there is weakness in you. So if there are of you a hundred steadfast persons, they shall overcome two hundreds, and if there are a thousand of you, they shall overcome two thousand with the Leave of Allâh. And Allâh is with As-Sâbirûn (the patient).",
            "english_rwwad": "Now Allah has lightened your burden, for He knew that there is weakness in you. So if there are a hundred steadfast men among you, they will overcome two hundred; and if there are a thousand, they will overcome two thousand, by Allah’s permission. And Allah is with those who are steadfast."
        }
    },
    {
        "id": 1226,
        "chapter": 8,
        "verse": 67,
        "arabic_text": "مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ",
        "phonetic": "8.67 Mā Kāna Linabīyin 'An Yakūna Lahu 'Asrá Ĥattá Yuthkhina Fī Al-'Arđi Turīdūna `Arađa Ad-Dunyā Wa Allāhu Yurīdu Al-'Ākhirata Wa Allāhu `Azīzun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "[457]- i.e., material benefit, such as the ransom paid for prisoners.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is not for a prophet to have captives [of war] until he inflicts a massacre [upon Allāh's enemies] in the land. You [i.e., some Muslims] desire the commodities of this world,[457] but Allāh desires [for you] the Hereafter. And Allāh is Exalted in Might and Wise.",
            "english_hilali_khan": "It is not for a Prophet that he should have prisoners of war (and free them with ransom) until he had made a great slaughter (among his enemies) in the land. You desire the good of this world (i.e. the money of ransom for freeing the captives), but Allâh desires (for you) the Hereafter. And Allâh is All-Mighty, All-Wise.",
            "english_rwwad": "It is not befitting for a prophet to take captives until he thoroughly subdues [the enemy] in the land. You desire the gains of this world, but Allah desires [for you] the Hereafter. And Allah is All-Mighty, All-Wise."
        }
    },
    {
        "id": 1227,
        "chapter": 8,
        "verse": 68,
        "arabic_text": "لَّوۡلَا كِتَٰبٞ مِّنَ ٱللَّهِ سَبَقَ لَمَسَّكُمۡ فِيمَآ أَخَذۡتُمۡ عَذَابٌ عَظِيمٞ",
        "phonetic": "8.68 Lawlā Kitābun Mina Allāhi Sabaqa Lamassakum Fīmā 'Akhadhtum `Adhābun `Ažīmun",
        "footnotes": {
            "english_saheeh": "[458]- Three interpretations of the \"decree\" are given:  that by which the companions of Badr were forgiven, that by which indeliberate errors in judgement by believers are not punished, and that which made lawful the spoils of war.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If not for a decree from Allāh that preceded,[458] you would have been touched for what you took by a great punishment.",
            "english_hilali_khan": "Were it not a previous ordainment from Allâh, a severe torment would have touched you for what you took.",
            "english_rwwad": "Were it not for a prior decree from Allah, you would have surely been afflicted with a great punishment for what you have taken [of ransom]."
        }
    },
    {
        "id": 1228,
        "chapter": 8,
        "verse": 69,
        "arabic_text": "فَكُلُواْ مِمَّا غَنِمۡتُمۡ حَلَٰلٗا طَيِّبٗاۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ",
        "phonetic": "8.69 Fakulū Mimmā Ghanimtum Ĥalālāan Ţayyibāan Wa Attaqū Allāha 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So consume what you have taken of war booty [as being] lawful and good, and fear Allāh. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "So enjoy what you have gotten of booty in war, lawful and good, and be afraid of Allâh. Certainly, Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "So enjoy what you have gained in war, for it is lawful and good, but fear Allah. Allah is indeed All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1229,
        "chapter": 8,
        "verse": 70,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
        "phonetic": "8.70 Yā 'Ayyuhā An-Nabīyu Qul Liman Fī 'Aydīkum Mina Al-'Asrá 'In Ya`lami Allāhu Fī Qulūbikum Khayrāan Yu'utikum Khayrāan Mimmā 'Ukhidha Minkum Wa Yaghfir Lakum Wa Allāhu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Prophet, say to whoever is in your hands of the captives, \"If Allāh knows [any] good in your hearts, He will give you [something] better than what was taken from you, and He will forgive you; and Allāh is Forgiving and Merciful.\"",
            "english_hilali_khan": "O Prophet (Muhammad صلى الله عليه وسلم) Say to the captives that are in your hands! \"If Allâh knows any good in your hearts, He will give you something better than what has been taken from you, and He will forgive you, and Allâh is Oft-Forgiving, Most Merciful.\"",
            "english_rwwad": "O Prophet, tell those captives who are in your custody, “If Allah knows of any good in your hearts, He will give you something better than what has been taken from you, and will forgive you, for Allah is All-Forgiving, Most Merciful.”"
        }
    },
    {
        "id": 1230,
        "chapter": 8,
        "verse": 71,
        "arabic_text": "وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
        "phonetic": "8.71 Wa 'In Yurīdū Khiyānataka Faqad Khānū Allāha Min Qablu Fa'amkana Minhum Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they intend to betray you - then they have already betrayed Allāh before, and He empowered [you] over them. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "But if they intend to betray you (O Muhammad صلى الله عليه وسلم), they indeed betrayed Allâh before. So He gave (you) power over them. And Allâh is All-Knower, All-Wise.",
            "english_rwwad": "But if they intend to betray you, they have already betrayed Allah before, so He empowered you over them. And Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1231,
        "chapter": 8,
        "verse": 72,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۭ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ",
        "phonetic": "8.72 'Inna Al-Ladhīna 'Āmanū Wa Hājarū Wa Jāhadū Bi'amwālihim Wa 'Anfusihim Fī Sabīli Allāhi Wa Al-Ladhīna 'Āwaw Wa Naşarū 'Ūlā'ika Ba`đuhum 'Awliyā'u Ba`đin Wa Al-Ladhīna 'Āmanū Wa Lam Yuhājarū Mā Lakum Min Walāyatihim Min Shay'in Ĥattá Yuhājirū Wa 'Ini Astanşarūkum Fī Ad-Dīni Fa`alaykumu An-Naşru 'Illā `Alá Qawmin Baynakum Wa Baynahum Mīthāqun Wa Allāhu Bimā Ta`malūna Başīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.8:72): See the footnote of (V.3:149).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have believed and emigrated and fought with their wealth and lives in the cause of Allāh and those who gave shelter and aided - they are allies of one another. But those who believed and did not emigrate - for you there is no support of them until they emigrate. And if they seek help of you for the religion, then you must help, except against a people between yourselves and whom is a treaty. And Allāh is Seeing of what you do.",
            "english_hilali_khan": "Verily, those who believed, and emigrated and strove hard and fought with their property and their lives in the Cause of Allâh as well as those who gave (them) asylum and help, - these are (all) allies to one another. And as to those who believed but did not emigrate (to you O Muhammad صلى الله عليه وسلم), you owe no duty of protection to them until they emigrate[1]; but if they seek your help in religion, it is your duty to help them except against a people with whom you have a treaty of mutual alliance; and Allâh is the All-Seer of what you do.",
            "english_rwwad": "Those who believed, migrated, and fought with their wealth and their lives in the cause of Allah, and those who provided [migrants] with shelter and help – they are allies of one another. As for those who believed but did not migrate, you have no obligation to protect them until they migrate. But if they seek your help in religion, it is your obligation to help, except against people with whom you have a treaty. And Allah is All-Seeing of what you do."
        }
    },
    {
        "id": 1232,
        "chapter": 8,
        "verse": 73,
        "arabic_text": "وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ",
        "phonetic": "8.73 Wa Al-Ladhīna Kafarū Ba`đuhum 'Awliyā'u Ba`đin 'Illā Taf`alūhu Takun Fitnatun Fī Al-'Arđi Wa Fasādun Kabīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.8:73) It has been mentioned in Tafsjr At-Tabari, that the best interpretation of this Verse: - [\"And those who disbelieve are allies of one another, (and) if you (Muslims of the whole world collectively) do not do so (i.e. become allies, as one united block V.8:73).\"] is \"That if you do not do what We (Allâh) have ordered you to do, [i.e. all of you (Muslims of the whole world) do not become allies as one united block to make Allâh’s religion Islâm) victorious, there will be a great Fitnah (polytheism, wars, battles, killing, robbing, a great mischief, corruption and oppression.)\"]. And it is Fitnah to have many Khalifahs (Muslim rulers), as it has been mentioned in Sahih Muslim by ‘Arfajah, who said: I heard Allâh’s Messenger صلى الله عليه وسلم saying: \"When you all (Muslims) are united (as one block) under a single Khalifah (chief Muslim ruler), and a man comes up to disintegrate you and separate you into different groups, then kill that man.\"\nAlso there is another narration in Sahih Muslim: Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلمsaid: \"If the Muslim world gave the Bai‘a (pledge) to two Khalifah (chief Muslim rulers), the first one who was given the Bai‘a (pledge) first will remain as the Khalifah, then kill the latter (the second) one.\" So it is a legal obligation, from the above-mentioned evident proofs (from the Qur’ân and the Prophet’s statement), that there shall not be more than one Khalifah (a chief Muslim ruler) for the whole Muslim world or otherwise there will be a great Fitnah (mischief and evil) amongst the Muslims, the ultimate results of which will not be worthy of praise.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who disbelieved are allies of one another. If you do not do so [i.e., ally yourselves with other believers], there will be fitnah [i.e., disbelief and oppression] on earth and great corruption.",
            "english_hilali_khan": "And those who disbelieve are allies of one another, (and) if you (Muslims of the whole world collectively) do not do so [i.e. become allies, as one united block under one Khalifah (a chief Muslim ruler for the whole Muslim world) to make victorious Allâh’s religion of Islâmic Monotheism], there will be Fitnah (wars, battles, polytheism) and oppression on the earth, and a great mischief and corruption (appearance of polytheism).[2]",
            "english_rwwad": "Those who disbelieve are protectors of one another. Unless you do likewise, there will be persecution in the land and a great corruption."
        }
    },
    {
        "id": 1233,
        "chapter": 8,
        "verse": 74,
        "arabic_text": "وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ",
        "phonetic": "8.74 Wa Al-Ladhīna 'Āmanū Wa Hājarū Wa Jāhadū Fī Sabīli Allāhi Wa Al-Ladhīna 'Āwaw Wa Naşarū 'Ūlā'ika Humu Al-Mu'uminūna Ĥaqqāan Lahum Maghfiratun Wa Rizqun Karīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who have believed and emigrated and fought in the cause of Allāh and those who gave shelter and aided - it is they who are the believers, truly. For them is forgiveness and noble provision.",
            "english_hilali_khan": "And those who believed, and emigrated and strove hard in the Cause of Allâh (Al-Jihâd), as well as those who gave (them) asylum and aid - these are the believers in truth, for them is forgiveness and Rizqun Karîm (a generous provision i.e. Paradise).",
            "english_rwwad": "Those who believed, migrated and fought in the cause of Allah, as well as those who gave them refuge and help – it is they who are the true believers; they will have forgiveness and an honorable provision."
        }
    },
    {
        "id": 1234,
        "chapter": 8,
        "verse": 75,
        "arabic_text": "وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ",
        "phonetic": "8.75 Wa Al-Ladhīna 'Āmanū Min Ba`du Wa Hājarū Wa Jāhadū Ma`akum Fa'ūlā'ika Minkum Wa 'Ūlū Al-'Arĥāmi Ba`đuhum 'Awlá Biba`đin Fī Kitābi Allāhi 'Inna Allāha Bikulli Shay'in `Alīmun",
        "footnotes": {
            "english_saheeh": "[459]- This applies to Muslim relatives only.  Others may be given by bequest.  See 4:11.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who believed after [the initial emigration] and emigrated and fought with you - they are of you. But those of [blood] relationship are more entitled [to inheritance] in the decree of Allāh.[459] Indeed, Allāh is Knowing of all things.",
            "english_hilali_khan": "And those who believed afterwards, and emigrated and strove hard along with you (in the Cause of Allâh), they are of you. But kindred by blood are nearer to one another (regarding inheritance) in the decree ordained by Allâh. Verily, Allâh is the All-Knower of everything.",
            "english_rwwad": "And those who believed afterwards, migrated and fought along with you – they belong to you. But blood relatives are more entitled to inherit from one another according to the Book of Allah. Indeed, Allah is All-Knowing of everything."
        }
    }
]