[
    {
        "id": 5909,
        "chapter": 85,
        "verse": 1,
        "arabic_text": "وَٱلسَّمَآءِ ذَاتِ ٱلۡبُرُوجِ",
        "phonetic": "85.1 Wa As-Samā'i Dhāti Al-Burūji",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.85:1) (About the) Stars, Abu Qatâdah mentioning Allâh’s Statement:\n\"And We have adorned the nearest heaven with lamps,\" and said, \"The creation of these stars is for three purposes, i.e., as decoration of the heaven, as missiles to hit the devils, and as signs to guide travellers. So, if anybody tries to find a different interpretation, he is mistaken and just wastes his efforts, and troubles himself with what is beyond his limited knowledge.\" (Sahih Al-Bukhari, Vol.4, Chapter 3).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "By the sky containing great stars",
            "english_hilali_khan": "By the heaven holding the big stars.[1]",
            "english_rwwad": "By the sky full of constellations,"
        }
    },
    {
        "id": 5910,
        "chapter": 85,
        "verse": 2,
        "arabic_text": "وَٱلۡيَوۡمِ ٱلۡمَوۡعُودِ",
        "phonetic": "85.2 Wa Al-Yawmi Al-Maw`ūdi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [by] the promised Day ",
            "english_hilali_khan": "And by the Promised Day (i.e. the Day of Resurrection).",
            "english_rwwad": "and by the promised Day,"
        }
    },
    {
        "id": 5911,
        "chapter": 85,
        "verse": 3,
        "arabic_text": "وَشَاهِدٖ وَمَشۡهُودٖ",
        "phonetic": "85.3 Wa Shāhidin Wa Mash/hūdin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [by] the witness and what is witnessed, ",
            "english_hilali_khan": "And by the Witnessing day (i.e. Friday), and by the Witnessed day [i.e. the day of ‘Arafât (Hajj) the ninth of Dhul-Hijjah];",
            "english_rwwad": "and by the witness and the witnessed,"
        }
    },
    {
        "id": 5912,
        "chapter": 85,
        "verse": 4,
        "arabic_text": "قُتِلَ أَصۡحَٰبُ ٱلۡأُخۡدُودِ",
        "phonetic": "85.4 Qutila 'Aşĥābu Al-'Ukhdūdi",
        "footnotes": {
            "english_saheeh": "[1895]- Or \"May they be destroyed\" or \"cursed.\" The \"companions of the trench\" (or ditch) were agents of a tyrannical king who refused to allow his people to believe in Allāh. Their evil deed in obedience to their ruler earned for them the curse of Allāh (subḥānahu wa taʿālā) .",
            "english_hilali_khan": "(V.85:4) The Story of the Boy and the King.\nNarrated Shu‘aib رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said: \"Among the people before you, there was a king and he had a sorcerer. When the sorcerer became old, he said to the king: ‘I have now become an old man, get me a boy so that I may teach him sorcery.’ So the king sent him a boy to teach him sorcery. Whenever the boy proceeded to the sorcerer, he sat with a monk who was on the way and listened to his talks and used to admire them (those talks). So when he went to the sorcerer, he passed by the monk and sat there with him. And on visiting the sorcerer, the latter thrashed him. So the boy complained about that to the monk. The monk said to him: Whenever you are afraid of the sorcerer, say to him: ‘My people kept me busy’; and whenever you are afraid of your people, say to them: ‘The sorcerer kept me busy.’ So the boy carried on like that (for a period).\n\"There came (on the main road) a huge creature (animal), and the people were unable to pass by. The boy said: ‘Today I will know whether the sorcerer is better or the monk’. So he took a stone and said: ‘O Allâh! If the deeds and actions of the monk are liked by You better than those of the sorcerer, then kill this creature so that the people can cross (the road).’ Then he hit (it) with the stone, and it was killed and the people passed (the road). The boy came to the monk and informed him about it. The monk said to him: ‘O my son! Today you are better than I; you have achieved what I see! And you will be put to trial. And in case you are put to trial, do not inform (them) about me.’ The boy used to treat the people suffering from born-blindness, leprosy, leucoderma, and other diseases. A blind courtier of the king heard about the boy. He came and brought a number of gifts for the boy and said: ‘All these gifts are for you on condition that you cure me’. The boy said: ‘I do not cure anybody; it is only Allâh (Alone) Who cures (people). So if you believe in Allâh, and invoke Allâh, He will cure you’. He then believed in Allâh, and Allâh cured him. Later the courtier came to the king, and sat at the place where he used to sit before. The king asked him: ‘Who has given you your sight back?’ The courtier replied: ‘My Lord (Allâh)!’ The king said: ‘Have you got another lord than I?’ The courtier said: ‘My Lord and your Lord is Allâh!’ The king got hold of him and kept on tormenting him till he informed him about the boy. So the boy was brought. The king said to the boy: ‘O boy! Has your (knowledge of) sorcery reached to the extent that you cure born-blinds, lepers, leucodermic patients and do such and such?’ The boy replied: ‘I do not cure anybody; it is only Allâh (Alone) Who does cure’. Then the king got hold of him, and kept on tormenting him till he informed him about the monk. And the monk was brought, and it was said to him: ‘Give up your religion (turn apostate)!’ The monk refused to turn apostate. Then the king ordered (to be bring) a saw, and it was put in the middle of his scalp and was sawn, till he fell. cut in two pieces. Then that courtier was brought, and it was said to him: ‘Give up your religion (turn apostate)!’ The courtier refused to turn apostate. So the saw was put in the middle of his scalp, and was sawn till he fell, cut in two pieces. Then the boy was brought, and it was said to him: ‘Give up your religion (turn apostate)!’ The boy refused to turn apostate. So the king ordered some of his courtiers to take the boy to such and such a mountain saying, ‘Then ascend up the mountain with him till you reach its top, and see if he turns apostate (from his religion, well and good); otherwise throw him down from its top.’ They took him, ascended up the mountain, and the boy said: ‘O Allâh! Save me from them by anything You wish!’ So the mountain shook and all of them fell down, and the boy came walking to the king. The king asked him: ‘What did your companions do?’ The boy said: ‘Allâh has saved me from them.’ The king then ordered some of his courtiers to take the boy on board a boat into the middle of the sea, saying, ‘Then if he turns apostate (from his religion, well and good), otherwise cast him into the sea.’ So they took him, and he said: ‘O Allâh! Save me from them by anything You wish.’ So the boat capsized, and (all the accompanying courtiers) were drowned. The boy then came walking to the king. The king said: ‘What did your companions do?’ The boy replied: ‘Allâh saved me from them’, and he further said to the king: ‘You cannot kill me till you do what I command!’ The king said: ‘What is that (command of yours)?’ The boy said: ‘Gather all the people in an upland place, and fasten me to the stem (of a tree); then take an arrow from my quiver and fix it in the bow, and say: - In the Name of Allâh, the Lord of the boy, - and shoot (me). If you do that, you will kill me.’ So the king gathered the people in an upland place, and fastened the boy to the stem, took an arrow from his quiver, fixed it in the bow, and said: ‘In the Name of Allâh, the Lord of the boy’, and shot the arrow. The arrow hit the temporal region of the skull of the boy, and the boy put his hand over the temporal region of his skull at the point where the arrow hit, and then died. The people proclaimed: ‘We have believed in the Lord of the boy! We have believed in the Lord of the boy! We have believed in the Lord of the boy!’ The king came, and it was said to him: ‘That is the thing which you were afraid of. By Allâh! The thing which you were afraid of, has fallen upon you, the people have believed (in Allâh).’ So he ordered (deep) ditches to be dug at the entrances of the roads, and it was done, then fire was kindled in those ditches, and the king ordered that whoever did not turn apostate (from his religion) be cast into the ditches, and it was done. Then there came a woman with her babe. She nearly retreated back from the ditch but the babe said (spoke): ‘O mother! Be patient, you are on the Truth,’ (So she threw herself in the ditch of the fire along with her child to be with the martyrs in the Paradise).\" (Sahih Muslim, Vol.4, Hadith No.7148).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Destroyed [i.e., cursed] were the companions of the trench[1895] ",
            "english_hilali_khan": "Cursed were the people of the Ditch (in the story of the Boy and the King).[2]",
            "english_rwwad": "cursed be the makers of the trench,"
        }
    },
    {
        "id": 5913,
        "chapter": 85,
        "verse": 5,
        "arabic_text": "ٱلنَّارِ ذَاتِ ٱلۡوَقُودِ",
        "phonetic": "85.5 An-Nāri Dhāti Al-Waqūdi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Containing] the fire full of fuel,",
            "english_hilali_khan": "Of fire fed with fuel,",
            "english_rwwad": "the fire full of fuel,"
        }
    },
    {
        "id": 5914,
        "chapter": 85,
        "verse": 6,
        "arabic_text": "إِذۡ هُمۡ عَلَيۡهَا قُعُودٞ",
        "phonetic": "85.6 'Idh Hum `Alayhā Qu`ūdun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "When they were sitting near it.",
            "english_hilali_khan": "When they sat by it (fire),",
            "english_rwwad": "when they sat around it,"
        }
    },
    {
        "id": 5915,
        "chapter": 85,
        "verse": 7,
        "arabic_text": "وَهُمۡ عَلَىٰ مَا يَفۡعَلُونَ بِٱلۡمُؤۡمِنِينَ شُهُودٞ",
        "phonetic": "85.7 Wa Hum `Alá Mā Yaf`alūna Bil-Mu'uminīna Shuhūdun",
        "footnotes": {
            "english_saheeh": "[1896]- After casting the believers into a trench filled with fire, they sat at its edge, watching them burn to death. This event occurred before the time of Prophet Muḥammad (ﷺ) .",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they, to what they were doing against the believers, were witnesses. [1896] ",
            "english_hilali_khan": "And they witnessed what they were doing against the believers (i.e. burning them).",
            "english_rwwad": "and were witnessing what they did to the believers."
        }
    },
    {
        "id": 5916,
        "chapter": 85,
        "verse": 8,
        "arabic_text": "وَمَا نَقَمُواْ مِنۡهُمۡ إِلَّآ أَن يُؤۡمِنُواْ بِٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ",
        "phonetic": "85.8 Wa Mā Naqamū Minhum 'Illā 'An Yu'uminū Billāhi Al-`Azīzi Al-Ĥamīdi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they resented them not except because they believed in Allāh, the Exalted in Might, the Praiseworthy, ",
            "english_hilali_khan": "And they had no fault except that they believed in Allâh, the All-Mighty, Worthy of all Praise!",
            "english_rwwad": "Their only grievance against them was that they believed in Allah, the All-Mighty, the Praiseworthy,"
        }
    },
    {
        "id": 5917,
        "chapter": 85,
        "verse": 9,
        "arabic_text": "ٱلَّذِي لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ",
        "phonetic": "85.9 Al-Ladhī Lahu Mulku As-Samāwāti Wa Al-'Arđi Wa Allāhu `Alá Kulli Shay'in Shahīdun",
        "footnotes": {
            "english_saheeh": "[1897]- See footnote to 4:79",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "To whom belongs the dominion of the heavens and the earth. And Allāh, over all things, is Witness.[1897] ",
            "english_hilali_khan": "To Whom belongs the dominion of the heavens and the earth! And Allâh is Witness over everything.",
            "english_rwwad": "to Whom belongs the dominion of the heavens and earth, and Allah is Witness over all things."
        }
    },
    {
        "id": 5918,
        "chapter": 85,
        "verse": 10,
        "arabic_text": "إِنَّ ٱلَّذِينَ فَتَنُواْ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ ثُمَّ لَمۡ يَتُوبُواْ فَلَهُمۡ عَذَابُ جَهَنَّمَ وَلَهُمۡ عَذَابُ ٱلۡحَرِيقِ",
        "phonetic": "85.10 'Inna Al-Ladhīna Fatanū Al-Mu'uminīna Wa Al-Mu'umināti Thumma Lam Yatūbū Falahum `Adhābu Jahannama Wa Lahum `Adhābu Al-Ĥarīqi",
        "footnotes": {
            "english_saheeh": "[1898]- Or, in this instance, the literal meaning of \"burned\" is also appropriate.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have tortured[1898] the believing men and believing women and then have not repented will have the punishment of Hell, and they will have the punishment of the Burning Fire. ",
            "english_hilali_khan": "Verily, those who put into trial the believing men and believing women (by torturing them and burning them), and then do not turn in repentance (to Allâh), then they will have the torment of Hell, and they will have the punishment of the burning Fire.",
            "english_rwwad": "Indeed, for those who tortured the believing men and women, then did not repent, there will be the punishment of Hell and the punishment of the burning fire."
        }
    },
    {
        "id": 5919,
        "chapter": 85,
        "verse": 11,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡكَبِيرُ",
        "phonetic": "85.11 'Inna Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Lahum Jannātun Tajrī Min Taĥtihā Al-'Anhāru Dhālika Al-Fawzu Al-Kabīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have believed and done righteous deeds will have gardens beneath which rivers flow. That is the great attainment. ",
            "english_hilali_khan": "Verily, those who believe and do righteous good deeds, for them will be Gardens under which rivers flow (Paradise). That is the great success.",
            "english_rwwad": "But those who believed and did righteous deeds will certainly have gardens under which rivers flow; that is the supreme triumph."
        }
    },
    {
        "id": 5920,
        "chapter": 85,
        "verse": 12,
        "arabic_text": "إِنَّ بَطۡشَ رَبِّكَ لَشَدِيدٌ",
        "phonetic": "85.12 'Inna Baţsha Rabbika Lashadīdun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the assault [i.e., vengeance] of your Lord is severe. ",
            "english_hilali_khan": "Verily, (O Muhammad صلى الله عليه وسلم) the Seizure (punishment) of your Lord is severe and painful. [See V.11:102].",
            "english_rwwad": "Indeed, the punishment of your Lord is severe."
        }
    },
    {
        "id": 5921,
        "chapter": 85,
        "verse": 13,
        "arabic_text": "إِنَّهُۥ هُوَ يُبۡدِئُ وَيُعِيدُ",
        "phonetic": "85.13 'Innahu Huwa Yubdi'u Wa Yu`īdu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, it is He who originates [creation] and repeats. ",
            "english_hilali_khan": "Verily, He it is Who begins (punishment) and repeats (punishment in the Hereafter) (or originates the creation of everything, and then repeats it on the Day of Resurrection).",
            "english_rwwad": "Indeed, it is He Who originates [the creation] then repeats it,"
        }
    },
    {
        "id": 5922,
        "chapter": 85,
        "verse": 14,
        "arabic_text": "وَهُوَ ٱلۡغَفُورُ ٱلۡوَدُودُ",
        "phonetic": "85.14 Wa Huwa Al-Ghafūru Al-Wadūdu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He is the Forgiving, the Affectionate, ",
            "english_hilali_khan": "And He is Oft-Forgiving, full of love (towards the pious who are real true believers of Islâmic Monotheism),",
            "english_rwwad": "and He is the All-Forgiving, the Most Affectionate,"
        }
    },
    {
        "id": 5923,
        "chapter": 85,
        "verse": 15,
        "arabic_text": "ذُو ٱلۡعَرۡشِ ٱلۡمَجِيدُ",
        "phonetic": "85.15 Dhū Al-`Arshi Al-Majīdu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Honorable Owner of the Throne, ",
            "english_hilali_khan": "Owner of the throne, the Glorious,",
            "english_rwwad": "the Lord of the Glorious Throne;"
        }
    },
    {
        "id": 5924,
        "chapter": 85,
        "verse": 16,
        "arabic_text": "فَعَّالٞ لِّمَا يُرِيدُ",
        "phonetic": "85.16 Fa``ālun Limā Yurīdu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Effecter of what He intends. ",
            "english_hilali_khan": "(He is the) Doer of whatsoever He intends (or wills).",
            "english_rwwad": "He does whatever He wills."
        }
    },
    {
        "id": 5925,
        "chapter": 85,
        "verse": 17,
        "arabic_text": "هَلۡ أَتَىٰكَ حَدِيثُ ٱلۡجُنُودِ",
        "phonetic": "85.17 Hal 'Atāka Ĥadīthu Al-Junūdi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Has there reached you the story of the soldiers -",
            "english_hilali_khan": "Has the story reached you of the hosts,",
            "english_rwwad": "Has there not come to you the story of the forces"
        }
    },
    {
        "id": 5926,
        "chapter": 85,
        "verse": 18,
        "arabic_text": "فِرۡعَوۡنَ وَثَمُودَ",
        "phonetic": "85.18 Fir`awna Wa Thamūda",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Those of] Pharaoh and Thamūd? ",
            "english_hilali_khan": "Of Fir‘aun (Pharaoh) and Thamûd?",
            "english_rwwad": "of Pharaoh and Thamūd?"
        }
    },
    {
        "id": 5927,
        "chapter": 85,
        "verse": 19,
        "arabic_text": "بَلِ ٱلَّذِينَ كَفَرُواْ فِي تَكۡذِيبٖ",
        "phonetic": "85.19 Bali Al-Ladhīna Kafarū Fī Takdhībin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they who disbelieve are in [persistent] denial, ",
            "english_hilali_khan": "Nay! The disbelievers (persisted) in denying (Prophet Muhammad صلى الله عليه وسلم and his Message of Islâmic Monotheism).",
            "english_rwwad": "But the disbelievers are in persistent denial,"
        }
    },
    {
        "id": 5928,
        "chapter": 85,
        "verse": 20,
        "arabic_text": "وَٱللَّهُ مِن وَرَآئِهِم مُّحِيطُۢ",
        "phonetic": "85.20 Wa Allāhu Min Warā'ihim Muĥīţun",
        "footnotes": {
            "english_saheeh": "[1899]- See footnote to 2:19",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "While Allāh encompasses them from behind.[1899] ",
            "english_hilali_khan": "And Allâh encompasses them from behind! (i.e. all their deeds are within His Knowledge, and He will requite them for their deeds).",
            "english_rwwad": "although Allah encompasses them from all sides."
        }
    },
    {
        "id": 5929,
        "chapter": 85,
        "verse": 21,
        "arabic_text": "بَلۡ هُوَ قُرۡءَانٞ مَّجِيدٞ",
        "phonetic": "85.21 Bal Huwa Qur'ānun Majīdun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But this is an honored Qur’ān ",
            "english_hilali_khan": "Nay! This is a Glorious Qur’ân,",
            "english_rwwad": "But this is a glorious Qur’an,"
        }
    },
    {
        "id": 5930,
        "chapter": 85,
        "verse": 22,
        "arabic_text": "فِي لَوۡحٖ مَّحۡفُوظِۭ",
        "phonetic": "85.22 Fī Lawĥin Maĥfūžin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Inscribed] in a Preserved Slate. ",
            "english_hilali_khan": "(Inscribed) in Al-Lauh Al-Mahfûz (The Preserved Tablet)!",
            "english_rwwad": "[inscribed] in a Preserved Tablet."
        }
    }
]