[
    {
        "id": 1235,
        "chapter": 9,
        "verse": 1,
        "arabic_text": "بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "9.1 Barā'atun Mina Allāhi Wa Rasūlihi 'Ilá Al-Ladhīna `Āhadttum Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "[461]- But who had violated it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[This is a declaration of] disassociation, from Allāh and His Messenger, to those with whom you had made a treaty among the polytheists.[461]",
            "english_hilali_khan": "Freedom from (all) obligations (is declared) from Allâh and His Messenger (صلى الله عليه وسلم) to those of the Mushrikûn (polytheists, pagans, idolaters, disbelievers in the Oneness of Allâh), with whom you made a treaty.",
            "english_rwwad": "A declaration of disassociation by Allah and His Messenger to those polytheists with whom you have made a treaty."
        }
    },
    {
        "id": 1236,
        "chapter": 9,
        "verse": 2,
        "arabic_text": "فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ",
        "phonetic": "9.2 Fasīĥū Fī Al-'Arđi 'Arba`ata 'Ash/hurin Wa A`lamū 'Annakum Ghayru Mu`jizī Allāhi Wa 'Anna Allāha Mukhzī Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So travel freely, [O disbelievers], throughout the land [during] four months but know that you cannot cause failure to Allāh and that Allāh will disgrace the disbelievers.",
            "english_hilali_khan": "for four months (as you will) throughout the land, but know that you cannot escape (from the punishment of) Allâh; and Allâh will disgrace the disbelievers.",
            "english_rwwad": "“Therefore move freely in the land for four months, but know that you cannot escape Allah, and that Allah will humiliate the disbelievers.”"
        }
    },
    {
        "id": 1237,
        "chapter": 9,
        "verse": 3,
        "arabic_text": "وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ",
        "phonetic": "9.3 Wa 'Adhānun Mina Allāhi Wa Rasūlihi 'Ilá An-Nāsi Yawma Al-Ĥajji Al-'Akbari 'Anna Allāha Barī'un Mina Al-Mushrikīna Wa Rasūluhu Fa'in Tubtum Fahuwa Khayrun Lakum Wa 'In Tawallaytum Fā`lamū 'Annakum Ghayru Mu`jizī Allāhi Wa Bashiri Al-Ladhīna Kafarū Bi`adhābin 'Alīmin",
        "footnotes": {
            "english_saheeh": "[462]- Ḥajj.  ʿUmrah is the lesser pilgrimage.\n[463]- i.e., you cannot escape His punishment.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [it is] an announcement from Allāh and His Messenger to the people on the day of the greater pilgrimage[462] that Allāh is disassociated from the disbelievers, and [so is] His Messenger. So if you repent, that is best for you; but if you turn away - then know that you will not cause failure to Allāh.[463] And give tidings to those who disbelieve of a painful punishment.",
            "english_hilali_khan": "and so is His Messenger. So if you (Mushrikûn ) repent, it is better for you, but if you turn away, then know that you cannot escape (from the Punishment of) Allâh. And give tidings (O Muhammad صلى الله عليه وسلم) of a painful torment to those who disbelieve.",
            "english_rwwad": "A declaration from Allah and His Messenger to the people on the day of the greater pilgrimage, that Allah and His Messenger are free from obligation to the polytheists. If you repent, it is better for you, but if you turn away, then know that you cannot escape Allah. And give the disbelievers tidings of a painful punishment."
        }
    },
    {
        "id": 1238,
        "chapter": 9,
        "verse": 4,
        "arabic_text": "إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡـٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ",
        "phonetic": "9.4 'Illā Al-Ladhīna `Āhadttum Mina Al-Mushrikīna Thumma Lam Yanquşūkum Shay'āan Wa Lam Yužāhirū `Alaykum 'Aĥadāan Fa'atimmū 'Ilayhim `Ahdahum 'Ilá Muddatihim 'Inna Allāha Yuĥibbu Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Excepted are those with whom you made a treaty among the polytheists and then they have not been deficient toward you in anything or supported anyone against you; so complete for them their treaty until their term [has ended]. Indeed, Allāh loves the righteous [who fear Him].",
            "english_hilali_khan": "with whom you have a treaty, and who have not subsequently failed you in aught, nor have supported anyone against you. So fulfil their treaty to them for the end of their term. Surely Allâh loves Al-Mattaqûn (the pious - See V.2:2).",
            "english_rwwad": "Except those polytheists with whom you have a treaty and who have not broken it in the least, nor have backed up anyone against you – so fulfill your treaty with them until the end of their term. Indeed, Allah loves those who fear Him."
        }
    },
    {
        "id": 1239,
        "chapter": 9,
        "verse": 5,
        "arabic_text": "فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ",
        "phonetic": "9.5 Fa'idhā Ansalakha Al-'Ash/huru Al-Ĥurumu Fāqtulū Al-Mushrikīna Ĥaythu Wajadtumūhum Wa Khudhūhum Wa Aĥşurūhum Wāq`udū Lahum Kulla Marşadin Fa'in Tābū Wa 'Aqāmū Aş-Şalāata Wa 'Ātaw Az-Zakāata Fakhallū Sabīlahum 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[464]- The four months mentioned in verse 2, in which the disbelievers were allowed free movement within the land.  Other scholars have interpreted them as \"the sacred months,\" i.e., Muḥarram, Rajab, Dhul-Qaʿdah and Dhul-Ḥijjah.",
            "english_hilali_khan": "a) (V.9:5) See the footnote of (V.2:193).\nb) Narrated Abû Hurairah رضي الله عنه : When the Prophet صلى الله عليه وسلم died and Abû Bakr became his successor and some of the Arabs reverted to disbelief, ‘Umar said, \"O Abû Bakr! How can you fight these people although Allâh’s Messenger صلى الله عليه وسلم said, \" I have been ordered to fight the people till they say: La ilâha illallâh (none has the right to be worshipped but Allâh), and whoever said La ilâha illallâh will save his property and his life from me, unless (he does something for which he receives legal punishment) justly, and his account will be on Allâh?\" Abû Bakr said, \"By Allâh! I will fight who ever differentiates between Salât (prayers) and Zakât, as Zakât is the right to be taken from property (according to Allâh’s orders). By Allâh! If they refused to pay me even a kid they used to pay to Allâh’s Messenger صلى الله عليه وسلم, I would fight with them for withholding it,\" ‘Umar said \"By Allâh! It was nothing, but I noticed that Allâh opened Abû Bakr’s chest towards the decision to fight, therefore I realized that his decision was right.\" (Sahih Al-Bukhâri, Vol.9, Hadîth No 59).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when the inviolable months[464] have passed, then kill the polytheists wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush. But if they should repent, establish prayer, and give zakāh, let them [go] on their way. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "wherever you find them, and capture them and besiege them, and lie in wait for them in each and every ambush. But if they repent and perform As-Salât (Iqâmat-as-Salât), and give Zakât, then leave their way free. Verily, Allâh is Oft-Forgiving, Most Merciful.[1]",
            "english_rwwad": "Then when the [four] sacred months are over, kill the polytheists wherever you find them, seize them, besiege them and lie in wait for them on every route. But if they repent, establish prayers and give zakah, then set them free, for Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1240,
        "chapter": 9,
        "verse": 6,
        "arabic_text": "وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ",
        "phonetic": "9.6 Wa 'In 'Aĥadun Mina Al-Mushrikīna Astajāraka Fa'ajirhu Ĥattá Yasma`a Kalāma Allāhi Thumma 'Abligh/hu Ma'manahu Dhālika Bi'annahum Qawmun Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allāh [i.e., the Qur’ān]. Then deliver him to his place of safety. That is because they are a people who do not know.",
            "english_hilali_khan": "And if anyone of the Mushrikûn (polytheists, idolaters, pagans, disbelievers in the Oneness of Allâh) seeks your protection, then grant him protection so that he may hear the Word of Allâh (the Qur’ân), and then escort him to where he can be secure, that is because they are men who know not.",
            "english_rwwad": "If any of the polytheists asks you for protection, give it to him, so that he may hear the Word of Allah, then escort him to his place of safety; that is because they are a people who do not know."
        }
    },
    {
        "id": 1241,
        "chapter": 9,
        "verse": 7,
        "arabic_text": "كَيۡفَ يَكُونُ لِلۡمُشۡرِكِينَ عَهۡدٌ عِندَ ٱللَّهِ وَعِندَ رَسُولِهِۦٓ إِلَّا ٱلَّذِينَ عَٰهَدتُّمۡ عِندَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ فَمَا ٱسۡتَقَٰمُواْ لَكُمۡ فَٱسۡتَقِيمُواْ لَهُمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ",
        "phonetic": "9.7 Kayfa Yakūnu Lilmushrikīna `Ahdun `Inda Allāhi Wa `Inda Rasūlihi 'Illā Al-Ladhīna `Āhadtum `Inda Al-Masjidi Al-Ĥarāmi Famā Astaqāmū Lakum Fāstaqīmū Lahum 'Inna Allāha Yuĥibbu Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "[465]- i.e., maintain the terms of the treaty.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "How can there be for the polytheists a treaty in the sight of Allāh and with His Messenger, except for those with whom you made a treaty at al-Masjid al-Ḥarām? So as long as they are upright toward you,[465] be upright toward them. Indeed, Allāh loves the righteous [who fear Him].",
            "english_hilali_khan": "How can there be a covenant with Allâh and with His Messenger for the Mushrikûn (polytheists, idolaters, pagans, disbelievers in the Oneness of Allâh) except those with whom you made a covenant near Al-Masjid-al-Harâm (at Makkah)? So long as they are true to you, stand you true to them. Verily, Allâh loves Al-Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "How can the polytheists have a treaty with Allah and with His Messenger, except those whom you made a treaty with at the Sacred Mosque? Should they fulfill their pledge to you, fulfill your pledge to them, for Allah loves those who fear Him."
        }
    },
    {
        "id": 1242,
        "chapter": 9,
        "verse": 8,
        "arabic_text": "كَيۡفَ وَإِن يَظۡهَرُواْ عَلَيۡكُمۡ لَا يَرۡقُبُواْ فِيكُمۡ إِلّٗا وَلَا ذِمَّةٗۚ يُرۡضُونَكُم بِأَفۡوَٰهِهِمۡ وَتَأۡبَىٰ قُلُوبُهُمۡ وَأَكۡثَرُهُمۡ فَٰسِقُونَ",
        "phonetic": "9.8 Kayfa Wa 'In Yažharū `Alaykum Lā Yarqubū Fīkum 'Illāan Wa Lā Dhimmatan Yurđūnakum Bi'afwāhihim Wa Ta'bá Qulūbuhum Wa 'Aktharuhum Fāsiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "How [can there be a treaty] while, if they gain dominance over you, they do not observe concerning you any pact of kinship or covenant of protection? They satisfy you with their mouths, but their hearts refuse [compliance], and most of them are defiantly disobedient.",
            "english_hilali_khan": "How (can there be such a covenant with them) that when you are overpowered by them, they regard not the ties, either of kinship or of covenant with you? With (good words from) their mouths they please you, but their hearts are averse to you, and most of them are Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "How [can there be a treaty] – if they were to overcome you, they would neither respect ties of kinship nor treaty? They please you with their tongues, while their hearts are averse to it, and most of them are wicked."
        }
    },
    {
        "id": 1243,
        "chapter": 9,
        "verse": 9,
        "arabic_text": "ٱشۡتَرَوۡاْ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلٗا فَصَدُّواْ عَن سَبِيلِهِۦٓۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "9.9 Ashtaraw Bi'āyāti Allāhi Thamanāan Qalīlāan Faşaddū `An Sabīlihi 'Innahum Sā'a Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They have exchanged the signs of Allāh for a small price and averted [people] from His way. Indeed, it was evil that they were doing.",
            "english_hilali_khan": "They have purchased with the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh a little gain, and they hindered men from His Way; evil indeed is that which they used to do.",
            "english_rwwad": "They have sold the verses of Allah for a small price and prevented [people] from His way. Terrible is indeed what they have done!"
        }
    },
    {
        "id": 1244,
        "chapter": 9,
        "verse": 10,
        "arabic_text": "لَا يَرۡقُبُونَ فِي مُؤۡمِنٍ إِلّٗا وَلَا ذِمَّةٗۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُعۡتَدُونَ",
        "phonetic": "9.10 Lā Yarqubūna Fī Mu'uminin 'Illāan Wa Lā Dhimmatan Wa 'Ūlā'ika Humu Al-Mu`tadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They do not observe toward a believer any pact of kinship or covenant of protection. And it is they who are the transgressors.",
            "english_hilali_khan": "With regard to a believer, they respect not the ties, either of kinship or of covenant! It is they who are the transgressors.",
            "english_rwwad": "They do not honor the ties of kinship or treaties with regard to the believers. It is they who are the transgressors."
        }
    },
    {
        "id": 1245,
        "chapter": 9,
        "verse": 11,
        "arabic_text": "فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِۗ وَنُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ",
        "phonetic": "9.11 Fa'in Tābū Wa 'Aqāmū Aş-Şalāata Wa 'Ātaw Az-Zakāata Fa'ikhwānukum Fī Ad-Dīni Wa Nufaşşilu Al-'Āyāti Liqawmin Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:11) See the footnote of (V.9:5).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they repent, establish prayer, and give zakāh, then they are your brothers in religion; and We detail the verses for a people who know.",
            "english_hilali_khan": "But if they repent, perform As-Salât, (Iqâmat-as-Salât) and give Zakât,[1] then they are your brethren in religion. (In this way) We explain the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail for a people who know.",
            "english_rwwad": "Yet if they repent, establish prayer and give zakah, then they are your brothers in faith. We explain the verses in detail for people who know."
        }
    },
    {
        "id": 1246,
        "chapter": 9,
        "verse": 12,
        "arabic_text": "وَإِن نَّكَثُوٓاْ أَيۡمَٰنَهُم مِّنۢ بَعۡدِ عَهۡدِهِمۡ وَطَعَنُواْ فِي دِينِكُمۡ فَقَٰتِلُوٓاْ أَئِمَّةَ ٱلۡكُفۡرِ إِنَّهُمۡ لَآ أَيۡمَٰنَ لَهُمۡ لَعَلَّهُمۡ يَنتَهُونَ",
        "phonetic": "9.12 Wa 'In Nakathū 'Aymānahum Min Ba`di `Ahdihim Wa Ţa`anū Fī Dīnikum Faqātilū 'A'immata Al-Kufri 'Innahum Lā 'Aymāna Lahum La`allahum Yantahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if they break their oaths after their treaty and defame your religion, then combat the leaders of disbelief, for indeed, there are no oaths [sacred] to them; [fight them that] they might cease.",
            "english_hilali_khan": "But if they violate their oaths after their covenant, and attack your religion with disapproval and criticism, then fight (you) the leaders of disbelief (chiefs of Quraish pagans of Makkah) - for surely their oaths are nothing to them - so that they may stop (evil actions).",
            "english_rwwad": "But if they break their oaths after making a pledge and revile your religion, then fight the leaders of disbelief – whose oaths mean nothing to them – so that they may desist."
        }
    },
    {
        "id": 1247,
        "chapter": 9,
        "verse": 13,
        "arabic_text": "أَلَا تُقَٰتِلُونَ قَوۡمٗا نَّكَثُوٓاْ أَيۡمَٰنَهُمۡ وَهَمُّواْ بِإِخۡرَاجِ ٱلرَّسُولِ وَهُم بَدَءُوكُمۡ أَوَّلَ مَرَّةٍۚ أَتَخۡشَوۡنَهُمۡۚ فَٱللَّهُ أَحَقُّ أَن تَخۡشَوۡهُ إِن كُنتُم مُّؤۡمِنِينَ",
        "phonetic": "9.13 'Alā Tuqātilūna Qawmāan Nakathū 'Aymānahum Wa Hammū Bi'ikhrāji Ar-Rasūli Wa Hum Bada'ūkum 'Awwala Marratin 'Atakhshawnahum Fa-Allāhu 'Aĥaqqu 'An Takhshawhu 'In Kuntum Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Would you not fight against a people who broke their oaths and determined to expel the Messenger, and they had begun [the attack upon] you the first time? Do you fear them? But Allāh has more right that you should fear Him, if you are [truly] believers.",
            "english_hilali_khan": "Will you not fight a people who have violated their oaths (pagans of Makkah), and intended to expel the Messenger while they did attack you first? Do you fear them? Allâh has more right that you should fear Him if you are believers.",
            "english_rwwad": "Will you not fight people who broke their oaths, conspired to expel the Messenger, and initiated the war against you first? Do you fear them? Rather it is Allah Whom you should fear, if you are [truly] believers."
        }
    },
    {
        "id": 1248,
        "chapter": 9,
        "verse": 14,
        "arabic_text": "قَٰتِلُوهُمۡ يُعَذِّبۡهُمُ ٱللَّهُ بِأَيۡدِيكُمۡ وَيُخۡزِهِمۡ وَيَنصُرۡكُمۡ عَلَيۡهِمۡ وَيَشۡفِ صُدُورَ قَوۡمٖ مُّؤۡمِنِينَ",
        "phonetic": "9.14 Qātilūhum Yu`adhibhumu Allāhu Bi'aydīkum Wa Yukhzihim Wa Yanşurkum `Alayhim Wa Yashfi Şudūra Qawmin Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Fight them; Allāh will punish them by your hands and will disgrace them and give you victory over them and satisfy the breasts [i.e., desires] of a believing people",
            "english_hilali_khan": "Fight against them so that Allâh will punish them by your hands and disgrace them and give you victory over them and heal the breasts of a believing people,",
            "english_rwwad": "Fight them, Allah will punish them at your hands, disgrace them, give you victory over them, and will soothe the hearts of people who believe,"
        }
    },
    {
        "id": 1249,
        "chapter": 9,
        "verse": 15,
        "arabic_text": "وَيُذۡهِبۡ غَيۡظَ قُلُوبِهِمۡۗ وَيَتُوبُ ٱللَّهُ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
        "phonetic": "9.15 Wa Yudh/hib Ghayža Qulūbihim Wa Yatūbu Allāhu `Alá Man Yashā'u Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And remove the fury in their [i.e., the believers'] hearts. And Allāh turns in forgiveness to whom He wills; and Allāh is Knowing and Wise.",
            "english_hilali_khan": "And remove the anger of their (believers’) hearts. Allâh accepts the repentance of whom He wills. Allâh is All-Knowing, All-Wise.",
            "english_rwwad": "and He will remove rage from their hearts. Allah turns in forgiveness to whom He wills. Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1250,
        "chapter": 9,
        "verse": 16,
        "arabic_text": "أَمۡ حَسِبۡتُمۡ أَن تُتۡرَكُواْ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَلَمۡ يَتَّخِذُواْ مِن دُونِ ٱللَّهِ وَلَا رَسُولِهِۦ وَلَا ٱلۡمُؤۡمِنِينَ وَلِيجَةٗۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ",
        "phonetic": "9.16 'Am Ĥasibtum 'An Tutrakū Wa Lammā Ya`lami Allāhu Al-Ladhīna Jāhadū Minkum Wa Lam Yattakhidhū Min Dūni Allāhi Wa Lā Rasūlihi Wa Lā Al-Mu'uminīna Walījatan Wa Allāhu Khabīrun Bimā Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do you think that you will be left [as you are] while Allāh has not yet made evident those among you who strive [for His cause] and do not take other than Allāh, His Messenger and the believers as intimates? And Allāh is [fully] Aware of what you do.",
            "english_hilali_khan": "Do you think that you shall be left alone while Allâh has not yet tested those among you who have striven hard and fought and have not taken Walîjah [(Bitânah - helpers, advisors and consultants from disbelievers, pagans.) giving openly to them their secrets] besides Allâh, and His Messenger, and the believers. Allâh is Well-Acquainted with what you do.",
            "english_rwwad": "Do you think that you will be left untested, when Allah has not yet proven who among you strove [in His cause] and did not take any trusted allies other than Allah, His Messenger and the believers? Allah is All-Aware of what you do."
        }
    },
    {
        "id": 1251,
        "chapter": 9,
        "verse": 17,
        "arabic_text": "مَا كَانَ لِلۡمُشۡرِكِينَ أَن يَعۡمُرُواْ مَسَٰجِدَ ٱللَّهِ شَٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِٱلۡكُفۡرِۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ وَفِي ٱلنَّارِ هُمۡ خَٰلِدُونَ",
        "phonetic": "9.17 Mā Kāna Lilmushrikīna 'An Ya`murū Masājida Allāhi Shāhidīna `Alá 'Anfusihim Bil-Kufri 'Ūlā'ika Ĥabiţat 'A`māluhum Wa Fī An-Nāri Hum Khālidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is not for the polytheists to maintain the mosques of Allāh [while] witnessing against themselves with disbelief. [For] those, their deeds have become worthless, and in the Fire they will abide eternally.",
            "english_hilali_khan": "It is not for the Mushrikûn (polytheists, idolaters, pagans, disbelievers in the Oneness of Allâh), to maintain the Mosques of Allâh (i.e. to pray and worship Allâh therein, to look after their cleanliness and their building,), while they witness against their ownselves of disbelief. The works of such are in vain and in Fire shall they abide.",
            "english_rwwad": "It is not for the polytheists to maintain Allah’s mosques while openly displaying their disbelief. Their deeds have become worthless, and they will abide in the Fire forever."
        }
    },
    {
        "id": 1252,
        "chapter": 9,
        "verse": 18,
        "arabic_text": "إِنَّمَا يَعۡمُرُ مَسَٰجِدَ ٱللَّهِ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَلَمۡ يَخۡشَ إِلَّا ٱللَّهَۖ فَعَسَىٰٓ أُوْلَٰٓئِكَ أَن يَكُونُواْ مِنَ ٱلۡمُهۡتَدِينَ",
        "phonetic": "9.18 'Innamā Ya`muru Masājida Allāhi Man 'Āmana Billāhi Wa Al-Yawmi Al-'Ākhiri Wa 'Aqāma Aş-Şalāata Wa 'Ātá Az-Zakāata Wa Lam Yakhsha 'Illā Allāha Fa`asá 'Ūlā'ika 'An Yakūnū Mina Al-Muhtadīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The mosques of Allāh are only to be maintained by those who believe in Allāh and the Last Day and establish prayer and give zakāh and do not fear except Allāh, for it is expected that those will be of the [rightly] guided.",
            "english_hilali_khan": "The Mosques of Allâh shall be maintained only by those who believe in Allâh and the Last Day, perform As-Salât (Iqâmat-as-Salât), and give Zakât and fear none but Allâh. It is they who are on true guidance.",
            "english_rwwad": "The mosques of Allah are only to be maintained by those who believe in Allah and the Last Day, establish prayer, give zakah and fear none but Allah. It is they who are expected to be rightly guided."
        }
    },
    {
        "id": 1253,
        "chapter": 9,
        "verse": 19,
        "arabic_text": "۞ أَجَعَلۡتُمۡ سِقَايَةَ ٱلۡحَآجِّ وَعِمَارَةَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ كَمَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَجَٰهَدَ فِي سَبِيلِ ٱللَّهِۚ لَا يَسۡتَوُۥنَ عِندَ ٱللَّهِۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ",
        "phonetic": "9.19 'Aja`altum Siqāyata Al-Ĥājji Wa `Imārata Al-Masjidi Al-Ĥarāmi Kaman 'Āmana Billāhi Wa Al-Yawmi Al-'Ākhiri Wa Jāhada Fī Sabīli Allāhi Lā Yastawūna `Inda Allāhi Wa Allāhu Lā Yahdī Al-Qawma Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you made the providing of water for the pilgrim and the maintenance of al-Masjid al-Ḥarām equal to [the deeds of] one who believes in Allāh and the Last Day and strives in the cause of Allāh? They are not equal in the sight of Allāh. And Allāh does not guide the wrongdoing people.",
            "english_hilali_khan": "Do you consider the providing of drinking water to the pilgrims and the maintenance of Al-Masjidal-Harâm (at Makkah) as equal to the worth of those who believe in Allâh and the Last Day, and strive hard and fight in the Cause of Allâh? They are not equal before Allâh. And Allâh guides not those people who are the Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "Do you consider giving water to the pilgrims and maintaining the Sacred Mosque as equal to believing in Allah and the Last Day and striving in Allah’s cause? They are not equal before Allah, and Allah does not guide the wrongdoing people."
        }
    },
    {
        "id": 1254,
        "chapter": 9,
        "verse": 20,
        "arabic_text": "ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ أَعۡظَمُ دَرَجَةً عِندَ ٱللَّهِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ",
        "phonetic": "9.20 Al-Ladhīna 'Āmanū Wa Hājarū Wa Jāhadū Fī Sabīli Allāhi Bi'amwālihim Wa 'Anfusihim 'A`žamu Darajatan `Inda Allāhi Wa 'Ūlā'ika Humu Al-Fā'izūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:20).\na. Narrated Abu Hurairah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"Whoever believes in Allâh and His Messenger صلى الله عليه وسلم performs Salât (Iqamât-as-Salât) and observes Saum (fasts) during the month of Ramadan, then it will be a promise binding upon Allâh to admit him to Paradise, no matter whether he fights in Allâh’s Cause or remains in the land where he is born.\" The people said, \"O Allâh’s Messenger! Shall we acquaint the people with this good news?\" He said, \"Paradise has one hundred grades which Allâh has reserved for the Mujahidûn who fight in His Cause, and the distance between each of two grades is like the distance between the heaven and the earth. So, when you ask Allâh (for something), ask for Al-Firdaus which is the middle and highest part of Paradise.\" [the subnarrator added, \"I think the Prophet صلى الله عليه وسلم also said, ‘Above it (i.e. Al-Firdaus ) is the Throne of the Most Gracious (i.e. Allâh), and from it gushes forth the rivers of Paradise].\" (Sahih Al Bukhârî, Vol.4, Hadith No.48).\nb. The wish for martyrdom.\nNarrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"By Him in Whose Hand my soul is! Were it not for some men amongst the believers who dislike to be left behind me, and whom I cannot provide with means of conveyance, I would certainly never remain behind any Sariya (army unit) going out for Jihâd in Allâh’s Cause. By Him in Whose Hand my soul is! I would love to be martyred in Allâh’s Cause and then come back to life, and then get martyred and then come back to life again, and then get martyred and then come back to life again, and then get martyred.\" (Sahih Al-Bukhâri, Vol.4, Hadith No.54).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ones who have believed, emigrated and striven in the cause of Allāh with their wealth and their lives are greater in rank in the sight of Allāh. And it is those who are the attainers [of success].",
            "english_hilali_khan": "Those who believed (in the Oneness of Allâh - Islâmic Monotheism) and emigrated and strove hard and fought in Allâh’s Cause with their wealth and their lives are far higher in degree with Allâh. They are the successful.[1]",
            "english_rwwad": "Those who believed, emigrated, and strove in Allah’s cause with their wealth and their lives are of a higher rank before Allah; it is they who will triumph."
        }
    },
    {
        "id": 1255,
        "chapter": 9,
        "verse": 21,
        "arabic_text": "يُبَشِّرُهُمۡ رَبُّهُم بِرَحۡمَةٖ مِّنۡهُ وَرِضۡوَٰنٖ وَجَنَّٰتٖ لَّهُمۡ فِيهَا نَعِيمٞ مُّقِيمٌ",
        "phonetic": "9.21 Yubashiruhum Rabbuhum Biraĥmatin Minhu Wa Riđwānin Wa Jannātin Lahum Fīhā Na`īmun Muqīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Their Lord gives them good tidings of mercy from Him and approval and of gardens for them wherein is enduring pleasure.",
            "english_hilali_khan": "Their Lord gives them glad tidings of Mercy from Him, and His being pleased (with them), and of Gardens (Paradise) for them wherein are everlasting delights.",
            "english_rwwad": "Their Lord gives them glad tidings of mercy from Him and His pleasure, and of gardens in which they will have an everlasting bliss,"
        }
    },
    {
        "id": 1256,
        "chapter": 9,
        "verse": 22,
        "arabic_text": "خَٰلِدِينَ فِيهَآ أَبَدًاۚ إِنَّ ٱللَّهَ عِندَهُۥٓ أَجۡرٌ عَظِيمٞ",
        "phonetic": "9.22 Khālidīna Fīhā 'Abadāan 'Inna Allāha `Indahu 'Ajrun `Ažīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[They will be] abiding therein forever. Indeed, Allāh has with Him a great reward.",
            "english_hilali_khan": "They will dwell therein forever. Verily, with Allâh is a great reward.",
            "english_rwwad": "abiding therein forever. Indeed, with Allah is a great reward."
        }
    },
    {
        "id": 1257,
        "chapter": 9,
        "verse": 23,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُوٓاْ ءَابَآءَكُمۡ وَإِخۡوَٰنَكُمۡ أَوۡلِيَآءَ إِنِ ٱسۡتَحَبُّواْ ٱلۡكُفۡرَ عَلَى ٱلۡإِيمَٰنِۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
        "phonetic": "9.23 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Tattakhidhū 'Ābā'akum Wa 'Ikhwānakum 'Awliyā'a 'Ini Astaĥabbū Al-Kufra `Alá Al-'Īmāni Wa Man Yatawallahum Minkum Fa'ūlā'ika Humu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, do not take your fathers or your brothers as allies if they have preferred disbelief over belief. And whoever does so among you - then it is those who are the wrongdoers.",
            "english_hilali_khan": "O you who believe! Take not as Auliyâ’ (supporters and helpers) your fathers and your brothers if they prefer disbelief to Belief. And whoever of you does so, then he is one of the Zâlimûn (wrong-doers).",
            "english_rwwad": "O you who believe, do not take your parents and brothers as allies if they choose disbelief over belief; whoever among you takes them as allies, it is they who are the wrongdoers."
        }
    },
    {
        "id": 1258,
        "chapter": 9,
        "verse": 24,
        "arabic_text": "قُلۡ إِن كَانَ ءَابَآؤُكُمۡ وَأَبۡنَآؤُكُمۡ وَإِخۡوَٰنُكُمۡ وَأَزۡوَٰجُكُمۡ وَعَشِيرَتُكُمۡ وَأَمۡوَٰلٌ ٱقۡتَرَفۡتُمُوهَا وَتِجَٰرَةٞ تَخۡشَوۡنَ كَسَادَهَا وَمَسَٰكِنُ تَرۡضَوۡنَهَآ أَحَبَّ إِلَيۡكُم مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَجِهَادٖ فِي سَبِيلِهِۦ فَتَرَبَّصُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ",
        "phonetic": "9.24 Qul 'In Kāna 'Ābā'uukum Wa 'Abnā'uukum Wa 'Ikhwānukum Wa 'Azwājukum Wa `Ashīratukum Wa 'Amwālun Aqtaraftumūhā Wa Tijāratun Takhshawna Kasādahā Wa Masākinu Tarđawnahā 'Aĥabba 'Ilaykum Mina Allāhi Wa Rasūlihi Wa Jihādin Fī Sabīlihi Fatarabbaşū Ĥattá Ya'tiya Allāhu Bi'amrihi Wa Allāhu Lā Yahdī Al-Qawma Al-Fāsiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:24): See the footnote of (V.2:190).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"If your fathers, your sons, your brothers, your wives, your relatives, wealth which you have obtained, commerce wherein you fear decline, and dwellings with which you are pleased are more beloved to you than Allāh and His Messenger and jihād [i.e., striving] in His cause, then wait until Allāh executes His command. And Allāh does not guide the defiantly disobedient people.\"",
            "english_hilali_khan": "Say: If your fathers, your sons, your brothers, your wives, your kindred, the wealth that you have gained, the commerce in which you fear a decline, and the dwellings in which you delight are dearer to you than Allâh and His Messenger, and striving hard and fighting in His Cause,[1] then wait until Allâh brings about His Decision (torment). And Allâh guides not the people who are Al-Fâsiqûn (the rebellious, disobedient to Allâh).",
            "english_rwwad": "Say, “If your parents, your children, your brothers, your spouses, your clan, the wealth you have acquired, the trade you fear to decline, and the homes you cherish – [if these] are dearer to you than Allah and His Messenger, and striving in His cause, then wait until Allah executes His decree. For Allah does not guide disobedient people.”"
        }
    },
    {
        "id": 1259,
        "chapter": 9,
        "verse": 25,
        "arabic_text": "لَقَدۡ نَصَرَكُمُ ٱللَّهُ فِي مَوَاطِنَ كَثِيرَةٖ وَيَوۡمَ حُنَيۡنٍ إِذۡ أَعۡجَبَتۡكُمۡ كَثۡرَتُكُمۡ فَلَمۡ تُغۡنِ عَنكُمۡ شَيۡـٔٗا وَضَاقَتۡ عَلَيۡكُمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّيۡتُم مُّدۡبِرِينَ",
        "phonetic": "9.25 Laqad Naşarakumu Allāhu Fī Mawāţina Kathīratin Wa Yawma Ĥunaynin 'Idh 'A`jabatkum Kathratukum Falam Tughni `Ankum Shay'āan Wa Đāqat `Alaykumu Al-'Arđu Bimā Raĥubat Thumma Wallaytum Mudbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has already given you victory in many regions and [even] on the day of Ḥunayn, when your great number pleased you, but it did not avail you at all, and the earth was confining for you with [i.e., in spite of] its vastness; then you turned back, fleeing.",
            "english_hilali_khan": "Truly Allâh has given you victory on many battle fields, and on the Day of Hunain (battle) when you rejoiced at your great number, but it availed you naught and the earth, vast as it is, was straitened for you, then you turned back in flight.",
            "english_rwwad": "Allah has given you victory in many battlefields, and on the day of Hunayn when you took pride in your great number, but they were of no use to you; the earth, despite its vastness, became constricted to you, then you turned back running away."
        }
    },
    {
        "id": 1260,
        "chapter": 9,
        "verse": 26,
        "arabic_text": "ثُمَّ أَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَنزَلَ جُنُودٗا لَّمۡ تَرَوۡهَا وَعَذَّبَ ٱلَّذِينَ كَفَرُواْۚ وَذَٰلِكَ جَزَآءُ ٱلۡكَٰفِرِينَ",
        "phonetic": "9.26 Thumma 'Anzala Allāhu Sakīnatahu `Alá Rasūlihi Wa `Alá Al-Mu'uminīna Wa 'Anzala Junūdāan Lam Tarawhā Wa `Adhaba Al-Ladhīna Kafarū Wa Dhalika Jazā'u Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then Allāh sent down His tranquility upon His Messenger and upon the believers and sent down soldiers [i.e., angels] whom you did not see and punished those who disbelieved. And that is the recompense of the disbelievers.",
            "english_hilali_khan": "Then Allâh did send down His Sakînah (calmness, tranquillity and reassurance) on the Messenger (Muhammad صلى الله عليه وسلم), and on the believers, and sent down forces (angels) which you saw not, and punished the disbelievers. Such is the recompense of disbelievers.",
            "english_rwwad": "Then Allah sent down His tranquility upon His Messenger and upon the believers, and sent down soldiers that you did not see, and chastised those who disbelieved. Such was the recompense of the disbelievers."
        }
    },
    {
        "id": 1261,
        "chapter": 9,
        "verse": 27,
        "arabic_text": "ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
        "phonetic": "9.27 Thumma Yatūbu Allāhu Min Ba`di Dhālika `Alá Man Yashā'u Wa Allāhu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then Allāh will accept repentance after that for whom He wills; and Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "Then after that Allâh will accept the repentance of whom He wills. And Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "Then afterwards, Allah will accept repentance of whom He wills, for Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1262,
        "chapter": 9,
        "verse": 28,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ",
        "phonetic": "9.28 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Innamā Al-Mushrikūna Najasun Falā Yaqrabū Al-Masjida Al-Ĥarāma Ba`da `Āmihim Hādhā Wa 'In Khiftum `Aylatan Fasawfa Yughnīkumu Allāhu Min Fađlihi 'In Shā'a 'Inna Allāha `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:28) Their impurity is spiritual and physical: spiritual, because they don’t believe in Allâh’s Oneness and in His Prophet Muhammad صلى الله عليه وسلم ; and physical, because they lack personal hygiene (filthy as regards urine, stools and blood). And the word Najas is used only for those persons who have spiritual impurity e.g. Al-Mushrikûn",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, indeed the polytheists are unclean, so let them not approach al-Masjid al-Ḥarām after this, their [final] year. And if you fear privation, Allāh will enrich you from His bounty if He wills. Indeed, Allāh is Knowing and Wise.",
            "english_hilali_khan": "O you who believe (in Allâh’s Oneness and in His Messenger Muhammad صلى الله عليه وسلم)! Verily, the Mushrikûn (polytheists, pagans, idolaters, disbelievers in the Oneness of Allâh, and in the Message of Muhammad صلى الله عليه وسلم) are Najasun (impure).[1] So let them not come near Al-Masjidal-Harâm (at Makkah) after this year; and if you fear poverty, Allâh will enrich you if He wills, out of His Bounty. Surely, Allâh is All-Knowing, All-Wise.",
            "english_rwwad": "O you who believe, the polytheists are impure, so do not let them come near the Sacred Mosque after this year. If you fear poverty, Allah will enrich you out of His bounty, if He wills. Indeed, Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1263,
        "chapter": 9,
        "verse": 29,
        "arabic_text": "قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ",
        "phonetic": "9.29 Qātilū Al-Ladhīna Lā Yu'uminūna Billāhi Wa Lā Bil-Yawmi Al-'Ākhiri Wa Lā Yuĥarrimūna Mā Ĥarrama Allāhu Wa Rasūluhu Wa Lā Yadīnūna Dīna Al-Ĥaqqi Mina Al-Ladhīna 'Ūtū Al-Kitāba Ĥattá Yu`ţū Al-Jizyata `An Yadin Wa Hum Şāghirūna",
        "footnotes": {
            "english_saheeh": "[466]- A tax required of non-Muslims exempting them from military service and entitling them to the protection of the Islāmic state.  Concurrently, zakāh is not taken from them, being an obligation only upon Muslims.",
            "english_hilali_khan": "(V.9:29) a) See the footnote of (V.2:193)\nb) Narrated Abû Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"The Hour will not be established untill you fight against the Jews, and the stone behind which a Jew will be hiding will say, ‘O Muslim! There is a Jew hiding behind me, so kill him’ \" (Sahih Al-Bukhâri, Vol. 4, Hadîth No.177)\nc) Jizyah a tax levied from the people of the Scriptures (Jews and Christians), who are under the protection of a Muslim government.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Fight against those who do not believe in Allāh or in the Last Day and who do not consider unlawful what Allāh and His Messenger have made unlawful and who do not adopt the religion of truth [i.e., Islām] from those who were given the Scripture - [fight] until they give the jizyah[466] willingly while they are humbled.",
            "english_hilali_khan": "and those who acknowledge not the religion of truth (i.e. Islâm) among the people of the Scripture (Jews and Christians), until they pay the Jizyah [2] with willing submission, and feel themselves subdued.",
            "english_rwwad": "Fight those of the People of the Book who do not believe in Allah and the Last Day, nor do they consider forbidden what Allah and His Messenger have forbidden, nor adopt the religion of truth, until they pay the protection tax willingly while they are humbled."
        }
    },
    {
        "id": 1264,
        "chapter": 9,
        "verse": 30,
        "arabic_text": "وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِـُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ",
        "phonetic": "9.30 Wa Qālati Al-Yahūdu `Uzayrun Abnu Allāhi Wa Qālati An-Naşārá Al-Masīĥu Abnu Allāhi Dhālika Qawluhum Bi'afwāhihim Yuđāhi'ūna Qawla Al-Ladhīna Kafarū Min Qablu Qātalahumu Allāhu 'Anná Yu'ufakūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:30)\na) See the footnote of (V.2:116).\nb) See the footnote of (V.4:40) and the footnote (c) of (V.68:42).\n[4] (V.9:31) Once while Allâh’s Messenger صلى الله عليه وسلم was reciting this Verse, ‘Adi bin Hâtim said, \"O Allâh’s Messenger! They do not worship them (i.e. the rabbis and monks).\" Allâh’s Messenger صلى الله عليه وسلم said: \"They certainly do. [They (i.e. the rabbis and monks) made lawful things as unlawful and unlawful things as lawful, and they (i.e. Jews and Christians) followed them; and by doing so, they really worshipped them].\" (Narrated by Ahmad, At-Tirmidhi, and Ibn Jarîr).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Jews say, \"Ezra is the son of Allāh\"; and the Christians say, \"The Messiah is the son of Allāh.\" That is their statement from their mouths; they imitate the saying of those who disbelieved before [them]. May Allāh destroy them; how are they deluded?",
            "english_hilali_khan": "And the Jews say: ‘Uzair (Ezra) is the son of Allâh, and the Christians say: Messiah is the son of Allâh. That is their saying with their mouths, resembling the saying of those who disbelieved aforetime. Allâh’s Curse be on them, how they are deluded away from the truth![3]",
            "english_rwwad": "The Jews say, “Ezra is the son of Allah,” and the Christians say, “The Messiah is the son of Allah.” These are mere words that they utter, imitating the words of the disbelievers before them. May Allah ruin them; how can they be deluded?"
        }
    },
    {
        "id": 1265,
        "chapter": 9,
        "verse": 31,
        "arabic_text": "ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ",
        "phonetic": "9.31 Attakhadhū 'Aĥbārahum Wa Ruhbānahum 'Arbābāan Min Dūni Allāhi Wa Al-Masīĥa Abna Maryama Wa Mā 'Umirū 'Illā Liya`budū 'Ilahāan Wāĥidāan Lā 'Ilāha 'Illā Huwa Subĥānahu `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "[467]- By their obedience to them rather than to what Allāh ordained.\n[468]- By their worship of him in conjunction with Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They have taken their scholars and monks as lords besides Allāh,[467] and [also] the Messiah, the son of Mary.[468] And they were not commanded except to worship one God; there is no deity except Him. Exalted is He above whatever they associate with Him.",
            "english_hilali_khan": "They (Jews and Christians) took their rabbis and their monks to be their lords besides Allâh (by obeying them in things which they made lawful or unlawful according to their own desires without being ordered by Allâh), and (they also took as their Lord) Messiah, son of Maryam (Mary), while they (Jews and Christians) were commanded [in the Taurât (Torah) and the Injeel (Gospel)] to worship none but One Ilâh (God - Allâh) Lâ ilâha illa Huwa (none has the right to be worshipped but He)[4]. Praise and glory be to Him (far above is He) from having the partners they associate (with Him).\"",
            "english_rwwad": "They have taken their rabbis and monks as lords besides Allah, as well as the Messiah, son of Mary, even though they were commanded to worship only One God; none has the right to be worshiped except Him, glorified is He far above what they associate with Him."
        }
    },
    {
        "id": 1266,
        "chapter": 9,
        "verse": 32,
        "arabic_text": "يُرِيدُونَ أَن يُطۡفِـُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَيَأۡبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ",
        "phonetic": "9.32 Yurīdūna 'An Yuţfi'ū Nūra Allāhi Bi'afwāhihim Wa Ya'bá Allāhu 'Illā 'An Yutimma Nūrahu Wa Law Kariha Al-Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They want to extinguish the light of Allāh with their mouths, but Allāh refuses except to perfect His light, although the disbelievers dislike it.",
            "english_hilali_khan": "They (the disbelievers, the Jews and the Christians) want to extinguish Allâh’s Light (with which Muhammad صلى الله عليه وسلم has been sent - Islâmic Monotheism) with their mouths, but Allâh will not allow except that His Light should be perfected even though the Kâfirûn (disbelievers) hate (it).",
            "english_rwwad": "They seek to extinguish the light of Allah with their mouths, but Allah refuses except to perfect His light, even if the disbelievers hate it."
        }
    },
    {
        "id": 1267,
        "chapter": 9,
        "verse": 33,
        "arabic_text": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ",
        "phonetic": "9.33 Huwa Al-Ladhī 'Arsala Rasūlahu Bil-Hudá Wa Dīni Al-Ĥaqqi Liyužhirahu `Alá Ad-Dīni Kullihi Wa Law Kariha Al-Mushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who has sent His Messenger with guidance and the religion of truth to manifest it over all religion, although they who associate others with Allāh dislike it.",
            "english_hilali_khan": "It is He Who has sent His Messenger (Muhammad صلى الله عليه وسلم) with guidance and the religion of truth (Islâm), to make it superior over all religions even though the Mushrikûn (polytheists, pagans, idolaters, disbelievers in the Oneness of Allâh) hate (it).",
            "english_rwwad": "It is He Who has sent His Messenger with guidance and the religion of truth, so that He may make it prevail over all other religions, even though the polytheists dislike it."
        }
    },
    {
        "id": 1268,
        "chapter": 9,
        "verse": 34,
        "arabic_text": "۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ كَثِيرٗا مِّنَ ٱلۡأَحۡبَارِ وَٱلرُّهۡبَانِ لَيَأۡكُلُونَ أَمۡوَٰلَ ٱلنَّاسِ بِٱلۡبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۗ وَٱلَّذِينَ يَكۡنِزُونَ ٱلذَّهَبَ وَٱلۡفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ ٱللَّهِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٖ",
        "phonetic": "9.34 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Inna Kathīrāan Mina Al-'Aĥbāri Wa Ar-Ruhbāni Laya'kulūna 'Amwāla An-Nāsi Bil-Bāţili Wa Yaşuddūna `An Sabīli Allāhi Wa Al-Ladhīna Yaknizūna Adh-Dhahaba Wa Al-Fiđđata Wa Lā Yunfiqūnahā Fī Sabīli Allāhi Fabashirhum Bi`adhābin 'Alīmin",
        "footnotes": {
            "english_saheeh": "[469]- i.e., through false pretense.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, indeed many of the scholars and the monks devour the wealth of people unjustly[469] and avert [them] from the way of Allāh. And those who hoard gold and silver and spend it not in the way of Allāh - give them tidings of a painful punishment.",
            "english_hilali_khan": "O you who believe! Verily, there are many of the (Jewish) rabbis and the (Christian) monks who devour the wealth of mankind in falsehood, and hinder (them) from the Way of Allâh (i.e. Allâh’s religion of Islâmic Monotheism). And those who hoard up gold and silver [Al-Kanz: the money, the Zakât of which has not been paid] and spend them not in the Way of Allâh, announce unto them a painful torment.",
            "english_rwwad": "O you who believe, there are many rabbis and monks who consume people’s wealth unlawfully and prevent people from Allah’s way. Those who hoard gold and silver and do not spend it in the way of Allah, give them tidings of a painful punishment."
        }
    },
    {
        "id": 1269,
        "chapter": 9,
        "verse": 35,
        "arabic_text": "يَوۡمَ يُحۡمَىٰ عَلَيۡهَا فِي نَارِ جَهَنَّمَ فَتُكۡوَىٰ بِهَا جِبَاهُهُمۡ وَجُنُوبُهُمۡ وَظُهُورُهُمۡۖ هَٰذَا مَا كَنَزۡتُمۡ لِأَنفُسِكُمۡ فَذُوقُواْ مَا كُنتُمۡ تَكۡنِزُونَ",
        "phonetic": "9.35 Yawma Yuĥmá `Alayhā Fī Nāri Jahannama Fatukwá Bihā Jibāhuhum Wa Junūbuhum Wa Žuhūruhum Hādhā Mā Kanaztum Li'nfusikum Fadhūqū Mā Kuntum Taknizūna",
        "footnotes": {
            "english_saheeh": "[470]- The gold and silver which was hoarded, i.e., whose zakāh was not paid.",
            "english_hilali_khan": "(V.9:35) See the footnote of (V.3:180)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Day when it[470] will be heated in the fire of Hell and seared therewith will be their foreheads, their flanks, and their backs, [it will be said], \"This is what you hoarded for yourselves, so taste what you used to hoard.\"",
            "english_hilali_khan": "On the Day when that (Al-Kanz: money, gold and silver the Zakât of which has not been paid) will be heated in the Fire of Hell and with it will be branded their foreheads, their flanks, and their backs, (and it will be said unto them): \"This is the treasure which you hoarded for yourselves. Now taste of what you used to hoard.\"[1]",
            "english_rwwad": "On the Day when their treasures will be heated up in the Fire of Hell, and their foreheads, sides and backs will be branded with it. [They will be told], “This is what you hoarded for yourselves; so taste [the punishment of] what you used to hoard.”"
        }
    },
    {
        "id": 1270,
        "chapter": 9,
        "verse": 36,
        "arabic_text": "إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثۡنَا عَشَرَ شَهۡرٗا فِي كِتَٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ أَرۡبَعَةٌ حُرُمٞۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُۚ فَلَا تَظۡلِمُواْ فِيهِنَّ أَنفُسَكُمۡۚ وَقَٰتِلُواْ ٱلۡمُشۡرِكِينَ كَآفَّةٗ كَمَا يُقَٰتِلُونَكُمۡ كَآفَّةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ",
        "phonetic": "9.36 'Inna `Iddata Ash-Shuhūri `Inda Allāhi Athnā `Ashara Shahrāan Fī Kitābi Allāhi Yawma Khalaqa As-Samāwāti Wa Al-'Arđa Minhā 'Arba`atun Ĥurumun Dhālika Ad-Dīnu Al-Qayyimu Falā Tažlimū Fīhinna 'Anfusakum Wa Qātilū Al-Mushrikīna Kāffatan Kamā Yuqātilūnakum Kāffatan Wa A`lamū 'Anna Allāha Ma`a Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "[471]- See footnote to 9:5.\n[472]- i.e., do not violate the sacred months or commit aggression therein.",
            "english_hilali_khan": "(V.9:36) See the footnotes of (V.2:193) and (V.8:73).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the number of months with Allāh is twelve [lunar] months in the register of Allāh [from] the day He created the heavens and the earth; of these, four are sacred.[471] That is the correct religion [i.e., way], so do not wrong yourselves during them.[472] And fight against the disbelievers collectively as they fight against you collectively. And know that Allāh is with the righteous [who fear Him].",
            "english_hilali_khan": "Verily, the number of months with Allâh is twelve months (in a year), so was it ordained by Allâh on the Day when He created the heavens and the earth; of them four are Sacred (i.e. the 1st, the 7th, the 11th and the 12th months of the Islâmic calendar). That is the right religion, so wrong not yourselves therein, and fight against the Mushrikûn (polytheists, pagans, idolaters, disbelievers in the Oneness of Allâh) collectively[2] as they fight against you collectively. But know that Allâh is with those who are Al-Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "The number of months with Allah is twelve, in the Record of Allah since the day He created the heavens and earth; of which four are sacred. This is the straight way, so do not wrong yourselves during these months, and fight the polytheists all together, just as they fight you all together. And know that Allah is with those who fear Him."
        }
    },
    {
        "id": 1271,
        "chapter": 9,
        "verse": 37,
        "arabic_text": "إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِـُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ",
        "phonetic": "9.37 'Innamā An-Nasī'u Ziyādatun Fī Al-Kufri Yuđallu Bihi Al-Ladhīna Kafarū Yuĥillūnahu `Āmāan Wa Yuĥarrimūnahu `Āmāan Liyuwāţi'ū `Iddata Mā Ĥarrama Allāhu Fayuĥillū Mā Ĥarrama Allāhu Zuyyina Lahum Sū'u 'A`mālihim Wa Allāhu Lā Yahdī Al-Qawma Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "[473]- Fighting during a sacred month.\n[474]- If they found it advantageous to violate a sacred month, they would do so, designating another month in its place in which to observe the restrictions concerning fighting.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the postponing [of restriction within sacred months] is an increase in disbelief by which those who have disbelieved are led [further] astray. They make it[473] lawful one year and unlawful another year to correspond to the number made unlawful by Allāh[474] and [thus] make lawful what Allāh has made unlawful. Made pleasing to them is the evil of their deeds; and Allāh does not guide the disbelieving people.",
            "english_hilali_khan": "The postponing (of a Sacred Month) is indeed an addition to disbelief: thereby the disbelievers are led astray, for they make it lawful one year and forbid it another year in order to adjust the number of months forbidden by Allâh, and make such forbidden ones lawful. The evil of their deeds is made fair-seeming to them. And Allâh guides not the people who disbelieve.",
            "english_rwwad": "The postponement of [Sacred Months] is an act of disbelief, which leads them further astray. They declare a month lawful in one year and sacred the next year, in order to match the number of months that Allah has declared as sacred, thus making lawful what Allah has made forbidden; their evil deeds have been made appealing to them, and Allah does not guide the disbelieving people."
        }
    },
    {
        "id": 1272,
        "chapter": 9,
        "verse": 38,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ",
        "phonetic": "9.38 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Mā Lakum 'Idhā Qīla Lakum Anfirū Fī Sabīli Allāhi Aththāqaltum 'Ilá Al-'Arđi 'Arađītum Bil-Ĥayāati Ad-Dunyā Mina Al-'Ākhirati Famā Matā`u Al-Ĥayāati Ad-Dunyā Fī Al-'Ākhirati 'Illā Qalīlun",
        "footnotes": {
            "english_saheeh": "[475]- i.e., inclining toward the comforts of worldly life.",
            "english_hilali_khan": "(V.9:38) Narrated Anas bin Mâlik رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Nobody who dies and finds good from Allâh (in the Hereafter) would wish to come back to this world, even if he were given the whole world and whatever is in it except the martyr who, on seeing the superiority of martyrdom would like to come back to the world and get killed again (in Allâh’s Cause).\" (Sahih Al Bukhâri, Vol.4, Hadîth No.53-A).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, what is [the matter] with you that, when you are told to go forth in the cause of Allāh, you adhere heavily to the earth?[475] Are you satisfied with the life of this world rather than the Hereafter? But what is the enjoyment of worldly life compared to the Hereafter except a [very] little.",
            "english_hilali_khan": "O you who believe! What is the matter with you, that when you are asked to march forth in the Cause of Allâh (i.e. Jihâd) you cling heavily to the earth? Are you pleased with the life of this world rather than the Hereafter? But little is the enjoyment of the life of this world as compared to the Hereafter.[1]",
            "english_rwwad": "O you who believe, what is the matter with you that when you are asked to march forth in the cause of Allah, you cling heavily to the earth? Are you content with the life of this world instead of the Hereafter? But the enjoyment of the life of this world is insignificant compared to that of the Hereafter."
        }
    },
    {
        "id": 1273,
        "chapter": 9,
        "verse": 39,
        "arabic_text": "إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡـٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ",
        "phonetic": "9.39 'Illā Tanfirū Yu`adhibkum `Adhābāan 'Alīmāan Wa Yastabdil Qawmāan Ghayrakum Wa Lā Tađurrūhu Shay'āan Wa Allāhu `Alá Kulli Shay'in Qadīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you do not go forth, He will punish you with a painful punishment and will replace you with another people, and you will not harm Him at all. And Allāh is over all things competent.",
            "english_hilali_khan": "If you march not forth, He will punish you with a painful torment and will replace you by another people; and you cannot harm Him at all, and Allâh is Able to do all things.",
            "english_rwwad": "Unless you march forth, He will chastise you with a painful punishment and replace you with another people, and you cannot harm Him in the least, for Allah is Most Capable of all things."
        }
    },
    {
        "id": 1274,
        "chapter": 9,
        "verse": 40,
        "arabic_text": "إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ",
        "phonetic": "9.40 'Illā Tanşurūhu Faqad Naşarahu Allāhu 'Idh 'Akhrajahu Al-Ladhīna Kafarū Thāniya Athnayni 'Idh Humā Fī Al-Ghāri 'Idh Yaqūlu Lişāĥibihi Lā Taĥzan 'Inna Allāha Ma`anā Fa'anzala Allāhu Sakīnatahu `Alayhi Wa 'Ayyadahu Bijunūdin Lam Tarawhā Wa Ja`ala Kalimata Al-Ladhīna Kafarū As-Suflá Wa Kalimatu Allāhi Hiya Al-`Ulyā Wa Allāhu `Azīzun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "[476]- The second was his companion, Abū Bakr.\n[477]- i.e., their claims and slogans.\n[478]- i.e., degraded and dishonored.\n[479]- \"Lā ilāha ill-Allāh\" (\"There is no deity except Allāh\").",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you do not aid him [i.e., the Prophet (ﷺ)] - Allāh has already aided him when those who disbelieved had driven him out [of Makkah] as one of two,[476] when they were in the cave and he [i.e., Muḥammad (ﷺ)] said to his companion, \"Do not grieve; indeed Allāh is with us.\" And Allāh sent down His tranquility upon him and supported him with soldiers [i.e., angels] you did not see and made the word[477] of those who disbelieved the lowest,[478] while the word of Allāh[479] - that is the highest. And Allāh is Exalted in Might and Wise.",
            "english_hilali_khan": "If you help him (Muhammad صلى الله عليه وسلم) not (it does not matter), for Allâh did indeed help him when the disbelievers drove him out, the second of the two; when they (Muhammad صلى الله عليه وسلم and Abu Bakr رضي الله عنه) were in the cave, he (صلى الله عليه وسلم) said to his companion (Abu Bakr رضي الله عنه): \"Be not sad (or afraid), surely Allâh is with us.\" Then Allâh sent down His Sakînah (calmness, tranquillity, peace) upon him, and strengthened him with forces (angels) which you saw not, and made the word of those who disbelieved the lowermost, while the Word of Allâh that became the uppermost; and Allâh is All-Mighty, All-Wise.",
            "english_rwwad": "If you do not support the Prophet, Allah has already supported him when the disbelievers forced him out; when he was second of the two in the cave – saying to his companion, “Do not grieve; Allah is with us.” Thereupon Allah sent down His tranquility upon him, supported him with soldiers that you did not see, and rendered the word of the disbelievers the lowest, whereas the Word of Allah is supreme. And Allah is All-Mighty, All-Wise."
        }
    },
    {
        "id": 1275,
        "chapter": 9,
        "verse": 41,
        "arabic_text": "ٱنفِرُواْ خِفَافٗا وَثِقَالٗا وَجَٰهِدُواْ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ فِي سَبِيلِ ٱللَّهِۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ",
        "phonetic": "9.41 Anfirū Khifāfāan Wa Thiqālāan Wa Jāhidū Bi'amwālikum Wa 'Anfusikum Fī Sabīli Allāhi Dhālikum Khayrun Lakum 'In Kuntum Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[480]- i.e., young or old, riding or walking, in ease or in hardship - in all circumstances and conditions.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Go forth, whether light or heavy,[480] and strive with your wealth and your lives in the cause of Allāh. That is better for you, if you only knew.",
            "english_hilali_khan": "March forth, whether you are light (being healthy, young and wealthy) or heavy (being ill, old and poor), and strive hard with your wealth and your lives in the Cause of Allâh. This is better for you, if you but knew.",
            "english_rwwad": "March forth, whether lightly or heavily armed, and strive in the cause of Allah with your wealth and your lives. That is best for you, if only you knew."
        }
    },
    {
        "id": 1276,
        "chapter": 9,
        "verse": 42,
        "arabic_text": "لَوۡ كَانَ عَرَضٗا قَرِيبٗا وَسَفَرٗا قَاصِدٗا لَّٱتَّبَعُوكَ وَلَٰكِنۢ بَعُدَتۡ عَلَيۡهِمُ ٱلشُّقَّةُۚ وَسَيَحۡلِفُونَ بِٱللَّهِ لَوِ ٱسۡتَطَعۡنَا لَخَرَجۡنَا مَعَكُمۡ يُهۡلِكُونَ أَنفُسَهُمۡ وَٱللَّهُ يَعۡلَمُ إِنَّهُمۡ لَكَٰذِبُونَ",
        "phonetic": "9.42 Law Kāna `Arađāan Qarībāan Wa Safarāan Qāşidāan Lāttaba`ūka Wa Lakin Ba`udat `Alayhimu Ash-Shuqqatu Wa Sayaĥlifūna Billāhi Law Astaţa`nā Lakharajnā Ma`akum Yuhlikūna 'Anfusahum Wa Allāhu Ya`lamu 'Innahum Lakādhibūna",
        "footnotes": {
            "english_saheeh": "[481]- When you return from the Tabūk expedition.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Had it been a near [i.e., easy] gain and a moderate trip, they [i.e., the hypocrites] would have followed you, but distant to them was the journey. And they will swear by Allāh,[481] \"If we were able, we would have gone forth with you,\" destroying themselves [through false oaths], and Allāh knows that indeed they are liars.",
            "english_hilali_khan": "Had it been a near gain (booty in front of them) and an easy journey, they would have followed you, but the distance (Tabuk expedition) was long for them; and they would swear by Allâh, \"If we only could, we would certainly have come forth with you.\" They destroy their ownselves, and Allâh knows that they are liars.",
            "english_rwwad": "If it had been an easy win within reach and a short journey, those [hypocrites] would have followed you, but the distance seemed too far for them. They will swear by Allah, “If we had been able, we would have surely joined you.” They destroy themselves; and Allah knows that they are liars."
        }
    },
    {
        "id": 1277,
        "chapter": 9,
        "verse": 43,
        "arabic_text": "عَفَا ٱللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمۡ حَتَّىٰ يَتَبَيَّنَ لَكَ ٱلَّذِينَ صَدَقُواْ وَتَعۡلَمَ ٱلۡكَٰذِبِينَ",
        "phonetic": "9.43 `Afā Allāhu `Anka Lima 'Adhinta Lahum Ĥattá Yatabayyana Laka Al-Ladhīna Şadaqū Wa Ta`lama Al-Kādhibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has pardoned you, [O Muḥammad, but] why did you give them permission [to remain behind]? [You should not have] until it was evident to you who were truthful and you knew [who were] the liars.",
            "english_hilali_khan": "May Allâh forgive you (O Muhammad صلى الله عليه وسلم). Why did you grant them leave (for remaining behind; you should have persisted as regards your order to them to proceed on Jihâd ), until those who told the truth were seen by you in a clear light, and you had known the liars?",
            "english_rwwad": "May Allah pardon you [O Prophet], why did you give them permission [to stay behind] before it became clear to you as to who were telling the truth, and who were liars?"
        }
    },
    {
        "id": 1278,
        "chapter": 9,
        "verse": 44,
        "arabic_text": "لَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلۡمُتَّقِينَ",
        "phonetic": "9.44 Lā Yasta'dhinuka Al-Ladhīna Yu'uminūna Billāhi Wa Al-Yawmi Al-'Ākhiri 'An Yujāhidū Bi'amwālihim Wa 'Anfusihim Wa Allāhu `Alīmun Bil-Muttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who believe in Allāh and the Last Day would not ask permission of you to be excused from striving [i.e., fighting] with their wealth and their lives. And Allāh is Knowing of those who fear Him.",
            "english_hilali_khan": "Those who believe in Allâh and the Last Day would not ask your leave to be exempted from fighting with their properties and their lives; and Allâh is the All-Knower of Al-Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "Those who believe in Allah and the Last Day will not ask you to be exempted from striving with their wealth and their lives in Allah’s cause. Allah is All-Knowing of those who fear Him."
        }
    },
    {
        "id": 1279,
        "chapter": 9,
        "verse": 45,
        "arabic_text": "إِنَّمَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَٱرۡتَابَتۡ قُلُوبُهُمۡ فَهُمۡ فِي رَيۡبِهِمۡ يَتَرَدَّدُونَ",
        "phonetic": "9.45 'Innamā Yasta'dhinuka Al-Ladhīna Lā Yu'uminūna Billāhi Wa Al-Yawmi Al-'Ākhiri Wa Artābat Qulūbuhum Fahum Fī Raybihim Yataraddadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Only those would ask permission of you who do not believe in Allāh and the Last Day and whose hearts have doubted, and they, in their doubt, are hesitating.",
            "english_hilali_khan": "It is only those who believe not in Allâh and the Last Day and whose hearts are in doubt that ask your leave (to be exempted from Jihâd). So in their doubts they waver.",
            "english_rwwad": "Only those who do not believe in Allah and the Last Day ask permission to be exempted; they have doubts in their hearts, so they will continue to waver in their doubts."
        }
    },
    {
        "id": 1280,
        "chapter": 9,
        "verse": 46,
        "arabic_text": "۞ وَلَوۡ أَرَادُواْ ٱلۡخُرُوجَ لَأَعَدُّواْ لَهُۥ عُدَّةٗ وَلَٰكِن كَرِهَ ٱللَّهُ ٱنۢبِعَاثَهُمۡ فَثَبَّطَهُمۡ وَقِيلَ ٱقۡعُدُواْ مَعَ ٱلۡقَٰعِدِينَ",
        "phonetic": "9.46 Wa Law 'Arādū Al-Khurūja La'a`addū Lahu `Uddatan Wa Lakin Kariha Allāhu Anbi`āthahum Fathabbaţahum Wa Qīla Aq`udū Ma`a Al-Qā`idīna",
        "footnotes": {
            "english_saheeh": "[482]- i.e., the women and children.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if they had intended to go forth, they would have prepared for it [some] preparation. But Allāh disliked their being sent, so He kept them back, and they were told, \"Remain [behind] with those who remain.\"[482]",
            "english_hilali_khan": "And if they had intended to march out, certainly, they would have made some preparation for it; but Allâh was averse to their being sent forth, so He made them lag behind, and it was said (to them), \"Sit you among those who sit (at home).\"",
            "english_rwwad": "If they had truly intended to march forth, they would have made necessary preparations for it. But Allah disliked their going forth, so He made them lag behind, and they were told, “Stay behind with those who are staying behind.”"
        }
    },
    {
        "id": 1281,
        "chapter": 9,
        "verse": 47,
        "arabic_text": "لَوۡ خَرَجُواْ فِيكُم مَّا زَادُوكُمۡ إِلَّا خَبَالٗا وَلَأَوۡضَعُواْ خِلَٰلَكُمۡ يَبۡغُونَكُمُ ٱلۡفِتۡنَةَ وَفِيكُمۡ سَمَّٰعُونَ لَهُمۡۗ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ",
        "phonetic": "9.47 Law Kharajū Fīkum Mā Zādūkum 'Illā Khabālāan Wa La'awđa`ū Khilālakum Yabghūnakumu Al-Fitnata Wa Fīkum Sammā`ūna Lahum Wa Allāhu `Alīmun Biž-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Had they gone forth with you, they would not have increased you except in confusion, and they would have been active among you, seeking [to cause] you fitnah [i.e., chaos and dissension]. And among you are avid listeners to them. And Allāh is Knowing of the wrongdoers.",
            "english_hilali_khan": "Had they marched out with you, they would have added to you nothing except disorder, and they would have hurried about in your midst (spreading corruption) and sowing sedition among you - and there are some among you who would have listened to them. And Allâh is the All-Knower of the Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "If they had gone forth with you, they would have only increased you in disorder, and would have scurried around, sowing discord among you, and some of you would have listened to them. And Allah is All-Knowing of the wrongdoers."
        }
    },
    {
        "id": 1282,
        "chapter": 9,
        "verse": 48,
        "arabic_text": "لَقَدِ ٱبۡتَغَوُاْ ٱلۡفِتۡنَةَ مِن قَبۡلُ وَقَلَّبُواْ لَكَ ٱلۡأُمُورَ حَتَّىٰ جَآءَ ٱلۡحَقُّ وَظَهَرَ أَمۡرُ ٱللَّهِ وَهُمۡ كَٰرِهُونَ",
        "phonetic": "9.48 Laqadi Abtaghaw Al-Fitnata Min Qablu Wa Qallabū Laka Al-'Umūra Ĥattá Jā'a Al-Ĥaqqu Wa Žahara 'Amru Allāhi Wa Hum Kārihūna",
        "footnotes": {
            "english_saheeh": "[483]- Or \"turned matters related to you over [in their minds, considering how to cause you failure].\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They had already desired dissension before and had upset matters for you[483] until the truth came and the ordinance [i.e., victory] of Allāh appeared, while they were averse.",
            "english_hilali_khan": "Verily, they had plotted sedition before, and had upset matters for you, until the truth (victory) came and the Decree of Allâh (His religion, Islâm) became manifest though they hated it.",
            "english_rwwad": "They had surely sought to sow discord before and devised plots against you [O Prophet] until the truth [victory] came and Allah’s decree [religion] prevailed, even though they were averse."
        }
    },
    {
        "id": 1283,
        "chapter": 9,
        "verse": 49,
        "arabic_text": "وَمِنۡهُم مَّن يَقُولُ ٱئۡذَن لِّي وَلَا تَفۡتِنِّيٓۚ أَلَا فِي ٱلۡفِتۡنَةِ سَقَطُواْۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةُۢ بِٱلۡكَٰفِرِينَ",
        "phonetic": "9.49 Wa Minhum Man Yaqūlu A'dhan Lī Wa Lā Taftinnī 'Alā Fī Al-Fitnati Saqaţū Wa 'Inna Jahannama Lamuĥīţatun Bil-Kāfirīna",
        "footnotes": {
            "english_saheeh": "[484]- By avoiding their obligation, they fell into destruction.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them is he who says, \"Permit me [to remain at home] and do not put me to trial.\" Unquestionably, into trial they have fallen.[484] And indeed, Hell will encompass the disbelievers.",
            "english_hilali_khan": "And among them is he who says: \"Grant me leave (to be exempted from Jihâd) and put me not into trial.\" Surely, they have fallen into trial. And verily, Hell is surrounding the disbelievers.",
            "english_rwwad": "There are some among them who say, “Exempt me and do not expose me to temptation.” They have already fallen into temptation. Hell will certainly encompass the disbelievers."
        }
    },
    {
        "id": 1284,
        "chapter": 9,
        "verse": 50,
        "arabic_text": "إِن تُصِبۡكَ حَسَنَةٞ تَسُؤۡهُمۡۖ وَإِن تُصِبۡكَ مُصِيبَةٞ يَقُولُواْ قَدۡ أَخَذۡنَآ أَمۡرَنَا مِن قَبۡلُ وَيَتَوَلَّواْ وَّهُمۡ فَرِحُونَ",
        "phonetic": "9.50 'In Tuşibka Ĥasanatun Tasu'uhum Wa 'In Tuşibka Muşībatun Yaqūlū Qad 'Akhadhnā 'Amranā Min Qablu Wa Yatawallaw Wa Hum Fariĥūna",
        "footnotes": {
            "english_saheeh": "[485]- The hypocrites claim to have protected themselves by remaining behind.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If good befalls you, it distresses them; but if disaster strikes you, they say, \"We took our matter [in hand] before,\"[485] and turn away while they are rejoicing.",
            "english_hilali_khan": "If good befalls you (O Muhammad صلى الله عليه وسلم), it grieves them, but if a calamity overtakes you, they say: \"We took our precaution beforehand\" and they turn away rejoicing.",
            "english_rwwad": "If something good happens to you, it grieves them, but if a disaster befalls you, they say, “We have taken our precautions beforehand,” and they turn away rejoicing."
        }
    },
    {
        "id": 1285,
        "chapter": 9,
        "verse": 51,
        "arabic_text": "قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوۡلَىٰنَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ",
        "phonetic": "9.51 Qul Lan Yuşībanā 'Illā Mā Kataba Allāhu Lanā Huwa Mawlānā Wa `Alá Allāhi Falyatawakkali Al-Mu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:51) See the footnote of (V.57:22).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Never will we be struck except by what Allāh has decreed for us; He is our protector.\" And upon Allāh let the believers rely.",
            "english_hilali_khan": "Say: \"Nothing shall ever happen to us except what Allâh has ordained for us.[1] He is our Maulâ (Lord, Helper and Protector).\" And in Allâh let the believers put their trust.",
            "english_rwwad": "Say, “Nothing will ever befall us except that which Allah has decreed for us; He is our Protector.” And in Allah alone let the believers put their trust."
        }
    },
    {
        "id": 1286,
        "chapter": 9,
        "verse": 52,
        "arabic_text": "قُلۡ هَلۡ تَرَبَّصُونَ بِنَآ إِلَّآ إِحۡدَى ٱلۡحُسۡنَيَيۡنِۖ وَنَحۡنُ نَتَرَبَّصُ بِكُمۡ أَن يُصِيبَكُمُ ٱللَّهُ بِعَذَابٖ مِّنۡ عِندِهِۦٓ أَوۡ بِأَيۡدِينَاۖ فَتَرَبَّصُوٓاْ إِنَّا مَعَكُم مُّتَرَبِّصُونَ",
        "phonetic": "9.52 Qul Hal Tarabbaşūna Binā 'Illā 'Iĥdá Al-Ĥusnayayni Wa Naĥnu Natarabbaşu Bikum 'An Yuşībakumu Allāhu Bi`adhābin Min `Indihi 'Aw Bi'aydīnā Fatarabbaşū 'Innā Ma`akum Mutarabbişūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Do you await for us except one of the two best things [i.e., martyrdom or victory] while we await for you that Allāh will afflict you with punishment from Himself or at our hands? So wait; indeed we, along with you, are waiting.\"",
            "english_hilali_khan": "Say: \"Do you wait for us (anything) except one of the two best things (martyrdom or victory); while we await for you either that Allâh will afflict you with a punishment from Himself or at our hands. So wait, we too are waiting with you.\"",
            "english_rwwad": "Say, “Are you awaiting to befall us except one of the two good things [victory or martyrdom]? But we are awaiting that Allah will afflict you with punishment from Himself or at our hands. So wait; we too are waiting with you.”"
        }
    },
    {
        "id": 1287,
        "chapter": 9,
        "verse": 53,
        "arabic_text": "قُلۡ أَنفِقُواْ طَوۡعًا أَوۡ كَرۡهٗا لَّن يُتَقَبَّلَ مِنكُمۡ إِنَّكُمۡ كُنتُمۡ قَوۡمٗا فَٰسِقِينَ",
        "phonetic": "9.53 Qul 'Anfiqū Ţaw`āan 'Aw Karhāan Lan Yutaqabbala Minkum 'Innakum Kuntum Qawmāan Fāsiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Spend willingly or unwillingly; never will it be accepted from you. Indeed, you have been a defiantly disobedient people.\"",
            "english_hilali_khan": "Say: \"Spend (in Allâh’s Cause) willingly or unwillingly, it will not be accepted from you. Verily, you are ever a people who are Fâsiqûn (rebellious, disobedient to Allâh).\"",
            "english_rwwad": "Say, “Whether you spend willingly or unwillingly, it will never be accepted from you, for you have been a wicked people.”"
        }
    },
    {
        "id": 1288,
        "chapter": 9,
        "verse": 54,
        "arabic_text": "وَمَا مَنَعَهُمۡ أَن تُقۡبَلَ مِنۡهُمۡ نَفَقَٰتُهُمۡ إِلَّآ أَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَبِرَسُولِهِۦ وَلَا يَأۡتُونَ ٱلصَّلَوٰةَ إِلَّا وَهُمۡ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمۡ كَٰرِهُونَ",
        "phonetic": "9.54 Wa Mā Mana`ahum 'An Tuqbala Minhum Nafaqātuhum 'Illā 'Annahum Kafarū Billāhi Wa Birasūlihi Wa Lā Ya'tūna Aş-Şalāata 'Illā Wa Hum Kusālá Wa Lā Yunfiqūna 'Illā Wa Hum Kārihūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:54) Narrated Abu Hurairah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"No Salât (prayer) is more heavy (harder) for the hypocrites than the Fajr and the ‘Ishâ prayer; but if they knew the reward for these Salât (prayers) at their respective times, they would certainly, present themselves (in the mosques) even if they had to crawl.\" The Prophet صلى الله عليه وسلم added, \"Certainly, I intended (or was about) to order the Mu‘adhdhin (call-maker) to pronounce Iqâmah and order a man to lead the Salât (prayer), and then take a fire flame to burn all those (men along with their houses) who had not yet left their houses for the Salât (prayer) (in the mosques).\" (Sahih Al-Bukhâri, Vol.1, Hadîth No. 626).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And what prevents their expenditures from being accepted from them but that they have disbelieved in Allāh and in His Messenger and that they come not to prayer except while they are lazy and that they do not spend except while they are unwilling.",
            "english_hilali_khan": "And nothing prevents their contributions from being accepted from them except that they disbelieved in Allâh and in His Messenger (Muhammad صلى الله عليه وسلم), and that they came not to As-Salât (the prayer) except in a lazy state,[2] and that they offer not contributions but unwillingly.",
            "english_rwwad": "Nothing prevents the acceptance of their spending except that they disbelieve in Allah and His Messenger, they do not come to prayer but lazily, and they do not spend but reluctantly."
        }
    },
    {
        "id": 1289,
        "chapter": 9,
        "verse": 55,
        "arabic_text": "فَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُعَذِّبَهُم بِهَا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ",
        "phonetic": "9.55 Falā Tu`jibka 'Amwāluhum Wa Lā 'Awlāduhum 'Innamā Yurīdu Allāhu Liyu`adhibahum Bihā Fī Al-Ĥayāati Ad-Dunyā Wa Tazhaqa 'Anfusuhum Wa Hum Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So let not their wealth or their children impress you. Allāh only intends to punish them through them in worldly life and that their souls should depart [at death] while they are disbelievers.",
            "english_hilali_khan": "So let not their wealth nor their children amaze you (O Muhammad صلى الله عليه وسلم); in reality Allâh’s Plan is to punish them with these things in the life of this world, and that their souls shall depart (die) while they are disbelievers.",
            "english_rwwad": "So do not let their wealth or their children impress you; Allah only intends to punish them through these things in the life of this world, and to let their souls depart while they are still disbelievers."
        }
    },
    {
        "id": 1290,
        "chapter": 9,
        "verse": 56,
        "arabic_text": "وَيَحۡلِفُونَ بِٱللَّهِ إِنَّهُمۡ لَمِنكُمۡ وَمَا هُم مِّنكُمۡ وَلَٰكِنَّهُمۡ قَوۡمٞ يَفۡرَقُونَ",
        "phonetic": "9.56 Wa Yaĥlifūna Billāhi 'Innahum Laminkum Wa Mā Hum Minkum Wa Lakinnahum Qawmun Yafraqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they swear by Allāh that they are from among you while they are not from among you; but they are a people who are afraid.",
            "english_hilali_khan": "They swear by Allâh that they are truly of you while they are not of you, but they are a people (hypocrites) who are afraid (that you may kill them).",
            "english_rwwad": "They swear by Allah that they belong to you, but they do not belong to you; rather they are a people who are afraid [of you]."
        }
    },
    {
        "id": 1291,
        "chapter": 9,
        "verse": 57,
        "arabic_text": "لَوۡ يَجِدُونَ مَلۡجَـًٔا أَوۡ مَغَٰرَٰتٍ أَوۡ مُدَّخَلٗا لَّوَلَّوۡاْ إِلَيۡهِ وَهُمۡ يَجۡمَحُونَ",
        "phonetic": "9.57 Law Yajidūna Malja'an 'Aw Maghārātin 'Aw Muddakhalāan Lawallaw 'Ilayhi Wa Hum Yajmaĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If they could find a refuge or some caves or any place to enter [and hide], they would turn to it while they run heedlessly.",
            "english_hilali_khan": "Should they find a refuge, or caves, or a place of concealment, they would turn straightway thereto with a swift rush.",
            "english_rwwad": "If they could find a refuge, or caves, or a place to hide, they would rush headlong to it."
        }
    },
    {
        "id": 1292,
        "chapter": 9,
        "verse": 58,
        "arabic_text": "وَمِنۡهُم مَّن يَلۡمِزُكَ فِي ٱلصَّدَقَٰتِ فَإِنۡ أُعۡطُواْ مِنۡهَا رَضُواْ وَإِن لَّمۡ يُعۡطَوۡاْ مِنۡهَآ إِذَا هُمۡ يَسۡخَطُونَ",
        "phonetic": "9.58 Wa Minhum Man Yalmizuka Fī Aş-Şadaqāti Fa'in 'U`ţū Minhā Rađū Wa 'In Lam Yu`ţaw Minhā 'Idhā Hum Yaskhaţūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:58) See the footnote of (V.20:134).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them are some who criticize you concerning the [distribution of] charities. If they are given from them, they approve; but if they are not given from them, at once they become angry.",
            "english_hilali_khan": "And of them are some who accuse you (O Muhammad صلى الله عليه وسلم) in the matter of (the distribution of) the alms. If they are given part thereof, they are pleased, but if they are not given thereof, behold! They are enraged![1]",
            "english_rwwad": "There are some among them who criticize you [O Prophet] concerning alms; if they are given something thereof, they are pleased, but if they are not given, they are enraged."
        }
    },
    {
        "id": 1293,
        "chapter": 9,
        "verse": 59,
        "arabic_text": "وَلَوۡ أَنَّهُمۡ رَضُواْ مَآ ءَاتَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ وَقَالُواْ حَسۡبُنَا ٱللَّهُ سَيُؤۡتِينَا ٱللَّهُ مِن فَضۡلِهِۦ وَرَسُولُهُۥٓ إِنَّآ إِلَى ٱللَّهِ رَٰغِبُونَ",
        "phonetic": "9.59 Wa Law 'Annahum Rađū Mā 'Ātāhumu Allāhu Wa Rasūluhu Wa Qālū Ĥasbunā Allāhu Sayu'utīnā Allāhu Min Fađlihi Wa Rasūluhu 'Innā 'Ilá Allāhi Rāghibūna",
        "footnotes": {
            "english_saheeh": "[486]- Meaning \"We desire Allāh and His grace and acceptance,\" or \"We desire whatever Allāh wills to give us of His bounty.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If only they had been satisfied with what Allāh and His Messenger gave them and said, \"Sufficient for us is Allāh; Allāh will give us of His bounty, and [so will] His Messenger; indeed, we are desirous toward Allāh,\"[486] [it would have been better for them].",
            "english_hilali_khan": "Would that they were contented with what Allâh and His Messenger (صلى الله عليه وسلم) gave them and had said: \"Allâh is Sufficient for us. Allâh will give us of His Bounty, and so will His Messenger (from alms). We implore Allâh (to enrich us).\"",
            "english_rwwad": "If only they had been pleased with that which Allah and His Messenger gave them, and said, “Allah is sufficient for us; Allah will give us out of His bounty, and so will His Messenger; to Allah alone we turn with hope.”"
        }
    },
    {
        "id": 1294,
        "chapter": 9,
        "verse": 60,
        "arabic_text": "۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
        "phonetic": "9.60 'Innamā Aş-Şadaqātu Lilfuqarā'i Wa Al-Masākīni Wa Al-`Āmilīna `Alayhā Wa Al-Mu'uallafati Qulūbuhum Wa Fī Ar-Riqābi Wa Al-Ghārimīna Wa Fī Sabīli Allāhi Wa Aibni As-Sabīli Farīđatan Mina Allāhi Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "[487]- By the state to collect, guard and distribute the zakāh.",
            "english_hilali_khan": "(V.9:60) See the footnote of (V.2:83) and also see (V.2:273).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Zakāh expenditures are only for the poor and for the needy and for those employed for it[487] and for bringing hearts together [for Islām] and for freeing captives [or slaves] and for those in debt and for the cause of Allāh and for the [stranded] traveler - an obligation [imposed] by Allāh. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "As-Sadaqât (here it means Zakât ) are only for the Fuqarâ’ (poor), and Al-Masâkin [2] (the poor) and those employed to collect (the funds), and to attract the hearts of those who have been inclined (towards Islâm), and to free the captives, and for those in debt, and for Allâh’s Cause (i.e. for Mujahidûn - those fighting in a holy battle), and for the wayfarer (a traveller who is cut off from everything); a duty imposed by Allâh. And Allâh is All-Knower, All-Wise.",
            "english_rwwad": "Alms [zakah] is only for the poor and the needy; those in charge of it; those whose hearts may be attracted [to Islam]; for freeing those in bondage; for those in debt; for the cause of Allah; and for [the stranded] traveler – as ordained by Allah, for Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1295,
        "chapter": 9,
        "verse": 61,
        "arabic_text": "وَمِنۡهُمُ ٱلَّذِينَ يُؤۡذُونَ ٱلنَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٞۚ قُلۡ أُذُنُ خَيۡرٖ لَّكُمۡ يُؤۡمِنُ بِٱللَّهِ وَيُؤۡمِنُ لِلۡمُؤۡمِنِينَ وَرَحۡمَةٞ لِّلَّذِينَ ءَامَنُواْ مِنكُمۡۚ وَٱلَّذِينَ يُؤۡذُونَ رَسُولَ ٱللَّهِ لَهُمۡ عَذَابٌ أَلِيمٞ",
        "phonetic": "9.61 Wa Minhumu Al-Ladhīna Yu'udhūna An-Nabīya Wa Yaqūlūna Huwa 'Udhunun Qul 'Udhunu Khayrin Lakum Yu'uminu Billāhi Wa Yu'uminu Lilmu'uminīna Wa Raĥmatun Lilladhīna 'Āmanū Minkum Wa Al-Ladhīna Yu'udhūna Rasūla Allāhi Lahum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "[488]- i.e., one who believes everything he hears.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them are those who abuse the Prophet and say, \"He is an ear.\"[488] Say, \"[It is] an ear of goodness for you that believes in Allāh and believes the believers and [is] a mercy to those who believe among you.\" And those who abuse the Messenger of Allāh - for them is a painful punishment.",
            "english_hilali_khan": "And among them are men who annoy the Prophet (Muhammad صلى الله عليه وسلم) and say: \"He is (lending his) ear (to every news).\" Say: \"He listens to what is best for you; he believes in Allâh, has faith in the believers, and is a mercy to those of you who believe.\" But those who annoy Allâh’s Messenger (Muhammad صلى الله عليه وسلم) will have a painful torment. [See V.33:57]",
            "english_rwwad": "Among those [hypocrites] are some who offend the Prophet and say, “He listens to everyone.” Say [O Prophet], “He listens to what is best for you; he believes in Allah, trusts the believers, and is a mercy for those of you who believe.” But for those who offend the Messenger of Allah there will be a painful punishment"
        }
    },
    {
        "id": 1296,
        "chapter": 9,
        "verse": 62,
        "arabic_text": "يَحۡلِفُونَ بِٱللَّهِ لَكُمۡ لِيُرۡضُوكُمۡ وَٱللَّهُ وَرَسُولُهُۥٓ أَحَقُّ أَن يُرۡضُوهُ إِن كَانُواْ مُؤۡمِنِينَ",
        "phonetic": "9.62 Yaĥlifūna Billāhi Lakum Liyurđūkum Wa Allāhu Wa Rasūluhu 'Aĥaqqu 'An Yurđūhu 'In Kānū Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[489]- Literally, \"to satisfy Him,\" meaning that Allāh would be satisfied by obedience to the Messenger (ﷺ).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They swear by Allāh to you [Muslims] to satisfy you. But Allāh and His Messenger are more worthy for them to satisfy,[489] if they were to be believers.",
            "english_hilali_khan": "They swear by Allâh to you (Muslims) in order to please you, but it is more fitting that they should please Allâh and His Messenger (Muhammad صلى الله عليه وسلم), if they are believers.",
            "english_rwwad": "They swear by Allah to you [O Muslims] to please you, but it is Allah and His Messenger whose pleasure they should seek, if they are true believers."
        }
    },
    {
        "id": 1297,
        "chapter": 9,
        "verse": 63,
        "arabic_text": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّهُۥ مَن يُحَادِدِ ٱللَّهَ وَرَسُولَهُۥ فَأَنَّ لَهُۥ نَارَ جَهَنَّمَ خَٰلِدٗا فِيهَاۚ ذَٰلِكَ ٱلۡخِزۡيُ ٱلۡعَظِيمُ",
        "phonetic": "9.63 'Alam Ya`lamū 'Annahu Man Yuĥādidi Allāha Wa Rasūlahu Fa'anna Lahu Nāra Jahannama Khālidāan Fīhā Dhālika Al-Khizyu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not know that whoever opposes Allāh and His Messenger - that for him is the fire of Hell, wherein he will abide eternally? That is the great disgrace.",
            "english_hilali_khan": "Know they not that whoever opposes and shows hostility to Allâh (عز وجل) and His Messenger(صلى الله عليه وسلم), certainly for him will be the Fire of Hell to abide therein. That is the extreme disgrace.",
            "english_rwwad": "Do they not know that whoever opposes Allah and His Messenger will dwell in the Fire of Hell forever? That is the ultimate disgrace."
        }
    },
    {
        "id": 1298,
        "chapter": 9,
        "verse": 64,
        "arabic_text": "يَحۡذَرُ ٱلۡمُنَٰفِقُونَ أَن تُنَزَّلَ عَلَيۡهِمۡ سُورَةٞ تُنَبِّئُهُم بِمَا فِي قُلُوبِهِمۡۚ قُلِ ٱسۡتَهۡزِءُوٓاْ إِنَّ ٱللَّهَ مُخۡرِجٞ مَّا تَحۡذَرُونَ",
        "phonetic": "9.64 Yaĥdharu Al-Munāfiqūna 'An Tunazzala `Alayhim Sūratun Tunabbi'uhum Bimā Fī Qulūbihim Quli Astahzi'ū 'Inna Allāha Mukhrijun Mā Taĥdharūna",
        "footnotes": {
            "english_saheeh": "[490]- i.e., exposing the truth about.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The hypocrites are apprehensive lest a sūrah be revealed about them, informing them of[490] what is in their hearts. Say, \"Mock [as you wish]; indeed, Allāh will expose that which you fear.\"",
            "english_hilali_khan": "The hypocrites fear lest a Sûrah (chapter of the Qur’ân) should be revealed about them, showing them what is in their hearts. Say: \"(Go ahead and) mock! But certainly Allâh will bring to light all that you fear.\"",
            "english_rwwad": "The hypocrites fear that a chapter should be sent down about them, informing [the believers] of what is in their hearts. Say [O Prophet], “Keep on mocking! Allah will certainly expose what you fear.”"
        }
    },
    {
        "id": 1299,
        "chapter": 9,
        "verse": 65,
        "arabic_text": "وَلَئِن سَأَلۡتَهُمۡ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلۡعَبُۚ قُلۡ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمۡ تَسۡتَهۡزِءُونَ",
        "phonetic": "9.65 Wa La'in Sa'altahum Layaqūlunna 'Innamā Kunnā Nakhūđu Wa Nal`abu Qul 'Abiālllahi Wa 'Āyātihi Wa Rasūlihi Kuntum Tastahzi'ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you ask them, they will surely say, \"We were only conversing and playing.\" Say, \"Is it Allāh and His verses and His Messenger that you were mocking?\"",
            "english_hilali_khan": "If you ask them (about this), they declare: \"We were only talking idly and joking.\" Say: \"Was it at Allâh (عز وجل), and His Ayât (proofs, evidence, verses, lessons, signs, revelations) and His Messenger (صلى الله عليه وسلم) that you were mocking?\"",
            "english_rwwad": "If you question them, they will surely say, “We were only indulging in idle talk and playing.” Say, “Was it Allah, His verses and His Messenger that you were mocking?”"
        }
    },
    {
        "id": 1300,
        "chapter": 9,
        "verse": 66,
        "arabic_text": "لَا تَعۡتَذِرُواْ قَدۡ كَفَرۡتُم بَعۡدَ إِيمَٰنِكُمۡۚ إِن نَّعۡفُ عَن طَآئِفَةٖ مِّنكُمۡ نُعَذِّبۡ طَآئِفَةَۢ بِأَنَّهُمۡ كَانُواْ مُجۡرِمِينَ",
        "phonetic": "9.66 Lā Ta`tadhirū Qad Kafartum Ba`da 'Īmānikum 'In Na`fu `An Ţā'ifatin Minkum Nu`adhib Ţā'ifatan Bi'annahum Kānū Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Make no excuse; you have disbelieved [i.e., rejected faith] after your belief. If We pardon one faction of you - We will punish another faction because they were criminals.",
            "english_hilali_khan": "Make no excuse; you disbelieved after you had believed. If We pardon some of you, We will punish others amongst you because they were Mujrimûn (disbelievers, polytheists, sinners, criminals.).",
            "english_rwwad": "Make no excuses; you have disbelieved after having believed. If We pardon some of you, We will punish others because they are wicked."
        }
    },
    {
        "id": 1301,
        "chapter": 9,
        "verse": 67,
        "arabic_text": "ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ بَعۡضُهُم مِّنۢ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمُنكَرِ وَيَنۡهَوۡنَ عَنِ ٱلۡمَعۡرُوفِ وَيَقۡبِضُونَ أَيۡدِيَهُمۡۚ نَسُواْ ٱللَّهَ فَنَسِيَهُمۡۚ إِنَّ ٱلۡمُنَٰفِقِينَ هُمُ ٱلۡفَٰسِقُونَ",
        "phonetic": "9.67 Al-Munāfiqūna Wa Al-Munāfiqātu Ba`đuhum Min Ba`đin Ya'murūna Bil-Munkari Wa Yanhawna `Ani Al-Ma`rūfi Wa Yaqbiđūna 'Aydiyahum Nasū Allāha Fanasiyahum 'Inna Al-Munāfiqīna Humu Al-Fāsiqūna",
        "footnotes": {
            "english_saheeh": "[491]- i.e., refuse to spend in the way of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The hypocrite men and hypocrite women are of one another. They enjoin what is wrong and forbid what is right and close their hands.[491] They have forgotten Allāh, so He has forgotten them [accordingly]. Indeed, the hypocrites - it is they who are the defiantly disobedient.",
            "english_hilali_khan": "The hypocrites, men and women, are one from another; they enjoin (on the people) Al-Munkar (i.e. disbelief and polytheism of all kinds and all that Islâm has forbidden), and forbid (people) from Al-Ma‘rûf (i.e. Islâmic Monotheism and all that Islâm orders one to do), and they close their hands [from giving (spending in Allâh’s Cause) alms]. They have forgotten Allâh, so He has forgotten them. Verily, the hypocrites are the Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "The hypocrites, both men and women, are all alike; they enjoin what is evil and forbid what is good, and they withhold their hands [from giving]. They forgot Allah, so He forgot them. Indeed, the hypocrites are the rebellious."
        }
    },
    {
        "id": 1302,
        "chapter": 9,
        "verse": 68,
        "arabic_text": "وَعَدَ ٱللَّهُ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡكُفَّارَ نَارَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۚ هِيَ حَسۡبُهُمۡۚ وَلَعَنَهُمُ ٱللَّهُۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ",
        "phonetic": "9.68 Wa`ada Allāhu Al-Munāfiqīna Wa Al-Munāfiqāti Wa Al-Kuffāra Nāra Jahannama Khālidīna Fīhā Hiya Ĥasbuhum Wa La`anahumu Allāhu Wa Lahum `Adhābun Muqīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has promised the hypocrite men and hypocrite women and the disbelievers the fire of Hell, wherein they will abide eternally. It is sufficient for them. And Allāh has cursed them, and for them is an enduring punishment.",
            "english_hilali_khan": "Allâh has promised the hypocrites - men and women - and the disbelievers, the Fire of Hell; therein shall they abide. It will suffice them. Allâh has cursed them and for them is the lasting torment.",
            "english_rwwad": "Allah has promised the hypocrites, both men and women, and the disbelievers the Fire of Hell, abiding therein forever – it is sufficient for them. Allah has cursed them, and for them there will be an everlasting punishment."
        }
    },
    {
        "id": 1303,
        "chapter": 9,
        "verse": 69,
        "arabic_text": "كَٱلَّذِينَ مِن قَبۡلِكُمۡ كَانُوٓاْ أَشَدَّ مِنكُمۡ قُوَّةٗ وَأَكۡثَرَ أَمۡوَٰلٗا وَأَوۡلَٰدٗا فَٱسۡتَمۡتَعُواْ بِخَلَٰقِهِمۡ فَٱسۡتَمۡتَعۡتُم بِخَلَٰقِكُمۡ كَمَا ٱسۡتَمۡتَعَ ٱلَّذِينَ مِن قَبۡلِكُم بِخَلَٰقِهِمۡ وَخُضۡتُمۡ كَٱلَّذِي خَاضُوٓاْۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "9.69 Kālladhīna Min Qablikum Kānū 'Ashadda Minkum Qūwatan Wa 'Akthara 'Amwālāan Wa 'Awlādāan Fāstamta`ū Bikhalāqihim Fāstamta`tum Bikhalāqikum Kamā Astamta`a Al-Ladhīna Min Qablikum Bikhalāqihim Wa Khuđtum Kālladhī Khāđū 'Ūlā'ika Ĥabiţat 'A`māluhum Fī Ad-Dunyā Wa Al-'Ākhirati Wa 'Ūlā'ika Humu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[You disbelievers are] like those before you; they were stronger than you in power and more abundant in wealth and children. They enjoyed their portion [of worldly enjoyment], and you have enjoyed your portion as those before you enjoyed their portion, and you have engaged [in vanities] like that in which they engaged. [It is] those whose deeds have become worthless in this world and in the Hereafter, and it is they who are the losers.",
            "english_hilali_khan": "Like those before you: they were mightier than you in power, and more abundant in wealth and children. They had enjoyed their portion (awhile), so enjoy your portion (awhile) as those before you enjoyed their portion (awhile); and you indulged in play and pastime (and in telling lies against Allâh and His Messenger Muhammad صلى الله عليه وسلم) as they indulged in play and pastime. Such are they whose deeds are in vain in this world and in the Hereafter. Such are they who are the losers.",
            "english_rwwad": "[O hypocrites, you are] like those who came before you, who were more powerful than you and more abundant in wealth and children. They enjoyed their share, and you too have enjoyed your share just as those who came before you enjoyed their share; and you have indulged in idle talk just as they did. Such are those whose deeds have become worthless in this world and in the Hereafter; it is they who are the losers."
        }
    },
    {
        "id": 1304,
        "chapter": 9,
        "verse": 70,
        "arabic_text": "أَلَمۡ يَأۡتِهِمۡ نَبَأُ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَقَوۡمِ إِبۡرَٰهِيمَ وَأَصۡحَٰبِ مَدۡيَنَ وَٱلۡمُؤۡتَفِكَٰتِۚ أَتَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ",
        "phonetic": "9.70 'Alam Ya'tihim Naba'u Al-Ladhīna Min Qablihim Qawmi Nūĥin Wa `Ādin Wa Thamūda Wa Qawmi 'Ibrāhīma Wa 'Aşĥābi Madyana Wa Al-Mu'utafikāti 'Atat/hum Rusuluhum Bil-Bayyināti Famā Kāna Allāhu Liyažlimahum Wa Lakin Kānū 'Anfusahum Yažlimūna",
        "footnotes": {
            "english_saheeh": "[492]- i.e., those to which Lot was sent and which earned for themselves Allāh's punishment.  See 11:82-83.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Has there not reached them the news of those before them - the people of Noah and [the tribes of] ʿAad and Thamūd and the people of Abraham and the companions [i.e., dwellers] of Madyan and the towns overturned?[492] Their messengers came to them with clear proofs. And Allāh would never have wronged them, but they were wronging themselves.",
            "english_hilali_khan": "Has not the story reached them of those before them? - The people of Nûh (Noah), ‘Âd, and Thamûd, the people of Ibrâhîm (Abraham), the dwellers of Madyan (Midian) and the cities overthrown [i.e. the people to whom Lût (Lot) preached]; to them came their Messengers with clear proofs. So it was not Allâh Who wronged them, but they used to wrong themselves.",
            "english_rwwad": "Have they not received the stories of those who came before them: the people of Noah, ‘Ād, Thamūd, the people of Abraham, the dwellers of Midian, and the overturned cities [of Lot]? Their messengers came to them with clear signs. It was not Allah who wronged them, but it was they who wronged themselves."
        }
    },
    {
        "id": 1305,
        "chapter": 9,
        "verse": 71,
        "arabic_text": "وَٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓۚ أُوْلَٰٓئِكَ سَيَرۡحَمُهُمُ ٱللَّهُۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ",
        "phonetic": "9.71 Wa Al-Mu'uminūna Wa Al-Mu'uminātu Ba`đuhum 'Awliyā'u Ba`đin Ya'murūna Bil-Ma`rūfi Wa Yanhawna `Ani Al-Munkari Wa Yuqīmūna Aş-Şalāata Wa Yu'utūna Az-Zakāata Wa Yuţī`ūna Allāha Wa Rasūlahu 'Ūlā'ika Sayarĥamuhumu Allāhu 'Inna Allāha `Azīzun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give zakāh and obey Allāh and His Messenger. Those - Allāh will have mercy upon them. Indeed, Allāh is Exalted in Might and Wise.",
            "english_hilali_khan": "The believers, men and women, are Auliyâ’ (helpers, supporters, friends, protectors) of one another; they enjoin (on the people) Al-Ma‘rûf (i.e. Islâmic Monotheism and all that Islâm orders one to do), and forbid (people) from Al-Munkar (i.e. polytheism and disbelief of all kinds, and all that Islâm has forbidden); they perform As-Salât (Iqâmat-as-Salât), and give the Zakât, and obey Allâh and His Messenger. Allâh will have His Mercy on them. Surely Allâh is All-Mighty, All-Wise.",
            "english_rwwad": "The believers, both men and women, are allies of one another; they enjoin what is good and forbid what is evil, they establish prayer, give zakah and obey Allah and His Messenger. It is they who will receive Allah’s mercy, for Allah is All-Mighty, All-Wise."
        }
    },
    {
        "id": 1306,
        "chapter": 9,
        "verse": 72,
        "arabic_text": "وَعَدَ ٱللَّهُ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَمَسَٰكِنَ طَيِّبَةٗ فِي جَنَّٰتِ عَدۡنٖۚ وَرِضۡوَٰنٞ مِّنَ ٱللَّهِ أَكۡبَرُۚ ذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "9.72 Wa`ada Allāhu Al-Mu'uminīna Wa Al-Mu'umināti Jannātin Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā Wa Masākina Ţayyibatan Fī Jannāti `Adnin Wa Riđwānun Mina Allāhi 'Akbaru Dhālika Huwa Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has promised the believing men and believing women gardens beneath which rivers flow, wherein they abide eternally, and pleasant dwellings in gardens of perpetual residence; but approval from Allāh is greater. It is that which is the great attainment.",
            "english_hilali_khan": "Allâh has promised the believers - men and women, - Gardens under which rivers flow to dwell therein forever, and beautiful mansions in Gardens of ‘Adn (Eden Paradise). But the greatest bliss is the Good Pleasure of Allâh. That is the supreme success.",
            "english_rwwad": "Allah has promised the believers, both men and women, gardens under which rivers flow, abiding therein forever, and splendid dwellings in the Gardens of Eternity, and Allah’s pleasure, which is the greatest of all; that is the supreme triumph."
        }
    },
    {
        "id": 1307,
        "chapter": 9,
        "verse": 73,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ",
        "phonetic": "9.73 Yā 'Ayyuhā An-Nabīyu Jāhidi Al-Kuffāra Wa Al-Munāfiqīna Wa Aghluž `Alayhim Wa Ma'wāhum Jahannamu Wa Bi'sa Al-Maşīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Prophet, fight against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.",
            "english_hilali_khan": "O Prophet (Muhammad صلى الله عليه وسلم)! Strive hard against the disbelievers and the hypocrites, and be harsh against them, their abode is Hell, - and worst indeed is that destination.",
            "english_rwwad": "O Prophet, strive against the disbelievers and the hypocrites, and be harsh with them. Their abode is Hell. What a terrible destination!"
        }
    },
    {
        "id": 1308,
        "chapter": 9,
        "verse": 74,
        "arabic_text": "يَحۡلِفُونَ بِٱللَّهِ مَا قَالُواْ وَلَقَدۡ قَالُواْ كَلِمَةَ ٱلۡكُفۡرِ وَكَفَرُواْ بَعۡدَ إِسۡلَٰمِهِمۡ وَهَمُّواْ بِمَا لَمۡ يَنَالُواْۚ وَمَا نَقَمُوٓاْ إِلَّآ أَنۡ أَغۡنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضۡلِهِۦۚ فَإِن يَتُوبُواْ يَكُ خَيۡرٗا لَّهُمۡۖ وَإِن يَتَوَلَّوۡاْ يُعَذِّبۡهُمُ ٱللَّهُ عَذَابًا أَلِيمٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَمَا لَهُمۡ فِي ٱلۡأَرۡضِ مِن وَلِيّٖ وَلَا نَصِيرٖ",
        "phonetic": "9.74 Yaĥlifūna Billāhi Mā Qālū Wa Laqad Qālū Kalimata Al-Kufri Wa Kafarū Ba`da 'Islāmihim Wa Hammū Bimā Lam Yanālū Wa Mā Naqamū 'Illā 'An 'Aghnāhumu Allāhu Wa Rasūluhu Min Fađlihi Fa'in Yatūbū Yaku Khayrāan Lahum Wa 'In Yatawallaw Yu`adhibhumu Allāhu `Adhābāan 'Alīmāan Fī Ad-Dunyā Wa Al-'Ākhirati Wa Mā Lahum Fī Al-'Arđi Min Wa Līyin Wa Lā Naşīrin",
        "footnotes": {
            "english_saheeh": "[493]- i.e., the murder of Prophet Muḥammad (ﷺ).\n[494]- i.e., for no reason.  On the contrary, they should have been grateful.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They swear by Allāh that they did not say [anything against the Prophet (ﷺ)] while they had said the word of disbelief and disbelieved after their [pretense of] Islām and planned that which they were not to attain.[493] And they were not resentful except [for the fact] that Allāh and His Messenger had enriched them of His bounty.[494] So if they repent, it is better for them; but if they turn away, Allāh will punish them with a painful punishment in this world and the Hereafter. And there will not be for them on earth any protector or helper.",
            "english_hilali_khan": "They swear by Allâh that they said nothing (bad), but really they said the word of disbelief, and they disbelieved after accepting Islâm, and they resolved that (plot to murder Prophet Muhammad صلى الله عليه وسلم) which they were unable to carry out, and they could not find any cause to do so except that Allâh and His Messenger had enriched them of His Bounty. If then they repent, it will be better for them, but if they turn away, Allâh will punish them with a painful torment in this worldly life and in the Hereafter. And there is none for them on earth as a Walî (supporter, protector) or a helper.",
            "english_rwwad": "They swear by Allah that they said nothing [blasphemous], while they indeed uttered a word of blasphemy, and disbelieved after accepting Islam, and plotted what they could not achieve. They are spiteful [against believers] for no reason except that Allah and His Messenger have enriched them out of His bounty. If they repent, it will be better for them, but if they turn away, Allah will chastise them with a painful punishment in this world and in the Hereafter, and they will have on earth no protector or helper."
        }
    },
    {
        "id": 1309,
        "chapter": 9,
        "verse": 75,
        "arabic_text": "۞ وَمِنۡهُم مَّنۡ عَٰهَدَ ٱللَّهَ لَئِنۡ ءَاتَىٰنَا مِن فَضۡلِهِۦ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ ٱلصَّٰلِحِينَ",
        "phonetic": "9.75 Wa Minhum Man `Āhada Allāha La'in 'Ātānā Min Fađlihi Lanaşşaddaqanna Wa Lanakūnanna Mina Aş-Şāliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among them are those who made a covenant with Allāh, [saying], \"If He should give us from His bounty, we will surely spend in charity, and we will surely be among the righteous.\"",
            "english_hilali_khan": "And of them are some who made a covenant with Allâh (saying): \"If He bestowed on us of His Bounty, we will verily give Sadaqâh (Zakât and voluntary charity in Allâh’s Cause) and will be certainly among those who are righteous.\"",
            "english_rwwad": "There are some among them who made a covenant with Allah: “If He gives us out of His bounty, we will surely spend in charity and be among the righteous.”"
        }
    },
    {
        "id": 1310,
        "chapter": 9,
        "verse": 76,
        "arabic_text": "فَلَمَّآ ءَاتَىٰهُم مِّن فَضۡلِهِۦ بَخِلُواْ بِهِۦ وَتَوَلَّواْ وَّهُم مُّعۡرِضُونَ",
        "phonetic": "9.76 Falammā 'Ātāhum Min Fađlihi Bakhilū Bihi Wa Tawallaw Wa Hum Mu`riđūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when He gave them from His bounty, they were stingy with it and turned away while they refused.",
            "english_hilali_khan": "Then when He gave them of His Bounty, they became niggardly [refused to pay the Sadaqâh (Zakât or voluntary charity)], and turned away, averse.",
            "english_rwwad": "But when He did give them out of His bounty, they grew stingy and turned away in aversion."
        }
    },
    {
        "id": 1311,
        "chapter": 9,
        "verse": 77,
        "arabic_text": "فَأَعۡقَبَهُمۡ نِفَاقٗا فِي قُلُوبِهِمۡ إِلَىٰ يَوۡمِ يَلۡقَوۡنَهُۥ بِمَآ أَخۡلَفُواْ ٱللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكۡذِبُونَ",
        "phonetic": "9.77 Fa'a`qabahum Nifāqāan Fī Qulūbihim 'Ilá Yawmi Yalqawnahu Bimā 'Akhlafū Allāha Mā Wa`adūhu Wa Bimā Kānū Yakdhibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So He penalized them with hypocrisy in their hearts until the Day they will meet Him - because they failed Allāh in what they promised Him and because they [habitually] used to lie.",
            "english_hilali_khan": "So He punished them by putting hypocrisy into their hearts till the Day whereon they shall meet Him, because they broke that (covenant with Allâh) which they had promised to Him and because they used to tell lies.",
            "english_rwwad": "So as a consequence He caused hypocrisy to take root in their hearts until the Day when they will meet Him, because of breaking their promise to Allah, and because of their persistent lying."
        }
    },
    {
        "id": 1312,
        "chapter": 9,
        "verse": 78,
        "arabic_text": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ سِرَّهُمۡ وَنَجۡوَىٰهُمۡ وَأَنَّ ٱللَّهَ عَلَّٰمُ ٱلۡغُيُوبِ",
        "phonetic": "9.78 'Alam Ya`lamū 'Anna Allāha Ya`lamu Sirrahum Wa Najwāhum Wa 'Anna Allāha `Allāmu Al-Ghuyūbi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:78) See F.N. of (V.11:18).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Did they not know that Allāh knows their secrets and their private conversations and that Allāh is the Knower of the unseen?",
            "english_hilali_khan": "Know they not that Allâh knows their secret ideas, and their Najwa [1] (secret counsels), and that Allâh is the All-Knower of things unseen.",
            "english_rwwad": "Do they not know that Allah knows their secret and private conversations, and that Allah is the All-Knower of all unseen?"
        }
    },
    {
        "id": 1313,
        "chapter": 9,
        "verse": 79,
        "arabic_text": "ٱلَّذِينَ يَلۡمِزُونَ ٱلۡمُطَّوِّعِينَ مِنَ ٱلۡمُؤۡمِنِينَ فِي ٱلصَّدَقَٰتِ وَٱلَّذِينَ لَا يَجِدُونَ إِلَّا جُهۡدَهُمۡ فَيَسۡخَرُونَ مِنۡهُمۡ سَخِرَ ٱللَّهُ مِنۡهُمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ",
        "phonetic": "9.79 Al-Ladhīna Yalmizūna Al-Muţţawwi`īna Mina Al-Mu'uminīna Fī Aş-Şadaqāti Wa Al-Ladhīna Lā Yajidūna 'Illā Juhdahum Fayaskharūna Minhum Sakhira Allāhu Minhum Wa Lahum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who criticize the contributors among the believers concerning [their] charities and [criticize] the ones who find nothing [to spend] except their effort, so they ridicule them - Allāh will ridicule them, and they will have a painful punishment.",
            "english_hilali_khan": "Those who defame such of the believers who give charity (in Allâh’s Cause) voluntarily, and such who could not find to give charity (in Allâh’s Cause) except what is available to them - so they mock at them (believers); Allâh will throw back their mockery on them, and they shall have a painful torment.",
            "english_rwwad": "Those who disparage the believers who voluntarily give charities and ridicule them for having nothing to give except their effort. Allah will ridicule them, and for them there will be a painful punishment."
        }
    },
    {
        "id": 1314,
        "chapter": 9,
        "verse": 80,
        "arabic_text": "ٱسۡتَغۡفِرۡ لَهُمۡ أَوۡ لَا تَسۡتَغۡفِرۡ لَهُمۡ إِن تَسۡتَغۡفِرۡ لَهُمۡ سَبۡعِينَ مَرَّةٗ فَلَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ ذَٰلِكَ بِأَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ",
        "phonetic": "9.80 Astaghfir Lahum 'Aw Lā Tastaghfir Lahum 'In Tastaghfir Lahum Sab`īna Marratan Falan Yaghfira Allāhu Lahum Dhālika Bi'annahum Kafarū Billāhi Wa Rasūlihi Wa Allāhu Lā Yahdī Al-Qawma Al-Fāsiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Ask forgiveness for them, [O Muḥammad], or do not ask forgiveness for them. If you should ask forgiveness for them seventy times - never will Allāh forgive them. That is because they disbelieved in Allāh and His Messenger, and Allāh does not guide the defiantly disobedient people.",
            "english_hilali_khan": "Whether you (O Muhammad صلى الله عليه وسلم) ask forgiveness for them (hypocrites) or ask not forgiveness for them - (and even) if you ask seventy times for their forgiveness - Allâh will not forgive them because they have disbelieved in Allâh and His Messenger (Muhammad صلى الله عليه وسلم). And Allâh guides not those people who are Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "Whether you [O Prophet] seek forgiveness for them or not, even if you seek forgiveness for them seventy times, Allah will never forgive them; that is because they disbelieved in Allah and His Messenger. Allah does not guide the rebellious people."
        }
    },
    {
        "id": 1315,
        "chapter": 9,
        "verse": 81,
        "arabic_text": "فَرِحَ ٱلۡمُخَلَّفُونَ بِمَقۡعَدِهِمۡ خِلَٰفَ رَسُولِ ٱللَّهِ وَكَرِهُوٓاْ أَن يُجَٰهِدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَقَالُواْ لَا تَنفِرُواْ فِي ٱلۡحَرِّۗ قُلۡ نَارُ جَهَنَّمَ أَشَدُّ حَرّٗاۚ لَّوۡ كَانُواْ يَفۡقَهُونَ",
        "phonetic": "9.81 Fariĥa Al-Mukhallafūna Bimaq`adihim Khilāfa Rasūli Allāhi Wa Karihū 'An Yujāhidū Bi'amwālihim Wa 'Anfusihim Fī Sabīli Allāhi Wa Qālū Lā Tanfirū Fī Al-Ĥarri Qul Nāru Jahannama 'Ashaddu Ĥarrāan Law Kānū Yafqahūna",
        "footnotes": {
            "english_saheeh": "[495]- Literally, \"were left behind [as Allāh willed]\" due to their false excuses having been accepted by the Prophet (ﷺ).  While pleased with their assumed deception, in reality, Allāh had prevented their participation knowing of their hypocrisy and evil intent.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who remained behind[495] rejoiced in their staying [at home] after [the departure of] the Messenger of Allāh and disliked to strive with their wealth and their lives in the cause of Allāh and said, \"Do not go forth in the heat.\" Say, \"The fire of Hell is more intense in heat\" - if they would but understand.",
            "english_hilali_khan": "Those who stayed away (from Tabuk expedition) rejoiced in their staying behind the Messenger of Allâh; they hated to strive and fight with their properties and their lives in the Cause of Allâh, and they said: \"March not forth in the heat.\" Say: \"The Fire of Hell is more intense in heat\"; if only they could understand!",
            "english_rwwad": "Those who remained behind rejoiced for doing so in defiance of the Messenger of Allah, and disliked to strive in the cause of Allah with their wealth and their lives, and said, “Do not march forth in this heat.” Say, “The Fire of Hell is more intense in heat.” – If only they could understand!"
        }
    },
    {
        "id": 1316,
        "chapter": 9,
        "verse": 82,
        "arabic_text": "فَلۡيَضۡحَكُواْ قَلِيلٗا وَلۡيَبۡكُواْ كَثِيرٗا جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "9.82 Falyađĥakū Qalīlāan Wa Līabkū Kathīrāan Jazā'an Bimā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So let them laugh a little and [then] weep much as recompense for what they used to earn.",
            "english_hilali_khan": "So let them laugh a little and (they will) cry much as a recompense of what they used to earn (by committing sins).",
            "english_rwwad": "Let them laugh a little and weep a lot as a recompense for what they used to do."
        }
    },
    {
        "id": 1317,
        "chapter": 9,
        "verse": 83,
        "arabic_text": "فَإِن رَّجَعَكَ ٱللَّهُ إِلَىٰ طَآئِفَةٖ مِّنۡهُمۡ فَٱسۡتَـٔۡذَنُوكَ لِلۡخُرُوجِ فَقُل لَّن تَخۡرُجُواْ مَعِيَ أَبَدٗا وَلَن تُقَٰتِلُواْ مَعِيَ عَدُوًّاۖ إِنَّكُمۡ رَضِيتُم بِٱلۡقُعُودِ أَوَّلَ مَرَّةٖ فَٱقۡعُدُواْ مَعَ ٱلۡخَٰلِفِينَ",
        "phonetic": "9.83 Fa'in Raja`aka Allāhu 'Ilá Ţā'ifatin Minhum Fāsta'dhanūka Lilkhurūji Faqul Lan Takhrujū Ma`iya 'Abadāan Wa Lan Tuqātilū Ma`iya `Adūwāan 'Innakum Rađītum Bil-Qu`ūdi 'Awwala Marratin Fāq`udū Ma`a Al-Khālifīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If Allāh should return you to a faction of them [after the expedition] and then they ask your permission to go out [to battle], say, \"You will not go out with me, ever, and you will never fight with me an enemy. Indeed, you were satisfied with sitting [at home] the first time, so sit [now] with those who stay behind.\"",
            "english_hilali_khan": "If Allâh brings you back to a party of them (the hypocrites), and they ask your permission to go out (to fight), say: \"Never shall you go out with me nor fight an enemy with me; you were pleased to sit (inactive) on the first occasion, then you sit (now) with those who lag behind.\"",
            "english_rwwad": "If Allah brings you back to a group of them and they ask your permission to go forth with you, say, “You will never go forth with me, nor will you ever fight an enemy with me. You were content to remain behind the first time, so now stay with those who remained behind.”"
        }
    },
    {
        "id": 1318,
        "chapter": 9,
        "verse": 84,
        "arabic_text": "وَلَا تُصَلِّ عَلَىٰٓ أَحَدٖ مِّنۡهُم مَّاتَ أَبَدٗا وَلَا تَقُمۡ عَلَىٰ قَبۡرِهِۦٓۖ إِنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦ وَمَاتُواْ وَهُمۡ فَٰسِقُونَ",
        "phonetic": "9.84 Wa Lā Tuşalli `Alá 'Aĥadin Minhum Māta 'Abadāan Wa Lā Taqum `Alá Qabrihi 'Innahum Kafarū Billāhi Wa Rasūlihi Wa Mātū Wa Hum Fāsiqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not pray [the funeral prayer, O Muḥammad], over any of them who has died - ever - or stand at his grave. Indeed, they disbelieved in Allāh and His Messenger and died while they were defiantly disobedient.",
            "english_hilali_khan": "And never (O Muhammad صلى الله عليه وسلم) pray (funeral prayer) for any of them (hypocrites) who dies, nor stand at his grave. Certainly they disbelieved in Allâh and His Messenger, and died while they were Fâsiqûn (rebellious, - disobedient to Allâh and His Messenger صلى الله عليه وسلم).",
            "english_rwwad": "Never offer funeral prayer for any of them who dies, nor stand by his grave, for they have disbelieved in Allah and His Messenger, and died as evildoers."
        }
    },
    {
        "id": 1319,
        "chapter": 9,
        "verse": 85,
        "arabic_text": "وَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَأَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ أَن يُعَذِّبَهُم بِهَا فِي ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ",
        "phonetic": "9.85 Wa Lā Tu`jibka 'Amwāluhum Wa 'Awlāduhum 'Innamā Yurīdu Allāhu 'An Yu`adhibahum Bihā Fī Ad-Dunyā Wa Tazhaqa 'Anfusuhum Wa Hum Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And let not their wealth and their children impress you. Allāh only intends to punish them through them in this world and that their souls should depart [at death] while they are disbelievers.",
            "english_hilali_khan": "And let not their wealth or their children amaze you. Allâh’s Plan is to punish them with these things in this world, and that their souls shall depart (die) while they are disbelievers.",
            "english_rwwad": "Do not let their wealth or their children impress you; Allah only intends to punish them with these things in this world, and to let their souls depart while they are disbelievers."
        }
    },
    {
        "id": 1320,
        "chapter": 9,
        "verse": 86,
        "arabic_text": "وَإِذَآ أُنزِلَتۡ سُورَةٌ أَنۡ ءَامِنُواْ بِٱللَّهِ وَجَٰهِدُواْ مَعَ رَسُولِهِ ٱسۡتَـٔۡذَنَكَ أُوْلُواْ ٱلطَّوۡلِ مِنۡهُمۡ وَقَالُواْ ذَرۡنَا نَكُن مَّعَ ٱلۡقَٰعِدِينَ",
        "phonetic": "9.86 Wa 'Idhā 'Unzilat Sūratun 'An 'Āminū Billāhi Wa Jāhidū Ma`a Rasūlihi Asta'dhanaka 'Ūlū Aţ-Ţawli Minhum Wa Qālū Dharnā Nakun Ma`a Al-Qā`idīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when a sūrah was revealed [enjoining them] to believe in Allāh and to fight with His Messenger, those of wealth among them asked your permission [to stay back] and said, \"Leave us to be with them who sit [at home].\"",
            "english_hilali_khan": "And when a Sûrah (chapter from the Qur’ân) is revealed, enjoining them to believe in Allâh and to strive hard and fight along with His Messenger, the wealthy among them ask your leave to exempt them (from Jihâd) and say, \"Leave us (behind), we would be with those who sit (at home).\"",
            "english_rwwad": "Whenever a Chapter is sent down [saying], “Believe in Allah and fight along with His Messenger,” the affluent among them would ask you to excuse them, saying, “Let us remain with those who stay behind.”"
        }
    },
    {
        "id": 1321,
        "chapter": 9,
        "verse": 87,
        "arabic_text": "رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ",
        "phonetic": "9.87 Rađū Bi'an Yakūnū Ma`a Al-Khawālifi Wa Ţubi`a `Alá Qulūbihim Fahum Lā Yafqahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They were satisfied to be with those who stay behind, and their hearts were sealed over, so they do not understand.",
            "english_hilali_khan": "They are content to be with those (the women) who sit behind (at home). Their hearts are sealed up (from all kinds of goodness and right guidance), so they understand not.",
            "english_rwwad": "They are content to be with those helpless who stay behind; their hearts have been sealed, so that they do not understand."
        }
    },
    {
        "id": 1322,
        "chapter": 9,
        "verse": 88,
        "arabic_text": "لَٰكِنِ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ جَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡۚ وَأُوْلَٰٓئِكَ لَهُمُ ٱلۡخَيۡرَٰتُۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
        "phonetic": "9.88 Lakini Ar-Rasūlu Wa Al-Ladhīna 'Āmanū Ma`ahu Jāhadū Bi'amwālihim Wa 'Anfusihim Wa 'Ūlā'ika Lahumu Al-Khayrātu Wa 'Ūlā'ika Humu Al-Mufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But the Messenger and those who believed with him fought with their wealth and their lives. Those will have [all that is] good and it is those who are the successful.",
            "english_hilali_khan": "But the Messenger (Muhammad صلى الله عليه وسلم) and those who believed with him (in Islâmic Monotheism) strove hard and fought with their wealth and their lives (in Allâh’s Cause). Such are they for whom are the good things, and it is they who will be successful.",
            "english_rwwad": "But the Messenger and those who believe with him strive with their wealth and their lives. It is they who will have all kinds of good, and it is they who are the successful."
        }
    },
    {
        "id": 1323,
        "chapter": 9,
        "verse": 89,
        "arabic_text": "أَعَدَّ ٱللَّهُ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "9.89 'A`adda Allāhu Lahum Jannātin Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā Dhālika Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has prepared for them gardens beneath which rivers flow, wherein they will abide eternally. That is the great attainment.",
            "english_hilali_khan": "For them Allâh has got ready Gardens (Paradise) under which rivers flow, to dwell therein forever. That is the supreme success.",
            "english_rwwad": "Allah has prepared for them gardens under which rivers flow, abiding therein forever; that is the supreme triumph."
        }
    },
    {
        "id": 1324,
        "chapter": 9,
        "verse": 90,
        "arabic_text": "وَجَآءَ ٱلۡمُعَذِّرُونَ مِنَ ٱلۡأَعۡرَابِ لِيُؤۡذَنَ لَهُمۡ وَقَعَدَ ٱلَّذِينَ كَذَبُواْ ٱللَّهَ وَرَسُولَهُۥۚ سَيُصِيبُ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابٌ أَلِيمٞ",
        "phonetic": "9.90 Wa Jā'a Al-Mu`adhirūna Mina Al-'A`rābi Liyu'udhana Lahum Wa Qa`ada Al-Ladhīna Kadhabū Allāha Wa Rasūlahu Sayuşību Al-Ladhīna Kafarū Minhum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "[496]- i.e., claimed faith.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those with excuses among the bedouins came to be permitted [to remain], and they who had lied[496] to Allāh and His Messenger sat [at home]. There will strike those who disbelieved among them a painful punishment.",
            "english_hilali_khan": "And those who made excuses from the bedouins came (to you, O Prophet صلى الله عليه وسلم) asking your permission to exempt them (from the battle), and those who had lied to Allâh and His Messenger sat at home (without asking the permission for it); a painful torment will seize those of them who disbelieve.",
            "english_rwwad": "Some of the Bedouin came with excuses, seeking to be exempted, while others who lied to Allah and His Messenger stayed behind. Those who disbelieved among them will be afflicted with a painful punishment."
        }
    },
    {
        "id": 1325,
        "chapter": 9,
        "verse": 91,
        "arabic_text": "لَّيۡسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلۡمَرۡضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُواْ لِلَّهِ وَرَسُولِهِۦۚ مَا عَلَى ٱلۡمُحۡسِنِينَ مِن سَبِيلٖۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
        "phonetic": "9.91 Laysa `Alá Ađ-Đu`afā'i Wa Lā `Alá Al-Marđá Wa Lā `Alá Al-Ladhīna Lā Yajidūna Mā Yunfiqūna Ĥarajun 'Idhā Naşaĥū Lillāhi Wa Rasūlihi Mā `Alá Al-Muĥsinīna Min Sabīlin Wa Allāhu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:91) CHAPTER. The Statement of the Prophet صلى الله عليه وسلم : \"Religion is An-Nasîhah (to be sincere and true) to: 1. Allâh جل جلاله i.e. [obeying Him, by following His Religion of Islamic Monotheism, attributing to Him what He deserves and doing Jihâd for His sake and to believe in Him, to fear Him much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Him much (perform all kinds of good deeds which He has ordained)], 2. to Allâh’s Messenger [i.e., to respect him greatly and to believe that he (صلى الله عليه وسلم) is Allâh’s Messenger, and to fight on his behalf both in his lifetime and after his death and to follow his Sunnah - (legal ways)] 3. to the Muslim rulers [i.e. to help them in their job of leading Muslims to the right path and alarm them if they are heedless] and 4. to all the Muslims (in common) [i.e. to order them for Al-Ma‘rûf (i.e. Islâmic Monotheism, and all that Islâm orders one to do), and to forbid them from Al-Munkar (i.e. disbelief, polytheism of all kinds, and all that Islâm has forbidden), and to be merciful and kind to them].\nAnd the Statement of Allâh تعالى : \"If they are sincere and true (in duty) to Allâh (جل جلاله) and His Messenger (Muhammad صلى الله عليه وسلم).\" (V.9:91)\nNarrated, Jarîr bin Abdullâh رضي الله عنه : I gave the Bai‘a (pledge) to Allâh’s Messenger صلى الله عليه وسلم for the following:\n1. Iqâmat-as-Salât (to perform prayers).\n2. To pay the Zakât .\n3. And to be sincere and true to every Muslim [i.e. to order them for Al-Ma‘rûf (i.e. Islâmic Monotheism, and all that Islâm orders one to do), and to forbid them from Al-Munkar (i.e. disbelief, polytheism of all kinds, and all that Islâm has forbidden), and to help them, and to be merciful and kind to them]. (Sahih Al-Bukhâri, Vol.1, Hadîth No.54 and its Chapter No.43).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There is not upon the weak or upon the ill or upon those who do not find anything to spend any discomfort [i.e., guilt] when they are sincere to Allāh and His Messenger. There is not upon the doers of good any cause [for blame]. And Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "There is no blame on those who are weak or ill or who find no resources to spend [in holy fighting (Jihâd)], if they are sincere and true (in duty) to Allâh and His Messenger.[1] No ground (of complaint) can there be against the Muhsinûn (good-doers - See the footnote of V.9:120). And Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "There is no blame on the weak, the sick, or those who have nothing to spend, as long as they are sincere to Allah and His Messenger. There is no blame on those who do good, and Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1326,
        "chapter": 9,
        "verse": 92,
        "arabic_text": "وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوۡكَ لِتَحۡمِلَهُمۡ قُلۡتَ لَآ أَجِدُ مَآ أَحۡمِلُكُمۡ عَلَيۡهِ تَوَلَّواْ وَّأَعۡيُنُهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ حَزَنًا أَلَّا يَجِدُواْ مَا يُنفِقُونَ",
        "phonetic": "9.92 Wa Lā `Alá Al-Ladhīna 'Idhā Mā 'Atawka Litaĥmilahum Qulta Lā 'Ajidu Mā 'Aĥmilukum `Alayhi Tawallaw Wa 'A`yunuhum Tafīđu Mina Ad-Dam`i Ĥazanāan 'Allā Yajidū Mā Yunfiqūna",
        "footnotes": {
            "english_saheeh": "[497]- No mounts or even shoes were available.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Nor [is there blame] upon those who, when they came to you for you to take them along, you said, \"I can find nothing upon which to carry you.\"[497] They turned back while their eyes overflowed with tears out of grief that they could not find something to spend [for the cause of Allāh].",
            "english_hilali_khan": "Nor (is there blame) on those who came to you to be provided with mounts, when you said: \"I can find no mounts for you,\" they turned back, while their eyes overflowing with tears of grief that they could not find anything to spend (for Jihâd).",
            "english_rwwad": "Nor is there any blame on those who came to you asking you for mounts to take them along, and you said, “I can find no mounts for you;” they turned away with their eyes overflowing with tears out of grief that that had nothing to spend."
        }
    },
    {
        "id": 1327,
        "chapter": 9,
        "verse": 93,
        "arabic_text": "۞ إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسۡتَـٔۡذِنُونَكَ وَهُمۡ أَغۡنِيَآءُۚ رَضُواْ بِأَن يَكُونُواْ مَعَ ٱلۡخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "9.93 'Innamā As-Sabīlu `Alá Al-Ladhīna Yasta'dhinūnaka Wa Hum 'Aghniyā'u Rađū Bi'an Yakūnū Ma`a Al-Khawālifi Wa Ţaba`a Allāhu `Alá Qulūbihim Fahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:93) Narrated Abu Hurairah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"A Prophet amongst the Prophets carried out a holy military expedition, so he said to his followers, ‘Anyone who has married a woman and wants to consummate the marriage, and has not done so yet, should not accompany me; nor should a man who has built a house but has not completed its roof; nor a man who has sheep or she-camels and is waiting for the birth of their young ones.’ So, the Prophet carried out the expedition and when he reached that town at the time or nearly at the time of the ‘Asr prayer, he said to the sun, ‘O sun! You are under Allâh’s Order and I am under Allâh’s Order. O Allâh! Stop it (i.e. the sun) from setting.’ It was stopped till Allâh made him victorious. Then he collected the booty and the fire came to burn it, but it did not burn it*. He said (to his men), ‘Some of you have stolen something from the booty. So one man from every tribe should give me a Bai‘a (pledge) by shaking hands with me.’ (They did so and) the hand of a man got stuck in the hand of their Prophet. Then that Prophet said (to the man), ‘The theft has been committed by your people. So all the persons of your tribe should give me the Bai‘a (pledge) by shaking hands with me.’ The hands of two or three men got stuck in the hand of their Prophet and he said, ‘You have committed the theft.’ Then they brought a head of gold like the head of a cow and put it there, and the fire came and consumed the booty. The Prophet صلى الله عليه وسلم added: \"Then Allâh saw our weakness and disability, so He made booty legal for us.\" (Sahin Al-Bukhâri, Vol.4, Hadîth No.353).\n* Booty used to be burnt by a fire sent by Allâh.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The cause [for blame] is only upon those who ask permission of you while they are rich. They are satisfied to be with those who stay behind, and Allāh has sealed over their hearts, so they do not know.",
            "english_hilali_khan": "The ground (of complaint) is only against those who are rich, and yet ask exemption.[2] They are content to be with (the women) who sit behind (at home) and Allâh has sealed up their hearts (from all kinds of goodness and right guidance) so that they know not (what they are losing).",
            "english_rwwad": "Blame is only on those who ask you for exemption even though they are affluent. They are content to stay behind with the helpless, and Allah has sealed their hearts so they do not know."
        }
    },
    {
        "id": 1328,
        "chapter": 9,
        "verse": 94,
        "arabic_text": "يَعۡتَذِرُونَ إِلَيۡكُمۡ إِذَا رَجَعۡتُمۡ إِلَيۡهِمۡۚ قُل لَّا تَعۡتَذِرُواْ لَن نُّؤۡمِنَ لَكُمۡ قَدۡ نَبَّأَنَا ٱللَّهُ مِنۡ أَخۡبَارِكُمۡۚ وَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ ثُمَّ تُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "9.94 Ya`tadhirūna 'Ilaykum 'Idhā Raja`tum 'Ilayhim Qul Lā Ta`tadhirū Lan Nu'umina Lakum Qad Nabba'anā Allāhu Min 'Akhbārikum Wa Sayará Allāhu `Amalakum Wa Rasūluhu Thumma Turaddūna 'Ilá `Ālimi Al-Ghaybi Wa Ash-Shahādati Fayunabbi'ukum Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[498]- See footnotes to 6:73.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will make excuses to you when you have returned to them. Say, \"Make no excuse - never will we believe you. Allāh has already informed us of your news [i.e., affair]. And Allāh will observe your deeds, and [so will] His Messenger; then you will be taken back to the Knower of the unseen and the witnessed,[498] and He will inform you of what you used to do.\"",
            "english_hilali_khan": "They (the hypocrites) will present their excuses to you (Muslims), when you return to them. Say (O Muhammad صلى الله عليه وسلم) \"Present no excuses, we shall not believe you. Allâh has already informed us of the news concerning you. Allâh and His Messenger will observe your deeds. In the end you will be brought back to the All-Knower of the unseen and the seen, then He (Allâh) will inform you of what you used to do.\" [Tafsir At-Tabari]",
            "english_rwwad": "They will make excuses to you when you return to them. Say, “Make no excuses; we will never believe you. Allah has already informed us about your affairs. Allah and His Messenger will see your deeds, then you will be brought back to the Knower of the unseen and the seen, and He will inform you of what you used to do.”"
        }
    },
    {
        "id": 1329,
        "chapter": 9,
        "verse": 95,
        "arabic_text": "سَيَحۡلِفُونَ بِٱللَّهِ لَكُمۡ إِذَا ٱنقَلَبۡتُمۡ إِلَيۡهِمۡ لِتُعۡرِضُواْ عَنۡهُمۡۖ فَأَعۡرِضُواْ عَنۡهُمۡۖ إِنَّهُمۡ رِجۡسٞۖ وَمَأۡوَىٰهُمۡ جَهَنَّمُ جَزَآءَۢ بِمَا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "9.95 Sayaĥlifūna Billāhi Lakum 'Idhā Anqalabtum 'Ilayhim Litu`riđū `Anhum Fa'a`riđū `Anhum 'Innahum Rijsun Wa Ma'wāhum Jahannamu Jazā'an Bimā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will swear by Allāh to you when you return to them that you would leave them alone. So leave them alone; indeed they are evil; and their refuge is Hell as recompense for what they had been earning.",
            "english_hilali_khan": "They will swear by Allâh to you (Muslims) when you return to them, that you may turn away from them. So turn away from them. Surely, they are Rijs [i.e. Najas (impure) because of their evil deeds], and Hell is their dwelling place - a recompense for that which they used to earn.",
            "english_rwwad": "When you return to them, they will swear to you by Allah so that you may leave them alone. So leave them alone, for they are evil. Their abode is Hell, as a recompense for what they used to do."
        }
    },
    {
        "id": 1330,
        "chapter": 9,
        "verse": 96,
        "arabic_text": "يَحۡلِفُونَ لَكُمۡ لِتَرۡضَوۡاْ عَنۡهُمۡۖ فَإِن تَرۡضَوۡاْ عَنۡهُمۡ فَإِنَّ ٱللَّهَ لَا يَرۡضَىٰ عَنِ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ",
        "phonetic": "9.96 Yaĥlifūna Lakum Litarđaw `Anhum Fa'in Tarđaw `Anhum Fa'inna Allāha Lā Yarđá `Ani Al-Qawmi Al-Fāsiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They swear to you so that you might be satisfied with them. But if you should be satisfied with them - indeed, Allāh is not satisfied with a defiantly disobedient people.",
            "english_hilali_khan": "They (the hypocrites) swear to you (Muslims) that you may be pleased with them, but if you are pleased with them, certainly Allâh is not pleased with the people who are Al-Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "They will swear to you in order to please you. Even if you are pleased with them, Allah will not be pleased with the rebellious people."
        }
    },
    {
        "id": 1331,
        "chapter": 9,
        "verse": 97,
        "arabic_text": "ٱلۡأَعۡرَابُ أَشَدُّ كُفۡرٗا وَنِفَاقٗا وَأَجۡدَرُ أَلَّا يَعۡلَمُواْ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
        "phonetic": "9.97 Al-'A`rābu 'Ashaddu Kufrāan Wa Nifāqāan Wa 'Ajdaru 'Allā Ya`lamū Ĥudūda Mā 'Anzala Allāhu `Alá Rasūlihi Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The bedouins are stronger in disbelief and hypocrisy and more likely not to know the limits of what [laws] Allāh has revealed to His Messenger. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "The bedouins are the worst in disbelief and hypocrisy, and more likely to be in ignorance of the limits (Allâh’s Commandments and His Laws) which Allâh has revealed to His Messenger. And Allâh is All-Knower, All-Wise.",
            "english_rwwad": "The Bedouins are worse in disbelief and hypocrisy, and less likely to know the limits sent down by Allah to His Messenger. And Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1332,
        "chapter": 9,
        "verse": 98,
        "arabic_text": "وَمِنَ ٱلۡأَعۡرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغۡرَمٗا وَيَتَرَبَّصُ بِكُمُ ٱلدَّوَآئِرَۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٞ",
        "phonetic": "9.98 Wa Mina Al-'A`rābi Man Yattakhidhu Mā Yunfiqu Maghramāan Wa Yatarabbaşu Bikumu Ad-Dawā'ira `Alayhim Dā'iratu As-Saw'i Wa Allāhu Samī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "[499]- i.e., a fine or penalty.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among the bedouins are some who consider what they spend as a loss[499] and await for you turns of misfortune. Upon them will be a misfortune of evil. And Allāh is Hearing and Knowing.",
            "english_hilali_khan": "And of the bedouins there are some who look upon what they spend (in Allâh’s Cause) as a fine and watch for calamities for you, on them be the calamity of evil. And Allâh is All-Hearer, All-Knower.",
            "english_rwwad": "Among the Bedouins are some who consider what they spend as a loss and await some misfortune to befall you. May ill-fortune befall them! And Allah is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 1333,
        "chapter": 9,
        "verse": 99,
        "arabic_text": "وَمِنَ ٱلۡأَعۡرَابِ مَن يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِۚ أَلَآ إِنَّهَا قُرۡبَةٞ لَّهُمۡۚ سَيُدۡخِلُهُمُ ٱللَّهُ فِي رَحۡمَتِهِۦٓۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ",
        "phonetic": "9.99 Wa Mina Al-'A`rābi Man Yu'uminu Billāhi Wa Al-Yawmi Al-'Ākhiri Wa Yattakhidhu Mā Yunfiqu Qurubātin `Inda Allāhi Wa Şalawāti Ar-Rasūli 'Alā 'Innahā Qurbatun Lahum Sayudkhiluhumu Allāhu Fī Raĥmatihi 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But among the bedouins are some who believe in Allāh and the Last Day and consider what they spend as means of nearness to Allāh and of [obtaining] invocations of the Messenger. Unquestionably, it is a means of nearness for them. Allāh will admit them to His mercy. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "And of the bedouins there are some who believe in Allâh and the Last Day, and look upon what they spend in Allâh’s Cause as means of nearness to Allâh, and a cause of receiving the Messenger’s invocations. Indeed these (spendings in Allâh’s Cause) are a means of nearness for them. Allâh will admit them to His Mercy. Certainly Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "However, there are some among the Bedouins who believe in Allah and the Last Day, and consider what they spend as a means of drawing closer to Allah, and of deserving the prayers of the Messenger. It is certainly a means of drawing closer for them. Allah will admit them to His mercy, for Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1334,
        "chapter": 9,
        "verse": 100,
        "arabic_text": "وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "9.100 Wa As-Sābiqūna Al-'Awwalūna Mina Al-Muhājirīna Wa Al-'Anşāri Wa Al-Ladhīna Attaba`ūhum Bi'iĥsānin Rađiya Allāhu `Anhum Wa Rađū `Anhu Wa 'A`adda Lahum Jannātin Tajrī Taĥtahā Al-'Anhāru Khālidīna Fīhā 'Abadāan Dhālika Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "[500]- Those who emigrated from Makkah and settled in Madīnah for the cause of Islām.\n[501]- The inhabitants of Madīnah who had accepted Islām and assisted the Prophet (ﷺ) and other emigrants upon their arrival there.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the first forerunners [in the faith] among the Muhājireen[500] and the Anṣār[501] and those who followed them with good conduct - Allāh is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.",
            "english_hilali_khan": "And the foremost to embrace Islâm of the Muhâjirûn (those who migrated from Makkah to Al-Madinah) and the Ansâr (the citizens of Al-Madinah who helped and gave aid to the Muhâjirûn ) and also those who followed them exactly (in Faith). Allâh is well-pleased with them as they are well-pleased with Him. He has prepared for them Gardens under which rivers flow (Paradise), to dwell therein forever. That is the supreme success.",
            "english_rwwad": "As for the first forerunners of the Emigrants and the Helpers, and those who followed them in righteous deeds, Allah is pleased with them and they are pleased with Him. He has prepared for them gardens under which rivers flow, abiding therein forever. That is the supreme triumph."
        }
    },
    {
        "id": 1335,
        "chapter": 9,
        "verse": 101,
        "arabic_text": "وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ",
        "phonetic": "9.101 Wa Mimman Ĥawlakum Mina Al-'A`rābi Munāfiqūna Wa Min 'Ahli Al-Madīnati Maradū `Alá An-Nifāqi Lā Ta`lamuhum Naĥnu Na`lamuhum Sanu`adhibuhum Marratayni Thumma Yuraddūna 'Ilá `Adhābin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among those around you of the bedouins are hypocrites, and [also] from the people of Madīnah. They have persisted in hypocrisy. You, [O Muḥammad], do not know them, [but] We know them. We will punish them twice [in this world]; then they will be returned to a great punishment.",
            "english_hilali_khan": "And among the bedouins around you, some are hypocrites, and so are some among the people of Al-Madinah who persist in hypocrisy; you (O Muhammad صلى الله عليه وسلم) know them not, We know them. We shall punish them twice, and thereafter they shall be brought back to a great (horrible) torment.",
            "english_rwwad": "Among the Bedouins around you are some hypocrites, as are from the people of Madinah; they are obstinate in their hypocrisy. You do not know them; We know them. We will punish them twice, then they will be brought back to a great punishment."
        }
    },
    {
        "id": 1336,
        "chapter": 9,
        "verse": 102,
        "arabic_text": "وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ",
        "phonetic": "9.102 Wa 'Ākharūna A`tarafū Bidhunūbihim Khalaţū `Amalāan Şāliĥāan Wa 'Ākhara Sayyi'āan `Asá Allāhu 'An Yatūba `Alayhim 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[502]- This refers to their having previously taken part in jihād but having abstained on the occasion of Tabūk.",
            "english_hilali_khan": "(V.9:102) The Statement of Allâh عز وجل : \"And (there are) others who have acknowledged their sins...\" (V.9:102)\nNarrated Samurah bin Jundub رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"Tonight two (visitors) came to me (in my dream) and took me to a town built with gold bricks and silver bricks. There, we met men who, (by) half of their bodies looked like the most handsome human beings you have ever seen, and (by) the other half, the ugliest human beings you have ever seen. Those two visitors said to those men: ‘Go and dip yourselves in that river.’ So they dipped themselves therein and then came to us, their ugliness having disappeared and they were in the most handsome shape. The visitors said, ‘This is the ‘Adn Paradise, and that is your dwelling place.’ Then they added, ‘As for those people who were half ugly and half handsome, they were those who have mixed deeds that were good with deeds that were evil, but Allâh forgave them.’ \" (Sahih Al-Bukhari, Vol.6, Hadith No.196).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [there are] others who have acknowledged their sins. They had mixed [i.e., polluted] a righteous deed with another that was bad.[502] Perhaps Allāh will turn to them in forgiveness. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "And (there are) others who have acknowledged their sins, they have mixed a deed that was righteous with another that was evil. Perhaps Allâh will turn unto them in forgiveness. Surely, Allâh is Oft-Forgiving, Most Merciful.[1]",
            "english_rwwad": "And there are others who admitted their sins; they have mixed righteous deeds with others that were evil. It is likely that Allah will turn to them in mercy, for Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1337,
        "chapter": 9,
        "verse": 103,
        "arabic_text": "خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
        "phonetic": "9.103 Khudh Min 'Amwālihim Şadaqatan Tuţahhiruhum Wa Tuzakkīhim Bihā Wa Şalli `Alayhim 'Inna Şalātaka Sakanun Lahum Wa Allāhu Samī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Take, [O Muḥammad], from their wealth a charity by which you purify them and cause them increase, and invoke [Allāh's blessings] upon them. Indeed, your invocations are reassurance for them. And Allāh is Hearing and Knowing.",
            "english_hilali_khan": "Take Sadaqah (alms) from their wealth in order to purify them and sanctify them with it, and invoke Allâh for them. Verily! Your invocations are a source of security for them; and Allâh is All-Hearer, All-Knower.",
            "english_rwwad": "Take charity from their wealth [O Prophet] to cleanse and purify them, and pray for them. Your prayer is a source of comfort for them. And Allah is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 1338,
        "chapter": 9,
        "verse": 104,
        "arabic_text": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
        "phonetic": "9.104 'Alam Ya`lamū 'Anna Allāha Huwa Yaqbalu At-Tawbata `An `Ibādihi Wa Ya'khudhu Aş-Şadaqāti Wa 'Anna Allāha Huwa At-Tawwābu Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "[503]- Refer to footnote in 2:37.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not know that it is Allāh who accepts repentance from His servants and receives charities and that it is Allāh who is the Accepting of Repentance,[503] the Merciful?",
            "english_hilali_khan": "Know they not that Allâh accepts repentance from His slaves and takes the Sadaqât (alms, charity), and that Allâh Alone is the One Who forgives and accepts repentance, Most Merciful?",
            "english_rwwad": "Do they not know that it is Allah Who accepts the repentance of His slaves and accepts their charities, and that it is Allah Who is the Accepter of Repentance, Most Merciful?"
        }
    },
    {
        "id": 1339,
        "chapter": 9,
        "verse": 105,
        "arabic_text": "وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "9.105 Wa Quli A`malū Fasayará Allāhu `Amalakum Wa Rasūluhu Wa Al-Mu'uminūna Wa Saturaddūna 'Ilá `Ālimi Al-Ghaybi Wa Ash-Shahādati Fayunabbi'ukum Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And say, \"Do [as you will], for Allāh will see your deeds, and [so will] His Messenger and the believers. And you will be returned to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.\"",
            "english_hilali_khan": "And say (O Muhammad صلى الله عليه وسلم) \"Do deeds! Allâh will see your deeds, and (so will) His Messenger and the believers. And you will be brought back to the All-Knower of the unseen and the seen. Then He will inform you of what you used to do.\"",
            "english_rwwad": "And say, “Do as you will; Allah will see your deeds, and so will His Messenger and the believers, then you will be brought back to the Knower of the unseen and the seen, and He will inform you of what you used to do.”"
        }
    },
    {
        "id": 1340,
        "chapter": 9,
        "verse": 106,
        "arabic_text": "وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
        "phonetic": "9.106 Wa 'Ākharūna Murjawna Li'amri Allāhi 'Immā Yu`adhibuhum Wa 'Immā Yatūbu `Alayhim Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [there are] others deferred until the command of Allāh - whether He will punish them or whether He will forgive them. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "And others are made to await for Allâh’s Decree, whether He will punish them or will forgive them. And Allâh is All-Knowing, All-Wise.",
            "english_rwwad": "And there are yet others who await Allah’s decision; either He will punish them or turn to them in mercy. And Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1341,
        "chapter": 9,
        "verse": 107,
        "arabic_text": "وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ",
        "phonetic": "9.107 Wa Al-Ladhīna Attakhadhū Masjidāan Đirārāan Wa Kufrāan Wa Tafrīqāan Bayna Al-Mu'uminīna Wa 'Irşādāan Liman Ĥāraba Allāha Wa Rasūlahu Min Qablu Wa Layaĥlifunna 'In 'Aradnā 'Illā Al-Ĥusná Wa Allāhu Yash/hadu 'Innahum Lakādhibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [there are] those [hypocrites] who took for themselves a mosque for causing harm and disbelief and division among the believers and as a station for whoever had warred against Allāh and His Messenger before. And they will surely swear, \"We intended only the best.\" And Allāh testifies that indeed they are liars.",
            "english_hilali_khan": "And as for those who put up a mosque by way of harm and disbelief and to disunite the believers and as an outpost for those who warred against Allâh and His Messenger (Muhammad صلى الله عليه وسلم) aforetime, they will indeed swear that their intention is nothing but good. Allâh bears witness that they are certainly liars.",
            "english_rwwad": "There are those [hypocrites] who built a mosque to cause harm, promote disbelief and create division among the believers, and as a base for those who had previously fought against Allah and His Messenger. They will surely swear, “We intend nothing but good,” but Allah testifies that they are indeed liars."
        }
    },
    {
        "id": 1342,
        "chapter": 9,
        "verse": 108,
        "arabic_text": "لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ",
        "phonetic": "9.108 Lā Taqum Fīhi 'Abadāan Lamasjidun 'Ussisa `Alá At-Taqwá Min 'Awwali Yawmin 'Aĥaqqu 'An Taqūma Fīhi Fīhi Rijālun Yuĥibbūna 'An Yataţahharū Wa Allāhu Yuĥibbu Al-Muţţahhirīna",
        "footnotes": {
            "english_saheeh": "[504]- This description is of the Qubā’ mosque.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do not stand [for prayer] within it - ever. A mosque founded on righteousness from the first day[504] is more worthy for you to stand in. Within it are men who love to purify themselves; and Allāh loves those who purify themselves.",
            "english_hilali_khan": "Never stand you therein. Verily, the mosque whose foundation was laid from the first day on piety is more worthy that you stand therein (to pray). In it are men who love to clean and to purify themselves. And Allâh loves those who make themselves clean and pure [i.e. who clean their private parts with dust (which has the properties of soap) and water from urine and stools, after answering the call of nature].",
            "english_rwwad": "Never pray therein [O Prophet]. A mosque that was founded on piety from the first day is more deserving for you to pray therein. In it are men who love to keep themselves pure, and Allah loves those who keep themselves pure."
        }
    },
    {
        "id": 1343,
        "chapter": 9,
        "verse": 109,
        "arabic_text": "أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ",
        "phonetic": "9.109 'Afaman 'Assasa Bunyānahu `Alá Taqwá Mina Allāhi Wa Riđwānin Khayrun 'Am Man 'Assasa Bunyānahu `Alá Shafā Jurufin Hārin Fānhāra Bihi Fī Nāri Jahannama Wa Allāhu Lā Yahdī Al-Qawma Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then is one who laid the foundation of his building on righteousness [with fear] from Allāh and [seeking] His approval better or one who laid the foundation of his building on the edge of a bank about to collapse, so it collapsed with him into the fire of Hell? And Allāh does not guide the wrongdoing people.",
            "english_hilali_khan": "Is it then he who laid the foundation of his building on piety to Allâh and His Good Pleasure better, or he who laid the foundation of his building on the brink of an undetermined precipice ready to crumble down, so that it crumbled to pieces with him into the Fire of Hell. And Allâh guides not the people who are the Zâlimûn (cruel, violent, proud, polytheist and wrong-doer).",
            "english_rwwad": "Who is better – one who laid the foundation of his building on piety and seeking Allah’s pleasure; or one who laid the foundation of his building on the edge of a crumbling precipice, so it tumbled down with him into the Fire of Hell? And Allah does not guide the wrongdoing people."
        }
    },
    {
        "id": 1344,
        "chapter": 9,
        "verse": 110,
        "arabic_text": "لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
        "phonetic": "9.110 Lā Yazālu Bunyānuhumu Al-Ladhī Banaw Rībatan Fī Qulūbihim 'Illā 'An Taqaţţa`a Qulūbuhum Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Their building which they built will not cease to be a [cause of] skepticism in their hearts until their hearts are cut [i.e., stopped]. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "The building which they built will never cease to be a cause of hypocrisy and doubt in their hearts unless their hearts are cut to pieces. (i.e. till they die). And Allâh is All-Knowing, All-Wise.",
            "english_rwwad": "This building which they built will not cease to be a source of unrest in their hearts until their hearts are cut into pieces. And Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 1345,
        "chapter": 9,
        "verse": 111,
        "arabic_text": "۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ",
        "phonetic": "9.111 'Inna Allāha Ashtará Mina Al-Mu'uminīna 'Anfusahum Wa 'Amwālahum Bi'anna Lahumu Al-Jannata Yuqātilūna Fī Sabīli Allāhi Fayaqtulūna Wa Yuqtalūna Wa`dāan `Alayhi Ĥaqqāan Fī At-Tawrāati Wa Al-'Injīli Wa Al-Qur'āni Wa Man 'Awfá Bi`ahdihi Mina Allāhi Fāstabshirū Bibay`ikumu Al-Ladhī Bāya`tum Bihi Wa Dhalika Huwa Al-Fawzu Al-`Ažīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:111)\na) Narrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"Allâh guarantees him who strives in His Cause and whose motivation for going out is nothing but Jihâd in His Cause and belief in His Words (Islamic Monotheism), that He will admit him into Paradise (if martyred) or bring him back to his dwelling place whence he has come out with what he gains of reward or booty.\" (Sahih Al-Bukhari, Vol.4, Hadith No.352).\nb) Narrated Jâbir bin ‘Abdullâh رضي الله عنهما : On the day of the battle of Uhud, a man came to the Prophet صلى الله عليه وسلم and said, \"Can you tell me where I will be if I should get martyred?\" The Prophet صلى الله عليه وسلم replied, \"In Paradise.\" The man threw away some dates he was carrying in his hand, and fought till he was martyred. (Sahih Al-Bukhari, Vol.5, Hadith No.377).\nc) Narrated Ibn ‘Umar رضي الله عنهما: I heard Allâh’s Messenger صلى الله عليه وسلم saying \"If you (1) practise Bai‘ Al-‘Inah (the ‘Inah transaction i.e. selling goods to a person for a certain price and then buying them back from him for a far less price); (2) and followed the tails of the cows (i.e. indulged in agriculture and became content with it), (3) and deserted the Jihâd (holy fighting) in Allâh’s Cause, Allâh will cover you with humiliation, and it will not be removed till you return back to your religion.\" (Abu Dâwûd, Vol.3, Hadith No.3462).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, Allāh has purchased from the believers their lives and their properties [in exchange] for that they will have Paradise. They fight in the cause of Allāh, so they kill and are killed. [It is] a true promise [binding] upon Him in the Torah and the Gospel and the Qur’ān. And who is truer to his covenant than Allāh? So rejoice in your transaction which you have contracted. And it is that which is the great attainment.",
            "english_hilali_khan": "Verily, Allâh has purchased of the believers their lives and their properties for (the price) that theirs shall be the Paradise. They fight in Allâh’s Cause, so they kill (others) and are killed. It is a promise in truth which is binding on Him in the Taurât (Torah) and the Injeel (Gospel) and the Qur’ân. And who is truer to his covenant than Allâh? Then rejoice in the bargain which you have concluded. That is the supreme success.[1]",
            "english_rwwad": "Allah has purchased from the believers their lives and their wealth, and in return they will have Paradise; they fight in the cause of Allah and they kill or are killed. This is a true promise, given by Him in the Torah, the Gospel and the Qur’an. Who is more faithful to his promise than Allah? Rejoice then in the transaction you have made with Him; that is the supreme triumph."
        }
    },
    {
        "id": 1346,
        "chapter": 9,
        "verse": 112,
        "arabic_text": "ٱلتَّٰٓئِبُونَ ٱلۡعَٰبِدُونَ ٱلۡحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلۡأٓمِرُونَ بِٱلۡمَعۡرُوفِ وَٱلنَّاهُونَ عَنِ ٱلۡمُنكَرِ وَٱلۡحَٰفِظُونَ لِحُدُودِ ٱللَّهِۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "9.112 At-Tā'ibūna Al-`Ābidūna Al-Ĥāmidūna As-Sā'iĥūna Ar-Rāki`ūna As-Sājidūna Al-'Āmirūna Bil-Ma`rūfi Wa An-Nāhūna `Ani Al-Munkari Wa Al-Ĥāfižūna Liĥudūdi Allāhi Wa Bashiri Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:112) Narrated Sahl bin Sa‘d: Allâh’s Messenger صلى الله عليه وسلم said, \"Whoever can guarantee (the chastity of) what is between his two jaw-bones and what is between his two legs (i.e., his mouth, tongue and his private parts)*. I guarantee Paradise for him.\" (Sahih Al-Bukhari, Vol.8, Hadith No.481)\n* i.e. whoever protects his tongue from illegal talk e.g., to tell lies, or backbiting, etc., and his mouth from eating and drinking forbidden illegal things, and his private parts from illegal sexual acts.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Such believers are] the repentant, the worshippers, the praisers [of Allāh], the travelers [for His cause], those who bow and prostrate [in prayer], those who enjoin what is right and forbid what is wrong, and those who observe the limits [set by] Allāh. And give good tidings to the believers.",
            "english_hilali_khan": "(The believers whose lives Allâh has purchased are) those who turn to Allâh in repentance (from polytheism and hypocrisy, etc.), who worship (Him), who praise (Him), who fast (or go out in Allâh’s Cause), who bow down (in prayer), who prostrate themselves (in prayer), who enjoin (on people) Al-Ma‘rûf (i.e. Islâmic Monotheism and all what Islâm has ordained) and forbid (people) from Al-Munkar (i.e. disbelief, polytheism of all kinds and all that Islâm has forbidden), and who observe the limits set by Allâh (do all that Allâh has ordained and abstain from all kinds of sins and evil deeds which Allâh has forbidden). And give glad tidings to the believers.[1]",
            "english_rwwad": "[Those believers] are the ones who repent, who constantly worship, who praise Him, who fast, who bow down and prostrate, who enjoin what is right and forbid what is wrong, and who observe the limits set by Allah; give glad tidings to the believers."
        }
    },
    {
        "id": 1347,
        "chapter": 9,
        "verse": 113,
        "arabic_text": "مَا كَانَ لِلنَّبِيِّ وَٱلَّذِينَ ءَامَنُوٓاْ أَن يَسۡتَغۡفِرُواْ لِلۡمُشۡرِكِينَ وَلَوۡ كَانُوٓاْ أُوْلِي قُرۡبَىٰ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمۡ أَنَّهُمۡ أَصۡحَٰبُ ٱلۡجَحِيمِ",
        "phonetic": "9.113 Mā Kāna Lilnnabīyi Wa Al-Ladhīna 'Āmanū 'An Yastaghfirū Lilmushrikīna Wa Law Kānū 'Ūlī Qurbá Min Ba`di Mā Tabayyana Lahum 'Annahum 'Aşĥābu Al-Jaĥīmi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is not for the Prophet and those who have believed to ask forgiveness for the polytheists, even if they were relatives, after it has become clear to them that they are companions of Hellfire.",
            "english_hilali_khan": "It is not (proper) for the Prophet and those who believe to ask Allâh’s Forgiveness for the Mushrikûn (polytheists, idolaters, pagans, disbelievers in the Oneness of Allâh), even though they be of kin, after it has become clear to them that they are the dwellers of the Fire (because they died in a state of disbelief).",
            "english_rwwad": "It is not fitting for the Prophet and those who believe to seek forgiveness for the polytheists, even if they are close relatives, after becoming clear to them that they are the people of Blazing Fire."
        }
    },
    {
        "id": 1348,
        "chapter": 9,
        "verse": 114,
        "arabic_text": "وَمَا كَانَ ٱسۡتِغۡفَارُ إِبۡرَٰهِيمَ لِأَبِيهِ إِلَّا عَن مَّوۡعِدَةٖ وَعَدَهَآ إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُۥٓ أَنَّهُۥ عَدُوّٞ لِّلَّهِ تَبَرَّأَ مِنۡهُۚ إِنَّ إِبۡرَٰهِيمَ لَأَوَّٰهٌ حَلِيمٞ",
        "phonetic": "9.114 Wa Mā Kāna Astighfāru 'Ibrāhīma Li'abīhi 'Illā `An Maw`idatin Wa`adahā 'Īyāhu Falammā Tabayyana Lahu 'Annahu `Adūwun Lillāhi Tabarra'a Minhu 'Inna 'Ibrāhīma La'awwāhun Ĥalīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:114) See the footnote of (V.6:74).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the request of forgiveness of Abraham for his father was only because of a promise he had made to him. But when it became apparent to him [i.e., Abraham] that he [i.e., the father] was an enemy to Allāh, he disassociated himself from him. Indeed was Abraham compassionate and patient.",
            "english_hilali_khan": "And Ibrâhîm’s (Abraham) invoking (of Allâh) for his father’s forgiveness was only because of a promise he [Ibrâhîm (Abraham)] had made to him (his father). But when it became clear to him [Ibrâhîm (Abraham)] that he (his father) is an enemy of Allâh, he dissociated himself from him. Verily Ibrâhîm (Abraham) was Awwah (one who invokes Allâh with humility, glorifies Him and remembers Him much) and was forbearing. (Tafsir Al-Qurtubî)[2].",
            "english_rwwad": "As for the prayer of Abraham for his father’s forgiveness, it was only because of a promise he had made to him. However, when it became clear to him that he was an enemy of Allah, he dissociated himself from him. Indeed, Abraham was tender-hearted, forbearing."
        }
    },
    {
        "id": 1349,
        "chapter": 9,
        "verse": 115,
        "arabic_text": "وَمَا كَانَ ٱللَّهُ لِيُضِلَّ قَوۡمَۢا بَعۡدَ إِذۡ هَدَىٰهُمۡ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ",
        "phonetic": "9.115 Wa Mā Kāna Allāhu Liyuđilla Qawmāan Ba`da 'Idh Hadāhum Ĥattá Yubayyina Lahum Mā Yattaqūna 'Inna Allāha Bikulli Shay'in `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:115) Killing the Khawârij) ( people who dissented from the religion and disagreed with the rest of the Muslims), and the Mulhidûn (heretics) after the establishment of firm proof against them.\nAnd the Statement of Allâh تعالى: ‘And Allâh will never lead a people astray after He has guided them, until He makes clear to them what they should avoid...’ (V.9:115) And Ibn ‘Umar رضي الله عنهما used to consider them (the Khawarij and the Mulhidûn) the worst of Allâh’s creatures and said, \"These people took some Verses that had been revealed concerning the disbelievers and interpreted them as describing the believers.\"\nNarrated ‘Abdullâh bin ‘Umar رضي الله عنهما regarding Al-Haruriyah: The Prophet صلى الله عليه وسلم said, \"They will go out of Islâm as an arrow darts out of the game’s body.\" (Sahih Al-Bukhari, Vol.9, Hadith No.66).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh would not let a people stray after He has guided them until He makes clear to them what they should avoid. Indeed, Allāh is Knowing of all things.",
            "english_hilali_khan": "And Allâh will never lead a people astray after He has guided them until He makes clear to them as to what they should avoid. Verily, Allâh is the All-Knower of everything.[3]",
            "english_rwwad": "Allah will not cause a people to go astray after He has guided them until He makes clear to them what they should avoid. Indeed, Allah is All-Knowing of everything."
        }
    },
    {
        "id": 1350,
        "chapter": 9,
        "verse": 116,
        "arabic_text": "إِنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۚ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٖ",
        "phonetic": "9.116 'Inna Allāha Lahu Mulku As-Samāwāti Wa Al-'Arđi Yuĥyī Wa Yumītu Wa Mā Lakum Min Dūni Allāhi Min Wa Līyin Wa Lā Naşīrin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, to Allāh belongs the dominion of the heavens and the earth; He gives life and causes death. And you have not besides Allāh any protector or any helper.",
            "english_hilali_khan": "Verily, Allâh! Unto Him belongs the dominion of the heavens and the earth, He gives life and He causes death. And besides Allâh you have neither any Walî (protector or guardian) nor any helper.",
            "english_rwwad": "Indeed, to Allah belongs the dominion of the heavens and earth. He gives life and causes death. You have no protector or helper besides Allah."
        }
    },
    {
        "id": 1351,
        "chapter": 9,
        "verse": 117,
        "arabic_text": "لَّقَد تَّابَ ٱللَّهُ عَلَى ٱلنَّبِيِّ وَٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ ٱلَّذِينَ ٱتَّبَعُوهُ فِي سَاعَةِ ٱلۡعُسۡرَةِ مِنۢ بَعۡدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٖ مِّنۡهُمۡ ثُمَّ تَابَ عَلَيۡهِمۡۚ إِنَّهُۥ بِهِمۡ رَءُوفٞ رَّحِيمٞ",
        "phonetic": "9.117 Laqad Tāba Allāhu `Alá An-Nabīyi Wa Al-Muhājirīna Wa Al-'Anşāri Al-Ladhīna Attaba`ūhu Fī Sā`ati Al-`Usrati Min Ba`di Mā Kāda Yazīghu Qulūbu Farīqin Minhum Thumma Tāba `Alayhim 'Innahu Bihim Ra'ūfun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has already forgiven the Prophet and the Muhājireen and the Anṣār who followed him in the hour of difficulty after the hearts of a party of them had almost inclined [to doubt], and then He forgave them. Indeed, He was to them Kind and Merciful.",
            "english_hilali_khan": "Allâh has forgiven the Prophet (صلى الله عليه وسلم), the Muhâjirûn (Muslim emigrants who left their homes and came to Al-Madinah) and the Ansâr (Muslims of Al-Madinah) who followed him (Muhammad صلى الله عليه وسلم) in the time of distress (Tabûk expedition), after the hearts of a party of them had nearly deviated (from the Right Path), but He accepted their repentance. Certainly, He is unto them full of Kindness, Most Merciful.",
            "english_rwwad": "Indeed, Allah has turned in mercy to the Prophet, the Emigrants and the Helpers who followed him in the hour of hardship [at Tabūk], after some of them were about to lose heart. Then He turned to them in mercy, for He is All-Gracious, Most Merciful to them."
        }
    },
    {
        "id": 1352,
        "chapter": 9,
        "verse": 118,
        "arabic_text": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
        "phonetic": "9.118 Wa `Alá Ath-Thalāthati Al-Ladhīna Khullifū Ĥattá 'Idhā Đāqat `Alayhimu Al-'Arđu Bimā Raĥubat Wa Đāqat `Alayhim 'Anfusuhum Wa Žannū 'An Lā Malja'a Mina Allāhi 'Illā 'Ilayhi Thumma Tāba `Alayhim Liyatūbū 'Inna Allāha Huwa At-Tawwābu Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "[505]- Thus it seemed to them in their extreme distress.\n[506]- Refer to footnote in 2:37.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [He also forgave] the three who were left alone [i.e., boycotted, regretting their error] to the point that the earth closed in on them in spite of its vastness[505] and their souls confined [i.e., anguished] them and they were certain that there is no refuge from Allāh except in Him. Then He turned to them so they could repent. Indeed, Allāh is the Accepting of Repentance,[506] the Merciful.",
            "english_hilali_khan": "And (He did forgive also) the three [who did not join the Tabûk expedition whose case was deferred (by the Prophet صلى الله عليه وسلم)] (for Allâh’s Decision) till for them the earth, vast as it is, was straitened and their ownselves were straitened to them, and they perceived that there is no fleeing from Allâh, and no refuge but with Him. Then, He forgave them (accepted their repentance), that they might beg for His pardon [repent (unto Him)] Verily, Allâh is the One Who forgives and accepts repentance, Most Merciful.",
            "english_rwwad": "[And Allah also turned in mercy to] the three who stayed behind, until the earth became constrained to them, despite its vastness, and their souls became a burden to them, and they realized that there was no refuge from Allah except in Him. Then He turned to them in mercy, so that they might repent, for Allah is the Accepter of Repentance, the Most Merciful."
        }
    },
    {
        "id": 1353,
        "chapter": 9,
        "verse": 119,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ",
        "phonetic": "9.119 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Attaqū Allāha Wa Kūnū Ma`a Aş-Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:119) The Statement of Allâh تعالى : ‘O you who believe! Be afraid of Allâh, and be with those who are true (in words and deeds).’ (V.9:119).\nAnd what is forbidden as regards telling of lies.\na) Narrated ‘Abdullâh رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"Truthfulness leads to Al-Birr (righteousness) and Al-Birr (righteousness) leads to Paradise. And a man keeps on telling the truth until he becomes a truthful person. Falsehood leads to Al-Fujûr (i.e. wickedness - evil-doing), and Al-Fujûr leads to the (Hell) Fire, and a man keeps on telling lies until he is written as a liar before Allâh.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.116).\nb) Narrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"The signs of a hypocrite are three: Whenever he speaks, he tells a lie; and whenever he promises, he breaks his promise; and whenever he is entrusted, he betrays (proves to be dishonest).\" (Sahih Al-Bukhari, Vol.8, Hadith No.117).\nc) Narrated Samurah bin Jundub رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"I saw (in a dream), two men came to me.\" Then the Prophet صلى الله عليه وسلم narrated the story (saying): \"They said: The person, the one whose cheek you saw being torn away (from the mouth to the ear) was a liar and used to tell lies and the people would report those lies on his authority till they spread all over the world. So he will be punished like that till the Day of Resurrection.\" (Sahih Al-Bukhari, Vol.8, Hadith No.118).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, fear Allāh and be with those who are true.",
            "english_hilali_khan": "O you who believe! Be afraid of Allâh, and be with those who are true (in words and deeds).[1]",
            "english_rwwad": "O you who believe, fear Allah and be with those who are truthful."
        }
    },
    {
        "id": 1354,
        "chapter": 9,
        "verse": 120,
        "arabic_text": "مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَـُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ",
        "phonetic": "9.120 Mā Kāna Li'hli Al-Madīnati Wa Man Ĥawlahum Mina Al-'A`rābi 'An Yatakhallafū `An Rasūli Allāhi Wa Lā Yarghabū Bi'anfusihim `An Nafsihi Dhālika Bi'annahum Lā Yuşībuhum Žama'un Wa Lā Naşabun Wa Lā Makhmaşatun Fī Sabīli Allāhi Wa Lā Yaţa'ūna Mawţi'āan Yaghīžu Al-Kuffāra Wa Lā Yanālūna Min `Adūwin Naylāan 'Illā Kutiba Lahum Bihi `Amalun Şāliĥun 'Inna Allāha Lā Yuđī`u 'Ajra Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "[507]- In times of hardship.  Rather, they should have been willing to endure with the Prophet (ﷺ) whatever was necessary for Islām.",
            "english_hilali_khan": "(V.9:120) Muhsinûn: Doers of good, i.e. those who perform good deeds totally for Allâh’s sake only without any show-off or to gain praise or fame, etc., and they do them in accordance with the Sunnah (legal ways) of Allâh’s Messenger, Muhammad صلى الله عليه وسلم.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It was not [proper] for the people of Madīnah and those surrounding them of the bedouins that they remain behind after [the departure of] the Messenger of Allāh or that they prefer themselves over his self.[507] That is because they are not afflicted by thirst or fatigue or hunger in the cause of Allāh, nor do they tread on any ground that enrages the disbelievers, nor do they inflict upon an enemy any infliction but that it is registered for them as a righteous deed. Indeed, Allāh does not allow to be lost the reward of the doers of good.",
            "english_hilali_khan": "It was not becoming of the people of Al-Madinah and the bedouins of the neighbourhood to remain behind Allâh’s Messenger (Muhammad صلى الله عليه وسلم when fighting in Allâh’s Cause) and (it was not becoming of them) to prefer their own lives to his life. That is because they suffer neither thirst nor fatigue, nor hunger in the Cause of Allâh, nor they take any step to raise the anger of disbelievers nor inflict any injury upon an enemy but is written to their credit as a deed of righteousness. Surely, Allâh wastes not the reward of the Muhsinûn [2]",
            "english_rwwad": "It was not for the people of Madinah and the Bedouins around them to stay behind the Messenger of Allah or to prefer their own lives to his. That is because whenever they suffer any thirst, weariness or hunger in the cause of Allah, or tread a place which enrages the disbelievers, or inflict any loss upon an enemy, a righteous deed is recorded for them. Allah does not allow the reward of those who do good to go to waste."
        }
    },
    {
        "id": 1355,
        "chapter": 9,
        "verse": 121,
        "arabic_text": "وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "9.121 Wa Lā Yunfiqūna Nafaqatan Şaghīratan Wa Lā Kabīratan Wa Lā Yaqţa`ūna Wa Adīāan 'Illā Kutiba Lahum Liyajziyahumu Allāhu 'Aĥsana Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:121)\na) Islâm demolishes all the previous evil deeds and so do migration (for Allâh’s sake) and Hajj (pilgrimage to Makkah). (Sahih Muslim, Vol.1, Chapter 52, Page 18)\nb) What is said regarding the superiority of a person who embraces Islâm sincerely.\nNarrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"If a person embraces Islâm sincerely, then Allâh shall forgive all his past sins, and after that starts the settlement of accounts: the reward of his good deeds will be ten times to seven hundred times for each good deed, and an evil deed will be recorded as it is unless Allâh forgives it.\" (Sahih Al-Bukhari, Vol.1, Hadith No. 40A)\nNarrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"If anyone of you improves (follow strictly) his Islâmic religion, then his good deeds will be rewarded ten times to seven hundred times for each good deed and a bad deed will be recorded as it is.\" (Sahih Al-Bukhari, Vol.1, Hadith No.4DB)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Nor do they spend an expenditure, small or large, or cross a valley but that it is registered for them that Allāh may reward them for the best of what they were doing.",
            "english_hilali_khan": "Nor do they spend anything (in Allâh’s Cause) - small or great - nor cross a valley, but is written to their credit that Allâh may recompense them with the best of what they used to do (i.e. Allâh will reward their good deeds according to the reward of their best deeds which they did in the most perfect manner).[3]",
            "english_rwwad": "Nor do they spend anything [for Allah’s cause], small or large, or cross a valley, but it is recorded for them, so that Allah may give them the best reward for what they used to do."
        }
    },
    {
        "id": 1356,
        "chapter": 9,
        "verse": 122,
        "arabic_text": "۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ",
        "phonetic": "9.122 Wa Mā Kāna Al-Mu'uminūna Liyanfirū Kāffatan Falawlā Nafara Min Kulli Firqatin Minhum Ţā'ifatun Liyatafaqqahū Fī Ad-Dīni Wa Liyundhirū Qawmahum 'Idhā Raja`ū 'Ilayhim La`allahum Yaĥdharūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn [i.e., advise] their people when they return to them that they might be cautious.",
            "english_hilali_khan": "And it is not (proper) for the believers to go out to fight (Jihâd ) all together. Of every troop of them, a party only should go forth, that they (who are left behind) may get instructions in (Islâmic) religion, and that they may warn their people when they return to them, so that they may beware (of evil).",
            "english_rwwad": "It is not right for the believers to march forth all at once; a group should go forth to acquire deeper knowledge of the religion, in order to admonish their people when they return to them, so that they may be cautious."
        }
    },
    {
        "id": 1357,
        "chapter": 9,
        "verse": 123,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قَٰتِلُواْ ٱلَّذِينَ يَلُونَكُم مِّنَ ٱلۡكُفَّارِ وَلۡيَجِدُواْ فِيكُمۡ غِلۡظَةٗۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ",
        "phonetic": "9.123 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Qātilū Al-Ladhīna Yalūnakum Mina Al-Kuffāri Wa Līajidū Fīkum Ghilžatan Wa A`lamū 'Anna Allāha Ma`a Al-Muttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, fight against those adjacent to you of the disbelievers and let them find in you harshness. And know that Allāh is with the righteous.",
            "english_hilali_khan": "O you who believe! Fight those of the disbelievers who are close to you, and let them find harshness in you; and know that Allâh is with those who are Al-Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "O you who believe, fight those disbelievers who are around you, and let them find harshness in you; and know that Allah is with those who fear Him."
        }
    },
    {
        "id": 1358,
        "chapter": 9,
        "verse": 124,
        "arabic_text": "وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ فَمِنۡهُم مَّن يَقُولُ أَيُّكُمۡ زَادَتۡهُ هَٰذِهِۦٓ إِيمَٰنٗاۚ فَأَمَّا ٱلَّذِينَ ءَامَنُواْ فَزَادَتۡهُمۡ إِيمَٰنٗا وَهُمۡ يَسۡتَبۡشِرُونَ",
        "phonetic": "9.124 Wa 'Idhā Mā 'Unzilat Sūratun Faminhum Man Yaqūlu 'Ayyukum Zādat/hu Hadhihi 'Īmānāan Fa'ammā Al-Ladhīna 'Āmanū Fazādat/hum 'Īmānāan Wa Hum Yastabshirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whenever a sūrah is revealed, there are among them [i.e., the hypocrites] those who say, \"Which of you has this increased in faith?\" As for those who believed, it has increased them in faith, while they are rejoicing.",
            "english_hilali_khan": "And whenever there comes down a Sûrah (chapter from the Qur’ân), some of them (hypocrites) say: \"Which of you has had his Faith increased by it?\" As for those who believe, it has increased their Faith, and they rejoice.",
            "english_rwwad": "Whenever a Chapter is sent down, some of those [hypocrites] say, “Which of you has this increased in faith?” As for those who believe, it does increase them in faith and they rejoice."
        }
    },
    {
        "id": 1359,
        "chapter": 9,
        "verse": 125,
        "arabic_text": "وَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ فَزَادَتۡهُمۡ رِجۡسًا إِلَىٰ رِجۡسِهِمۡ وَمَاتُواْ وَهُمۡ كَٰفِرُونَ",
        "phonetic": "9.125 Wa 'Ammā Al-Ladhīna Fī Qulūbihim Marađun Fazādat/hum Rijsāan 'Ilá Rijsihim Wa Mātū Wa Hum Kāfirūna",
        "footnotes": {
            "english_saheeh": "[508]- Literally, \"filth,\" i.e., disbelief and hypocrisy.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for those in whose hearts is disease, it has [only] increased them in evil [in addition] to their evil.[508] And they will have died while they are disbelievers.",
            "english_hilali_khan": "But as for those in whose hearts is a disease (of doubt, disbelief and hypocrisy), it will add suspicion and doubt to their suspicion, disbelief and doubt; and they die while they are disbelievers.",
            "english_rwwad": "But as for those in whose hearts is sickness, it only increases them in wickedness to their wickedness, and they will die while they are disbelievers."
        }
    },
    {
        "id": 1360,
        "chapter": 9,
        "verse": 126,
        "arabic_text": "أَوَلَا يَرَوۡنَ أَنَّهُمۡ يُفۡتَنُونَ فِي كُلِّ عَامٖ مَّرَّةً أَوۡ مَرَّتَيۡنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمۡ يَذَّكَّرُونَ",
        "phonetic": "9.126 'Awalā Yarawna 'Annahum Yuftanūna Fī Kulli `Āmin Marratan 'Aw Marratayni Thumma Lā Yatūbūna Wa Lā Hum Yadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not see that they are tried every year once or twice but then they do not repent nor do they remember?",
            "english_hilali_khan": "See they not that they are put in trial once or twice every year (with different kinds of calamities, disease, famine)? Yet, they turn not in repentance, nor do they learn a lesson (from it).",
            "english_rwwad": "Do they not see that they are put to trial once or twice every year? Yet they neither repent, nor do they take heed."
        }
    },
    {
        "id": 1361,
        "chapter": 9,
        "verse": 127,
        "arabic_text": "وَإِذَا مَآ أُنزِلَتۡ سُورَةٞ نَّظَرَ بَعۡضُهُمۡ إِلَىٰ بَعۡضٍ هَلۡ يَرَىٰكُم مِّنۡ أَحَدٖ ثُمَّ ٱنصَرَفُواْۚ صَرَفَ ٱللَّهُ قُلُوبَهُم بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ",
        "phonetic": "9.127 Wa 'Idhā Mā 'Unzilat Sūratun Nažara Ba`đuhum 'Ilá Ba`đin Hal Yarākum Min 'Aĥadin Thumma Anşarafū Şarafa Allāhu Qulūbahum Bi'annahum Qawmun Lā Yafqahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whenever a sūrah is revealed, they look at each other, [as if saying], \"Does anyone see you?\" and then they dismiss themselves. Allāh has dismissed their hearts because they are a people who do not understand.",
            "english_hilali_khan": "And whenever there comes down a Sûrah (chapter from the Qur’ân), they look at one another (saying): \"Does any one see you?\" Then they turn away. Allâh has turned their hearts (from the light) because they are a people that understand not.",
            "english_rwwad": "Whenever a Chapter is revealed, they look at one another [saying], “Is anyone watching you?” Then they slip away. Allah has turned their hearts away because they are a people who do not understand."
        }
    },
    {
        "id": 1362,
        "chapter": 9,
        "verse": 128,
        "arabic_text": "لَقَدۡ جَآءَكُمۡ رَسُولٞ مِّنۡ أَنفُسِكُمۡ عَزِيزٌ عَلَيۡهِ مَا عَنِتُّمۡ حَرِيصٌ عَلَيۡكُم بِٱلۡمُؤۡمِنِينَ رَءُوفٞ رَّحِيمٞ",
        "phonetic": "9.128 Laqad Jā'akum Rasūlun Min 'Anfusikum `Azīzun `Alayhi Mā `Anittum Ĥarīşun `Alaykum Bil-Mu'uminīna Ra'ūfun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer; [he is] concerned over you [i.e., your guidance] and to the believers is kind and merciful.",
            "english_hilali_khan": "Verily, there has come unto you a Messenger (Muhammad صلى الله عليه وسلم) from amongst yourselves (i.e. whom you know well). It grieves him that you should receive any injury or difficulty. He (Muhammad صلى الله عليه وسلم) is anxious over you (to be rightly guided, to repent to Allâh, and beg Him to pardon and forgive your sins in order that you may enter Paradise and be saved from the punishment of the Hell-fire); for the believers (he صلى الله عليه وسلم is) full of pity, kind, and merciful.",
            "english_rwwad": "There has come to you a Messenger from among yourselves; he is grieved by your suffering, and is concerned for you, and is gracious and merciful towards the believers."
        }
    },
    {
        "id": 1363,
        "chapter": 9,
        "verse": 129,
        "arabic_text": "فَإِن تَوَلَّوۡاْ فَقُلۡ حَسۡبِيَ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَهُوَ رَبُّ ٱلۡعَرۡشِ ٱلۡعَظِيمِ",
        "phonetic": "9.129 Fa'in Tawallaw Faqul Ĥasbī Allāhu Lā 'Ilāha 'Illā Huwa `Alayhi Tawakkaltu Wa Huwa Rabbu Al-`Arshi Al-`Ažīmi ",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.9:129) See the footnote of (V.3:173).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if they turn away, [O Muḥammad], say, \"Sufficient for me is Allāh; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne.\"",
            "english_hilali_khan": "But if they turn away, say (O Muhammad صلى الله عليه وسلم): \"Allâh is sufficient for me. Lâ ilâha illa Huwa (none has the right to be worshipped but He) in Him I put my trust and He is the Lord of the Mighty Throne.\"[1]",
            "english_rwwad": "But if they turn away, then say, “Allah is sufficient for me; none has the right to be worshiped except Him; in Him I put my trust, and He is the Lord of the Mighty Throne.”"
        }
    }
]