[
    {
        "id": 6130,
        "chapter": 98,
        "verse": 1,
        "arabic_text": "لَمۡ يَكُنِ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَٱلۡمُشۡرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأۡتِيَهُمُ ٱلۡبَيِّنَةُ",
        "phonetic": "98.1 Lam Yakuni Al-Ladhīna Kafarū Min 'Ahli Al-Kitābi Wa Al-Mushrikīna Munfakkīna Ĥattá Ta'tiyahumu Al-Bayyinahu",
        "footnotes": {
            "english_saheeh": "[1958]- i.e., from their erroneous beliefs and superstitions.",
            "english_hilali_khan": "(V.98:1) Al-Mushrikûn: polytheists, pagans, idolaters and disbelievers in the Oneness of Allâh and His Messenger Muhammad صلى الله عليه وسلم.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who disbelieved among the People of the Scripture and the polytheists were not to be parted [from misbelief][1958] until there came to them clear evidence ",
            "english_hilali_khan": "Those who disbelieve from among the people of the Scripture (Jews and Christians) and Al-Mushrikûn,[3] were not going to leave (their disbelief) until there came to them clear evidence.",
            "english_rwwad": "Those who disbelieve from the People of the Book and the polytheists were not going to desist [from disbelief] until there came to them clear proof,"
        }
    },
    {
        "id": 6131,
        "chapter": 98,
        "verse": 2,
        "arabic_text": "رَسُولٞ مِّنَ ٱللَّهِ يَتۡلُواْ صُحُفٗا مُّطَهَّرَةٗ",
        "phonetic": "98.2 Rasūlun Mina Allāhi Yatlū Şuĥufāan Muţahharahan",
        "footnotes": {
            "english_saheeh": "[1959]- i.e., containing no falsehood.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "A Messenger from Allāh, reciting purified[1959] scriptures ",
            "english_hilali_khan": "A Messenger (Muhammad صلى الله عليه وسلم) from Allâh, reciting (the Qur’ân) purified pages [purified from Al-Bâtil (falsehood)].",
            "english_rwwad": "a messenger from Allah, reciting pure pages"
        }
    },
    {
        "id": 6132,
        "chapter": 98,
        "verse": 3,
        "arabic_text": "فِيهَا كُتُبٞ قَيِّمَةٞ",
        "phonetic": "98.3 Fīhā Kutubun Qayyimahun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Within which are correct writings [i.e., rulings and laws].",
            "english_hilali_khan": "Wherein are correct and straight laws from Allâh.",
            "english_rwwad": "containing upright commandments."
        }
    },
    {
        "id": 6133,
        "chapter": 98,
        "verse": 4,
        "arabic_text": "وَمَا تَفَرَّقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَةُ",
        "phonetic": "98.4 Wa Mā Tafarraqa Al-Ladhīna 'Ūtū Al-Kitāba 'Illā Min Ba`di Mā Jā'at/humu Al-Bayyinahu",
        "footnotes": {
            "english_saheeh": "[1960]- Into sects and denominations.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Nor did those who were given the Scripture become divided[1960] until after there had come to them clear evidence. ",
            "english_hilali_khan": "And the people of the Scripture (Jews and Christians) differed not until after there came to them clear evidence (i.e. Prophet Muhammad صلى الله عليه وسلم and whatever was revealed to him).",
            "english_rwwad": "Yet those who were given the Scripture did not disagree except after the clear proof came to them,"
        }
    },
    {
        "id": 6134,
        "chapter": 98,
        "verse": 5,
        "arabic_text": "وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ وَيُقِيمُواْ ٱلصَّلَوٰةَ وَيُؤۡتُواْ ٱلزَّكَوٰةَۚ وَذَٰلِكَ دِينُ ٱلۡقَيِّمَةِ",
        "phonetic": "98.5 Wa Mā 'Umirū 'Illā Liya`budū Allāha Mukhlişīna Lahu Ad-Dīna Ĥunafā'a Wa Yuqīmū Aş-Şalāata Wa Yu'utū Az-Zakāata Wa Dhalika Dīnu Al-Qayyimahi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they were not commanded except to worship Allāh, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakāh. And that is the correct religion. ",
            "english_hilali_khan": "And they were commanded not, but that they should worship Allâh, and worship none but Him Alone (abstaining from ascribing partners to Him), and perform As-Salât (Iqâmat-as-Salât) and give Zakât, and that is the right religion.",
            "english_rwwad": "although they were commanded only to worship Allah with sincere devotion to Him, being inclined to true faith, and to establish prayer and give zakah; that is the true religion."
        }
    },
    {
        "id": 6135,
        "chapter": 98,
        "verse": 6,
        "arabic_text": "إِنَّ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَٱلۡمُشۡرِكِينَ فِي نَارِ جَهَنَّمَ خَٰلِدِينَ فِيهَآۚ أُوْلَٰٓئِكَ هُمۡ شَرُّ ٱلۡبَرِيَّةِ",
        "phonetic": "98.6 'Inna Al-Ladhīna Kafarū Min 'Ahli Al-Kitābi Wa Al-Mushrikīna Fī Nāri Jahannama Khālidīna Fīhā 'Ūlā'ika Hum Sharru Al-Barīyahi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.98:6) It is obligatory to have Belief in the Messengership of the Prophet (Muhammad صلى الله عليه وسلم). Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said: \"By Him (Allâh) in Whose Hand Muhammad’s soul is, there is none from amongst the Jews and Christians (of these present nations) who hears about me and then dies without believing in the Message with which I have been sent (i.e. Islâmic Monotheism) but he will be from the dwellers of the (Hell) Fire.\" (Sahih Muslim, the Book of Faith, Vol.1, Chapter No.240). See also (V.3:85) and (V.3:116).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, they who disbelieved among the People of the Scripture and the polytheists will be in the fire of Hell, abiding eternally therein. Those are the worst of creatures. ",
            "english_hilali_khan": "Verily, those who disbelieve (in the religion of Islâm, the Qur’ân and Prophet Muhammad صلى الله عليه وسلم) from among the people of the Scripture (Jews and Christians) and Al-Mushrikûn will abide in the Fire of Hell. They are the worst of creatures.[4]",
            "english_rwwad": "Those who disbelieve from the People of the Book and the polytheists will be in the fire of Hell, abiding therein forever. It is they who are the worst of creatures."
        }
    },
    {
        "id": 6136,
        "chapter": 98,
        "verse": 7,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ هُمۡ خَيۡرُ ٱلۡبَرِيَّةِ",
        "phonetic": "98.7 'Inna Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti 'Ūlā'ika Hum Khayru Al-Barīyahi",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, they who have believed and done righteous deeds - those are the best of creatures. ",
            "english_hilali_khan": "Verily, those who believe [in the Oneness of Allâh, and in His Messenger Muhammad صلى الله عليه وسلم) including all obligations ordered by Islâm] and do righteous good deeds, they are the best of creatures.",
            "english_rwwad": "As for those who believe and do righteous deeds – it is they who are the best of creatures."
        }
    },
    {
        "id": 6137,
        "chapter": 98,
        "verse": 8,
        "arabic_text": "جَزَآؤُهُمۡ عِندَ رَبِّهِمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ ذَٰلِكَ لِمَنۡ خَشِيَ رَبَّهُۥ",
        "phonetic": "98.8 Jazā'uuhum `Inda Rabbihim Jannātu `Adnin Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā 'Abadāan Rađiya Allāhu `Anhum Wa Rađū `Anhu Dhālika Liman Khashiya Rabbahu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Their reward with their Lord will be gardens of perpetual residence beneath which rivers flow, wherein they will abide forever, Allāh being pleased with them and they with Him. That is for whoever has feared his Lord. ",
            "english_hilali_khan": "Their reward with their Lord is ‘Adn (Eden) Paradise (Gardens of Eternity), underneath which rivers flow. They will abide therein forever, Allâh will be pleased with them, and they with Him. That is for him who fears his Lord.",
            "english_rwwad": "Their reward with their Lord is Gardens of Eternity under which rivers flow, abiding therein forever. Allah is pleased with them and they are pleased with Him. This is for those who fear their Lord."
        }
    }
]