[
    {
        "id": 6188,
        "chapter": 105,
        "verse": 1,
        "arabic_text": "أَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِأَصۡحَٰبِ ٱلۡفِيلِ",
        "phonetic": "105.1 'Alam Tará Kayfa Fa`ala Rabbuka Bi'aşĥābi Al-Fīl",
        "footnotes": {
            "english_saheeh": "[1992]- i.e., the army under the command of Abrahah al-Ashram which was accompanied by a huge elephant and came with the intention of destroying the Kaʿbah at Makkah.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you not considered, [O Muḥammad], how your Lord dealt with the companions of the elephant?[1992] ",
            "english_hilali_khan": "Have you (O Muhammad صلى الله عليه وسلم) not seen how your Lord dealt with the owners of the Elephant? [The Elephant army which came from Yemen under the command of Abrahah Al-Ashram intending to destroy the Ka‘bah at Makkah].",
            "english_rwwad": "Have you not seen how your Lord dealt with the people of the Elephant?"
        }
    },
    {
        "id": 6189,
        "chapter": 105,
        "verse": 2,
        "arabic_text": "أَلَمۡ يَجۡعَلۡ كَيۡدَهُمۡ فِي تَضۡلِيلٖ",
        "phonetic": "105.2 'Alam Yaj`al Kaydahum Fī Tađlīlin",
        "footnotes": {
            "english_saheeh": "[1993]- Causing them to perish.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Did He not make their plan into misguidance?[1993] ",
            "english_hilali_khan": "Did He not make their plot go astray?",
            "english_rwwad": "Did He not turn their scheme into a total loss?"
        }
    },
    {
        "id": 6190,
        "chapter": 105,
        "verse": 3,
        "arabic_text": "وَأَرۡسَلَ عَلَيۡهِمۡ طَيۡرًا أَبَابِيلَ",
        "phonetic": "105.3 Wa 'Arsala `Alayhim Ţayrāan 'Abābīla",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He sent against them birds in flocks, ",
            "english_hilali_khan": "And He sent against them birds, in flocks,",
            "english_rwwad": "He sent against them swarms of birds,"
        }
    },
    {
        "id": 6191,
        "chapter": 105,
        "verse": 4,
        "arabic_text": "تَرۡمِيهِم بِحِجَارَةٖ مِّن سِجِّيلٖ",
        "phonetic": "105.4 Tarmīhim Biĥijāratin Min Sijjīlin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Striking them with stones of hard clay, ",
            "english_hilali_khan": "Striking them with stones of Sijjîl (baked clay).",
            "english_rwwad": "pelting them with stones of baked clay,"
        }
    },
    {
        "id": 6192,
        "chapter": 105,
        "verse": 5,
        "arabic_text": "فَجَعَلَهُمۡ كَعَصۡفٖ مَّأۡكُولِۭ",
        "phonetic": "105.5 Faja`alahum Ka`aşfin Ma'kūlin",
        "footnotes": {
            "english_saheeh": "[1994]- i.e., husks which have been chewed by cattle. This event took place in the year of the Prophet's birth.",
            "english_hilali_khan": "(V.105:5) The story of the army of the Elephants (the Qur’ân 105:1-5). This incident happened during the period of the birth-year of Prophet Muhammad صلى الله عليه وسلم. Abrahah Al-Ashram was the governor of Yemen on behalf of the king of Ethiopia (as Yemen was a part of the Ethiopian kingdom). He (Abrahah) thought to build a house (like the Ka‘bah at Makkah) in San‘a (the capital of Yemen) and call the Arabs to perform the pilgrimage there in San‘a instead of the Ka‘bah (Al-Bait Al-Harâm) in Makkah, with the intention of diverting the trade and benefits from Makkah to Yemen. He presented his idea to the king of Ethiopia who agreed to his idea. So the house (church) was built and he named it Al-Qullais; there was no church of its like at that time. Then a man from the Quraish tribe of Makkah came there and was infuriated by it, so he relieved his nature (stools and urine) in it, soiled its walls and went away. When Abrahah Al-Ashram saw that, he could not control his anger and raised an army to invade Makkah and demolish the Ka‘bah. He had in that army thirteen elephants and amongst them was an elephant called Mahmûd which was the biggest of them. So that army proceeded and none amongst the Arab tribes that faced them (fought against them) but was killed and defeated, till it approached near Makkah. Then there took place negotiations between Abrahah Al-Ashram and the chief of Makkah (Abdul Muttalib bin Hâshim, the grandfather of the Prophet صلى الله عليه وسلم), and it was concluded that Abrahah would restore the camels of Abdul Muttalib which he had taken away, and then he (Abrahah Al-Ashram) would decide himself as regards the Ka‘bah. Abdul Muttalib ordered the men of Makkah to evacuate the city and go to the top of the mountains along with their wives and children in case some harm should come to them from the invading oppressors. Then that army moved towards Makkah till they reached valley Muhassir. While the army was marching towards Makkah, in the middle of the valley, suddenly it was overtaken by flocks of birds, flocks after flocks, air-raiding that army with small stones slightly bigger than a lentil seed. There never fell a stone on a soldier except it dissolved his flesh and burst it into pieces. So they perished with a total destruction. Abrahah Al-Ashram fled away while his flesh was bursting into pieces till he died on the way (back to Yemen). Such was the victory bestowed by Allâh, (the All-Majestic, All-Powerful) to the people of Makkah and such was the protection provided by Him for His House (Ka‘bah in Makkah). (See Tafsîr Ibn Kathir, Sûrah Al-Fîl).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He made them like eaten straw.[1994] ",
            "english_hilali_khan": "And He made them like (an empty field of) stalks (of which the corn has been eaten up by cattle).[2]",
            "english_rwwad": "leaving them like chewed up and trampled chaff."
        }
    }
]