[
    {
        "id": 2029,
        "chapter": 17,
        "verse": 1,
        "arabic_text": "سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
        "phonetic": "17.1 Subĥāna Al-Ladhī 'Asrá Bi`abdihi Laylāan Mina Al-Masjidi Al-Ĥarāmi 'Ilá Al-Masjidi Al-'Aqşá Al-Ladhī Bāraknā Ĥawlahu Linuriyahu Min 'Āyātinā 'Innahu Huwa As-Samī`u Al-Başīru",
        "footnotes": {
            "english_saheeh": "[722]- Above any imperfection or failure to do as He wills.\n[723]- In Jerusalem.\n[724]- Who hears every sound, distinguishes every voice, understands every word, and accepts and responds to supplications.\n[725]- After Seeing add ftnt:  Who sees and understands all things apparent and unapparent, visible and invisible.",
            "english_hilali_khan": "[1] (V.17:1)وقد روى طلحة بن عبيد الله أنه قال للنبي صلى الله عليه وسلم ما معنى سبحان الله؟ قال تنزيه الله من كل سوء؛\n[2] (V.17:1) Narrated Jâbir bin ‘Abdullâh رضي الله عنهما that he heard Allâh’s Messenger صلى الله عليه وسلم saying, \"When the people of Quraish did not believe me [i.e. in the story of my Isrâ’ - (Night Journey)], I stood up in Al-Hijr and Allâh displayed Jerusalem in front of me, and I began describing it to them while I was looking at it. (Sahih Al-Bukhari, Vol.5, Hadith No.226).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Exalted[722] is He who took His Servant [i.e., Prophet Muḥammad (ﷺ)] by night from al-Masjid al-Ḥarām to al-Masjid al-Aqṣā,[723] whose surroundings We have blessed, to show him of Our signs. Indeed, He is the Hearing,[724] the Seeing.[725]",
            "english_hilali_khan": "1. Glorified (and Exalted) be He (Allâh) [above all that (evil) they associate with Him][1] Who took His slave (Muhammad صلى الله عليه و سلم) for a journey by night from Al-Masjid-al-Harâm (at Makkah) to Al-Masjid-al-Aqsâ (in Jerusalem), the neighbourhood whereof We have blessed, in order that We might show him (Muhammad صلى الله عليه و سلم) of Our Ayât (proofs, evidence, lessons, signs, etc.). Verily, He is the All-Hearer, the All-Seer[2].",
            "english_rwwad": "Glory be to the One Who took His slave [Muhammad] by night from the Sacred Mosque [in Makkah] to the Aqsā Mosque [in Jerusalem] whose surroundings We have blessed, so that We may show him some of Our signs. Indeed, He is the All-Hearing, the All-Seeing."
        }
    },
    {
        "id": 2030,
        "chapter": 17,
        "verse": 2,
        "arabic_text": "وَءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِي وَكِيلٗا",
        "phonetic": "17.2 Wa 'Ātaynā Mūsá Al-Kitāba Wa Ja`alnāhu Hudáan Libanī 'Isrā'īla 'Allā Tattakhidhū Min Dūnī Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "[726]- i.e., trust in Allāh, knowing that He (subḥānahu wa taʿālā) is responsible for every occurrence.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We gave Moses the Scripture and made it a guidance for the Children of Israel that you not take other than Me as Disposer of affairs,[726]",
            "english_hilali_khan": "And We gave Mûsâ (Moses) the Scripture and made it a guidance for the Children of Israel (saying): \"Take none other than Me as (your) Wakîl (Protector, Lord or Disposer of your affairs).",
            "english_rwwad": "We gave Moses the Scripture and made it a guide for the Children of Israel, “Do not take besides Me anyone as a Disposer of Affairs."
        }
    },
    {
        "id": 2031,
        "chapter": 17,
        "verse": 3,
        "arabic_text": "ذُرِّيَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدٗا شَكُورٗا",
        "phonetic": "17.3 Dhurrīyata Man Ĥamalnā Ma`a Nūĥin 'Innahu Kāna `Abdāan Shakūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O descendants of those We carried [in the ship] with Noah. Indeed, he was a grateful servant.",
            "english_hilali_khan": "\"O offspring of those whom We carried (in the ship) with Nûh (Noah)! Verily, he was a grateful slave.\"",
            "english_rwwad": "O descendants of those whom We carried [on board] with Noah. He was indeed a grateful slave.”"
        }
    },
    {
        "id": 2032,
        "chapter": 17,
        "verse": 4,
        "arabic_text": "وَقَضَيۡنَآ إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ فِي ٱلۡكِتَٰبِ لَتُفۡسِدُنَّ فِي ٱلۡأَرۡضِ مَرَّتَيۡنِ وَلَتَعۡلُنَّ عُلُوّٗا كَبِيرٗا",
        "phonetic": "17.4 Wa Qađaynā 'Ilá Banī 'Isrā'īla Fī Al-Kitābi Latufsidunna Fī Al-'Arđi Marratayni Wa Lata`lunna `Ulūwāan Kabīrāan",
        "footnotes": {
            "english_saheeh": "[727]- Foretold out of divine knowledge of what they would do.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We conveyed[727] to the Children of Israel in the Scripture that, \"You will surely cause corruption on the earth twice, and you will surely reach [a degree of] great haughtiness.\"",
            "english_hilali_khan": "And We decreed for the Children of Israel in the Scripture: indeed you would do mischief in the land twice and you will become tyrants and extremely arrogant!",
            "english_rwwad": "We declared to the Children of Israel in the Scripture, “You will surely spread corruption on earth twice, and you will surely become exceedingly arrogant."
        }
    },
    {
        "id": 2033,
        "chapter": 17,
        "verse": 5,
        "arabic_text": "فَإِذَا جَآءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَيۡكُمۡ عِبَادٗا لَّنَآ أُوْلِي بَأۡسٖ شَدِيدٖ فَجَاسُواْ خِلَٰلَ ٱلدِّيَارِۚ وَكَانَ وَعۡدٗا مَّفۡعُولٗا",
        "phonetic": "17.5 Fa'idhā Jā'a Wa`du 'Ūlāhumā Ba`athnā `Alaykum `Ibādāan Lanā 'Ūlī Ba'sin Shadīdin Fajāsū Khilāla Ad-Diyāri Wa Kāna Wa`dāan Maf`ūlāan",
        "footnotes": {
            "english_saheeh": "[728]- i.e., the promised punishment for the first of their two transgressions.\n[729]- Violating their sanctity, to kill and plunder.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when the [time of] promise came for the first of them,[728] We sent against you servants of Ours - those of great military might, and they probed [even] into the homes,[729] and it was a promise fulfilled.",
            "english_hilali_khan": "So, when the promise came for the first of the two, We sent against you slaves of Ours given to terrible warfare. They entered the very innermost parts of your homes. And it was a promise (completely) fulfilled.",
            "english_rwwad": "When the first of the two warnings came to pass, We sent against you some of Our slaves of great might, and they ravaged through the land; this warning was bound to be fulfilled."
        }
    },
    {
        "id": 2034,
        "chapter": 17,
        "verse": 6,
        "arabic_text": "ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَيۡهِمۡ وَأَمۡدَدۡنَٰكُم بِأَمۡوَٰلٖ وَبَنِينَ وَجَعَلۡنَٰكُمۡ أَكۡثَرَ نَفِيرًا",
        "phonetic": "17.6 Thumma Radadnā Lakumu Al-Karrata `Alayhim Wa 'Amdadnākum Bi'amwālin Wa Banīna Wa Ja`alnākum 'Akthara Nafīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We gave back to you a return victory over them. And We reinforced you with wealth and sons and made you more numerous in manpower.",
            "english_hilali_khan": "Then We gave you a return of victory over them. And We helped you with wealth and children and made you more numerous in man-power.",
            "english_rwwad": "Then We gave you the upper hand over them and strengthened you with wealth and children, and made you greater in number."
        }
    },
    {
        "id": 2035,
        "chapter": 17,
        "verse": 7,
        "arabic_text": "إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ لِيَسُـُٔواْ وُجُوهَكُمۡ وَلِيَدۡخُلُواْ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٖ وَلِيُتَبِّرُواْ مَا عَلَوۡاْ تَتۡبِيرًا",
        "phonetic": "17.7 'In 'Aĥsantum 'Aĥsantum Li'nfusikum Wa 'In 'Asa'tum Falahā Fa'idhā Jā'a Wa`du Al-'Ākhirati Liyasū'ū Wujūhakum Wa Liyadkhulū Al-Masjida Kamā Dakhalūhu 'Awwala Marratin Wa Liyutabbirū Mā `Alaw Tatbīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[And said], \"If you do good, you do good for yourselves; and if you do evil, [you do it] to them [i.e., yourselves].\" Then when the final [i.e., second] promise came, [We sent your enemies] to sadden your faces and to enter the masjid [i.e., the temple in Jerusalem], as they entered it the first time, and to destroy what they had taken over with [total] destruction.",
            "english_hilali_khan": "(And We said): \"If you do good, you do good for your ownselves, and if you do evil (you do it) against yourselves.\" Then, when the second promise came to pass, (We permitted your enemies) to disgrace your faces and to enter the mosque (of Jerusalem) as they had entered it before, and to destroy with utter destruction all that fell in their hands.",
            "english_rwwad": "If you do good, it is for your own good, but if you do evil, it is to your own loss. Then when the second warning came to pass, your enemies would disgrace and suppress you, and enter the Temple [of Jerusalem] as they entered it the first time, and utterly destroy whatever fell into their power."
        }
    },
    {
        "id": 2036,
        "chapter": 17,
        "verse": 8,
        "arabic_text": "عَسَىٰ رَبُّكُمۡ أَن يَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ حَصِيرًا",
        "phonetic": "17.8 `Asá Rabbukum 'An Yarĥamakum Wa 'In `Udtum `Udnā Wa Ja`alnā Jahannama Lilkāfirīna Ĥaşīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Then Allāh said], \"It is expected, [if you repent], that your Lord will have mercy upon you. But if you return [to sin], We will return [to punishment]. And We have made Hell, for the disbelievers, a prison-bed.\"",
            "english_hilali_khan": "[And We said in the Taurât (Torah)]: \"It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our Punishment). And We have made Hell a prison for the disbelievers.",
            "english_rwwad": "Your Lord may bestow mercy upon you, but if you return [to sin], We will return [to punishment]. And We have made Hell a prison for the disbelievers.”"
        }
    },
    {
        "id": 2037,
        "chapter": 17,
        "verse": 9,
        "arabic_text": "إِنَّ هَٰذَا ٱلۡقُرۡءَانَ يَهۡدِي لِلَّتِي هِيَ أَقۡوَمُ وَيُبَشِّرُ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرٗا كَبِيرٗا",
        "phonetic": "17.9 'Inna Hādhā Al-Qur'āna Yahdī Lillatī Hiya 'Aqwamu Wa Yubashiru Al-Mu'uminīna Al-Ladhīna Ya`malūna Aş-Şāliĥāti 'Anna Lahum 'Ajrāan Kabīrāan ",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, this Qur’ān guides to that which is most suitable and gives good tidings to the believers who do righteous deeds that they will have a great reward",
            "english_hilali_khan": "Verily, this Qur’ân guides to that which is most just and right and gives glad tidings to the believers (in the Oneness of Allâh and His Messenger, Muhammad صلى الله عليه و سلم), who work deeds of righteousness, that they shall have a great reward (Paradise).",
            "english_rwwad": "Indeed, this Qur’an guides to what is most upright, and gives glad tidings to the believers who do righteous deeds that they will have a great reward."
        }
    },
    {
        "id": 2038,
        "chapter": 17,
        "verse": 10,
        "arabic_text": "وَأَنَّ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِيمٗا",
        "phonetic": "17.10 Wa 'Anna Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati 'A`tadnā Lahum `Adhābāan 'Alīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And that those who do not believe in the Hereafter - We have prepared for them a painful punishment.",
            "english_hilali_khan": "And that those who believe not in the Hereafter, for them We have prepared a painful torment (Hell).",
            "english_rwwad": "And that those who do not believe in the Hereafter, We have prepared for them a painful punishment."
        }
    },
    {
        "id": 2039,
        "chapter": 17,
        "verse": 11,
        "arabic_text": "وَيَدۡعُ ٱلۡإِنسَٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلۡخَيۡرِۖ وَكَانَ ٱلۡإِنسَٰنُ عَجُولٗا",
        "phonetic": "17.11 Wa Yad`u Al-'Insānu Bish-Sharri Du`ā'ahu Bil-Khayri Wa Kāna Al-'Insānu `Ajūlāan",
        "footnotes": {
            "english_saheeh": "[730]- i.e., impatient, emotional, and acting without forethought.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And man supplicates for evil [when angry] as he supplicates for good, and man is ever hasty.[730]",
            "english_hilali_khan": "And man invokes (Allâh) for evil as he invokes (Allâh) for good and man is ever hasty [i.e., if he is angry with somebody, he invokes (saying): \"O Allâh! Curse him\" and that one should not do, but one should be patient].",
            "english_rwwad": "Man prays for evil as he prays for good, for man is ever hasty."
        }
    },
    {
        "id": 2040,
        "chapter": 17,
        "verse": 12,
        "arabic_text": "وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا",
        "phonetic": "17.12 Wa Ja`alnā Al-Layla Wa An-Nahāra 'Āyatayni Famaĥawnā 'Āyata Al-Layli Wa Ja`alnā 'Āyata An-Nahāri Mubşiratan Litabtaghū Fađlāan Min Rabbikum Wa Lita`lamū `Adada As-Sinīna Wa Al-Ĥisāba Wa Kulla Shay'in Faşşalnāhu Tafşīlāan",
        "footnotes": {
            "english_saheeh": "[731]- Or \"giving sight.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have made the night and day two signs, and We erased the sign of the night and made the sign of the day visible[731] that you may seek bounty from your Lord and may know the number of years and the account [of time]. And everything We have set out in detail.",
            "english_hilali_khan": "And We have appointed the night and the day as two Ayât (signs etc.). Then, We have obliterated the sign of the night (with darkness) while We have made the sign of the day illuminating, that you may seek bounty from your Lord, and that you may know the number of the years and the reckoning. And We have explained everything (in detail) with full explanation.",
            "english_rwwad": "We have made the day and night as two signs. We darkened the night and made the day bright, so that you may seek your Lord’s bounty and know the number of years and calculation [of time]. And We have expounded everything in detail."
        }
    },
    {
        "id": 2041,
        "chapter": 17,
        "verse": 13,
        "arabic_text": "وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا",
        "phonetic": "17.13 Wa Kulla 'Insānin 'Alzamnāhu Ţā'irahu Fī `Unuqihi Wa Nukhriju Lahu Yawma Al-Qiyāmati Kitābāan Yalqāhu Manshūrāan",
        "footnotes": {
            "english_saheeh": "[732]- i.e., after having instructed him, We have made him responsible for his own destiny.",
            "english_hilali_khan": "(V.17:13) Narrated Ibn Mas‘ûd رضي الله عنه: A man asked the Prophet صلى الله عليه وسلم \"What deeds are the best?\" The Prophet صلى الله عليه وسلم said; (1) To perform the (daily compulsory) Salât (prayers) at their (early) stated fixed times; (2) To be good and dutiful to one’s own parents (3) and to participate in Jihâd in Allâh’s Cause.\" (Sahih Al-Bukhari, Vol.9, Hadith No.625).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [for] every person We have imposed his fate upon his neck,[732] and We will produce for him on the Day of Resurrection a record which he will encounter spread open.",
            "english_hilali_khan": "And We have fastened every man’s deeds[1] to his neck, and on the Day of Resurrection, We shall bring out for him a book which he will find wide open.",
            "english_rwwad": "We have bound every man’s deeds to his neck. On the Day of Resurrection We will bring forth for him a record which he will find spread open."
        }
    },
    {
        "id": 2042,
        "chapter": 17,
        "verse": 14,
        "arabic_text": "ٱقۡرَأۡ كِتَٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡيَوۡمَ عَلَيۡكَ حَسِيبٗا",
        "phonetic": "17.14 Aqra' Kitābaka Kafá Binafsika Al-Yawma `Alayka Ĥasībāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It will be said], \"Read your record. Sufficient is yourself against you this Day as accountant.\"",
            "english_hilali_khan": "(It will be said to him): \"Read your book. You yourself are sufficient as a reckoner against you this Day.\"",
            "english_rwwad": "[It will be said,] “Read your record; this Day you are sufficient to take account of yourself.”"
        }
    },
    {
        "id": 2043,
        "chapter": 17,
        "verse": 15,
        "arabic_text": "مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا",
        "phonetic": "17.15 Mani Ahtadá Fa'innamā Yahtadī Linafsihi Wa Man Đalla Fa'innamā Yađillu `Alayhā Wa Lā Taziru Wāziratun Wizra 'Ukhrá Wa Mā Kunnā Mu`adhibīna Ĥattá Nab`atha Rasūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever is guided is only guided for [the benefit of] his soul. And whoever errs only errs against it. And no bearer of burdens will bear the burden of another. And never would We punish until We sent a messenger.",
            "english_hilali_khan": "Whoever goes right, then he goes right only for the benefit of his ownself. And whoever goes astray, then he goes astray to his own loss. No one laden with burdens can bear another’s burden. And We never punish until We have sent a Messenger (to give warning).",
            "english_rwwad": "Whoever accepts guidance, it is only for his own good; and whoever goes astray, it is only for his own loss. No bearer of burden will bear the burden of another, nor do We punish until We have sent a messenger."
        }
    },
    {
        "id": 2044,
        "chapter": 17,
        "verse": 16,
        "arabic_text": "وَإِذَآ أَرَدۡنَآ أَن نُّهۡلِكَ قَرۡيَةً أَمَرۡنَا مُتۡرَفِيهَا فَفَسَقُواْ فِيهَا فَحَقَّ عَلَيۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَٰهَا تَدۡمِيرٗا",
        "phonetic": "17.16 Wa 'Idhā 'Aradnā 'An Nuhlika Qaryatan 'Amarnā Mutrafīhā Fafasaqū Fīhā Faĥaqqa `Alayhā Al-Qawlu Fadammarnāhā Tadmīrāan",
        "footnotes": {
            "english_saheeh": "[733]- To obey Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when We intend to destroy a city, We command its affluent[733] but they defiantly disobey therein; so the word [i.e., deserved decree] comes into effect upon it, and We destroy it with [complete] destruction.",
            "english_hilali_khan": "And when We decide to destroy a town (population), We (first) send a definite order (to obey Allâh and be righteous) to those among them [or We (first) increase in number those of its population] who lead a life of luxury. Then, they transgress therein, and thus the word (of torment) is justified against it (them). Then We destroy it with complete destruction.",
            "english_rwwad": "Whenever We decide to destroy a town, We command its affluent ones [to obey Allah] but they defiantly disobey, so the punishment becomes inevitable, and We destroy it completely."
        }
    },
    {
        "id": 2045,
        "chapter": 17,
        "verse": 17,
        "arabic_text": "وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحٖۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرَۢا بَصِيرٗا",
        "phonetic": "17.17 Wa Kam 'Ahlaknā Mina Al-Qurūni Min Ba`di Nūĥin Wa Kafá Birabbika Bidhunūbi `Ibādihi Khabīrāan Başīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how many have We destroyed from the generations after Noah. And sufficient is your Lord, concerning the sins of His servants, as Aware and Seeing.",
            "english_hilali_khan": "And how many generations have We destroyed after Nûh (Noah)! And Sufficient is your Lord as an All-Knower and All-Beholder of the sins of His slaves.",
            "english_rwwad": "How many generations We have destroyed since the time Noah! Your Lord is sufficient as All-Aware and All-Seeing of the sins of His slaves."
        }
    },
    {
        "id": 2046,
        "chapter": 17,
        "verse": 18,
        "arabic_text": "مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا",
        "phonetic": "17.18 Man Kāna Yurīdu Al-`Ājilata `Ajjalnā Lahu Fīhā Mā Nashā'u Liman Nurīdu Thumma Ja`alnā Lahu Jahannama Yaşlāhā Madhmūmāan Madĥūrāan",
        "footnotes": {
            "english_saheeh": "[734]- i.e., worldly gratifications.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever should desire the immediate[734] - We hasten for him from it what We will to whom We intend. Then We have made for him Hell, which he will [enter to] burn, censured and banished.",
            "english_hilali_khan": "Whoever desires the quick-passing (transitory enjoyment of this world), We readily grant him what We will for whom We like. Then, afterwards, We have appointed for him Hell; he will burn therein disgraced and rejected (- far away from Allâh’s Mercy).",
            "english_rwwad": "Whoever desires this fleeting life, We hasten therein whatever We will to whoever We please. Then We prepare for him Hell, which he will enter, despised and rejected."
        }
    },
    {
        "id": 2047,
        "chapter": 17,
        "verse": 19,
        "arabic_text": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا",
        "phonetic": "17.19 Wa Man 'Arāda Al-'Ākhirata Wa Sa`á Lahā Sa`yahā Wa Huwa Mu'uminun Fa'ūlā'ika Kāna Sa`yuhum Mashkūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But whoever desires the Hereafter and exerts the effort due to it while he is a believer - it is those whose effort is ever appreciated [by Allāh].",
            "english_hilali_khan": "And whoever desires the Hereafter and strives for it, with the necessary effort due for it (i.e. does righteous deeds of Allâh’s Obedience) while he is a believer (in the Oneness of Allâh - Islâmic Monotheism) - then such are the ones whose striving shall be appreciated, (thanked and rewarded by Allâh).",
            "english_rwwad": "But whoever desires the Hereafter and strives for it as he should, being a believer – it is those whose efforts will be appreciated."
        }
    },
    {
        "id": 2048,
        "chapter": 17,
        "verse": 20,
        "arabic_text": "كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا",
        "phonetic": "17.20 Kullāan Numiddu Hā'uulā' Wa Hā'uulā' Min `Aţā'i Rabbika Wa Mā Kāna `Aţā'u Rabbika Maĥžūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "To each [category] We extend - to these and to those - from the gift of your Lord. And never has the gift of your Lord been restricted.",
            "english_hilali_khan": "On each - these as well as those - We bestow from the Bounties of your Lord. And the Bounties of your Lord can never be forbidden.",
            "english_rwwad": "We give both – the latter and the former – from the bounty of your Lord, and Your Lord’s bounty is not restricted."
        }
    },
    {
        "id": 2049,
        "chapter": 17,
        "verse": 21,
        "arabic_text": "ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا",
        "phonetic": "17.21 Anžur Kayfa Fađđalnā Ba`đahum `Alá Ba`đin Wa Lal'ākhiratu 'Akbaru Darajātin Wa 'Akbaru Tafđīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Look how We have favored [in provision] some of them over others. But the Hereafter is greater in degrees [of difference] and greater in distinction.",
            "english_hilali_khan": "See how We prefer one above another (in this world), and verily, the Hereafter will be greater in degrees and greater in preferment.",
            "english_rwwad": "See how We have favored some over others [in this world], but the Hereafter has higher ranks and greater degrees of excellence for some over others."
        }
    },
    {
        "id": 2050,
        "chapter": 17,
        "verse": 22,
        "arabic_text": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا",
        "phonetic": "17.22 Lā Taj`al Ma`a Allāhi 'Ilahāan 'Ākhara Fataq`uda Madhmūmāan Makhdhūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do not make [as equal] with Allāh another deity and [thereby] become censured and forsaken.",
            "english_hilali_khan": "Set not up with Allâh any other ilâh (god), (O man)! (This verse is addressed to Prophet Muhammad صلى الله عليه و سلم , but its implication is general to all mankind), or you will sit down reproved, forsaken (in the Hell-fire).",
            "english_rwwad": "Do not set up with Allah any other god, or else you will be despised and forsaken."
        }
    },
    {
        "id": 2051,
        "chapter": 17,
        "verse": 23,
        "arabic_text": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا",
        "phonetic": "17.23 Wa Qađá Rabbuka 'Allā Ta`budū 'Illā 'Īyāhu Wa Bil-Wālidayni 'Iĥsānāan 'Immā Yablughanna `Indaka Al-Kibara 'Aĥaduhumā 'Aw Kilāhumā Falā Taqul Lahumā 'Uffin Wa Lā Tanharhumā Wa Qul Lahumā Qawlāan Karīmāan",
        "footnotes": {
            "english_saheeh": "[735]- An expression of disapproval or irritation.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord has decreed that you worship not except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\"[735] and do not repel them but speak to them a noble word.",
            "english_hilali_khan": "And your Lord has decreed that you worship none but Him. And that you be dutiful to your parents. If one of them or both of them attain old age in your life, say not to them a word of disrespect, nor shout at them but address them in terms of honour.",
            "english_rwwad": "Your Lord has ordained that you worship none but Him, and show kindness to parents. If one or both of them reach old age in your care, do not say to them a word of annoyance nor scold them, rather speak to them noble words,"
        }
    },
    {
        "id": 2052,
        "chapter": 17,
        "verse": 24,
        "arabic_text": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا",
        "phonetic": "17.24 Wa Akhfiđ Lahumā Janāĥa Adh-Dhulli Mina Ar-Raĥmati Wa Qul Rrabbi Arĥamhumā Kamā Rabbayānī Şaghīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And lower to them the wing of humility out of mercy and say, \"My Lord, have mercy upon them as they brought me up [when I was] small.\"",
            "english_hilali_khan": "And lower unto them the wing of submission and humility through mercy, and say: \"My Lord! Bestow on them Your Mercy as they did bring me up when I was young.\"",
            "english_rwwad": "and lower to them the wing of humility out of mercy, and say, “My Lord, have mercy upon them as they raised me when I was small.”"
        }
    },
    {
        "id": 2053,
        "chapter": 17,
        "verse": 25,
        "arabic_text": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا",
        "phonetic": "17.25 Rabbukum 'A`lamu Bimā Fī Nufūsikum 'In Takūnū Şāliĥīna Fa'innahu Kāna Lil'awwābīna Ghafūrāan",
        "footnotes": {
            "english_saheeh": "[736]- For those who intend righteousness, hastening to repent from sins and errors committed through human weakness, Allāh (subḥānahu wa taʿālā) promises forgiveness.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Your Lord is most knowing of what is within yourselves. If you should be righteous [in intention] - then indeed He is ever, to the often returning [to Him], Forgiving.[736]",
            "english_hilali_khan": "Your Lord knows best what is in your inner-selves. If you are righteous, then, verily, He is Ever Most Forgiving to those who turn unto Him again and again in obedience, and in repentance.",
            "english_rwwad": "Your Lord knows best what is in your hearts. If you are righteous, He is All-Forgiving to those who constantly turn to Him."
        }
    },
    {
        "id": 2054,
        "chapter": 17,
        "verse": 26,
        "arabic_text": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا",
        "phonetic": "17.26 Wa 'Āti Dhā Al-Qurbá Ĥaqqahu Wa Al-Miskīna Wa Abna As-Sabīli Wa Lā Tubadhir Tabdhīrāan",
        "footnotes": {
            "english_saheeh": "[737]- i.e., on that which is unlawful or in disobedience to Allāh.",
            "english_hilali_khan": "[1] (V.17:26) See the footnote of (V.2:83).\n[2] (V.17:26) You have to follow a middle course in your spendings - neither a miser nor a spendthrift, and not to be like those who spend in the disobedience of Allâh and His Messenger صلى الله عليه وسلم.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully.[737]",
            "english_hilali_khan": "And give to the kinsman his due and to the Miskîn [1] (poor) and to the wayfarer. But spend not wastefully (your wealth) in the manner of a spendthrift.[2] (Tafsir At-Tabarî)",
            "english_rwwad": "Give relatives their due, and the needy and the stranded travelers, and do not spend wastefully."
        }
    },
    {
        "id": 2055,
        "chapter": 17,
        "verse": 27,
        "arabic_text": "إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا",
        "phonetic": "17.27 'Inna Al-Mubadhirīna Kānū 'Ikhwāna Ash-Shayāţīni Wa Kāna Ash-Shayţānu Lirabbihi Kafūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the wasteful are brothers of the devils, and ever has Satan been to his Lord ungrateful.",
            "english_hilali_khan": "Verily, the spendthrifts are brothers of the Shayâtîn (devils), and the Shaitân (Devil-Satan) is ever ungrateful to his Lord.",
            "english_rwwad": "Indeed, the wasteful are Satans’ brothers, and Satan is ever ungrateful to his Lord."
        }
    },
    {
        "id": 2056,
        "chapter": 17,
        "verse": 28,
        "arabic_text": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا",
        "phonetic": "17.28 Wa 'Immā Tu`riđanna `Anhumu Abtighā'a Raĥmatin Min Rabbika Tarjūhā Faqul Lahum Qawlāan Maysūrāan",
        "footnotes": {
            "english_saheeh": "[738]- i.e., if you have not the means to give them at present.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you [must] turn away from them [i.e., the needy] awaiting mercy from your Lord which you expect,[738] then speak to them a gentle word.",
            "english_hilali_khan": "And if you (O Muhammad صلى الله عليه و سلم) turn away from them (kindred, poor, wayfarer whom We have ordered you to give their rights, but if you have no money at the time they ask you for it) and you are awaiting a mercy from your Lord for which you hope, then, speak unto them a soft kind word (i.e. Allâh will give me and I shall give you).",
            "english_rwwad": "But if you must turn away from them [those in need] while hoping to receive bounty from your Lord, then say to them words of comfort."
        }
    },
    {
        "id": 2057,
        "chapter": 17,
        "verse": 29,
        "arabic_text": "وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا",
        "phonetic": "17.29 Wa Lā Taj`al Yadaka Maghlūlatan 'Ilá `Unuqika Wa Lā Tabsuţhā Kulla Al-Basţi Fataq`uda Malūmāan Maĥsūrāan",
        "footnotes": {
            "english_saheeh": "[739]- i.e., refusing to spend.\n[740]- i.e., being extravagant.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not make your hand [as] chained to your neck[739] or extend it completely[740] and [thereby] become blamed and insolvent.",
            "english_hilali_khan": "And let not your hand be tied (like a miser) to your neck, nor stretch it forth to its utmost reach (like a spendthrift), so that you become blameworthy and in severe poverty.",
            "english_rwwad": "Do not be too tight-fisted, nor too open-handed, for you will end up blameworthy and destitute."
        }
    },
    {
        "id": 2058,
        "chapter": 17,
        "verse": 30,
        "arabic_text": "إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا",
        "phonetic": "17.30 'Inna Rabbaka Yabsuţu Ar-Rizqa Liman Yashā'u Wa Yaqdiru 'Innahu Kāna Bi`ibādihi Khabīrāan Başīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord extends provision for whom He wills and restricts [it]. Indeed He is ever, concerning His servants, Aware and Seeing.",
            "english_hilali_khan": "Truly, your Lord enlarges the provision for whom He wills and straitens (for whom He wills). Verily, He is Ever All-Knower, All-Seer of His slaves.",
            "english_rwwad": "Your Lord extends provision to whom He wills or restricts it. He is All-Aware and All-Seeing of His slaves."
        }
    },
    {
        "id": 2059,
        "chapter": 17,
        "verse": 31,
        "arabic_text": "وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـٔٗا كَبِيرٗا",
        "phonetic": "17.31 Wa Lā Taqtulū 'Awlādakum Khashyata 'Imlāqin Naĥnu Narzuquhum Wa 'Īyākum 'Inna Qatlahum Kāna Khiţ'āan Kabīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not kill your children for fear of poverty. We provide for them and for you. Indeed, their killing is ever a great sin.",
            "english_hilali_khan": "And kill not your children for fear of poverty. We shall provide for them as well as for you. Surely, the killing of them is a great sin.",
            "english_rwwad": "Do not kill your children for fear of poverty, for We provide for them and for you. Indeed, killing them is a great sin."
        }
    },
    {
        "id": 2060,
        "chapter": 17,
        "verse": 32,
        "arabic_text": "وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا",
        "phonetic": "17.32 Wa Lā Taqrabū Az-Ziná 'Innahu Kāna Fāĥishatan Wa Sā'a Sabīlāan",
        "footnotes": {
            "english_saheeh": "[741]- i.e., avoid all situations that might possibly lead to it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not approach unlawful sexual intercourse.[741] Indeed, it is ever an immorality and is evil as a way.",
            "english_hilali_khan": "And come not near to unlawful sex. Verily, it is a Fâhishah (i.e. anything that transgresses its limits: a great sin), and an evil way (that leads one to Hell unless Allâh forgives him).",
            "english_rwwad": "Do not go near adultery, for it is indeed a shameful act and an evil way."
        }
    },
    {
        "id": 2061,
        "chapter": 17,
        "verse": 33,
        "arabic_text": "وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا",
        "phonetic": "17.33 Wa Lā Taqtulū An-Nafsa Allatī Ĥarrama Allāhu 'Illā Bil-Ĥaqqi Wa Man Qutila Mažlūmāan Faqad Ja`alnā Liwalīyihi Sulţānāan Falā Yusrif Fī Al-Qatli 'Innahu Kāna Manşūrāan",
        "footnotes": {
            "english_saheeh": "[742]- i.e., through legal justice or during jihād.\n[743]- Grounds for legal action.",
            "english_hilali_khan": "(V.17:33):\na) See the footnote of (V.2:22).\nb) See the footnote of (V.5:50).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not kill the soul [i.e., person] which Allāh has forbidden, except by right.[742] And whoever is killed unjustly - We have given his heir authority,[743] but let him not exceed limits in [the matter of] taking life. Indeed, he has been supported [by the law].",
            "english_hilali_khan": "And do not kill anyone whose killing Allâh has forbidden, except for a just cause. And whoever is killed wrongfully (Mazlûman intentionally with hostility and oppression and not by mistake), We have given his heir the authority [to demand Qisâs, - Law of Equality in punishment - or to forgive, or to take Diyah (blood money)]. But let him not exceed limits in the matter of taking life (i.e he should not kill except the killer). Verily, he is helped (by the Islâmic law).[1]",
            "english_rwwad": "Do not kill any soul that Allah has forbidden, except in the course of justice. If anyone is killed wrongfully, We have given his heir authority [of compensation], but he should not exceed the bounds in killing, for he is already supported [by law]."
        }
    },
    {
        "id": 2062,
        "chapter": 17,
        "verse": 34,
        "arabic_text": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا",
        "phonetic": "17.34 Wa Lā Taqrabū Māla Al-Yatīmi 'Illā Bi-Atī Hiya 'Aĥsanu Ĥattá Yablugha 'Ashuddahu Wa 'Awfū Bil-`Ahdi 'Inna Al-`Ahda Kāna Mas'ūlāan",
        "footnotes": {
            "english_saheeh": "[744]- i.e., to improve or increase it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not approach the property of an orphan, except in the way that is best,[744] until he reaches maturity. And fulfill [every] commitment. Indeed, the commitment is ever [that about which one will be] questioned.",
            "english_hilali_khan": "And come not near to the orphan’s property except to improve it, until he attains the age of full strength. And fulfil (every) covenant. Verily, the covenant, will be questioned about.",
            "english_rwwad": "Do not approach the property of an orphan except with good [intent], until he reaches maturity; and fulfill the covenant, for you will certainly be questioned about the covenant."
        }
    },
    {
        "id": 2063,
        "chapter": 17,
        "verse": 35,
        "arabic_text": "وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا",
        "phonetic": "17.35 Wa 'Awfū Al-Kayla 'Idhā Kiltum Wa Zinū Bil-Qisţāsi Al-Mustaqīmi Dhālika Khayrun Wa 'Aĥsanu Ta'wīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And give full measure when you measure, and weigh with an even [i.e., honest] balance. That is the best [way] and best in result.",
            "english_hilali_khan": "And give full measure when you measure, and weigh with a balance that is straight. That is good (advantageous) and better in the end.",
            "english_rwwad": "Give full measure when you measure, and weigh with accurate scales; that is fair and best in the end."
        }
    },
    {
        "id": 2064,
        "chapter": 17,
        "verse": 36,
        "arabic_text": "وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡـُٔولٗا",
        "phonetic": "17.36 Wa Lā Taqfu Mā Laysa Laka Bihi `Ilmun 'Inna As-Sam`a Wa Al-Başara Wa Al-Fu'uāda Kullu 'Ūlā'ika Kāna `Anhu Mas'ūlāan",
        "footnotes": {
            "english_saheeh": "[745]- i.e., do not assume and do not say.",
            "english_hilali_khan": "(V.17:36) e.g. one’s saying: \"I have seen,\" while in fact he has not seen, or \"I have heard,\" while he has not heard.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not pursue[745] that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those [one] will be questioned.",
            "english_hilali_khan": "And follow not (O man i.e., say not, or do not or witness not) that of which you have no knowledge.[2] Verily! The hearing, and the sight, and the heart, of each of those one will be questioned (by Allâh).",
            "english_rwwad": "Do not follow that of which you have no knowledge. Indeed, the hearing, the sight, and the heart, all of them will be called to account."
        }
    },
    {
        "id": 2065,
        "chapter": 17,
        "verse": 37,
        "arabic_text": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا",
        "phonetic": "17.37 Wa Lā Tamshi Fī Al-'Arđi Maraĥāan 'Innaka Lan Takhriqa Al-'Arđa Wa Lan Tablugha Al-Jibāla Ţūlāan",
        "footnotes": {
            "english_saheeh": "[746]- Man, for all his arrogance, is yet a weak and small creature.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height.[746]",
            "english_hilali_khan": "And walk not on the earth with conceit and arrogance. Verily, you can neither rend nor penetrate the earth, nor can you attain a stature like the mountains in height.",
            "english_rwwad": "Do not walk on the earth arrogantly; you cannot cleave the earth, nor can you reach the mountains in height."
        }
    },
    {
        "id": 2066,
        "chapter": 17,
        "verse": 38,
        "arabic_text": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا",
        "phonetic": "17.38 Kullu Dhālika Kāna Sayyi'uhu `Inda Rabbika Makrūhāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "All that [i.e., the aforementioned] - its evil is ever, in the sight of your Lord, detested.",
            "english_hilali_khan": "All the bad aspects of these (the above mentioned things) are hateful to your Lord.",
            "english_rwwad": "The evil of all these actions is hateful to your Lord."
        }
    },
    {
        "id": 2067,
        "chapter": 17,
        "verse": 39,
        "arabic_text": "ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا",
        "phonetic": "17.39 Dhālika Mimmā 'Awĥá 'Ilayka Rabbuka Mina Al-Ĥikmati Wa Lā Taj`al Ma`a Allāhi 'Ilahāan 'Ākhara Fatulqá Fī Jahannama Malūmāan Madĥūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is from what your Lord has revealed to you, [O Muḥammad], of wisdom. And, [O mankind], do not make [as equal] with Allāh another deity, lest you be thrown into Hell, blamed and banished.",
            "english_hilali_khan": "This is (part) of Al-Hikmah (wisdom, good manners and high character) which your Lord has revealed to you (O Muhammad صلى الله عليه و سلم). And set not up with Allâh any other ilâh (god) lest you should be thrown into Hell, blameworthy and rejected, (from Allâh’s Mercy).",
            "english_rwwad": "This is part of the wisdom that your Lord has revealed to you [O Prophet]. Do not set up any other god with Allah, or you will be thrown into Hell, blameworthy and rejected."
        }
    },
    {
        "id": 2068,
        "chapter": 17,
        "verse": 40,
        "arabic_text": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا",
        "phonetic": "17.40 'Afa'aşfākum Rabbukum Bil-Banīna Wa Attakhadha Mina Al-Malā'ikati 'Ināthāan 'Innakum Lataqūlūna Qawlāan `Ažīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, has your Lord chosen you for [having] sons and taken [i.e., adopted] from among the angels daughters? Indeed, you say a grave saying.",
            "english_hilali_khan": "Has then your Lord (O pagans of Makkah!) preferred for you sons, and taken for Himself from among the angels daughters? Verily you indeed utter an awful saying.",
            "english_rwwad": "Has your Lord favored you with sons and has taken for Himself angels as daughters? You are indeed making a monstrous claim."
        }
    },
    {
        "id": 2069,
        "chapter": 17,
        "verse": 41,
        "arabic_text": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا",
        "phonetic": "17.41 Wa Laqad Şarrafnā Fī Hādhā Al-Qur'āni Liyadhakkarū Wa Mā Yazīduhum 'Illā Nufūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly diversified [the contents] in this Qur’ān that they [i.e., mankind] may be reminded, but it does not increase them [i.e., the disbelievers] except in aversion.",
            "english_hilali_khan": "And surely, We have explained [Our Promises, Warnings and (set forth many) examples] in this Qur’ân that they (the disbelievers) may take heed, but it increases them in naught save aversion.",
            "english_rwwad": "We have explained things in various ways in this Qur’an, so that they may take heed, but it only increases them in aversion."
        }
    },
    {
        "id": 2070,
        "chapter": 17,
        "verse": 42,
        "arabic_text": "قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا",
        "phonetic": "17.42 Qul Law Kāna Ma`ahu 'Ālihatun Kamā Yaqūlūna 'Idhāan Lābtaghaw 'Ilá Dhī Al-`Arshi Sabīlāan",
        "footnotes": {
            "english_saheeh": "[747]- To please Him, recognizing His superiority.  Another interpretation is \"...they would seek a way\" to depose Him (subḥānahu wa taʿālā) and take over His Throne.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"If there had been with Him [other] gods, as they say, then they [each] would have sought to the Owner of the Throne a way.\"[747]",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم to these polytheists, pagans): \"If there had been other âlihah (gods) along with Him as they assert, then they would certainly have sought out a way to the Lord of the Throne (seeking His Pleasures and to be near to Him).",
            "english_rwwad": "Say, “If there were other gods besides Him – as they claim – they would have surely sought a way to the Lord of the Throne.”"
        }
    },
    {
        "id": 2071,
        "chapter": 17,
        "verse": 43,
        "arabic_text": "سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا",
        "phonetic": "17.43 Subĥānahu Wa Ta`ālá `Ammā Yaqūlūna `Ulūwāan Kabīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Exalted is He and high above what they say by great sublimity.",
            "english_hilali_khan": "Glorified and Exalted be He! High above (the great falsehood) that they say! (i.e. forged statements that there are other gods along with Allâh, but He is Allâh, the One, the Self-Sufficient Master, Whom all creatures need. He begets not, nor was He begotten, and there is none comparable or coequal unto Him).",
            "english_rwwad": "Glorified and Highly Exalted is He far above what they claim!"
        }
    },
    {
        "id": 2072,
        "chapter": 17,
        "verse": 44,
        "arabic_text": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا",
        "phonetic": "17.44 Tusabbiĥu Lahu As-Samāwātu As-Sab`u Wa Al-'Arđu Wa Man Fīhinna Wa 'In Min Shay'in 'Illā Yusabbiĥu Biĥamdihi Wa Lakin Lā Tafqahūna Tasbīĥahum 'Innahu Kāna Ĥalīmāan Ghafūrāan",
        "footnotes": {
            "english_saheeh": "[748]- Refer to footnote in 2:225.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The seven heavens and the earth and whatever is in them exalt Him. And there is not a thing except that it exalts [Allāh] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing[748] and Forgiving.",
            "english_hilali_khan": "The seven heavens and the earth and all that is therein, glorify Him and there is not a thing but glorifies His Praise. But you understand not their glorification. Truly, He is Ever Forbearing, Oft-Forgiving.",
            "english_rwwad": "The seven heavens and the earth, and all those in them glorify Him. There is not a single thing that does not glorify Him with His praise, but you do not understand their glorification. Indeed, He is Most Forbearing, All-Forgiving."
        }
    },
    {
        "id": 2073,
        "chapter": 17,
        "verse": 45,
        "arabic_text": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا",
        "phonetic": "17.45 Wa 'Idhā Qara'ta Al-Qur'āna Ja`alnā Baynaka Wa Bayna Al-Ladhīna Lā Yu'uminūna Bil-'Ākhirati Ĥijābāan Mastūrāan",
        "footnotes": {
            "english_saheeh": "[749]- Preventing guidance from reaching them.",
            "english_hilali_khan": "(V.17:45) It is said in the Book of Tafsîr (Imâm Qurtubî) as regards this Verse (17:45):\nNarrated Sa‘îd bin Jubair رضي الله عنه \"When the Sûrah No.111 (Tabbat Yadâ) was revealed, the wife of Abu Lahab came looking for the Prophet صلى الله عليه وسلم while Abu Bakr رضي الله عنه, was sitting beside him. Abu Bakr said to the Prophet صلى الله عليه وسلم: \"I wish if you get aside (or go away) as she is coming to us, she may harm you.\" The Prophet صلى الله عليه وسلم said: \"There will be a screen set between me and her.\" So she did not see him. She said to Abu Bakr: \"Your companion is saying poetry against me,\" Abu Bakr said: \"By Allâh, he does not say poetry.\" She said: \"Do you believe that?\" Then she left. Abu Bakr said, \"O Allâh’s Messenger! She did not see you.\" The Prophet صلى الله عليه وسلم said: \"An angel was screening me from her.\" [This Hadith is quoted in Musnad Abu Ya‘la.]\nIt is said that if the above Verse (17:45) is recited by a real believer (of Islâmic Monotheism) he will be screened from a disbeliever. (Allâh knows better). (Tafsîr Al-Qurtubî, Vol.10, Page 269).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when you recite the Qur’ān, We put between you and those who do not believe in the Hereafter a concealed partition.[749]",
            "english_hilali_khan": "And when you (Muhammad صلى الله عليه و سلم) recite the Qur’ân, We put between you and those who believe not in the Hereafter, an invisible veil[1] (or screen their hearts, so they hear or understand it not).",
            "english_rwwad": "When you recite the Qur’an, We place between you and those who do not believe in the Hereafter an invisible barrier."
        }
    },
    {
        "id": 2074,
        "chapter": 17,
        "verse": 46,
        "arabic_text": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا",
        "phonetic": "17.46 Wa Ja`alnā `Alá Qulūbihim 'Akinnatan 'An Yafqahūhu Wa Fī 'Ādhānihim Waqrāan Wa 'Idhā Dhakarta Rabbaka Fī Al-Qur'āni Waĥdahu Wa Llaw `Alá 'Adbārihim Nufūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And when you mention your Lord alone in the Qur’ān, they turn back in aversion.",
            "english_hilali_khan": "And We have put coverings over their hearts lest they should understand it (the Qur’ân), and in their ears deafness. And when you make mention of your Lord Alone [Lâ ilâha illallâh (none has the right to be worshipped but Allâh) Islâmic Monotheism (توحيد الله)] in the Qur’ân, they turn on their backs, fleeing in extreme dislike.",
            "english_rwwad": "We have placed covers on their hearts so that they do not understand it, and deafness in their ears. When you mention your Lord alone in the Qur’an, they turn their backs in aversion."
        }
    },
    {
        "id": 2075,
        "chapter": 17,
        "verse": 47,
        "arabic_text": "نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا",
        "phonetic": "17.47 Naĥnu 'A`lamu Bimā Yastami`ūna Bihi 'Idh Yastami`ūna 'Ilayka Wa 'Idh Hum Najwá 'Idh Yaqūlu Až-Žālimūna 'In Tattabi`ūna 'Illā Rajulāan Masĥūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We are most knowing of how they listen to it when they listen to you and [of] when they are in private conversation, when the wrongdoers say, \"You follow not but a man affected by magic.\"",
            "english_hilali_khan": "We know best of what they listen to, when they listen to you. And when they take secret counsel, then the Zâlimûn (polytheists and wrong-doers) say: \"You follow none but a bewitched man.\"",
            "english_rwwad": "We are well aware of what they wish to hear when they listen to you, and what they say when they converse in private, when the wrongdoers say, “You are not following but a bewitched man.”"
        }
    },
    {
        "id": 2076,
        "chapter": 17,
        "verse": 48,
        "arabic_text": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا",
        "phonetic": "17.48 Anžur Kayfa Đarabū Laka Al-'Amthāla Fađallū Falā Yastaţī`ūna Sabīlāan",
        "footnotes": {
            "english_saheeh": "[750]- Describing the Prophet (ﷺ) as a poet, a madman or one under the influence of sorcery.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Look how they strike for you comparisons;[750] but they have strayed, so they cannot [find] a way.",
            "english_hilali_khan": "See what examples they have put forward for you. So they have gone astray, and never can they find a way.",
            "english_rwwad": "See how they call you names! Thus they have gone astray and cannot find a way."
        }
    },
    {
        "id": 2077,
        "chapter": 17,
        "verse": 49,
        "arabic_text": "وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا",
        "phonetic": "17.49 Wa Qālū 'A'idhā Kunnā `Ižāmāan Wa Rufātāan 'A'innā Lamab`ūthūna Khalqāan Jadīdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"When we are bones and crumbled particles, will we [truly] be resurrected as a new creation?\"",
            "english_hilali_khan": "And they say: \"When we are bones and fragments (destroyed), should we really be resurrected (to be) a new creation?\"",
            "english_rwwad": "They say, “What! When we are turned into bones and dust, will we really be resurrected as a new creation?”"
        }
    },
    {
        "id": 2078,
        "chapter": 17,
        "verse": 50,
        "arabic_text": "۞ قُلۡ كُونُواْ حِجَارَةً أَوۡ حَدِيدًا",
        "phonetic": "17.50 Qul Kūnū Ĥijāratan 'Aw Ĥadīdāan",
        "footnotes": {
            "english_saheeh": "[751]- i.e., even if you should be stones or iron.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Be you stones or iron[751]",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم) \"Be you stones or iron,\"",
            "english_rwwad": "Say, “Be you stones or iron,"
        }
    },
    {
        "id": 2079,
        "chapter": 17,
        "verse": 51,
        "arabic_text": "أَوۡ خَلۡقٗا مِّمَّا يَكۡبُرُ فِي صُدُورِكُمۡۚ فَسَيَقُولُونَ مَن يُعِيدُنَاۖ قُلِ ٱلَّذِي فَطَرَكُمۡ أَوَّلَ مَرَّةٖۚ فَسَيُنۡغِضُونَ إِلَيۡكَ رُءُوسَهُمۡ وَيَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰٓ أَن يَكُونَ قَرِيبٗا",
        "phonetic": "17.51 'Aw Khalqāan Mimmā Yakburu Fī Şudūrikum Fasayaqūlūna Man Yu`īdunā Quli Al-Ladhī Faţarakum 'Awwala Marratin Fasayunghiđūna 'Ilayka Ru'ūsahum Wa Yaqūlūna Matá Huwa Qul `Asá 'An Yakūna Qarībāan",
        "footnotes": {
            "english_saheeh": "[752]- Such as the heavens and earth.\n[753]- In disbelief and ridicule.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or [any] creation of that which is great[752] within your breasts.\" And they will say, \"Who will restore us?\" Say, \"He who brought you forth the first time.\" Then they will nod their heads toward you[753] and say, \"When is that?\" Say, \"Perhaps it will be soon -",
            "english_hilali_khan": "\"Or some created thing that is yet greater (or harder) in your breasts (thoughts to be resurrected, even then you shall be resurrected).\" Then, they will say: \"Who shall bring us back (to life)?\" Say: \"He Who created you first!\" Then, they will shake their heads at you and say: \"When will that be?\" Say: \"Perhaps it is near!\"",
            "english_rwwad": "or any other substance you think is harder to bring back to life.” They will then say, “Who will bring us back [to life]?” Say, “The One Who created you the first time.” They will shake their heads at you and say, “When will that be?” Say, “Perhaps it is soon.”"
        }
    },
    {
        "id": 2080,
        "chapter": 17,
        "verse": 52,
        "arabic_text": "يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا",
        "phonetic": "17.52 Yawma Yad`ūkum Fatastajībūna Biĥamdihi Wa Tažunnūna 'In Labithtum 'Illā Qalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day He will call you and you will respond with praise of Him and think that you had not remained [in the world] except for a little.\"",
            "english_hilali_khan": "On the Day when He will call you, and you will answer (His Call) with (words of) His Praise and Obedience, and you will think that you have stayed (in this world) but a little while!",
            "english_rwwad": "On the Day when He calls you, you will respond by praising Him, thinking that you had not stayed [on earth] except for a little while."
        }
    },
    {
        "id": 2081,
        "chapter": 17,
        "verse": 53,
        "arabic_text": "وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا",
        "phonetic": "17.53 Wa Qul Li`ibādī Yaqūlū Allatī Hiya 'Aĥsanu 'Inna Ash-Shayţāna Yanzaghu Baynahum 'Inna Ash-Shayţāna Kāna Lil'insāni `Adūwāan Mubīnāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And tell My servants to say that which is best. Indeed, Satan induces [dissension] among them. Indeed Satan is ever, to mankind, a clear enemy.",
            "english_hilali_khan": "And say to My slaves (i.e. the true believers of Islâmic Monotheism) that they should (only) say those words that are the best. (Because) Shaitân (Satan) verily, sows a state of conflict and disagreements among them. Surely, Shaitân (Satan) is to man a plain enemy.",
            "english_rwwad": "Tell My slaves that they should say what is best, for Satan sows discord among them. Indeed, Satan is a sworn enemy to mankind."
        }
    },
    {
        "id": 2082,
        "chapter": 17,
        "verse": 54,
        "arabic_text": "رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن يَشَأۡ يَرۡحَمۡكُمۡ أَوۡ إِن يَشَأۡ يُعَذِّبۡكُمۡۚ وَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ وَكِيلٗا",
        "phonetic": "17.54 Rabbukum 'A`lamu Bikum 'In Yasha' Yarĥamkum 'Aw 'In Yasha' Yu`adhibkum Wa Mā 'Arsalnāka `Alayhim Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Your Lord is most knowing of you. If He wills, He will have mercy upon you; or if He wills, He will punish you. And We have not sent you, [O Muḥammad], over them as a manager.",
            "english_hilali_khan": "Your Lord knows you best; if He wills, He will have mercy on you, or if He wills, He will punish you. And We have not sent you (O Muhammad صلى الله عليه و سلم) as a guardian over them.",
            "english_rwwad": "Your Lord knows you best: if He wills, He will have mercy on you; or if He wills, He will punish you. We have not sent you [O Prophet] to be in charge of them."
        }
    },
    {
        "id": 2083,
        "chapter": 17,
        "verse": 55,
        "arabic_text": "وَرَبُّكَ أَعۡلَمُ بِمَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعۡضٖۖ وَءَاتَيۡنَا دَاوُۥدَ زَبُورٗا",
        "phonetic": "17.55 Wa Rabbuka 'A`lamu Biman Fī As-Samāwāti Wa Al-'Arđi Wa Laqad Fađđalnā Ba`đa An-Nabīyīna `Alá Ba`đin Wa 'Ātaynā Dāwūda Zabūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord is most knowing of whoever is in the heavens and the earth. And We have made some of the prophets exceed others [in various ways], and to David We gave the book [of Psalms].",
            "english_hilali_khan": "And your Lord knows best all who are in the heavens and the earth. And indeed, We have preferred some of the Prophets above others, and to Dâwûd (David) We gave the Zabûr (Psalms).",
            "english_rwwad": "Your Lord knows best all those in the heavens and on earth. We have surely favored some prophets over others, and We gave David the Psalms."
        }
    },
    {
        "id": 2084,
        "chapter": 17,
        "verse": 56,
        "arabic_text": "قُلِ ٱدۡعُواْ ٱلَّذِينَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا يَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِيلًا",
        "phonetic": "17.56 Quli Ad`ū Al-Ladhīna Za`amtum Min Dūnihi Falā Yamlikūna Kashfa Ađ-Đurri `Ankum Wa Lā Taĥwīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer [to someone else].\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم): \"Call upon those - besides Him - whom you pretend [to be gods like angels, ‘Îsâ (Jesus), ‘Uzair (Ezra), and others.]. They have neither the power to remove the adversity from you nor even to shift it from you to another person.\"",
            "english_rwwad": "Say, “Call upon those whom you claimed [to be gods] besides Him; they have no power to remove harm or avert it from you.”"
        }
    },
    {
        "id": 2085,
        "chapter": 17,
        "verse": 57,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا",
        "phonetic": "17.57 'Ūlā'ika Al-Ladhīna Yad`ūna Yabtaghūna 'Ilá Rabbihimu Al-Wasīlata 'Ayyuhum 'Aqrabu Wa Yarjūna Raĥmatahu Wa Yakhāfūna `Adhābahu 'Inna `Adhāba Rabbika Kāna Maĥdhūrāan",
        "footnotes": {
            "english_saheeh": "[754]- Among the righteous of Allāh's creation, such as angels, prophets, deceased scholars, etc.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those whom they invoke[754] seek means of access to their Lord, [striving as to] which of them would be nearest, and they hope for His mercy and fear His punishment. Indeed, the punishment of your Lord is ever feared.",
            "english_hilali_khan": "Those whom they call upon [like ‘Îsâ (Jesus) - son of Maryam (Mary), ‘Uzair (Ezra), angel] desire (for themselves) means of access to their Lord (Allâh), as to which of them should be the nearest; and they [‘Îsâ (Jesus), ‘Uzair (Ezra), angels and others] hope for His Mercy and fear His Torment. Verily, the Torment of your Lord is (something) to be afraid of!",
            "english_rwwad": "Those whom they call upon seek means of nearness to their Lord, each trying to become closer, hoping for His Mercy and fearing His punishment. Indeed, the punishment of your Lord is fearsome."
        }
    },
    {
        "id": 2086,
        "chapter": 17,
        "verse": 58,
        "arabic_text": "وَإِن مِّن قَرۡيَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ يَوۡمِ ٱلۡقِيَٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابٗا شَدِيدٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا",
        "phonetic": "17.58 Wa 'In Min Qaryatin 'Illā Naĥnu Muhlikūhā Qabla Yawmi Al-Qiyāmati 'Aw Mu`adhibūhā `Adhābāan Shadīdāan Kāna Dhālika Fī Al-Kitābi Masţūrāan",
        "footnotes": {
            "english_saheeh": "[755]- Because of the sins of its inhabitants.\n[756]- The Preserved Slate (al-Lawḥ al-Maḥfūẓ), which is with Allāh.",
            "english_hilali_khan": "(V.17:58) It is said by ‘Abdullâh bin Mas‘ûd رضي الله عنه: \"If the people of a town indulge in illegal sexual intercourse and practise Ribâ (usury of all kinds), Allâh permits its destruction.\" (Tafsîr Al-Qurtubî).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there is no city but that We will destroy it[755] before the Day of Resurrection or punish it with a severe punishment. That has ever been in the Register[756] inscribed.",
            "english_hilali_khan": "And there is not a town (population) but We shall destroy it before the Day of Resurrection, or punish it with a severe torment. That is written in the Book (of Our Decrees)[1]",
            "english_rwwad": "There is no [disbelieving] town except that We will destroy it before the Day of Resurrection or punish it severely. This is written in the Record."
        }
    },
    {
        "id": 2087,
        "chapter": 17,
        "verse": 59,
        "arabic_text": "وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا",
        "phonetic": "17.59 Wa Mā Mana`anā 'An Nursila Bil-'Āyāti 'Illā 'An Kadhaba Bihā Al-'Awwalūna Wa 'Ātaynā Thamūda An-Nāqata Mubşiratan Fažalamū Bihā Wa Mā Nursilu Bil-'Āyāti 'Illā Takhwīfāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And nothing has prevented Us from sending signs [i.e., miracles] except that the former peoples denied them. And We gave Thamūd the she-camel as a visible sign, but they wronged her. And We send not the signs except as a warning.",
            "english_hilali_khan": "And nothing stops Us from sending the Ayât (proofs, evidence, signs) but that the people of old denied them. And We sent the she-camel to Thamûd as a clear sign, but they did her wrong. And We sent not the signs except to warn, and to make them afraid (of destruction).",
            "english_rwwad": "Nothing prevents Us from sending signs except that the earlier people denied them. We gave Thamūd the she-camel as a clear sign, but they wrongfully rejected her. We do not send signs except as a warning."
        }
    },
    {
        "id": 2088,
        "chapter": 17,
        "verse": 60,
        "arabic_text": "وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا",
        "phonetic": "17.60 Wa 'Idh Qulnā Laka 'Inna Rabbaka 'Aĥāţa Bin-Nāsi Wa Mā Ja`alnā Ar-Ru'uyā Allatī 'Araynāka 'Illā Fitnatan Lilnnāsi Wa Ash-Shajarata Al-Mal`ūnata Fī Al-Qur'āni Wa Nukhawwifuhum Famā Yazīduhum 'Illā Ţughyānāan Kabīrāan",
        "footnotes": {
            "english_saheeh": "[757]- In His knowledge and power, meaning that Allāh would protect him (ﷺ) from their harm.\n[758]- During the miʿrāj (ascension) into the heavens.",
            "english_hilali_khan": "(V.17:60) See footnote of (V.53:12) Al-Mi‘râj",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [remember, O Muḥammad], when We told you, \"Indeed, your Lord has encompassed the people.\"[757] And We did not make the sight which We showed you[758] except as a trial for the people, as was the accursed tree [mentioned] in the Qur’ān. And We threaten [i.e., warn] them, but it increases them not except in great transgression.",
            "english_hilali_khan": "And (remember) when We told you: \"Verily! Your Lord has encompassed mankind (i.e. they are in His Grip).\" And We made not the vision which we showed you (O Muhammad as an actual eye-witness and not as a dream on the night of Al-Isrâ’[1]) but a trial for mankind, and (likewise) the accursed tree (Zaqqûm, mentioned) in the Qur’ân. We warn and make them afraid but it only increases them in naught save great disbelief, oppression and disobedience to Allâh.",
            "english_rwwad": "And [remember, O Prophet] when We told you, “Your Lord encompasses all people [with His knowledge and might].” We did not make the sight which We showed you except as a test for people, as well as the cursed tree [mentioned] in the Qur’an. We keep threatening them, yet it only increases them to greater transgression."
        }
    },
    {
        "id": 2089,
        "chapter": 17,
        "verse": 61,
        "arabic_text": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا",
        "phonetic": "17.61 Wa 'Idh Qulnā Lilmalā'ikati Asjudū Li'dama Fasajadū 'Illā 'Iblīsa Qāla 'A'asjudu Liman Khalaqta Ţīnāan",
        "footnotes": {
            "english_saheeh": "[759]- See footnote to 2:34.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees.[759] He said, \"Should I prostrate to one You created from clay?\"",
            "english_hilali_khan": "And (remember) when We said to the angels: \"Prostrate yourselves unto Adam.\" They prostrated themselves except Iblîs (Satan). He said: \"Shall I prostrate myself to one whom You created from clay?\"",
            "english_rwwad": "And [remember] when We said to the angels, “Prostrate to Adam;” they all prostrated except Iblīs, who said, “Should I prostrate to whom You created from clay?”"
        }
    },
    {
        "id": 2090,
        "chapter": 17,
        "verse": 62,
        "arabic_text": "قَالَ أَرَءَيۡتَكَ هَٰذَا ٱلَّذِي كَرَّمۡتَ عَلَيَّ لَئِنۡ أَخَّرۡتَنِ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلٗا",
        "phonetic": "17.62 Qāla 'Ara'aytaka Hādhā Al-Ladhī Karramta `Alayya La'in 'Akhkhartanī 'Ilá Yawmi Al-Qiyāmati La'aĥtanikanna Dhurrīyatahu 'Illā Qalīlāan",
        "footnotes": {
            "english_saheeh": "[760]- By tempting them and leading them astray.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Iblees] said, \"Do You see this one whom You have honored above me? If You delay me [i.e., my death] until the Day of Resurrection, I will surely destroy[760] his descendants, except for a few.\"",
            "english_hilali_khan": "[Iblîs (Satan)] said: \"See this one whom You have honoured above me, if You give me respite (keep me alive) to the Day of Resurrection, I will surely seize and mislead his offspring (by sending them astray) all but a few!\"",
            "english_rwwad": "He added, “Do You see this one whom You have honored above me? If you give me respite until the Day of Resurrection, I will surely overpower his offspring, except for a few.”"
        }
    },
    {
        "id": 2091,
        "chapter": 17,
        "verse": 63,
        "arabic_text": "قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمۡ جَزَآءٗ مَّوۡفُورٗا",
        "phonetic": "17.63 Qāla Adh/hab Faman Tabi`aka Minhum Fa'inna Jahannama Jazā'uukum Jazā'an Mawfūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"Go, for whoever of them follows you, indeed Hell will be the recompense of [all of] you - an ample recompense.",
            "english_hilali_khan": "(Allâh) said: \"Go, and whosoever of them follows you, surely Hell will be the recompense of you (all) - an ample recompense.",
            "english_rwwad": "Allah said, “Be gone! Whoever among them follows you, Hell will be an ample recompense for you all."
        }
    },
    {
        "id": 2092,
        "chapter": 17,
        "verse": 64,
        "arabic_text": "وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا",
        "phonetic": "17.64 Wa Astafziz Mani Astaţa`ta Minhum Bişawtika Wa 'Ajlib `Alayhim Bikhaylika Wa Rajilika Wa Shārik/hum Fī Al-'Amwli Wa Al-'Awlādi Wa `Id/hum Wa Mā Ya`iduhumu Ash-Shayţānu 'Illā Ghurūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And incite [to senselessness] whoever you can among them with your voice and assault them with your horses and foot soldiers and become a partner in their wealth and their children and promise them.\" But Satan does not promise them except delusion.",
            "english_hilali_khan": "\"And befool them gradually those whom you can among them with your voice (i.e. songs, music, and any other call for Allâh’s disobedience), make assaults on them with your cavalry and your infantry, share with them wealth and children (by tempting them to earn money by illegal ways - usury, or by committing illegal sexual intercourse), and make promises to them.\" But Satan promises them nothing but deceit.",
            "english_rwwad": "Entice with your voice whoever of them you can; mobilize against them your cavalry and infantry; manipulate them in their wealth and children, and make promises to them.” But Satan does not promise them except delusion."
        }
    },
    {
        "id": 2093,
        "chapter": 17,
        "verse": 65,
        "arabic_text": "إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٞۚ وَكَفَىٰ بِرَبِّكَ وَكِيلٗا",
        "phonetic": "17.65 'Inna `Ibādī Laysa Laka `Alayhim Sulţānun Wa Kafá Birabbika Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "[761]- Refer to footnote in 3: 173.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, over My [believing] servants there is for you no authority. And sufficient is your Lord as Disposer of affairs.[761]",
            "english_hilali_khan": "\"Verily, My slaves (i.e. the true believers of Islâmic Monotheism) - you have no authority over them. And All-Sufficient is your Lord as a Guardian.\"",
            "english_rwwad": "“You will have no authority over My slaves.” And sufficient is your Lord as a Guardian."
        }
    },
    {
        "id": 2094,
        "chapter": 17,
        "verse": 66,
        "arabic_text": "رَّبُّكُمُ ٱلَّذِي يُزۡجِي لَكُمُ ٱلۡفُلۡكَ فِي ٱلۡبَحۡرِ لِتَبۡتَغُواْ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِيمٗا",
        "phonetic": "17.66 Rabbukumu Al-Ladhī Yuzjī Lakumu Al-Fulka Fī Al-Baĥri Litabtaghū Min Fađlihi 'Innahu Kāna Bikum Raĥīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is your Lord who drives the ship for you through the sea that you may seek of His bounty. Indeed, He is ever, to you, Merciful.",
            "english_hilali_khan": "Your Lord is He Who drives the ship for you through the sea, in order that you may seek of His Bounty. Truly He is Ever Most Merciful towards you.",
            "english_rwwad": "It is your Lord Who makes the ships sail for you through the sea, so that you may seek of His bounty. Indeed, He is ever Merciful to you."
        }
    },
    {
        "id": 2095,
        "chapter": 17,
        "verse": 67,
        "arabic_text": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا",
        "phonetic": "17.67 Wa 'Idhā Massakumu Ađ-Đurru Fī Al-Baĥri Đalla Man Tad`ūna 'Illā 'Īyāhu Falammā Najjākum 'Ilá Al-Barri 'A`rađtum Wa Kāna Al-'Insānu Kafūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.17:67) Ibn Kathir in his Book of Tafsîr as regards this Verse (17:67) said: ‘Ikrimah bin Abî Jahl fled from Allâh’s Messenger صلى الله عليه وسلم (at the time) when Makkah was conquered. He rode over the (Red) Sea to cross over to Ethiopia, but (as they proceeded), a heavy stormy wind overtook their boat, and huge waves came to them from all sides, and they thought that they are encircled therein. The people of the boat said to one another \"None can save you except Allâh (the Only True God of the heavens and earth). So invoke (call upon) Him (Allâh) (by making your Faith pure for Him Alone and none else) to deliver you safe (from drowning).\" ‘Ikrimah said to himself. ‘By Allâh if none can benefit in the sea except Allâh (Alone) then no doubt none can benefit over the land except Allâh (Alone). O Allâh! I promise You that if You delivered me safe from this, I will go and put my hands in the hands of (Prophet) Muhammad and surely I will find him full of pity, kindness and mercy.’ So they were delivered safe (by Allâh), and returned to their sea-shore and came out of the sea. ‘Ikrimah then proceeded to Allâh’s Messenger, Muhammad صلى الله عليه وسلم (narrated his story), embraced Islâm (just as he promised Allâh), and became a perfect Muslim.\" (Tafsir Ibn Kathir).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when adversity touches you at sea, lost are [all] those you invoke except for Him. But when He delivers you to the land, you turn away [from Him]. And ever is man ungrateful.",
            "english_hilali_khan": "And when harm touches you upon the sea, those that you call upon vanish from you except Him (Allâh Alone). But when He brings you safe to land, you turn away (from Him). And man is ever ungrateful[1].",
            "english_rwwad": "When hardship strikes you at sea, you forget all those whom you invoke besides Him. Then when He brings you safe to the land, you turn away. Mankind is ever ungrateful."
        }
    },
    {
        "id": 2096,
        "chapter": 17,
        "verse": 68,
        "arabic_text": "أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا",
        "phonetic": "17.68 'Afa'amintum 'An Yakhsifa Bikum Jāniba Al-Barri 'Aw Yursila `Alaykum Ĥāşibāan Thumma Lā Tajidū Lakum Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then do you feel secure that [instead] He will not cause a part of the land to swallow you or send against you a storm of stones? Then you would not find for yourselves an advocate.",
            "english_hilali_khan": "Do you then feel secure that He will not cause a side of the land to swallow you up, or that He will not send against you a violent sand-storm? Then, you shall find no Wakîl (guardian - one to guard you from the torment).",
            "english_rwwad": "Do you feel secure that He will not make some part of the land swallow you up, or send against you a storm of stones? Thereupon you will find none to protect you."
        }
    },
    {
        "id": 2097,
        "chapter": 17,
        "verse": 69,
        "arabic_text": "أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا",
        "phonetic": "17.69 'Am 'Amintum 'An Yu`īdakum Fīhi Tāratan 'Ukhrá Fayursila `Alaykum Qāşifāan Mina Ar-Rīĥi Fayughriqakum Bimā Kafartum Thumma Lā Tajidū Lakum `Alaynā Bihi Tabī`āan",
        "footnotes": {
            "english_saheeh": "[762]- Or \"for your disbelief.\"\n[763]- Or \"someone to demand restitution.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or do you feel secure that He will not send you back into it [i.e., the sea] another time and send upon you a hurricane of wind and drown you for what you denied?[762] Then you would not find for yourselves against Us an avenger.[763]",
            "english_hilali_khan": "Or do you feel secure that He will not send you back a second time to sea and send against you a hurricane of wind and drown you because of your disbelief? Then you will not find any avenger therein against Us.",
            "english_rwwad": "Or do you feel secure that He will not send you back [to sea] once again, and send upon you a violent storm to drown you on account of your disbelief? Thereupon you will find none to help you against Us."
        }
    },
    {
        "id": 2098,
        "chapter": 17,
        "verse": 70,
        "arabic_text": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا",
        "phonetic": "17.70 Wa Laqad Karramnā Banī 'Ādama Wa Ĥamalnāhum Fī Al-Barri Wa Al-Baĥri Wa Razaqnāhum Mina Aţ-Ţayyibāti Wa Fađđalnāhum `Alá Kathīrin Mimman Khalaqnā Tafđīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference.",
            "english_hilali_khan": "And indeed We have honoured the Children of Adam, and We have carried them on land and sea, and have provided them with At-Tayyibât (lawful good things), and have preferred them above many of those whom We have created with a marked preferment.",
            "english_rwwad": "We have honored the children of Adam, carried them on land and sea, provided for them good things and favored them above many of those whom We have created."
        }
    },
    {
        "id": 2099,
        "chapter": 17,
        "verse": 71,
        "arabic_text": "يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۭ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا",
        "phonetic": "17.71 Yawma Nad`ū Kulla 'Unāsin Bi'imāmihim Faman 'Ūtiya Kitābahu Biyamīnihi Fa'ūlā'ika Yaqra'ūna Kitābahum Wa Lā Yužlamūna Fatīlāan",
        "footnotes": {
            "english_saheeh": "[764]- Other meanings are \"with their leader\" or \"with that which they had followed.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Mention, O Muḥammad], the Day We will call forth every people with their record [of deeds].[764] Then whoever is given his record in his right hand - those will read their records, and injustice will not be done to them, [even] as much as a thread [inside the date seed].",
            "english_hilali_khan": "(And remember) the Day when We shall call together call human beings with their (respective) Imâm [their Prophets, or their records of good and bad deeds, or their Holy Books like the Qur’ân, the Taurât (Torah), the Injeel (Gospel), the leaders whom the people followed in this world.]. So whosoever is given his record in his right hand, such will read their records, and they will not be dealt with unjustly in the least.",
            "english_rwwad": "On the Day when We will summon every community with its leader. Those who are given their record in their right hand will read their record [happily]; they will not be wronged even as much as the thread of a date stone."
        }
    },
    {
        "id": 2100,
        "chapter": 17,
        "verse": 72,
        "arabic_text": "وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا",
        "phonetic": "17.72 Wa Man Kāna Fī Hadhihi 'A`má Fahuwa Fī Al-'Ākhirati 'A`má Wa 'Ađallu Sabīlāan",
        "footnotes": {
            "english_saheeh": "[765]- i.e., refusing to see the truth.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whoever is blind[765] in this [life] will be blind in the Hereafter and more astray in way.",
            "english_hilali_khan": "And whoever is blind in this world (i.e., does not see Allâh’s Signs and believes not in Him), will be blind in the Hereafter, and more astray from the Path.",
            "english_rwwad": "But whoever was blind [from the truth] in this life will be even blinder in the Hereafter and further astray from the right way."
        }
    },
    {
        "id": 2101,
        "chapter": 17,
        "verse": 73,
        "arabic_text": "وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا",
        "phonetic": "17.73 Wa 'In Kādū Layaftinūnaka `Ani Al-Ladhī 'Awĥaynā 'Ilayka Litaftariya `Alaynā Ghayrahu Wa 'Idhāan Lāttakhadhūka Khalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, they were about to tempt you away from that which We revealed to you in order to [make] you invent about Us something else; and then they would have taken you as a friend.",
            "english_hilali_khan": "Verily, they were about to tempt you away from that which We have revealed (the Qur’ân) unto you (O Muhammad صلى الله عليه و سلم), to fabricate something other than it against Us, and then they would certainly have taken you a Khalîl (an intimate friend)!",
            "english_rwwad": "They were about to tempt you away from what We have revealed to you [O Prophet], so that you would fabricate something else and attribute it to Us; then they would have surely taken you as a close friend."
        }
    },
    {
        "id": 2102,
        "chapter": 17,
        "verse": 74,
        "arabic_text": "وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡـٔٗا قَلِيلًا",
        "phonetic": "17.74 Wa Lawlā 'An Thabbatnāka Laqad Kidtta Tarkanu 'Ilayhim Shay'āan Qalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if We had not strengthened you, you would have almost inclined to them a little.",
            "english_hilali_khan": "And had We not made you stand firm, you would nearly have inclined to them a little.",
            "english_rwwad": "Had We not made you stand firm, you would nearly have inclined to them a little."
        }
    },
    {
        "id": 2103,
        "chapter": 17,
        "verse": 75,
        "arabic_text": "إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا",
        "phonetic": "17.75 'Idhāan La'adhaqnāka Đi`fa Al-Ĥayāati Wa Đi`fa Al-Mamāti Thumma Lā Tajidu Laka `Alaynā Naşīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then [if you had], We would have made you taste double [punishment in] life and double [after] death. Then you would not find for yourself against Us a helper.",
            "english_hilali_khan": "In that case We would have made you taste a double portion (of punishment) in this life and a double portion (of punishment) after death. And then you would have found none to help you against Us.",
            "english_rwwad": "In that case, We would have made you taste double punishment, both in this life and after death. Thereupon you would have found no helper against Us."
        }
    },
    {
        "id": 2104,
        "chapter": 17,
        "verse": 76,
        "arabic_text": "وَإِن كَادُواْ لَيَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِيُخۡرِجُوكَ مِنۡهَاۖ وَإِذٗا لَّا يَلۡبَثُونَ خِلَٰفَكَ إِلَّا قَلِيلٗا",
        "phonetic": "17.76 Wa 'In Kādū Layastafizzūnaka Mina Al-'Arđi Liyukhrijūka Minhā Wa 'Idhāan Lā Yalbathūna Khilāfaka 'Illā Qalīlāan",
        "footnotes": {
            "english_saheeh": "[766]- Only ten years after the Prophet's emigration, Makkah was completely cleared of his enemies.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, they were about to provoke [i.e., drive] you from the land [i.e., Makkah] to evict you therefrom. And then [when they do], they will not remain [there] after you, except for a little.[766]",
            "english_hilali_khan": "And verily they were about to frighten you so much as to drive you out from the land. But in that case they would not have stayed (therein) after you, except for a little while.",
            "english_rwwad": "They were about to provoke you so as to drive you out of the land [of Makkah], but then they would not have remained after you, except for a little while."
        }
    },
    {
        "id": 2105,
        "chapter": 17,
        "verse": 77,
        "arabic_text": "سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِيلًا",
        "phonetic": "17.77 Sunnata Man Qad 'Arsalnā Qablaka Min Rusulinā Wa Lā Tajidu Lisunnatinā Taĥwīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[That is Our] established way for those We had sent before you of Our messengers; and you will not find in Our way any alteration.",
            "english_hilali_khan": "(This was Our) Sunnah (rule or way) with the Messengers We sent before you (O Muhammad صلى الله عليه و سلم), and you will not find any alteration in Our Sunnah (rule or way).",
            "english_rwwad": "Such was Our way with the messengers We sent before you, and you will find no change in Our way."
        }
    },
    {
        "id": 2106,
        "chapter": 17,
        "verse": 78,
        "arabic_text": "أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا",
        "phonetic": "17.78 'Aqimi Aş-Şalāata Lidulūki Ash-Shamsi 'Ilá Ghasaqi Al-Layli Wa Qur'āna Al-Fajri 'Inna Qur'āna Al-Fajri Kāna Mash/hūdāan",
        "footnotes": {
            "english_saheeh": "[767]- i.e., the period which includes the ẓuhr, aṣr, maghrib, and ʿishā’ prayers.\n[768]- i.e., the fajr prayer, in which the recitation of the Qur’ān is prolonged.",
            "english_hilali_khan": "[1] (V.17:78) See the glossary.\n[2] (V.17:78)\nNarrated Abu Salâmah bin ‘Abdur-Râhman: Abu Hurairah رضي الله عنه said, \"I heard Allâh’s Messenger صلى الله عليه وسلم saying, ‘The reward of a Salât (prayer) in congregation is twenty-five times superior in degrees to that of a Salât (prayer) offered by a person alone. The angels of the night and the angels of the day gather at the time of Fajr prayer.’ \"\nAbu Hurairah then added, \"Recite the Holy Book if you wish, for ‘Verily, the recitation of the Qur’ân in the early dawn (Fajr prayer) is ever witnessed (attended by the angels in charge of mankind of the day and the night)’ (V.17:78)\". (Sahih Al-Bukhari, Vol.1, Hadith No.621).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Establish prayer at the decline of the sun [from its meridian] until the darkness of the night[767] and [also] the Qur’ān [i.e., recitation] of dawn.[768] Indeed, the recitation of dawn is ever witnessed.",
            "english_hilali_khan": "Perform As-Salât (Iqamât-as-Salât)[1] from mid-day till the darkness of the night (i.e. the Zuhr, ‘Asr, Maghrib and ‘Ishâ’ prayers), and recite the Qur’ân in the early dawn (i.e. the morning prayer). Verily, the recitation of the Qur’ân in the early dawn is ever witnessed (attended by the angels in charge of mankind of the day and the night)[2].",
            "english_rwwad": "Establish prayer at the decline of the sun until the darkness of the night, and the recitation of dawn [prayer], for the recitation of dawn is ever witnessed [by the angles]."
        }
    },
    {
        "id": 2107,
        "chapter": 17,
        "verse": 79,
        "arabic_text": "وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا",
        "phonetic": "17.79 Wa Mina Al-Layli Fatahajjad Bihi Nāfilatan Laka `Asá 'An Yab`athaka Rabbuka Maqāmāan Maĥmūdāan",
        "footnotes": {
            "english_saheeh": "[769]- Literally, \"arise from sleep for prayer.\"\n[770]- This is a promise from Allāh (subḥānahu wa taʿālā) to Prophet Muḥammad (ﷺ).\n[771]- The position of intercession by permission of Allāh and the highest degree in Paradise.",
            "english_hilali_khan": "(V.17:79)\nA). Narrated Ibn ‘Umar رضي الله عنهما \"On the Day of Resurrection the people will fall on their knees and every nation will follow their Prophet and they will say, ‘O so-and-so! Intercede (for us with Allâh)’, till (the right of) of intercession will be given to the Prophet (Muhammad صلى الله عليه وسلم) and that will be the day when Allâh will raise him to Maqâm Mahmûd (a station of praise and glory i.e the honour of intercession on the Day of Resurrection)\". (Sahih Al-Bukhari, Vol.6, Hadith No.242)\nB). Narrated Jâbir bin ‘Abdullâhرضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Whoever, after listening to the Adhân (call for the prayer) says, ‘O Allâh, the Lord of this complete call and of this prayer, which is going to be established! Give Muhammad Al-Wasîlah and Al-Fadîlah* and raise him to Maqâm Mahmûd , which You have promised him,’ will be granted my intercession for him on the Day of Resurrection.\" (Sahih Al-Bukhari, Vol.6, Hadith No.243).\n* Al-Wasîlah is the highest position in Paradise which is granted to the Prophet صلى الله عليه وسلم particularly; Al-Fadîlah is the extra degree of honour which is bestowed on him above all creation.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And from [part of] the night, pray[769] with it [i.e., recitation of the Qur’ān] as additional [worship] for you; it is expected that[770] your Lord will resurrect you to a praised station.[771]",
            "english_hilali_khan": "And in some parts of the night (also) offer the Salât (prayer) with it (i.e. recite the Qur’ân in the prayer), as an additional prayer (Tahajjud optional prayer - Nawâfil) for you (O Muhammad صلى الله عليه و سلم). It may be that your Lord will raise you to Maqâm Mahmûd (a station of praise and glory, i.e. the honour of intercession on the Day of Resurrection.)[3].",
            "english_rwwad": "And wake up during the night and pray, as an additional prayer for you [O Prophet], so your Lord may raise you to a praised status [of Grand Intercession]."
        }
    },
    {
        "id": 2108,
        "chapter": 17,
        "verse": 80,
        "arabic_text": "وَقُل رَّبِّ أَدۡخِلۡنِي مُدۡخَلَ صِدۡقٖ وَأَخۡرِجۡنِي مُخۡرَجَ صِدۡقٖ وَٱجۡعَل لِّي مِن لَّدُنكَ سُلۡطَٰنٗا نَّصِيرٗا",
        "phonetic": "17.80 Wa Qul Rabbi 'Adkhilnī Mudkhala Şidqin Wa 'Akhrijnī Mukhraja Şidqin Wa Aj`al Lī Min Ladunka Sulţānāan Naşīrāan",
        "footnotes": {
            "english_saheeh": "[772]- Into Madīnah at the time of emigration, or into the grave.\n[773]- From Makkah, or from the grave at the time of resurrection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And say, \"My Lord, cause me to enter a sound entrance[772] and to exit a sound exit[773] and grant me from Yourself a supporting authority.\"",
            "english_hilali_khan": "And say (O Muhammad صلى الله عليه و سلم): My Lord! Let my entry (to the city of Al-Madinah) be good, and (likewise) my exit (from the city of Makkah) be good. And grant me from You an authority to help me (or a firm sign or a proof).",
            "english_rwwad": "And say, “My Lord, make me enter an honorable entrance and make me exit an honorable exit, and grant me from Yourself a supporting authority.”"
        }
    },
    {
        "id": 2109,
        "chapter": 17,
        "verse": 81,
        "arabic_text": "وَقُلۡ جَآءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَٰطِلُۚ إِنَّ ٱلۡبَٰطِلَ كَانَ زَهُوقٗا",
        "phonetic": "17.81 Wa Qul Jā'a Al-Ĥaqqu Wa Zahaqa Al-Bāţilu 'Inna Al-Bāţila Kāna Zahūqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And say, \"Truth has come, and falsehood has departed. Indeed is falsehood, [by nature], ever bound to depart.\"",
            "english_hilali_khan": "And say: \"Truth (i.e. Islâmic Monotheism or this Qur’ân or Jihâd against polytheists) has come and Bâtil (falsehood, i.e. Satan or polytheism) has vanished. Surely Bâtil is ever bound to vanish.\"",
            "english_rwwad": "And say, “The truth has come and falsehood has perished. Indeed, falsehood is bound to perish.”"
        }
    },
    {
        "id": 2110,
        "chapter": 17,
        "verse": 82,
        "arabic_text": "وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَآءٞ وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ وَلَا يَزِيدُ ٱلظَّٰلِمِينَ إِلَّا خَسَارٗا",
        "phonetic": "17.82 Wa Nunazzilu Mina Al-Qur'āni Mā Huwa Shifā'un Wa Raĥmatun Lilmu'uminīna Wa Lā Yazīdu Až-Žālimīna 'Illā Khasārāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We send down of the Qur’ān that which is healing and mercy for the believers, but it does not increase the wrongdoers except in loss.",
            "english_hilali_khan": "And We send down of the Qur’ân that which is a healing and a mercy to those who believe (in Islâmic Monotheism and act on it), and it increases the Zâlimûn (polytheists and wrong-doers) nothing but loss.",
            "english_rwwad": "We send down the Qur’an as a healing and mercy for the believers, but it does not increase the wrongdoers except in loss."
        }
    },
    {
        "id": 2111,
        "chapter": 17,
        "verse": 83,
        "arabic_text": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسٗا",
        "phonetic": "17.83 Wa 'Idhā 'An`amnā `Alá Al-'Insāni 'A`rađa Wa Na'á Bijānibihi Wa 'Idhā Massahu Ash-Sharru Kāna Ya'ūsāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when We bestow favor upon man [i.e., the disbeliever], he turns away and distances himself; and when evil touches him, he is ever despairing.",
            "english_hilali_khan": "And when We bestow Our Grace on man (the disbeliever), he turns away and becomes arrogant (far away from the Right Path). And when evil touches him, he is in great despair.",
            "english_rwwad": "When We bestow favor upon man, he turns away and distances himself, but when evil befalls him, he is in utter despair."
        }
    },
    {
        "id": 2112,
        "chapter": 17,
        "verse": 84,
        "arabic_text": "قُلۡ كُلّٞ يَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِيلٗا",
        "phonetic": "17.84 Qul Kullun Ya`malu `Alá Shākilatihi Farabbukum 'A`lamu Biman Huwa 'Ahdá Sabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Each works according to his manner, but your Lord is most knowing of who is best guided in way.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم to mankind): \"Each one does according to Shakilatihi (i.e. his way or his religion or his intentions.), and your Lord knows best of him whose path (religion) is right.\"",
            "english_rwwad": "Say, “Everyone acts in his own way, but your Lord knows best whose way is best guided.”"
        }
    },
    {
        "id": 2113,
        "chapter": 17,
        "verse": 85,
        "arabic_text": "وَيَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّي وَمَآ أُوتِيتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِيلٗا",
        "phonetic": "17.85 Wa Yas'alūnaka `Ani Ar-Rūĥi Quli Ar-Rūĥu Min 'Amri Rabbī Wa Mā 'Ūtītum Mina Al-`Ilmi 'Illā Qalīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they ask you, [O Muḥammad], about the soul. Say, \"The soul is of the affair [i.e., concern] of my Lord. And you [i.e., mankind] have not been given of knowledge except a little.\"",
            "english_hilali_khan": "And they ask you (O Muhammad صلى الله عليه و سلم) concerning the Rûh (the Spirit); Say: \"The Rûh (the Spirit) is one of the things, the knowledge of which is only with my Lord. And of knowledge, you (mankind) have been given only a little.\"",
            "english_rwwad": "They ask you [O Prophet] about the soul. Say, “The soul is only known to my Lord, and you have not been given knowledge except a little.”"
        }
    },
    {
        "id": 2114,
        "chapter": 17,
        "verse": 86,
        "arabic_text": "وَلَئِن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيۡنَا وَكِيلًا",
        "phonetic": "17.86 Wa La'in Shi'nā Lanadh/habanna Bial-Ladhī 'Awĥaynā 'Ilayka Thumma Lā Tajidu Laka Bihi `Alaynā Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if We willed, We could surely do away with that which We revealed to you. Then you would not find for yourself concerning it an advocate against Us.",
            "english_hilali_khan": "And if We willed, We could surely take away that which We have revealed to you (i.e. this Qur’ân). Then you would find no protector for you against Us in that respect.",
            "english_rwwad": "If We willed, We could surely take away what We have revealed to you, then you would find no guardian to plead its return from Us,"
        }
    },
    {
        "id": 2115,
        "chapter": 17,
        "verse": 87,
        "arabic_text": "إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا",
        "phonetic": "17.87 'Illā Raĥmatan Min Rabbika 'Inna Fađlahu Kāna `Alayka Kabīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Except [We have left it with you] as a mercy from your Lord. Indeed, His favor upon you has ever been great.",
            "english_hilali_khan": "Except as a Mercy from your Lord. Verily His Grace unto you (O Muhammad صلى الله عليه و سلم) is ever great.",
            "english_rwwad": "nevertheless it is a mercy from your Lord, for His favor to you is truly great."
        }
    },
    {
        "id": 2116,
        "chapter": 17,
        "verse": 88,
        "arabic_text": "قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا",
        "phonetic": "17.88 Qul La'ini Ajtama`ati Al-'Insu Wa Al-Jinnu `Alá 'An Ya'tū Bimithli Hādhā Al-Qur'āni Lā Ya'tūna Bimithlihi Wa Law Kāna Ba`đuhum Liba`đin Žahīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"If mankind and the jinn gathered in order to produce the like of this Qur’ān, they could not produce the like of it, even if they were to each other assistants.\"",
            "english_hilali_khan": "Say: \"If the mankind and the jinn were together to produce the like of this Qur’ân, they could not produce the like thereof, even if they helped one another.\"",
            "english_rwwad": "Say, “If all humans and jinn were to come together to produce something similar to this Qur’an, they would not be able to produce the like of it, even if they collaborated with one another.”"
        }
    },
    {
        "id": 2117,
        "chapter": 17,
        "verse": 89,
        "arabic_text": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا",
        "phonetic": "17.89 Wa Laqad Şarrafnā Lilnnāsi Fī Hādhā Al-Qur'āni Min Kulli Mathalin Fa'abá 'Aktharu An-Nāsi 'Illā Kufūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly diversified for the people in this Qur’ān from every [kind of] example, but most of the people refused except disbelief.",
            "english_hilali_khan": "And indeed We have fully explained to mankind, in this Qur’ân, every kind of similitude, but most of mankind refuse (the truth and accept nothing) but disbelief.",
            "english_rwwad": "We have explained every kind of example for mankind in this Qur’an, yet most people persist in disbelief."
        }
    },
    {
        "id": 2118,
        "chapter": 17,
        "verse": 90,
        "arabic_text": "وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا",
        "phonetic": "17.90 Wa Qālū Lan Nu'umina Laka Ĥattá Tafjura Lanā Mina Al-'Arđi Yanbū`āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"We will not believe you until you break open for us from the ground a spring",
            "english_hilali_khan": "And they say: \"We shall not believe in you (O Muhammad صلى الله عليه و سلم), until you cause a spring to gush forth from the earth for us;",
            "english_rwwad": "They say, “We will never believe in you until you cause a spring to gush forth for us from the earth,"
        }
    },
    {
        "id": 2119,
        "chapter": 17,
        "verse": 91,
        "arabic_text": "أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا",
        "phonetic": "17.91 'Aw Takūna Laka Jannatun Min Nakhīlin Wa `Inabin Fatufajjira Al-'Anhāra Khilālahā Tafjīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or [until] you have a garden of palm trees and grapes and make rivers gush forth within them in force [and abundance]",
            "english_hilali_khan": "\"Or you have a garden of date-palms and grapes, and cause rivers to gush forth in their midst abundantly;",
            "english_rwwad": "or until you have a garden of date palm and grapevines, and you cause rivers to flow abundantly in their midst,"
        }
    },
    {
        "id": 2120,
        "chapter": 17,
        "verse": 92,
        "arabic_text": "أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا",
        "phonetic": "17.92 'Aw Tusqiţa As-Samā'a Kamā Za`amta `Alaynā Kisafāan 'Aw Ta'tiya Billāhi Wa Al-Malā'ikati Qabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or you make the heaven fall upon us in fragments as you have claimed or you bring Allāh and the angels before [us]",
            "english_hilali_khan": "\"Or you cause the heaven to fall upon us in pieces, as you have pretended, or you bring Allâh and the angels before (us) face to face;",
            "english_rwwad": "or you make the sky to fall upon us in pieces – as you claim – or bring Allah and the angels before us face to face,"
        }
    },
    {
        "id": 2121,
        "chapter": 17,
        "verse": 93,
        "arabic_text": "أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا",
        "phonetic": "17.93 'Aw Yakūna Laka Baytun Min Zukhrufin 'Aw Tarqá Fī As-Samā'i Wa Lan Nu'umina Liruqīyika Ĥattá Tunazzila `Alaynā Kitābāan Naqra'uuhu Qul Subĥāna Rabbī Hal Kuntu 'Illā Basharāan Rasūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or you have a house of ornament [i.e., gold] or you ascend into the sky. And [even then], we will not believe in your ascension until you bring down to us a book we may read.\" Say, \"Exalted is my Lord! Was I ever but a human messenger?\"",
            "english_hilali_khan": "\"Or you have a house of Zukhruf (like silver and pure gold), or you ascend up into the sky, and even then we will put no faith in your ascension until you bring down for us a Book that we would read.\" Say (O Muhammad صلى الله عليه و سلم): \"Glorified (and Exalted) be my Lord [(Allâh) above all that evil they (polytheists) associate with Him]! Am I anything but a man, sent as a Messenger?\"",
            "english_rwwad": "or until you have a house of gold, or you ascend to the heaven, and even then we will never believe in your ascension unless you bring down to us a book which we can read.” Say, “Glory be to my Lord! Am I anything but a human, sent as a messenger?”"
        }
    },
    {
        "id": 2122,
        "chapter": 17,
        "verse": 94,
        "arabic_text": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا",
        "phonetic": "17.94 Wa Mā Mana`a An-Nāsa 'An Yu'uminū 'Idh Jā'ahumu Al-Hudá 'Illā 'An Qālū 'Aba`atha Allāhu Basharāan Rasūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And what prevented the people from believing when guidance came to them except that they said, \"Has Allāh sent a human messenger?\"",
            "english_hilali_khan": "And nothing prevented men from believing when the guidance came to them, except that they said: \"Has Allâh sent a man as (His) Messenger?\"",
            "english_rwwad": "Nothing prevented people from believing when guidance came to them except that they said, “Has Allah sent a human as a messenger?”"
        }
    },
    {
        "id": 2123,
        "chapter": 17,
        "verse": 95,
        "arabic_text": "قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا",
        "phonetic": "17.95 Qul Law Kāna Fī Al-'Arđi Malā'ikatun Yamshūna Muţma'innīna Lanazzalnā `Alayhim Mina As-Samā'i Malakāan Rasūlāan",
        "footnotes": {
            "english_saheeh": "[774]- i.e., who were settled and established there, as is man.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"If there were upon the earth angels walking securely,[774] We would have sent down to them from the heaven an angel [as a] messenger.\"",
            "english_hilali_khan": "Say: \"If there were on the earth, angels walking about in peace and security, We should certainly have sent down for them from the heaven an angel as a Messenger.\"",
            "english_rwwad": "Say, “If there had been angels walking on earth peacefully, We would have certainly sent down to them from the heaven an angel as a messenger.”"
        }
    },
    {
        "id": 2124,
        "chapter": 17,
        "verse": 96,
        "arabic_text": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا",
        "phonetic": "17.96 Qul Kafá Billāhi Shahīdāan Baynī Wa Baynakum 'Innahu Kāna Bi`ibādihi Khabīrāan Başīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Sufficient is Allāh as Witness between me and you. Indeed He is ever, concerning His servants, Aware and Seeing.\"",
            "english_hilali_khan": "Say: \"Sufficient is Allâh for a witness between me and you. Verily He is Ever the All-Knower, the All-Seer of His slaves.\"",
            "english_rwwad": "Say, “Allah is Sufficient as a witness between me and you. He is indeed All-Aware, All-Seeing of His slaves.”"
        }
    },
    {
        "id": 2125,
        "chapter": 17,
        "verse": 97,
        "arabic_text": "وَمَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِيَآءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡيٗا وَبُكۡمٗا وَصُمّٗاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَٰهُمۡ سَعِيرٗا",
        "phonetic": "17.97 Wa Man Yahdi Allāhu Fahuwa Al-Muhtadi Wa Man Yuđlil Falan Tajida Lahum 'Awliyā'a Min Dūnihi Wa Naĥshuruhum Yawma Al-Qiyāmati `Alá Wajūhihim `Umyāan Wa Bukmāan Wa Şummāan Ma'wāhum Jahannamu Kullamā Khabat Zidnāhum Sa`īrāan",
        "footnotes": {
            "english_saheeh": "[775]- As a result of his own preference.",
            "english_hilali_khan": "(V.17:97) Narrated Anas bin Mâlik رضي الله عنه: A man said, \"O Allâh’s Prophet! Will Allâh gather a disbeliever (prone) on his face on the Day of Resurrection?\" He صلى الله عليه وسلم said, \"Will not the One Who made him walk on his feet in this world, be able to make him walk on his face on the Day of Resurrection?\" (Qatâdah, a subnarrator, said: \"Yes, by the Power of Our Lord!\") (Sahih Al Bukhri, Vol. 6, Hadith No.283).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whoever Allāh guides - he is the [rightly] guided; and whoever He sends astray[775] - you will never find for them protectors besides Him, and We will gather them on the Day of Resurrection [fallen] on their faces - blind, dumb and deaf. Their refuge is Hell; every time it subsides, We increase [for] them blazing fire.",
            "english_hilali_khan": "And he whom Allâh guides, he is led aright; but he whom He sends astray, for such you will find no Auliyâ’ (helpers and protectors), besides Him, and We shall gather them together on the Day of Resurrection on their faces,[1]blind, dumb and deaf; their abode will be Hell; whenever it abates, We shall increase for them the fierceness of the Fire.",
            "english_rwwad": "Whoever Allah guides is truly guided; and whoever He causes to stray, you will find none to protect them besides Him. On the Day of Resurrection, We will gather [and drag] them on their faces – deaf, dumb and blind. Their abode will be Hell; every time it subsides, We will flare it up for them."
        }
    },
    {
        "id": 2126,
        "chapter": 17,
        "verse": 98,
        "arabic_text": "ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمۡ كَفَرُواْ بِـَٔايَٰتِنَا وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدًا",
        "phonetic": "17.98 Dhālika Jazā'uuhum Bi'annahum Kafarū Bi'āyātinā Wa Qālū 'A'idhā Kunnā `Ižāmāan Wa Rufātāan 'A'innā Lamab`ūthūna Khalqāan Jadīdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is their recompense because they disbelieved in Our verses and said, \"When we are bones and crumbled particles, will we [truly] be resurrected [in] a new creation?\"",
            "english_hilali_khan": "That is their recompense, because they denied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and said: \"When we are bones and fragments, shall we really be raised up as a new creation?\"",
            "english_rwwad": "That will be their recompense because they rejected Our verses and said, “What! When we are turned into bones and crumbled particles, will we really be raised as a new creation?”"
        }
    },
    {
        "id": 2127,
        "chapter": 17,
        "verse": 99,
        "arabic_text": "۞ أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰٓ أَن يَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلٗا لَّا رَيۡبَ فِيهِ فَأَبَى ٱلظَّٰلِمُونَ إِلَّا كُفُورٗا",
        "phonetic": "17.99 'Awalam Yaraw 'Anna Allāha Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Qādirun `Alá 'An Yakhluqa Mithlahum Wa Ja`ala Lahum 'Ajalāan Lā Rayba Fīhi Fa'abá Až-Žālimūna 'Illā Kufūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not see that Allāh, who created the heavens and earth, is [the one] Able to create the likes of them? And He has appointed for them a term, about which there is no doubt. But the wrongdoers refuse except disbelief.",
            "english_hilali_khan": "See they not that Allâh, Who created the heavens and the earth, is Able to create the like of them. And He has decreed for them an appointed term, whereof there is no doubt. But the Zâlimûn (polytheists and wrong-doers) refuse (the truth - the Message of Islâmic Monotheism, and accept nothing) but disbelief.",
            "english_rwwad": "Do they not see that Allah, Who created the heavens and earth, is able to create the like of them? He has decreed for them an appointed time, about which there is no doubt, yet the wrongdoers persist in denial."
        }
    },
    {
        "id": 2128,
        "chapter": 17,
        "verse": 100,
        "arabic_text": "قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا",
        "phonetic": "17.100 Qul Law 'Antum Tamlikūna Khazā'ina Raĥmati Rabbī 'Idhāan La'amsaktum Khashyata Al-'Infāqi Wa Kāna Al-'Insānu Qatūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say [to them], \"If you possessed the depositories of the mercy of my Lord, then you would withhold out of fear of spending.\" And ever has man been stingy.",
            "english_hilali_khan": "Say (to the disbelievers): \"If you possessed the treasure of the Mercy of my Lord (wealth, money, provision.), then you would surely hold back (from spending) for fear of (being exhausted), and man is ever miserly!\"",
            "english_rwwad": "Say, “If you were to own the treasuries of my Lord’s mercy, you would surely hold them back for fear of spending, for man is ever miserly.”"
        }
    },
    {
        "id": 2129,
        "chapter": 17,
        "verse": 101,
        "arabic_text": "وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا",
        "phonetic": "17.101 Wa Laqad 'Ātaynā Mūsá Tis`a 'Āyātin Bayyinātin Fās'l Banī 'Isrā'īla 'Idh Jā'ahum Faqāla Lahu Fir`awnu 'Innī La'ažunnuka Yāmūsá Masĥūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly given Moses nine evident signs, so ask the Children of Israel [about] when he came to them and Pharaoh said to him, \"Indeed I think, O Moses, that you are affected by magic.\"",
            "english_hilali_khan": "And indeed We gave Mûsâ (Moses) nine clear signs. Ask then the Children of Israel, when he came to them, then Fir‘aun (Pharaoh) said to him: \"O Mûsâ (Moses)! I think you are indeed bewitched.\"",
            "english_rwwad": "We gave Moses nine clear signs. Ask the Children of Israel when he came to them, Pharaoh said to him, “O Moses, I certainly think that you are bewitched.”"
        }
    },
    {
        "id": 2130,
        "chapter": 17,
        "verse": 102,
        "arabic_text": "قَالَ لَقَدۡ عَلِمۡتَ مَآ أَنزَلَ هَٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ بَصَآئِرَ وَإِنِّي لَأَظُنُّكَ يَٰفِرۡعَوۡنُ مَثۡبُورٗا",
        "phonetic": "17.102 Qāla Laqad `Alimta Mā 'Anzala Hā'uulā' 'Illā Rabbu As-Samāwāti Wa Al-'Arđi Başā'ira Wa 'Innī La'ažunnuka Yā Fir`awnu Mathbūrāan",
        "footnotes": {
            "english_saheeh": "[776]- i.e., I am certain.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"You have already known that none has sent down these [signs] except the Lord of the heavens and the earth as evidence, and indeed I think,[776] O Pharaoh, that you are destroyed.\"",
            "english_hilali_khan": "[Mûsâ (Moses)] said: \"Verily, you know that these signs have been sent down by none but the Lord of the heavens and the earth (as clear evidence i.e. proofs of Allâh’s Oneness and His Omnipotence.). And I think you are, indeed, O Fir‘aun (Pharaoh) doomed to destruction (away from all good)!\"",
            "english_rwwad": "Moses said, “You already know that none sent down these [signs] except the Lord of the heavens and earth as clear proofs, and I certainly think that you, O Pharaoh, are doomed!”"
        }
    },
    {
        "id": 2131,
        "chapter": 17,
        "verse": 103,
        "arabic_text": "فَأَرَادَ أَن يَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَٰهُ وَمَن مَّعَهُۥ جَمِيعٗا",
        "phonetic": "17.103 Fa'arāda 'An Yastafizzahum Mina Al-'Arđi Fa'aghraqnāhu Wa Man Ma`ahu Jamī`āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he intended to drive them from the land, but We drowned him and those with him all together.",
            "english_hilali_khan": "So he resolved to turn them out of the land (of Egypt). But We drowned him and all who were with him.",
            "english_rwwad": "So he decided to exile them out of the land, but We drowned him and all those who were with him."
        }
    },
    {
        "id": 2132,
        "chapter": 17,
        "verse": 104,
        "arabic_text": "وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِيٓ إِسۡرَٰٓءِيلَ ٱسۡكُنُواْ ٱلۡأَرۡضَ فَإِذَا جَآءَ وَعۡدُ ٱلۡأٓخِرَةِ جِئۡنَا بِكُمۡ لَفِيفٗا",
        "phonetic": "17.104 Wa Qulnā Min Ba`dihi Libanī 'Isrā'īla Askunū Al-'Arđa Fa'idhā Jā'a Wa`du Al-'Ākhirati Ji'nā Bikum Lafīfāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We said after him [i.e., Pharaoh] to the Children of Israel, \"Dwell in the land, and when there comes the promise [i.e., appointment] of the Hereafter, We will bring you forth in [one] gathering.\"",
            "english_hilali_khan": "And We said to the Children of Israel after him: \"Dwell in the land, then, when the final and the last promise comes near [i.e. the Day of Resurrection or the descent of Christ [‘Îsâ (Jesus), son of Maryam (Mary) عليهما السلام on the earth], We shall bring you altogether as mixed crowd (gathered out of various nations). (Tafsir Al-Qurtubî,).",
            "english_rwwad": "Thereafter We said to the Children of Israel, “Dwell in the land, but when the promise of the Hereafter comes, We will bring you all together.”"
        }
    },
    {
        "id": 2133,
        "chapter": 17,
        "verse": 105,
        "arabic_text": "وَبِٱلۡحَقِّ أَنزَلۡنَٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا",
        "phonetic": "17.105 Wa Bil-Ĥaqqi 'Anzalnāhu Wa Bil-Ĥaqqi Nazala Wa Mā 'Arsalnāka 'Illā Mubashirāan Wa Nadhīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.17:105)\na) See the footnote of (V.3:85).\nb) See the footnote of (V.4:80).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And with the truth We have sent it [i.e., the Qur’ān] down, and with the truth it has descended. And We have not sent you, [O Muḥammad], except as a bringer of good tidings and a warner.",
            "english_hilali_khan": "And with truth We have sent it down (i.e. the Qur’ân), and with truth it has descended. And We have sent you (O Muhammad صلى الله عليه و سلم) as nothing but a bearer of glad tidings (of Paradise for those who follow your Message of Islâmic Monotheism), and a warner (of Hell-fire for those who refuse to follow your Message of Islâmic Monotheism)[1].",
            "english_rwwad": "With the truth We have sent down this [Qur’an] and with the truth it has descended, and We have not sent you [O Prophet] except as a bearer of glad tidings and a warner."
        }
    },
    {
        "id": 2134,
        "chapter": 17,
        "verse": 106,
        "arabic_text": "وَقُرۡءَانٗا فَرَقۡنَٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثٖ وَنَزَّلۡنَٰهُ تَنزِيلٗا",
        "phonetic": "17.106 Wa Qur'ānāan Faraqnāhu Litaqra'ahu `Alá An-Nāsi `Alá Mukthin Wa Nazzalnāhu Tanzīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [it is] a Qur’ān which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively.",
            "english_hilali_khan": "years).",
            "english_rwwad": "This is a Qur’an that We have revealed over stages so that you may recite it to people at a slower pace, and We have sent it down in a successive manner."
        }
    },
    {
        "id": 2135,
        "chapter": 17,
        "verse": 107,
        "arabic_text": "قُلۡ ءَامِنُواْ بِهِۦٓ أَوۡ لَا تُؤۡمِنُوٓاْۚ إِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ مِن قَبۡلِهِۦٓ إِذَا يُتۡلَىٰ عَلَيۡهِمۡ يَخِرُّونَۤ لِلۡأَذۡقَانِۤ سُجَّدٗاۤ",
        "phonetic": "17.107 Qul 'Āminū Bihi 'Aw Lā Tu'uminū 'Inna Al-Ladhīna 'Ūtū Al-`Ilma Min Qablihi 'Idhā Yutlá `Alayhim Yakhirrūna Lil'adhqāni Sujjadāan",
        "footnotes": {
            "english_saheeh": "[777]- i.e., the righteous among the People of the Scriptures who recognize the truth contained in the Qur’ān.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Believe in it or do not believe.\" Indeed, those who were given knowledge before it[777] - when it is recited to them, they fall upon their faces in prostration,",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم to them): \"Believe in it (the Qur’ân) or do not believe (in it). Verily those who were given knowledge before it (the Jews and the Christians like ‘Abdullâh bin Salâm and Salmân Al-Farisî), when it is recited to them, fall down on their faces in humble prostration.\"",
            "english_rwwad": "Say, “Believe in it, or do not believe. Those who were given knowledge before it, when it is recited to them, they fall on their faces in prostration,"
        }
    },
    {
        "id": 2136,
        "chapter": 17,
        "verse": 108,
        "arabic_text": "وَيَقُولُونَ سُبۡحَٰنَ رَبِّنَآ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولٗا",
        "phonetic": "17.108 Wa Yaqūlūna Subĥāna Rabbinā 'In Kāna Wa`du Rabbinā Lamaf`ūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled.\"",
            "english_hilali_khan": "And they say: \"Glory be to our Lord! Truly, the Promise of our Lord must be fulfilled.\"",
            "english_rwwad": "and they say, “Glory be to our Lord. The promise of our Lord is bound to be fulfilled.”"
        }
    },
    {
        "id": 2137,
        "chapter": 17,
        "verse": 109,
        "arabic_text": "وَيَخِرُّونَ لِلۡأَذۡقَانِ يَبۡكُونَ وَيَزِيدُهُمۡ خُشُوعٗا۩",
        "phonetic": "17.109 Wa Yakhirrūna Lil'adhqāni Yabkūna Wa Yazīduhum Khushū`āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they fall upon their faces weeping, and it [i.e., the Qur’ān] increases them in humble submission.",
            "english_hilali_khan": "And they fall down on their faces weeping and it increases their humility.",
            "english_rwwad": "They fall down on their faces weeping, and it increases their humility.”"
        }
    },
    {
        "id": 2138,
        "chapter": 17,
        "verse": 110,
        "arabic_text": "قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا",
        "phonetic": "17.110 Qul Ad`ū Allāha 'Aw Ad`ū Ar-Raĥmana 'Ayyāanan Mmā Tad`ū Falahu Al-'Asmā'u Al-Ĥusná Wa Lā Tajhar Bişalātika Wa Lā Tukhāfit Bihā Wa Abtaghi Bayna Dhālika Sabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Call upon Allāh or call upon the Most Merciful [ar-Raḥmān]. Whichever [name] you call - to Him belong the best names.\" And do not recite [too] loudly in your prayer or [too] quietly but seek between that an [intermediate] way.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه و سلم): \"Invoke Allâh or invoke the Most Gracious (Allâh), by whatever name you invoke Him (it is the same), for to Him belong the Best Names. And offer your Salât (prayer) neither aloud nor in a low voice, but follow a way between.",
            "english_rwwad": "Say, “Call upon Allah or call upon the Most Compassionate – whichever name you call, to Him belong the Most Beautiful Names.” Do not be too loud in your prayer, nor too quiet, but seek a way in between."
        }
    },
    {
        "id": 2139,
        "chapter": 17,
        "verse": 111,
        "arabic_text": "وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَلَمۡ يَكُن لَّهُۥ وَلِيّٞ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِيرَۢا",
        "phonetic": "17.111 Wa Quli Al-Ĥamdu Lillāhi Al-Ladhī Lam Yattakhidh Waladāan Wa Lam Yakun Lahu Sharīkun Fī Al-Mulki Wa Lam Yakun Lahu Wa Līyun Mina Adh-Dhulli Wa Kabbirhu Takbīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And say, \"Praise to Allāh, who has not taken a son and has had no partner in [His] dominion and has no [need of a] protector out of weakness; and glorify Him with [great] glorification.\"",
            "english_hilali_khan": "And say: \"All the praises and thanks be to Allâh, Who has not begotten a son (or offspring), and Who has no partner in (His) Dominion, nor He is low to have a Walî (helper, protector or supporter). And magnify Him with all magnificence, [Allâhu-Akbar (Allâh is the Most Great)].\"",
            "english_rwwad": "And say, “All praise is for Allah Who has not taken a son, nor does He have any partner in His dominion, nor does He need any protector out of weakness. And proclaim His greatness immensely.”"
        }
    }
]