[
    {
        "id": 2140,
        "chapter": 18,
        "verse": 1,
        "arabic_text": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ",
        "phonetic": "18.1 Al-Ĥamdu Lillāhi Al-Ladhī 'Anzala `Alá `Abdihi Al-Kitāba Wa Lam Yaj`al Llahu `Iwajā",
        "footnotes": {
            "english_saheeh": "[779]- From the truth or the straight path.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[All] praise is [due] to Allāh, who has sent down upon His Servant [Muḥammad (ﷺ)] the Book and has not made therein any deviance.[779]",
            "english_hilali_khan": "1. All the praises and thanks be to Allâh, Who has sent down to His slave (Muhammad صلى الله عليه وسلم) the Book (the Qur’ân), and has not placed therein any crookedness.",
            "english_rwwad": "All praise be to Allah Who has sent down upon His slave the Book, and has not allowed any crookedness therein,"
        }
    },
    {
        "id": 2141,
        "chapter": 18,
        "verse": 2,
        "arabic_text": "قَيِّمٗا لِّيُنذِرَ بَأۡسٗا شَدِيدٗا مِّن لَّدُنۡهُ وَيُبَشِّرَ ٱلۡمُؤۡمِنِينَ ٱلَّذِينَ يَعۡمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ أَجۡرًا حَسَنٗا",
        "phonetic": "18.2 Qayyimāan Liyundhira Ba'sāan Shadīdāan Min Ladunhu Wa Yubashira Al-Mu'uminīna Al-Ladhīna Ya`malūna Aş-Şāliĥāti 'Anna Lahum 'Ajrāan Ĥasanāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He has made it] straight, to warn of severe punishment from Him and to give good tidings to the believers who do righteous deeds that they will have a good reward [i.e., Paradise].",
            "english_hilali_khan": "(He has made it) straight to give warning (to the disbelievers) of a severe punishment from Him, and to give glad tidings to the believers (in the Oneness of Allâh - Islâmic Monotheism), who do righteous deeds, that they shall have a fair reward (i.e. Paradise).",
            "english_rwwad": "an upright Book, to warn of a severe punishment from Him, and to give glad tidings to the believers who do righteous deeds, that they will have a good reward,"
        }
    },
    {
        "id": 2142,
        "chapter": 18,
        "verse": 3,
        "arabic_text": "مَّٰكِثِينَ فِيهِ أَبَدٗا",
        "phonetic": "18.3 Mākithīna Fīhi 'Abadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "In which they will remain forever",
            "english_hilali_khan": "They shall abide therein for ever.",
            "english_rwwad": "wherein they will abide forever;"
        }
    },
    {
        "id": 2143,
        "chapter": 18,
        "verse": 4,
        "arabic_text": "وَيُنذِرَ ٱلَّذِينَ قَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗا",
        "phonetic": "18.4 Wa Yundhira Al-Ladhīna Qālū Attakhadha Allāhu Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to warn those who say, \"Allāh has taken a son\".",
            "english_hilali_khan": "And to warn those (Jews, Christians, and pagans) who say, \"Allâh has begotten a son (or offspring or children).\"",
            "english_rwwad": "and to warn those who say, “Allah has begotten a son.”"
        }
    },
    {
        "id": 2144,
        "chapter": 18,
        "verse": 5,
        "arabic_text": "مَّا لَهُم بِهِۦ مِنۡ عِلۡمٖ وَلَا لِأٓبَآئِهِمۡۚ كَبُرَتۡ كَلِمَةٗ تَخۡرُجُ مِنۡ أَفۡوَٰهِهِمۡۚ إِن يَقُولُونَ إِلَّا كَذِبٗا",
        "phonetic": "18.5 Mmā Lahum Bihi Min `Ilmin Wa Lā Li'ābā'ihim Kaburat Kalimatan Takhruju Min 'Afwāhihim 'In Yaqūlūna 'Illā Kadhibāan",
        "footnotes": {
            "english_saheeh": "[780]- i.e., they could not have had knowledge of something which is not true.",
            "english_hilali_khan": "(V.18:5): see the footnote of V.2:116.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They have no knowledge of it,[780] nor had their fathers. Grave is the word that comes out of their mouths; they speak not except a lie.",
            "english_hilali_khan": "5. No knowledge have they of such a thing, nor had their fathers. Mighty is the word that comes out of their mouths [i.e. He begot sons and daughters]. They utter nothing but a lie[1].",
            "english_rwwad": "They have no knowledge of it, nor did their forefathers. What a monstrous word that comes out of their mouths! They say nothing but lies."
        }
    },
    {
        "id": 2145,
        "chapter": 18,
        "verse": 6,
        "arabic_text": "فَلَعَلَّكَ بَٰخِعٞ نَّفۡسَكَ عَلَىٰٓ ءَاثَٰرِهِمۡ إِن لَّمۡ يُؤۡمِنُواْ بِهَٰذَا ٱلۡحَدِيثِ أَسَفًا",
        "phonetic": "18.6 Fala`allaka Bākhi`un Nafsaka `Alá 'Āthārihim 'In Lam Yu'uminū Bihadhā Al-Ĥadīthi 'Asafāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then perhaps you would kill yourself through grief over them, [O Muḥammad], if they do not believe in this message, [and] out of sorrow.",
            "english_hilali_khan": "Perhaps, you, would kill yourself (O Muhammad صلى الله عليه وسلم) in grief, over their footsteps (for their turning away from you), because they believe not in this narration (the Qur’ân).",
            "english_rwwad": "Perhaps you grieve yourself to death [O Prophet] over them, if they do not believe in this message."
        }
    },
    {
        "id": 2146,
        "chapter": 18,
        "verse": 7,
        "arabic_text": "إِنَّا جَعَلۡنَا مَا عَلَى ٱلۡأَرۡضِ زِينَةٗ لَّهَا لِنَبۡلُوَهُمۡ أَيُّهُمۡ أَحۡسَنُ عَمَلٗا",
        "phonetic": "18.7 'Innā Ja`alnā Mā `Alá Al-'Arđi Zīnatan Lahā Linabluwahum 'Ayyuhum 'Aĥsanu `Amalāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We have made that which is on the earth adornment for it that We may test them [as to] which of them is best in deed.",
            "english_hilali_khan": "Verily! We have made that which is on earth as an adornment for it, in order that We may test them (mankind) as to which of them are best in deeds. [i.e. those who do good deeds in the most perfect manner, that means to do them (deeds) totally for Allâh’s sake and in accordance to the legal ways of the Prophet صلى الله عليه وسلم].",
            "english_rwwad": "We have made all that is on earth as an adornment for it, so that We may test them as to which of them is best in deeds."
        }
    },
    {
        "id": 2147,
        "chapter": 18,
        "verse": 8,
        "arabic_text": "وَإِنَّا لَجَٰعِلُونَ مَا عَلَيۡهَا صَعِيدٗا جُرُزًا",
        "phonetic": "18.8 Wa 'Innā Lajā`ilūna Mā `Alayhā Şa`īdāan Juruzāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, We will make that which is upon it [into] a barren ground.",
            "english_hilali_khan": "And verily We shall make all that is on it (the earth) a bare dry soil (without any vegetation or trees.).",
            "english_rwwad": "And We will surely turn all that is on it to a barren land."
        }
    },
    {
        "id": 2148,
        "chapter": 18,
        "verse": 9,
        "arabic_text": "أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا",
        "phonetic": "18.9 'Am Ĥasibta 'Anna 'Aşĥāba Al-Kahfi Wa Ar-Raqīmi Kānū Min 'Āyātinā `Ajabāan",
        "footnotes": {
            "english_saheeh": "[781]- Rather, it is only one of the many wonders of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or have you thought that the companions of the cave and the inscription were, among Our signs, a wonder?[781]",
            "english_hilali_khan": "Do you think that the people of the Cave and the Inscription (the news or the names of the people of the Cave) were a wonder among Our Signs?",
            "english_rwwad": "Do you think that the people of the Cave and the Inscription were of Our only wondrous signs?"
        }
    },
    {
        "id": 2149,
        "chapter": 18,
        "verse": 10,
        "arabic_text": "إِذۡ أَوَى ٱلۡفِتۡيَةُ إِلَى ٱلۡكَهۡفِ فَقَالُواْ رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةٗ وَهَيِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدٗا",
        "phonetic": "18.10 'Idh 'Awá Al-Fityatu 'Ilá Al-Kahfi Faqālū Rabbanā 'Ātinā Min Ladunka Raĥmatan Wa Hayyi' Lanā Min 'Amrinā Rashadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Mention] when the youths retreated to the cave and said, \"Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.\"",
            "english_hilali_khan": "(Remember) when the young men fled for refuge (from their disbelieving folk) to the Cave. They said: \"Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way!\"",
            "english_rwwad": "When the youths took refuge in the Cave, and said, “Our Lord, grant us mercy from Yourself, and show us the right way in our ordeal.”"
        }
    },
    {
        "id": 2150,
        "chapter": 18,
        "verse": 11,
        "arabic_text": "فَضَرَبۡنَا عَلَىٰٓ ءَاذَانِهِمۡ فِي ٱلۡكَهۡفِ سِنِينَ عَدَدٗا",
        "phonetic": "18.11 Fađarabnā `Alá 'Ādhānihim Fī Al-Kahfi Sinīna `Adadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We cast [a cover of sleep] over their ears within the cave for a number of years.",
            "english_hilali_khan": "Therefore We covered up their (sense of) hearing (causing them to go in deep sleep) in the Cave for a number of years.",
            "english_rwwad": "Then We caused them to fall into a deep sleep in the cave for many years."
        }
    },
    {
        "id": 2151,
        "chapter": 18,
        "verse": 12,
        "arabic_text": "ثُمَّ بَعَثۡنَٰهُمۡ لِنَعۡلَمَ أَيُّ ٱلۡحِزۡبَيۡنِ أَحۡصَىٰ لِمَا لَبِثُوٓاْ أَمَدٗا",
        "phonetic": "18.12 Thumma Ba`athnāhum Lina`lama 'Ayyu Al-Ĥizbayni 'Aĥşá Limā Labithū 'Amadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We awakened them that We might show which of the two factions was most precise in calculating what [extent] they had remained in time.",
            "english_hilali_khan": "Then We raised them up (from their sleep), that We might test which of the two parties was best at calculating the time period that they had tarried.",
            "english_rwwad": "Then We awakened them so that We may see which of the two parties would be more precise in calculating the length of their stay."
        }
    },
    {
        "id": 2152,
        "chapter": 18,
        "verse": 13,
        "arabic_text": "نَّحۡنُ نَقُصُّ عَلَيۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡيَةٌ ءَامَنُواْ بِرَبِّهِمۡ وَزِدۡنَٰهُمۡ هُدٗى",
        "phonetic": "18.13 Naĥnu Naquşşu `Alayka Naba'ahum Bil-Ĥaqqi 'Innahum Fityatun 'Āmanū Birabbihim Wa Zidnāhum Hudáan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is We who relate to you, [O Muḥammad], their story in truth. Indeed, they were youths who believed in their Lord, and We increased them in guidance.",
            "english_hilali_khan": "We narrate unto you (O Muhammad صلى الله عليه وسلم) their story with truth: Truly they were young men who believed in their Lord (Allâh), and We increased them in guidance.",
            "english_rwwad": "We relate to you their story in truth. They were youths who believed in their Lord, and We gave them more guidance."
        }
    },
    {
        "id": 2153,
        "chapter": 18,
        "verse": 14,
        "arabic_text": "وَرَبَطۡنَا عَلَىٰ قُلُوبِهِمۡ إِذۡ قَامُواْ فَقَالُواْ رَبُّنَا رَبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَن نَّدۡعُوَاْ مِن دُونِهِۦٓ إِلَٰهٗاۖ لَّقَدۡ قُلۡنَآ إِذٗا شَطَطًا",
        "phonetic": "18.14 Wa Rabaţnā `Alá Qulūbihim 'Idh Qāmū Faqālū Rabbunā Rabbu As-Samāwāti Wa Al-'Arđi Lan Nad`uwa Min Dūnihi 'Ilahāan Laqad Qulnā 'Idhāan Shaţaţāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We bound [i.e., made firm] their hearts when they stood up and said, \"Our Lord is the Lord of the heavens and the earth. Never will we invoke besides Him any deity. We would have certainly spoken, then, an excessive transgression.",
            "english_hilali_khan": "And We made their hearts firm and strong (with the light of Faith in Allâh and bestowed upon them patience to bear the separation of their kith and kin and dwellings) when they stood up and said: \"Our Lord is the Lord of the heavens and the earth, never shall we call upon any ilâh (god) other than Him; if we did, we should indeed have uttered an enormity in disbelief.",
            "english_rwwad": "We strengthened their hearts when they stood up and proclaimed, “Our Lord is the Lord of the heavens and earth. We will never call upon any god other than Him, or we would be uttering an outrageous lie.”"
        }
    },
    {
        "id": 2154,
        "chapter": 18,
        "verse": 15,
        "arabic_text": "هَٰٓؤُلَآءِ قَوۡمُنَا ٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗۖ لَّوۡلَا يَأۡتُونَ عَلَيۡهِم بِسُلۡطَٰنِۭ بَيِّنٖۖ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبٗا",
        "phonetic": "18.15 Hā'uulā' Qawmunā Attakhadhū Min Dūnihi 'Ālihatan Lawlā Ya'tūna `Alayhim Bisulţānin Bayyinin Faman 'Ažlamu Mimmani Aftará `Alá Allāhi Kadhibāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "These, our people, have taken besides Him deities. Why do they not bring for [worship of] them a clear evidence? And who is more unjust than one who invents about Allāh a lie?\"",
            "english_hilali_khan": "\"These our people have taken for worship âlihah (gods) other than Him (Allâh). Why do they not bring for them a clear authority? And who does more wrong than he who invents a lie against Allâh.",
            "english_rwwad": "These people of ours have taken besides Him other gods. Why do they not bring a clear proof about them? Who does greater wrong than one who fabricates lies against Allah?"
        }
    },
    {
        "id": 2155,
        "chapter": 18,
        "verse": 16,
        "arabic_text": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا",
        "phonetic": "18.16 Wa 'Idh A`tazaltumūhum Wa Mā Ya`budūna 'Illā Allāha Fa'wū 'Ilá Al-Kahfi Yanshur Lakum Rabbukum Min Raĥmatihi Wa Yuhayyi' Lakum Min 'Amrikum Mirfaqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[The youths said to one another], \"And when you have withdrawn from them and that which they worship other than Allāh, retreat to the cave. Your Lord will spread out for you of His mercy and will prepare for you from your affair facility.\"",
            "english_hilali_khan": "(The young men said to one another): \"And when you withdraw from them, and that which they worship, except Allâh, then seek refuge in the Cave; your Lord will open a way for you from His Mercy and will make easy for you your affair (i.e. will give you what you will need of provision, dwelling).\"",
            "english_rwwad": "When you have distanced yourselves from them and what they worship other than Allah, take refuge in the cave; your Lord will extend His mercy to you and make for you an easy way out of your ordeal.”"
        }
    },
    {
        "id": 2156,
        "chapter": 18,
        "verse": 17,
        "arabic_text": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا",
        "phonetic": "18.17 Wa Tará Ash-Shamsa 'Idhā Ţala`at Tazāwaru `An Kahfihim Dhāta Al-Yamīni Wa 'Idhā Gharabat Taqriđuhum Dhāta Ash-Shimāli Wa Hum Fī Fajwatin Minhu Dhālika Min 'Āyāti Allāhi Man Yahdi Allāhu Fahuwa Al-Muhtadi Wa Man Yuđlil Falan Tajida Lahu Walīyāan Murshidāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [had you been present], you would see the sun when it rose, inclining away from their cave on the right, and when it set, passing away from them on the left, while they were [lying] within an open space thereof. That was from the signs of Allāh. He whom Allāh guides is the [rightly] guided, but he whom He sends astray - never will you find for him a protecting guide.",
            "english_hilali_khan": "And you might have seen the sun, when it rose, declining to the right from their Cave, and when it set, turning away from them to the left, while they lay in the midst of the Cave. That is (one) of the Ayât (proofs, evidence, signs) of Allâh. He whom Allâh guides, he is the rightly guided; but he whom He sends astray, for him you will find no Walî (guiding friend) to lead him (to the right Path).",
            "english_rwwad": "You would have seen the sun when it rose, it would incline away from their Cave to the right; and when it set, it would turn away from them to the left, while they were in its open space. That was one of the signs of Allah. Whoever Allah guides is rightly guided, and whoever He causes to stray, you will never find for him a protecting guide."
        }
    },
    {
        "id": 2157,
        "chapter": 18,
        "verse": 18,
        "arabic_text": "وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا",
        "phonetic": "18.18 Wa Taĥsabuhum 'Ayqāžāan Wa Hum Ruqūdun Wa Nuqallibuhum Dhāta Al-Yamīni Wa Dhāta Ash-Shimāli Wa Kalbuhum Bāsiţun Dhirā`ayhi Bil-Waşīdi Lawi Aţţala`ta `Alayhim Lawallayta Minhum Firārāan Wa Lamuli'ta Minhum Ru`bāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you would think them awake, while they were asleep. And We turned them to the right and to the left, while their dog stretched his forelegs at the entrance. If you had looked at them, you would have turned from them in flight and been filled by them with terror.",
            "english_hilali_khan": "And you would have thought them awake, whereas they were asleep. And We turned them on their right and on their left sides, and their dog stretching forth his two forelegs at the entrance [of the Cave or in the space near to the entrance of the Cave (as a guard at the gate)]. Had you looked at them, you would certainly have turned back from them in flight, and would certainly have been filled with awe of them.",
            "english_rwwad": "You would have thought they were awake, although they were asleep. We turned them over on their right and left sides, while their dog stretching its forelegs at the entrance. If you had seen them, you would have fled away from them, filled with horror."
        }
    },
    {
        "id": 2158,
        "chapter": 18,
        "verse": 19,
        "arabic_text": "وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا",
        "phonetic": "18.19 Wa Kadhalika Ba`athnāhum Liyatasā'alū Baynahum Qāla Qā'ilun Minhum Kam Labithtum Qālū Labithnā Yawmāan 'Aw Ba`đa Yawmin Qālū Rabbukum 'A`lamu Bimā Labithtum Fāb`athū 'Aĥadakum Biwariqikum Hadhihi 'Ilá Al-Madīnati Falyanžur 'Ayyuhā 'Azká Ţa`āmāan Falya'tikum Birizqin Minhu Wa Līatalaţţaf Wa Lā Yush`iranna Bikum 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "[782]- By the will of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And similarly,[782] We awakened them that they might question one another. Said a speaker from among them, \"How long have you remained [here]?\" They said, \"We have remained a day or part of a day.\" They said, \"Your Lord is most knowing of how long you remained. So send one of you with this silver coin of yours to the city and let him look to which is the best of food and bring you provision from it and let him be cautious. And let no one be aware of you.",
            "english_hilali_khan": "Likewise, We awakened them (from their long deep sleep) that they might question one another. A speaker from among them said: \"How long have you stayed (here)?\" They said: \"We have stayed (perhaps) a day or part of a day.\" They said: \"Your Lord (Alone) knows best how long you have stayed (here). So send one of you with this silver coin of yours to the town, and let him find out which is the good lawful food, and bring some of that to you. And let him be careful and let no man know of you.",
            "english_rwwad": "Similarly, We awakened them so that they might question one another. One of them said, “How long have you been here?” They said, “We have been here for a day or part of a day.” They said, “Your Lord knows best how long have you been here. Send one of you with these silver coins of yours to the city, and let him see who has the most pure food and bring some provision from it. And be cautious and let no one know about you."
        }
    },
    {
        "id": 2159,
        "chapter": 18,
        "verse": 20,
        "arabic_text": "إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا",
        "phonetic": "18.20 'Innahum 'In Yažharū `Alaykum Yarjumūkum 'Aw Yu`īdūkum Fī Millatihim Wa Lan Tufliĥū 'Idhāan 'Abadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, if they come to know of you, they will stone you or return you to their religion. And never would you succeed, then - ever.\"",
            "english_hilali_khan": "\"For, if they come to know of you, they will stone you (to death or abuse and harm you) or turn you back to their religion; and in that case you will never be successful.\"",
            "english_rwwad": "For if they find out about you, they will stone you or force you back to their religion, and then you will never succeed.”"
        }
    },
    {
        "id": 2160,
        "chapter": 18,
        "verse": 21,
        "arabic_text": "وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا",
        "phonetic": "18.21 Wa Kadhalika 'A`tharnā `Alayhim Liya`lamū 'Anna Wa`da Allāhi Ĥaqqun Wa 'Anna As-Sā`ata Lā Rayba Fīhā 'Idh Yatanāza`ūna Baynahum 'Amrahum Faqālū Abnū `Alayhim Bunyānāan Rabbuhum 'A`lamu Bihim Qāla Al-Ladhīna Ghalabū `Alá 'Amrihim Lanattakhidhanna `Alayhim Masjidāan",
        "footnotes": {
            "english_saheeh": "[783]- The people of the city.\n[784]- i.e., we will make this site a place of worship.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And similarly, We caused them to be found that they [who found them] would know that the promise of Allāh is truth and that of the Hour there is no doubt. [That was] when they[783] disputed among themselves about their affair and [then] said, \"Construct over them a structure. Their Lord is most knowing about them.\" Said those who prevailed in the matter, \"We will surely take [for ourselves] over them a masjid.\"[784]",
            "english_hilali_khan": "And thus We made their case known (to the people), that they might know that the Promise of Allâh is true, and that there can be no doubt about the Hour. (Remember) when they (the people of the city) disputed among themselves about their case, they said: \"Construct a building over them; their Lord knows best about them;\" (then) those who won their point said (most probably the disbelievers): \"We verily shall build a place of worship over them.\"",
            "english_rwwad": "This is how We made their case known so that the people might know that the promise of Allah is true and that there is no doubt about the Hour, when they were disputing among themselves concerning their matter [of resurrection], they said, “Build a structure over them. Their Lord knows best about them.” Those who prevailed in their matter said, “We will surely build over them a place of worship.”"
        }
    },
    {
        "id": 2161,
        "chapter": 18,
        "verse": 22,
        "arabic_text": "سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا",
        "phonetic": "18.22 Sayaqūlūna Thalāthatun Rābi`uhum Kalbuhum Wa Yaqūlūna Khamsatun Sādisuhum Kalbuhum Rajmāan Bil-Ghaybi Wa Yaqūlūna Sab`atun Wa Thāminuhum Kalbuhum Qul Rabbī 'A`lamu Bi`iddatihim Mā Ya`lamuhum 'Illā Qalīlun Falā Tumāri Fīhim 'Illā Mirā'an Žāhirāan Wa Lā Tastafti Fīhim Minhum 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "[785]- i.e., one from the Qur’ān, which is the only sure argument.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They [i.e., people] will say there were three, the fourth of them being their dog; and they will say there were five, the sixth of them being their dog - guessing at the unseen; and they will say there were seven, and the eighth of them was their dog. Say, [O Muḥammad], \"My Lord is most knowing of their number. None knows them except a few. So do not argue about them except with an obvious argument[785] and do not inquire about them among [the speculators] from anyone.\"",
            "english_hilali_khan": "(Some) say they were three, the dog being the fourth among them; and (others) say they were five, the dog being the sixth, - guessing at the unseen; (yet others) say they were seven, and the dog being the eighth. Say (O Muhammad صلى الله عليه وسلم): \"My Lord knows best their number; none knows them but a few.\" So debate not (about their number) except with the clear proof (which We have revealed to you). And consult not any of them (people of the Scripture - Jews and Christians) about (the affair of) the people of the Cave.",
            "english_rwwad": "Some will say, “They were three, their dog was the fourth,” while others will say, “They were five, their dog was the sixth,” – merely guessing at the unseen. And others will say, “They were seven, their dog was the eighth.” Say, “My Lord knows best their number; no one knows about them except a few. So do not argue about them except in a brief manner, nor ask anyone about them.”"
        }
    },
    {
        "id": 2162,
        "chapter": 18,
        "verse": 23,
        "arabic_text": "وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا",
        "phonetic": "18.23 Wa Lā Taqūlanna Lishay'in 'Innī Fā`ilun Dhālika Ghadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And never say of anything, \"Indeed, I will do that tomorrow,\"",
            "english_hilali_khan": "And never say of anything, \"I shall do such and such thing tomorrow.\"",
            "english_rwwad": "And never say about anything, “I will surely do this tomorrow,”"
        }
    },
    {
        "id": 2163,
        "chapter": 18,
        "verse": 24,
        "arabic_text": "إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا",
        "phonetic": "18.24 'Illā 'An Yashā'a Allāhu Wa Adhkur Rabbaka 'Idhā Nasīta Wa Qul `Asá 'An Yahdiyani Rabbī Li'qraba Min Hādhā Rashadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Except [when adding], \"If Allāh wills.\" And remember your Lord when you forget [it] and say, \"Perhaps my Lord will guide me to what is nearer than this to right conduct.\"",
            "english_hilali_khan": "Except (with the saying), \"If Allâh will!\" And remember your Lord when you forget and say: \"It may be that my Lord guides me unto a nearer way of truth than this.\"",
            "english_rwwad": "without adding, “if Allah wills.” And remember your Lord if you forget, and say, “My Lord will hopefully guide me to something closer to what is right.”"
        }
    },
    {
        "id": 2164,
        "chapter": 18,
        "verse": 25,
        "arabic_text": "وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا",
        "phonetic": "18.25 Wa Labithū Fī Kahfihim Thalātha Miā'atin Sinīna Wa Azdādū Tis`āan",
        "footnotes": {
            "english_saheeh": "[786]- i.e., 309 lunar years.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they remained in their cave for three hundred years and exceeded by nine.[786]",
            "english_hilali_khan": "And they stayed in their Cave three hundred (solar) years, adding nine (for lunar years). (Tafsir Al-Qurtubi)",
            "english_rwwad": "They remained in their cave for three hundred years, plus nine."
        }
    },
    {
        "id": 2165,
        "chapter": 18,
        "verse": 26,
        "arabic_text": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا",
        "phonetic": "18.26 Quli Allāhu 'A`lamu Bimā Labithū Lahu Ghaybu As-Samāwāti Wa Al-'Arđi 'Abşir Bihi Wa 'Asmi` Mā Lahum Min Dūnihi Min Wa Līyin Wa Lā Yushriku Fī Ĥukmihi 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Allāh is most knowing of how long they remained. He has [knowledge of] the unseen [aspects] of the heavens and the earth. How Seeing is He and how Hearing! They have not besides Him any protector, and He shares not His legislation with anyone.\"",
            "english_hilali_khan": "Say: \"Allâh knows best how long they stayed. With Him is (the knowledge of) the Unseen of the heavens and the earth. How clearly He sees, and hears (everything)! They have no Walî (Helper, Disposer of affairs, Protector) other than Him, and He makes none to share in His Decision and His Rule.\"",
            "english_rwwad": "Say, “Allah knows best how long they remained. To Him belongs [knowledge of] the unseen of the heavens and earth. How well He sees and how well He hears! They have no protector besides Him, and He shares His command with none.”"
        }
    },
    {
        "id": 2166,
        "chapter": 18,
        "verse": 27,
        "arabic_text": "وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا",
        "phonetic": "18.27 Wa Atlu Mā 'Ūĥiya 'Ilayka Min Kitābi Rabbika Lā Mubaddila Likalimātihi Wa Lan Tajida Min Dūnihi Multaĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And recite, [O Muḥammad], what has been revealed to you of the Book of your Lord. There is no changer of His words, and never will you find in other than Him a refuge.",
            "english_hilali_khan": "And recite what has been revealed to you (O Muhammad صلى الله عليه وسلم) of the Book (the Qur’ân) of your Lord (i.e. recite it, understand and follow its teachings and act on its orders and preach it to men). None can change His Words, and none will you find as a refuge other than Him.",
            "english_rwwad": "Recite what has been revealed to you from the Book of your Lord. None can change His Words, and you will never find any refuge except with Him."
        }
    },
    {
        "id": 2167,
        "chapter": 18,
        "verse": 28,
        "arabic_text": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا",
        "phonetic": "18.28 Wa Aşbir Nafsaka Ma`a Al-Ladhīna Yad`ūna Rabbahum Bil-Ghadāati Wa Al-`Ashīyi Yurīdūna Wajhahu Wa Lā Ta`du `Aynāka `Anhum Turīdu Zīnata Al-Ĥayāati Ad-Dunyā Wa Lā Tuţi` Man 'Aghfalnā Qalbahu `An Dhikrinā Wa Attaba`a Hawāhu Wa Kāna 'Amruhu Furuţāan",
        "footnotes": {
            "english_saheeh": "[787]- Or \"in excess,\" exceeding the limits of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And keep yourself patient [by being] with those who call upon their Lord in the morning and the evening, seeking His face [i.e., acceptance]. And let not your eyes pass beyond them, desiring adornments of the worldly life, and do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is ever [in] neglect.[787]",
            "english_hilali_khan": "And keep yourself (O Muhammad صلى الله عليه وسلم) patiently with those who call on their Lord (i.e. your companions who remember their Lord with glorification, praising in prayers, and other righteous deeds) morning and afternoon, seeking His Face; and let not your eyes overlook them, desiring the pomp and glitter of the life of the world; and obey not him whose heart We have made heedless of Our Remembrance, and who follows his own lusts, and whose affair (deeds) has been lost.",
            "english_rwwad": "Be patient with those who call upon their Lord morning and evening, seeking His pleasure. Do not turn your eyes away from them, desiring the adornments of the life of this world. And do not obey one whose heart We have made heedless of Our remembrance, who follows his desires and whose affair is at loss."
        }
    },
    {
        "id": 2168,
        "chapter": 18,
        "verse": 29,
        "arabic_text": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا",
        "phonetic": "18.29 Wa Quli Al-Ĥaqqu Min Rabbikum Faman Shā'a Falyu'umin Wa Man Shā'a Falyakfur 'Innā 'A`tadnā Lilžžālimīna Nārāan 'Aĥāţa Bihim Surādiquhā Wa 'In Yastaghīthū Yughāthū Bimā'in Kālmuhli Yashwī Al-Wujūha Bi'sa Ash-Sharābu Wa Sā'at Murtafaqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And say, \"The truth is from your Lord, so whoever wills - let him believe; and whoever wills - let him disbelieve.\" Indeed, We have prepared for the wrongdoers a fire whose walls will surround them. And if they call for relief, they will be relieved with water like murky oil, which scalds [their] faces. Wretched is the drink, and evil is the resting place.",
            "english_hilali_khan": "And say: \"The truth is from your Lord.\" Then whosoever wills, let him believe; and whosoever wills, let him disbelieve. Verily, We have prepared for the Zâlimûn (polytheists and wrong-doers.), a Fire whose walls will be surrounding them (disbelievers in the Oneness of Allâh). And if they ask for help (relief, water), they will be granted water like boiling oil, that will scald their faces. Terrible is the drink, and an evil Murtafaq (dwelling, resting place.)!",
            "english_rwwad": "Say, “The truth is from your Lord. Whoever wills may believe, and whoever wills may disbelieve.” We have prepared for the wrongdoers a Fire which will encompass them like the walls. If they cry for relief, they will be relieved with water like boiling oil that will scald the faces. What a terrible drink, and what a terrible resting place!"
        }
    },
    {
        "id": 2169,
        "chapter": 18,
        "verse": 30,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا",
        "phonetic": "18.30 'Inna Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti 'Innā Lā Nuđī`u 'Ajra Man 'Aĥsana `Amalāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have believed and done righteous deeds - indeed, We will not allow to be lost the reward of any who did well in deeds.",
            "english_hilali_khan": "Verily as for those who believed and did righteous deeds, certainly We shall not make the reward of anyone who does his (righteous) deeds in the most perfect manner to be lost.",
            "english_rwwad": "Those who believe and do righteous deeds, We will not let the reward of those who do good deeds to be lost."
        }
    },
    {
        "id": 2170,
        "chapter": 18,
        "verse": 31,
        "arabic_text": "أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا",
        "phonetic": "18.31 'Ūlā'ika Lahum Jannātu `Adnin Tajrī Min Taĥtihimu Al-'Anhāru Yuĥallawna Fīhā Min 'Asāwira Min Dhahabin Wa Yalbasūna Thiyābāan Khuđrāan Min Sundusin Wa 'Istabraqin Muttaki'īna Fīhā `Alá Al-'Arā'iki Ni`ma Ath-Thawābu Wa Ĥasunat Murtafaqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those will have gardens of perpetual residence; beneath them rivers will flow. They will be adorned therein with bracelets of gold and will wear green garments of fine silk and brocade, reclining therein on adorned couches. Excellent is the reward, and good is the resting place.",
            "english_hilali_khan": "These! For them will be ‘Adn (Eden) Paradise (everlasting Gardens); wherein rivers flow underneath them; therein they will be adorned with bracelets of gold, and they will wear green garments of fine and thick silk. They will recline therein on raised thrones. How good is the reward, and what an excellent Murtafaq (dwelling, resting place.)!",
            "english_rwwad": "It is they who will have Gardens of Eternity, under which rivers flow. They will be adorned therein with golden bracelets and will wear green garments of fine silk and brocade, reclining on adorned couches. What an excellent reward, and what a pleasant resting place!"
        }
    },
    {
        "id": 2171,
        "chapter": 18,
        "verse": 32,
        "arabic_text": "۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا",
        "phonetic": "18.32 Wa Ađrib Lahum Mathalāan Rajulayni Ja`alnā Li'ĥadihimā Jannatayni Min 'A`nābin Wa Ĥafafnāhumā Binakhlin Wa Ja`alnā Baynahumā Zar`āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And present to them an example of two men: We granted to one of them two gardens of grapevines, and We bordered them with palm trees and placed between them [fields of] crops.",
            "english_hilali_khan": "And put forward to them the example of two men: unto one of them We had given two gardens of grapes, and We had surrounded both with date-palms; and had put between them green crops (cultivated fields).",
            "english_rwwad": "Give them an example of two men: to one of them We gave two gardens of grapevines and surrounded them with palm trees, and placed between them crops."
        }
    },
    {
        "id": 2172,
        "chapter": 18,
        "verse": 33,
        "arabic_text": "كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡـٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا",
        "phonetic": "18.33 Kiltā Al-Jannatayni 'Ātat 'Ukulahā Wa Lam Tažlim Minhu Shay'āan Wa Fajjarnā Khilālahumā Naharāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Each of the two gardens produced its fruit and did not fall short thereof in anything. And We caused to gush forth within them a river.",
            "english_hilali_khan": "Each of those two gardens brought forth its produce, and failed not in the least therein, and We caused a river to gush forth in the midst of them.",
            "english_rwwad": "Each garden yielded its produce and did not fall short in the least, and We caused a stream to flow through them."
        }
    },
    {
        "id": 2173,
        "chapter": 18,
        "verse": 34,
        "arabic_text": "وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا",
        "phonetic": "18.34 Wa Kāna Lahu Thamarun Faqāla Lişāĥibihi Wa Huwa Yuĥāwiruhu 'Anā 'Aktharu Minka Mālāan Wa 'A`azzu Nafarāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he had fruit, so he said to his companion while he was conversing with him, \"I am greater than you in wealth and mightier in [numbers of] men.\"",
            "english_hilali_khan": "And he had property (or fruit) and he said to his companion, in the course of mutual talk: \"I am more than you in wealth and stronger in respect of men.\" (Tafsir Al-Qurtubî).",
            "english_rwwad": "And he had abundant fruit. He said to his companion, as he was conversing with him, “I am greater than you in wealth and superior in following.”"
        }
    },
    {
        "id": 2174,
        "chapter": 18,
        "verse": 35,
        "arabic_text": "وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٞ لِّنَفۡسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدٗا",
        "phonetic": "18.35 Wa Dakhala Jannatahu Wa Huwa Žālimun Linafsihi Qāla Mā 'Ažunnu 'An Tabīda Hadhihi 'Abadāan",
        "footnotes": {
            "english_saheeh": "[788]- i.e., proud and ungrateful to Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he entered his garden while he was unjust to himself.[788] He said, \"I do not think that this will perish - ever.",
            "english_hilali_khan": "And he went into his garden while in a state (of pride and disbelief) unjust to himself. He said: \"I think not that this will ever perish.",
            "english_rwwad": "He entered his garden, having wronged himself, and said, “I do not think that this will ever perish,"
        }
    },
    {
        "id": 2175,
        "chapter": 18,
        "verse": 36,
        "arabic_text": "وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّدِدتُّ إِلَىٰ رَبِّي لَأَجِدَنَّ خَيۡرٗا مِّنۡهَا مُنقَلَبٗا",
        "phonetic": "18.36 Wa Mā 'Ažunnu As-Sā`ata Qā'imatan Wa La'in Rudidtu 'Ilá Rabbī La'ajidanna Khayrāan Minhā Munqalabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return.\"",
            "english_hilali_khan": "\"And I think not the Hour will ever come, and if indeed I am brought back to my Lord, (on the Day of Resurrection), I surely shall find better than this when I return to Him.\"",
            "english_rwwad": "nor do I think that the Hour will ever come. Even if I am brought back to my Lord, I will surely find something better than this.”"
        }
    },
    {
        "id": 2176,
        "chapter": 18,
        "verse": 37,
        "arabic_text": "قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ يُحَاوِرُهُۥٓ أَكَفَرۡتَ بِٱلَّذِي خَلَقَكَ مِن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ سَوَّىٰكَ رَجُلٗا",
        "phonetic": "18.37 Qāla Lahu Şāĥibuhu Wa Huwa Yuĥāwiruhu 'Akafarta Bial-Ladhī Khalaqaka Min Turābin Thumma Min Nuţfatin Thumma Sawwāka Rajulāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "His companion said to him while he was conversing with him, \"Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man?",
            "english_hilali_khan": "His companion said to him during the talk with him: \"Do you disbelieve in Him Who created you out of dust (i.e. your father Adam), then out of Nutfah (mixed semen drops of male and female discharge), then fashioned you into a man?",
            "english_rwwad": "His companion said, while conversing with him, “Do you disbelieve in He Who created you from dust, then from a sperm-drop, then fashioned you into a well proportioned man?"
        }
    },
    {
        "id": 2177,
        "chapter": 18,
        "verse": 38,
        "arabic_text": "لَّٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّي وَلَآ أُشۡرِكُ بِرَبِّيٓ أَحَدٗا",
        "phonetic": "18.38 Lakinnā Huwa Allāhu Rabbī Wa Lā 'Ushriku Birabbī 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for me, He is Allāh, my Lord, and I do not associate with my Lord anyone.",
            "english_hilali_khan": "\"But as for my part, (I believe) that He is Allâh, my Lord, and none shall I associate as partner with my Lord.",
            "english_rwwad": "As for me: He is Allah, my Lord, and I do not associate anyone with my Lord."
        }
    },
    {
        "id": 2178,
        "chapter": 18,
        "verse": 39,
        "arabic_text": "وَلَوۡلَآ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالٗا وَوَلَدٗا",
        "phonetic": "18.39 Wa Lawlā 'Idh Dakhalta Jannataka Qulta Mā Shā'a Allāhu Lā Qūwata 'Illā Billāhi 'In Tarani 'Anā 'Aqalla Minka Mālāan Wa Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:39): What is said regarding the statement: Lâ haulâ walâ quwwata illa billâh (i.e. There is neither might nor power except with Allâh).\nNarrated Abu Mûsâ Al-Ash‘ari: The Prophet صلى الله عليه وسلم started ascending a high place or a hill. A man (amongst his companions) ascended it and shouted in a loud voice. Lâ ilâha illal-lahu wallâhu Akbar* (At that time) Allâh’s Messenger صلى الله عليه وسلم was riding his mule. Allâh’s Messenger صلى الله عليه وسلم said, \"You are not calling upon a deaf or an absent one.\" and added, \"O Abu Mûsâ (or, O ‘Abdullâh)! Shall I tell you a sentence from the treasure of Paradise?\" I said, \"Yes.\" He said,\"Lâ haulâ walâ quwwata illa billâh\" (Sahih Al-Bukhari, Vol. 8, Hadith No. 418).\n*None has the right to be worshipped but Allâh, and Allâh is the Most Great.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And why did you, when you entered your garden, not say, 'What Allāh willed [has occurred]; there is no power except in Allāh'? Although you see me less than you in wealth and children,",
            "english_hilali_khan": "\"It was better for you to say, when you entered your garden: ‘That which Allâh wills (will come to pass)! There is no power but with Allâh[1]!’ If you see me less than you in wealth, and children,",
            "english_rwwad": "If only you had said, when you entered your garden, ‘This is by Allah’s Will; there is no power except with Allah.’ Even though you see me inferior to you in wealth and children,"
        }
    },
    {
        "id": 2179,
        "chapter": 18,
        "verse": 40,
        "arabic_text": "فَعَسَىٰ رَبِّيٓ أَن يُؤۡتِيَنِ خَيۡرٗا مِّن جَنَّتِكَ وَيُرۡسِلَ عَلَيۡهَا حُسۡبَانٗا مِّنَ ٱلسَّمَآءِ فَتُصۡبِحَ صَعِيدٗا زَلَقًا",
        "phonetic": "18.40 Fa`asá Rabbī 'An Yu'utiyanī Khayrāan Min Jannatika Wa Yursila `Alayhā Ĥusbānāan Mina As-Samā'i Fatuşbiĥa Şa`īdāan Zalaqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It may be that my Lord will give me [something] better than your garden and will send upon it a [disastrous] penalty from the sky, and it will become a smooth, dusty ground,",
            "english_hilali_khan": "\"It may be that my Lord will give me something better than your garden, and will send on it Husbân (torment, bolt) from the sky, then it will be a barren slippery earth.",
            "english_rwwad": "it may well be that my Lord will give me something better than your garden, and send upon your garden a thunderbolt from the heaven, turning it into a barren land."
        }
    },
    {
        "id": 2180,
        "chapter": 18,
        "verse": 41,
        "arabic_text": "أَوۡ يُصۡبِحَ مَآؤُهَا غَوۡرٗا فَلَن تَسۡتَطِيعَ لَهُۥ طَلَبٗا",
        "phonetic": "18.41 'Aw Yuşbiĥa Mā'uuhā Ghawrāan Falan Tastaţī`a Lahu Ţalabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or its water will become sunken [into the earth], so you would never be able to seek it.\"",
            "english_hilali_khan": "\"Or the water thereof (of the gardens) becomes deep-sunken (underground) so that you will never be able to seek it.\"",
            "english_rwwad": "Or its water may sink, so you will never be able to get it back.”"
        }
    },
    {
        "id": 2181,
        "chapter": 18,
        "verse": 42,
        "arabic_text": "وَأُحِيطَ بِثَمَرِهِۦ فَأَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَآ أَنفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَٰلَيۡتَنِي لَمۡ أُشۡرِكۡ بِرَبِّيٓ أَحَدٗا",
        "phonetic": "18.42 Wa 'Uĥīţa Bithamarihi Fa'aşbaĥa Yuqallibu Kaffayhi `Alá Mā 'Anfaqa Fīhā Wa Hiya Khāwiyatun `Alá `Urūshihā Wa Yaqūlu Yā Laytanī Lam 'Ushrik Birabbī 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "[789]- He attributed his prosperity to himself rather than to Allāh and disbelieved in the account of the Hereafter.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And his fruits were encompassed [by ruin], so he began to turn his hands about [in dismay] over what he had spent on it, while it had collapsed upon its trellises, and said, \"Oh, I wish I had not associated with my Lord anyone.\"[789]",
            "english_hilali_khan": "So his fruits were encircled (with ruin). And he remained clapping his hands (with sorrow) over what he had spent upon it, while it was all destroyed on its trellises, and he could only say: \"Would that I had ascribed no partners to my Lord!\" [Tafsir Ibn Kathîr]",
            "english_rwwad": "Eventually all his produce was destroyed and he started wringing his hands [in dismay] over what he had spent on it, as it had collapsed on its trellises, and he said, “Oh, would that I had not associated anyone with my Lord!”"
        }
    },
    {
        "id": 2182,
        "chapter": 18,
        "verse": 43,
        "arabic_text": "وَلَمۡ تَكُن لَّهُۥ فِئَةٞ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا",
        "phonetic": "18.43 Wa Lam Takun Lahu Fi'atun Yanşurūnahu Min Dūni Allāhi Wa Mā Kāna Muntaşirāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there was for him no company to aid him other than Allāh, nor could he defend himself.",
            "english_hilali_khan": "And he had no group of men to help him against Allâh, nor could he defend (or save) himself.",
            "english_rwwad": "He had none to support him against Allah, nor could he support himself."
        }
    },
    {
        "id": 2183,
        "chapter": 18,
        "verse": 44,
        "arabic_text": "هُنَالِكَ ٱلۡوَلَٰيَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَيۡرٞ ثَوَابٗا وَخَيۡرٌ عُقۡبٗا",
        "phonetic": "18.44 Hunālika Al-Walāyatu Lillāhi Al-Ĥaqqi Huwa Khayrun Thawābāan Wa Khayrun `Uqbāan",
        "footnotes": {
            "english_saheeh": "[790]- i.e., at such a time or on the Day of Judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There[790] the authority is [completely] for Allāh, the Truth. He is best in reward and best in outcome.",
            "english_hilali_khan": "There (on the Day of Resurrection), Al-Walâyah (protection, power, authority and kingdom) will be for Allâh (Alone), the True God. He (Allâh) is the Best for reward and the Best for the final end. (Lâ ilâha illallâh- none has the right to be worshipped but Allâh).",
            "english_rwwad": "In that situation, the authority only rests with Allah, the True God. He is best in reward and best in outcome."
        }
    },
    {
        "id": 2184,
        "chapter": 18,
        "verse": 45,
        "arabic_text": "وَٱضۡرِبۡ لَهُم مَّثَلَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ٱلسَّمَآءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ فَأَصۡبَحَ هَشِيمٗا تَذۡرُوهُ ٱلرِّيَٰحُۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ مُّقۡتَدِرًا",
        "phonetic": "18.45 Wa Ađrib Lahum Mathala Al-Ĥayāati Ad-Dunyā Kamā'in 'Anzalnāhu Mina As-Samā'i Fākhtalaţa Bihi Nabātu Al-'Arđi Fa'aşbaĥa Hashīmāan Tadhrūhu Ar-Riyāĥu Wa Kāna Allāhu `Alá Kulli Shay'in Muqtadirāan",
        "footnotes": {
            "english_saheeh": "[791]- Absorbs it, growing lush and thick.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And present to them the example of the life of this world, [its being] like rain which We send down from the sky, and the vegetation of the earth mingles with it[791] and [then] it becomes dry remnants, scattered by the winds. And Allāh is ever, over all things, Perfect in Ability.",
            "english_hilali_khan": "And put forward to them the example of the life of this world: it is like the water (rain) which We send down from the sky, and the vegetation of the earth mingles with it, and becomes fresh and green. But (later) it becomes dry and broken pieces, which the winds scatter. And Allâh is Able to do everything.",
            "english_rwwad": "Give them the example of the life of this world: it is like the plants of the earth, thriving when sustained by the rain We send down from the sky, but soon they turn into chaff scattered by the winds. Allah has full power over all things."
        }
    },
    {
        "id": 2185,
        "chapter": 18,
        "verse": 46,
        "arabic_text": "ٱلۡمَالُ وَٱلۡبَنُونَ زِينَةُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٌ أَمَلٗا",
        "phonetic": "18.46 Al-Mālu Wa Al-Banūna Zīnatu Al-Ĥayāati Ad-Dunyā Wa Al-Bāqiyātu Aş-Şāliĥātu Khayrun `Inda Rabbika Thawābāan Wa Khayrun 'Amalāan",
        "footnotes": {
            "english_saheeh": "[792]- i.e., in His sight or evaluation.",
            "english_hilali_khan": "(V.18:46): good righteous deeds:- five compulsory prayers, deeds of Allâh’s obedience, good and nice talk, remembrance of Allâh with glorification, praises and thanks.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord[792] for reward and better for [one's] hope.",
            "english_hilali_khan": "Wealth and children are the adornment of the life of this world. But the good righteous deeds,[1] that last, are better with your Lord for rewards and better in respect of hope.",
            "english_rwwad": "Wealth and children are the adornment of the life of this world, but the lasting righteous deeds are better with your Lord in reward and better in hope."
        }
    },
    {
        "id": 2186,
        "chapter": 18,
        "verse": 47,
        "arabic_text": "وَيَوۡمَ نُسَيِّرُ ٱلۡجِبَالَ وَتَرَى ٱلۡأَرۡضَ بَارِزَةٗ وَحَشَرۡنَٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ أَحَدٗا",
        "phonetic": "18.47 Wa Yawma Nusayyiru Al-Jibāla Wa Tará Al-'Arđa Bārizatan Wa Ĥasharnāhum Falam Nughādir Minhum 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "[793]- i.e., flattened and bare.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [warn of] the Day when We will remove the mountains and you will see the earth exposed,[793] and We will gather them and not leave behind from them anyone.",
            "english_hilali_khan": "And (remember) the Day We shall cause the mountains to pass away (like clouds of dust), and you will see the earth as a levelled plain, and we shall gather them all together so as to leave not one of them behind.",
            "english_rwwad": "And [beware of] the Day when We will move the mountains away, and you will see the earth laid bare; We will gather them all and not leave behind anyone of them."
        }
    },
    {
        "id": 2187,
        "chapter": 18,
        "verse": 48,
        "arabic_text": "وَعُرِضُواْ عَلَىٰ رَبِّكَ صَفّٗا لَّقَدۡ جِئۡتُمُونَا كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةِۭۚ بَلۡ زَعَمۡتُمۡ أَلَّن نَّجۡعَلَ لَكُم مَّوۡعِدٗا",
        "phonetic": "18.48 Wa `Uriđū `Alá Rabbika Şaffāan Laqad Ji'tumūnā Kamā Khalaqnākum 'Awwala Marratin Bal Za`amtum 'Allan Naj`ala Lakum Maw`idāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they will be presented before your Lord in rows, [and He will say], \"You have certainly come to Us just as We created you the first time. But you claimed that We would never make for you an appointment.\"",
            "english_hilali_khan": "And they will be set before your Lord in (lines as) rows, (and Allâh will say): \"Now indeed, you have come to Us as We created you the first time. Nay, but you thought that We had appointed no meeting for you (with Us).\"",
            "english_rwwad": "They will be presented before your Lord in rows, “Now you have come to Us as We created you the first time, although you claimed that We would never appoint a time for your return.”"
        }
    },
    {
        "id": 2188,
        "chapter": 18,
        "verse": 49,
        "arabic_text": "وَوُضِعَ ٱلۡكِتَٰبُ فَتَرَى ٱلۡمُجۡرِمِينَ مُشۡفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَٰوَيۡلَتَنَا مَالِ هَٰذَا ٱلۡكِتَٰبِ لَا يُغَادِرُ صَغِيرَةٗ وَلَا كَبِيرَةً إِلَّآ أَحۡصَىٰهَاۚ وَوَجَدُواْ مَا عَمِلُواْ حَاضِرٗاۗ وَلَا يَظۡلِمُ رَبُّكَ أَحَدٗا",
        "phonetic": "18.49 Wa Wuđi`a Al-Kitābu Fatará Al-Mujrimīna Mushfiqīna Mimmā Fīhi Wa Yaqūlūna Yā Waylatanā Māli Hādhā Al-Kitābi Lā Yughādiru Şaghīratan Wa Lā Kabīratan 'Illā 'Aĥşāhā Wa Wajadū Mā `Amilū Ĥāđirāan Wa Lā Yažlimu Rabbuka 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the record [of deeds] will be placed [open], and you will see the criminals fearful of that within it, and they will say, \"Oh, woe to us! What is this book that leaves nothing small or great except that it has enumerated it?\" And they will find what they did present [before them]. And your Lord does injustice to no one.",
            "english_hilali_khan": "And the Book (one’s Record) will be placed (in the right hand for a believer in the Oneness of Allâh, and in the left hand for a disbeliever in the Oneness of Allâh), and you will see the Mujrimûn (criminals, polytheists, sinners), fearful of that which is (recorded) therein. They will say: \"Woe to us! What sort of Book is this that leaves neither a small thing nor a big thing, but has recorded it with numbers!\" And they will find all that they did, placed before them, and your Lord treats no one with injustice.",
            "english_rwwad": "And the record [of deeds] will be placed before them, and you will see the wicked scared of what it contains. They will say, “Woe to us! What is this book that leaves nothing, small or big, except that it has recorded it?” They will find all what they did before them, and your Lord does not wrong anyone."
        }
    },
    {
        "id": 2189,
        "chapter": 18,
        "verse": 50,
        "arabic_text": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦٓۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّيَّتَهُۥٓ أَوۡلِيَآءَ مِن دُونِي وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّٰلِمِينَ بَدَلٗا",
        "phonetic": "18.50 Wa 'Idh Qulnā Lilmalā'ikati Asjudū Li'dama Fasajadū 'Illā 'Iblīsa Kāna Mina Al-Jinni Fafasaqa `An 'Amri Rabbihi 'Afatattakhidhūnahu Wa Dhurrīyatahu 'Awliyā'a Min Dūnī Wa Hum Lakum `Adūwun Bi'sa Lilžžālimīna Badalāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He was of the jinn and departed from [i.e., disobeyed] the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange.",
            "english_hilali_khan": "And (remember) when We said to the angels: \"Prostrate yourselves unto Adam.\" So they prostrated themselves except Iblîs (Satan). He was one of the jinn; he disobeyed the Command of his Lord. Will you then take him (Iblîs) and his offspring as protectors and helpers rather than Me while they are enemies to you? What an evil is the exchange for the Zâlimûn (polytheists, and wrong-doers).",
            "english_rwwad": "And [remember] when We said to the angels, “Prostrate before Adam,” so they all prostrated except Iblīs, who was one of the jinn, but he disobeyed the command of his Lord. Will you then take him and his progeny as protectors instead of Me, even though they are your enemies? What a terrible exchange for the wrongdoers!"
        }
    },
    {
        "id": 2190,
        "chapter": 18,
        "verse": 51,
        "arabic_text": "۞ مَّآ أَشۡهَدتُّهُمۡ خَلۡقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَا خَلۡقَ أَنفُسِهِمۡ وَمَا كُنتُ مُتَّخِذَ ٱلۡمُضِلِّينَ عَضُدٗا",
        "phonetic": "18.51 Mā 'Ash/hadtuhum Khalqa As-Samāwāti Wa Al-'Arđi Wa Lā Khalqa 'Anfusihim Wa Mā Kuntu Muttakhidha Al-Muđillīna `Ađudāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I did not make them witness to the creation of the heavens and the earth or to the creation of themselves, and I would not have taken the misguiders as assistants.",
            "english_hilali_khan": "I (Allâh) made them (Iblîs and his offspring) not to witness (nor took their help in) the creation of the heavens and the earth and not (even) their own creation, nor was I (Allâh) to take the misleaders as helpers.",
            "english_rwwad": "I did not call them to witness the creation of the heavens and earth, nor even the creation of their own selves, and I would not take those who misguide others as helpers."
        }
    },
    {
        "id": 2191,
        "chapter": 18,
        "verse": 52,
        "arabic_text": "وَيَوۡمَ يَقُولُ نَادُواْ شُرَكَآءِيَ ٱلَّذِينَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ يَسۡتَجِيبُواْ لَهُمۡ وَجَعَلۡنَا بَيۡنَهُم مَّوۡبِقٗا",
        "phonetic": "18.52 Wa Yawma Yaqūlu Nādū Shurakā'iya Al-Ladhīna Za`amtum Fada`awhum Falam Yastajībū Lahum Wa Ja`alnā Baynahum Mawbiqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:52): In Arabic \"Maubiq\" also means enmity, or destruction, or a valley in Hell.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [warn of] the Day when He will say, \"Call My 'partners' whom you claimed,\" and they will invoke them, but they will not respond to them. And We will put between them [a valley of] destruction.",
            "english_hilali_khan": "And (remember) the Day He will say: \"Call those (so-called) partners of Mine whom you pretended.\" Then they will cry unto them, but they will not answer them, and We shall put a Maubiq (barrier)[2] between them.",
            "english_rwwad": "And [beware of] the Day when He will say, “Call upon those whom you claimed to be My partners.” So they will call them, but they will not respond to them, and We will make them share the same doom."
        }
    },
    {
        "id": 2192,
        "chapter": 18,
        "verse": 53,
        "arabic_text": "وَرَءَا ٱلۡمُجۡرِمُونَ ٱلنَّارَ فَظَنُّوٓاْ أَنَّهُم مُّوَاقِعُوهَا وَلَمۡ يَجِدُواْ عَنۡهَا مَصۡرِفٗا",
        "phonetic": "18.53 Wa Ra'á Al-Mujrimūna An-Nāra Fažannū 'Annahum Muwāqi`ūhā Wa Lam Yajidū `Anhā Maşrifāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the criminals will see the Fire and will be certain that they are to fall therein. And they will not find from it a way elsewhere.",
            "english_hilali_khan": "And the Mujrimûn (criminals, polytheists, sinners) shall see the Fire and apprehend that they have to fall therein. And they will find no way of escape from there.",
            "english_rwwad": "The wicked will see the Fire and realize that they are bound to fall into it, and they will find no escape from it."
        }
    },
    {
        "id": 2193,
        "chapter": 18,
        "verse": 54,
        "arabic_text": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا",
        "phonetic": "18.54 Wa Laqad Şarrafnā Fī Hādhā Al-Qur'āni Lilnnāsi Min Kulli Mathalin Wa Kāna Al-'Insānu 'Akthara Shay'in Jadalāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly diversified in this Qur’ān for the people from every [kind of] example; but man has ever been, most of anything, [prone to] dispute.",
            "english_hilali_khan": "And indeed We have put forth every kind of example in this Qur’ân, for mankind. But, man is ever more quarrelsome than anything.",
            "english_rwwad": "We have surely diversified in this Qur’an every kind of example for people, but man is the most quarrelsome of all beings."
        }
    },
    {
        "id": 2194,
        "chapter": 18,
        "verse": 55,
        "arabic_text": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا",
        "phonetic": "18.55 Wa Mā Mana`a An-Nāsa 'An Yu'uminū 'Idh Jā'ahumu Al-Hudá Wa Yastaghfirū Rabbahum 'Illā 'An Ta'tiyahum Sunnatu Al-'Awwalīna 'Aw Ya'tiyahumu Al-`Adhābu Qubulāan",
        "footnotes": {
            "english_saheeh": "[794]- Who denied the truth brought by Allāh's messengers.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And nothing has prevented the people from believing when guidance came to them and from asking forgiveness of their Lord except that there [must] befall them the [accustomed] precedent of the former peoples[794] or that the punishment should come [directly] before them.",
            "english_hilali_khan": "And nothing prevents men from believing, (now) when the guidance (the Qur’ân) has come to them, and from asking Forgiveness of their Lord, except that the ways of the ancients be repeated with them (i.e. their destruction decreed by Allâh), or the torment be brought to them face to face?",
            "english_rwwad": "Nothing prevents people from believing when guidance comes to them and from seeking forgiveness from their Lord except that the fate of the earlier nations should come to them, or that the punishment should come before their eyes."
        }
    },
    {
        "id": 2195,
        "chapter": 18,
        "verse": 56,
        "arabic_text": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا",
        "phonetic": "18.56 Wa Mā Nursilu Al-Mursalīna 'Illā Mubashirīna Wa Mundhirīna Wa Yujādilu Al-Ladhīna Kafarū Bil-Bāţili Liyudĥiđū Bihi Al-Ĥaqqa Wa Attakhadhū 'Āyātī Wa Mā 'Undhirū Huzūan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We send not the messengers except as bringers of good tidings and warners. And those who disbelieve dispute by [using] falsehood to [attempt to] invalidate thereby the truth and have taken My verses, and that of which they are warned, in ridicule.",
            "english_hilali_khan": "And We send not the Messengers except as givers of glad tidings and warners. But those who disbelieve, dispute with false argument, in order to refute the truth thereby. And they treat My Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), and that with which they are warned, as a jest and mockery!",
            "english_rwwad": "We do not send the messengers except as bearers of glad tidings and warners. But those who disbelieve seek to undermine the truth with false arguments, and they take My verses and warnings in ridicule."
        }
    },
    {
        "id": 2196,
        "chapter": 18,
        "verse": 57,
        "arabic_text": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا",
        "phonetic": "18.57 Wa Man 'Ažlamu Mimman Dhukkira Bi'āyāti Rabbihi Fa'a`rađa `Anhā Wa Nasiya Mā Qaddamat Yadāhu 'Innā Ja`alnā `Alá Qulūbihim 'Akinnatan 'An Yafqahūhu Wa Fī 'Ādhānihim Waqrāan Wa 'In Tad`uhum 'Ilá Al-Hudá Falan Yahtadū 'Idhāan 'Abadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And who is more unjust than one who is reminded of the verses of his Lord but turns away from them and forgets what his hands have put forth? Indeed, We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if you invite them to guidance - they will never be guided, then - ever.",
            "english_hilali_khan": "And who does more wrong than he who is reminded of the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of his Lord, but turns away from them, forgetting what (deeds) his hands have sent forth. Truly, We have set veils over their hearts lest they should understand this (the Qur’ân), and in their ears, deafness. And if you (O Muhammad صلى الله عليه وسلم) call them to guidance, even then they will never be guided.",
            "english_rwwad": "Who could be more wrong than one who is reminded of the verses of his Lord, but he turns away from them and forgets what his hands have sent forth? We have placed veils on their hearts so that they cannot understand it, and deafness in their ears. Even if you call them to guidance, they will never be guided."
        }
    },
    {
        "id": 2197,
        "chapter": 18,
        "verse": 58,
        "arabic_text": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا",
        "phonetic": "18.58 Wa Rabbuka Al-Ghafūru Dhū Ar-Raĥmati Law Yu'uākhidhuhum Bimā Kasabū La`ajjala Lahumu Al-`Adhāba Bal Lahum Maw`idun Lan Yajidū Min Dūnihi Maw'ilāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And your Lord is the Forgiving, the possessor of mercy. If He were to impose blame upon them for what they earned, He would have hastened for them the punishment. Rather, for them is an appointment from which they will never find an escape.",
            "english_hilali_khan": "And your Lord is Most Forgiving, Owner of Mercy. Were He to call them to account for what they have earned, then surely, He would have hastened their punishment. But they have their appointed time, beyond which they will find no escape.",
            "english_rwwad": "But your Lord is the All-Forgiving, Lord of Mercy. If He were to take them to task for what they did, He would have hastened their punishment. Yet there is an appointed time for them from which they will find no escape."
        }
    },
    {
        "id": 2198,
        "chapter": 18,
        "verse": 59,
        "arabic_text": "وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا",
        "phonetic": "18.59 Wa Tilka Al-Qurá 'Ahlaknāhum Lammā Žalamū Wa Ja`alnā Limahlikihim Maw`idāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those cities - We destroyed them when they wronged, and We made for their destruction an appointed time.",
            "english_hilali_khan": "And these towns (population, - ‘Âd, Thamûd) We destroyed them when they did wrong. And We appointed a fixed time for their destruction.",
            "english_rwwad": "Those are the towns We destroyed when they persisted in wrongdoing, and We set an appointed time for their destruction."
        }
    },
    {
        "id": 2199,
        "chapter": 18,
        "verse": 60,
        "arabic_text": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا",
        "phonetic": "18.60 Wa 'Idh Qāla Mūsá Lifatāhu Lā 'Abraĥu Ĥattá 'Ablugha Majma`a Al-Baĥrayni 'Aw 'Amđiya Ĥuqubāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:60) The Story of Mûsâ (Moses) and Khidr عليهما السلام Narrated Sa‘îd bin Jubair: I said to Ibn ‘Abbâs, \"Nauf Al-Bikâli claims that Mûsâ (Moses), the companion of Al-Khidr was not the Mûsâ (Moses) of the Children of Israel.\" Ibn ‘Abbâs said, \"The enemy of Allâh (Nauf) told a lie.\" Narrated Ubayy bin Ka‘b that he heard Allâh’s Messenger صلى الله عليه وسلم saying, \"Mûsâ (Moses) got up to deliver a speech before the Children of Israel and he was asked, ‘Who is the most learned person among the people?’ Mûsâ (Moses) replied, ‘I (am the most learned).’ Allâh admonished him for he did not ascribe knowledge to Allâh Alone.\nSo Allâh revealed to him: ‘At the junction of the two seas there is a slave of Ours who is more learned than you.’ Mûsâ (Moses) asked, ‘O my Lord, how can I meet him?’ Allâh said, Take a fish and put it in a basket and then proceed (set out and where you lose the fish, you will find him).’ So Mûsâ (Moses) (took a fish and put it in a basket and) set out, along with his boy-servant Yûsha‘ bin Nûn, till they reached a rock (on which) they both lay their heads and slept. The fish moved vigorously in the basket and got out of it and fell into the sea and there it took its way through the sea (straight) as in a tunnel. (V.18:61) Allâh stopped the current of water on both sides of the way created by the fish, and so that way was like a tunnel. When Mûsâ (Moses) got up, his companion forgot to tell him about the fish, and so they carried on their journey during the rest of the day and the whole night. The next morning Mûsâ (Moses) asked his boy-servant ‘Bring us our morning meal; truly, we have suffered much fatigue in this, our journey.’ (V.18:62)\nMûsâ (Moses) did not get tired till he had passed the place which Allâh had ordered him to seek after. His boy-servant then said to him, ‘Do you remember when we betook ourselves to the rock? I indeed forgot the fish; none but Satan made me forget to remember it. It took its course into the sea in a strange way.’ (V.18:63)\nThere was a tunnel for the fish and for Mûsâ (Moses) and his boy-servant there was astonishment. Mûsâ (Moses) said, ‘That is what we have been seeking’. So they went back retracing their footsteps. (V.18:64) They both returned, retracing their steps till they reached the rock. Behold! There they found a man covered with a garment. Mûsâ (Moses) greeted him. Al-Khidr said astonishingly. ‘Is there such a greeting in your land?’ Mûsâ (Moses) said, ‘I am Mûsâ (Moses).’ He said, ‘Are you the Mûsâ (Moses) of the Children of Israel?’ Mûsâ (Moses) said, ‘Yes’; and added, ‘I have come to you so that you may teach me something of that knowledge which you have been taught’.\nAl-Khidr said, ‘You will not be able to have patience with me.’ (V.18:67)\n‘O Mûsâ (Moses)! I have some of Allâh’s Knowledge which He has bestowed upon me but you do not know it; and you too, have some of Allâh’s Knowledge which He has bestowed upon you, but I do not know it.\" Mûsâ (Moses) said, ‘If Allâh wills, you will find me patient, and I will not disobey you in aught.’ (V.18:69).\nAl-Khidr said to him. ‘Then, if you follow me, ask me not about anything till I myself mention it to you.’ (V.18:70). After that both of them proceeded along the sea coast, till a ship passed by and they requested the crew to let them go on board. The crew recognized Al-Khidr and allowed them to get on board free of charge. When they got on board, suddenly Mûsâ (Moses) saw that Al-Khidr had pulled out one of the planks of the ship with an adze. Mûsâ (Moses) said to him, ‘These people gave us a free lift, yet you have scuttled their ship so as to drown its people! Verily, you have committed a thing ‘Imra’ (a Munkar - evil, bad, dreadful thing).’ (V.18:71)\nAl-Khidr said, ‘Did I not tell you, that you would not be able to have patience with me?’ (V.18:72)\nMûsâ (Moses) said, ‘Call me not to account for what I forgot and be not hard upon me for my affair (with you.)’ (V.18:73).\"\nAllâh’s Messenger صلى الله عليه وسلم said, \"The first excuse given by Mûsâ (Moses), was that he had forgotten. Then a sparrow came and sat over the edge of the ship and dipped its beak once in the sea. Al-Khidr said to Mûsâ (Moses), ‘My knowledge and your knowledge, compared to Allâh’s Knowledge is like what this sparrow has taken out of the sea.’ Then they both got out of the ship, and while they were walking on the sea shore, Al-Khidr saw a boy playing with other boys. Al-Khidr got hold of the head of that boy and pulled it out with his hands and killed him. Mûsâ (Moses) said, ‘Have you killed an innocent person who had killed none! Verily, you have committed a thing ‘Nukra’ (a great Munkar - prohibited, evil, dreadful thing)!’ (V.18:74) He said, ‘Did I not tell you that you would not be able to have patience with me?’ (V.18:75) (The subnarrator said, ‘The second blame was stronger than the first one). Mûsâ (Moses) said, ‘If I ask you anything after this, keep me not in your company; you have received an excuse from me.’ (V.18:76)\nThen they both proceeded until they came to the people of a town. They asked them for food but they refused to entertain them. (Then) they found there a wall on the point of falling down. (V.18:77) (Al-Khidr) set it up straight with his own hands. Mûsâ (Moses) said, ‘We came to these people, but they neither fed us nor received us as guests. If you had wished, you could surely have exacted some recompense for it.’ (Al-Khidr) said, ‘This is the parting between me and you, (please read V. 18:79, 80-82) that is the interpretation of those (things) over which you could not hold patience.’ (V.18:78-82).\"\nAllâh’s Messenger صلى الله عليه وسلم said, \"We wished Mûsâ (Moses) had more patience so that Allâh might have described to us more about their story.\" (Sahih Al-Bukhari, Vol.6, Hadith No.249).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when Moses said to his boy [i.e., servant], \"I will not cease [traveling] until I reach the junction of the two seas or continue for a long period.\"",
            "english_hilali_khan": "And (remember) when Mûsâ (Moses) said to his boy-servant: \"I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling.\"[1]",
            "english_rwwad": "And [remember] when Moses said to his servant, “I will not give up until I reach the junction of the two seas, or I travel for ages.”"
        }
    },
    {
        "id": 2200,
        "chapter": 18,
        "verse": 61,
        "arabic_text": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا",
        "phonetic": "18.61 Falammā Balaghā Majma`a Baynihimā Nasiyā Ĥūtahumā Fa Attakhadha Sabīlahu Fī Al-Baĥri Sarabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when they reached the junction between them, they forgot their fish, and it took its course into the sea, slipping away.",
            "english_hilali_khan": "But when they reached the junction of the two seas, they forgot their fish, and it took its way through the sea as in a tunnel.",
            "english_rwwad": "But when they reached the junction of the two seas, they forgot their fish, which made its way into the sea, slipping away."
        }
    },
    {
        "id": 2201,
        "chapter": 18,
        "verse": 62,
        "arabic_text": "فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا لَقَدۡ لَقِينَا مِن سَفَرِنَا هَٰذَا نَصَبٗا",
        "phonetic": "18.62 Falammā Jāwazā Qāla Lifatāhu 'Ātinā Ghadā'anā Laqad Laqīnā Min Safarinā Hādhā Naşabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when they had passed beyond it, [Moses] said to his boy, \"Bring us our morning meal. We have certainly suffered in this, our journey, [much] fatigue.\"",
            "english_hilali_khan": "So when they had passed further on (beyond that fixed place), Mûsâ (Moses) said to his boy-servant: \"Bring us our morning meal; truly, we have suffered much fatigue in this, our journey.\"",
            "english_rwwad": "When they traveled further, he said to his servant, “Bring us our morning meal; this journey has truly exhausted us.”"
        }
    },
    {
        "id": 2202,
        "chapter": 18,
        "verse": 63,
        "arabic_text": "قَالَ أَرَءَيۡتَ إِذۡ أَوَيۡنَآ إِلَى ٱلصَّخۡرَةِ فَإِنِّي نَسِيتُ ٱلۡحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيۡطَٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ عَجَبٗا",
        "phonetic": "18.63 Qāla 'Ara'ayta 'Idh 'Awaynā 'Ilá Aş-Şakhrati Fa'innī Nasītu Al-Ĥūta Wa Mā 'Ansānīhu 'Illā Ash-Shayţānu 'An 'Adhkurahu Wa Attakhadha Sabīlahu Fī Al-Baĥri `Ajabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Did you see when we retired to the rock? Indeed, I forgot [there] the fish. And none made me forget it except Satan - that I should mention it. And it took its course into the sea amazingly.\"",
            "english_hilali_khan": "He said: \"Do you remember when we betook ourselves to the rock? I indeed forgot the fish; none but Shaitân (Satan) made me forget to remember it. It took its course into the sea in a strange (way)!\"",
            "english_rwwad": "He said, “You remember when we rested by the rock, I forgot the fish; it was none who made me forget to mention it except Satan, and it made its way into the sea amazingly.”"
        }
    },
    {
        "id": 2203,
        "chapter": 18,
        "verse": 64,
        "arabic_text": "قَالَ ذَٰلِكَ مَا كُنَّا نَبۡغِۚ فَٱرۡتَدَّا عَلَىٰٓ ءَاثَارِهِمَا قَصَصٗا",
        "phonetic": "18.64 Qāla Dhālika Mā Kunnā Nabghi Fārtaddā `Alá 'Āthārihimā Qaşaşāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"That is what we were seeking.\" So they returned, following their footprints.",
            "english_hilali_khan": "[Mûsâ (Moses)] said: \"That is what we have been seeking.\" So they went back retracing their footsteps.",
            "english_rwwad": "Moses said, “That is exactly what we were looking for.” So they turned back, retracing their footsteps."
        }
    },
    {
        "id": 2204,
        "chapter": 18,
        "verse": 65,
        "arabic_text": "فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا",
        "phonetic": "18.65 Fawajadā `Abdāan Min `Ibādinā 'Ātaynāhu Raĥmatan Min `Indinā Wa `Allamnāhu Min Ladunnā `Ilmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they found a servant from among Our servants [i.e., al-Khiḍr] to whom We had given mercy from Us and had taught him from Us a [certain] knowledge.",
            "english_hilali_khan": "Then they found one of Our slaves, on whom We had bestowed mercy from Us, and whom We had taught knowledge from Us.",
            "english_rwwad": "There they found one of Our slaves upon whom We bestowed Our mercy and We taught him from Our Own knowledge."
        }
    },
    {
        "id": 2205,
        "chapter": 18,
        "verse": 66,
        "arabic_text": "قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدٗا",
        "phonetic": "18.66 Qāla Lahu Mūsá Hal 'Attabi`uka `Alá 'An Tu`allimani Mimmā `Ullimta Rushdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Moses said to him, \"May I follow you on [the condition] that you teach me from what you have been taught of sound judgement?\"",
            "english_hilali_khan": "Mûsâ (Moses) said to him (Khidr): \"May I follow you so that you teach me something of that knowledge (guidance and true path) which you have been taught (by Allâh)?\"",
            "english_rwwad": "Moses said to him, “May I follow you so that you may teach me some knowledge that you have been taught?”"
        }
    },
    {
        "id": 2206,
        "chapter": 18,
        "verse": 67,
        "arabic_text": "قَالَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا",
        "phonetic": "18.67 Qāla 'Innaka Lan Tastaţī`a Ma`iya Şabrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Indeed, with me you will never be able to have patience.",
            "english_hilali_khan": "He (Khidr) said: \"Verily you will not be able to have patience with me!",
            "english_rwwad": "He said, “You will never be able to have patience with me.”"
        }
    },
    {
        "id": 2207,
        "chapter": 18,
        "verse": 68,
        "arabic_text": "وَكَيۡفَ تَصۡبِرُ عَلَىٰ مَا لَمۡ تُحِطۡ بِهِۦ خُبۡرٗا",
        "phonetic": "18.68 Wa Kayfa Taşbiru `Alá Mā Lam Tuĥiţ Bihi Khubrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how can you have patience for what you do not encompass in knowledge?\"",
            "english_hilali_khan": "\"And how can you have patience about a thing which you know not?\"",
            "english_rwwad": "How can you have patience with that which you have no knowledge about?”"
        }
    },
    {
        "id": 2208,
        "chapter": 18,
        "verse": 69,
        "arabic_text": "قَالَ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ صَابِرٗا وَلَآ أَعۡصِي لَكَ أَمۡرٗا",
        "phonetic": "18.69 Qāla Satajidunī 'In Shā'a Allāhu Şābirāan Wa Lā 'A`şī Laka 'Amrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"You will find me, if Allāh wills, patient, and I will not disobey you in [any] order.\"",
            "english_hilali_khan": "Mûsâ (Moses) said: \"If Allâh wills, you will find me patient, and I will not disobey you in aught.\"",
            "english_rwwad": "Moses said, “You will find me patient, if Allah wills; and I will not disobey any of your orders.”"
        }
    },
    {
        "id": 2209,
        "chapter": 18,
        "verse": 70,
        "arabic_text": "قَالَ فَإِنِ ٱتَّبَعۡتَنِي فَلَا تَسۡـَٔلۡنِي عَن شَيۡءٍ حَتَّىٰٓ أُحۡدِثَ لَكَ مِنۡهُ ذِكۡرٗا",
        "phonetic": "18.70 Qāla Fa'ini Attaba`tanī Falā Tas'alnī `An Shay'in Ĥattá 'Uĥditha Laka Minhu Dhikrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Then if you follow me, do not ask me about anything until I make to you about it mention [i.e., explanation].\"",
            "english_hilali_khan": "He (Khidr) said: \"Then, if you follow me, ask me not about anything till I myself mention of it to you.\"",
            "english_rwwad": "He said, “Then if you follow me, do not ask me about anything until I mention it to you.”"
        }
    },
    {
        "id": 2210,
        "chapter": 18,
        "verse": 71,
        "arabic_text": "فَٱنطَلَقَا حَتَّىٰٓ إِذَا رَكِبَا فِي ٱلسَّفِينَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَيۡـًٔا إِمۡرٗا",
        "phonetic": "18.71 Fānţalaqā Ĥattá 'Idhā Rakibā Fī As-Safīnati Kharaqahā Qāla 'Akharaqtahā Litughriqa 'Ahlahā Laqad Ji'ta Shay'āan 'Imrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they set out, until when they had embarked on the ship, he [i.e., al-Khiḍr] tore it open. [Moses] said, \"Have you torn it open to drown its people? You have certainly done a grave thing.\"",
            "english_hilali_khan": "So they both proceeded, till, when they embarked the ship, he (Khidr) scuttled it. Mûsâ (Moses) said: \"Have you scuttled it in order to drown its people? Verily, you have committed a thing \"Imr\" (a Munkar - evil, bad, dreadful thing).\"",
            "english_rwwad": "So they both set out, until when they boarded a ship, he made a hole in it. Moses said, “Did you make a hole in it to drown its people? You have done something terrible!”"
        }
    },
    {
        "id": 2211,
        "chapter": 18,
        "verse": 72,
        "arabic_text": "قَالَ أَلَمۡ أَقُلۡ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا",
        "phonetic": "18.72 Qāla 'Alam 'Aqul 'Innaka Lan Tastaţī`a Ma`iya Şabrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Al-Khiḍr] said, \"Did I not say that with me you would never be able to have patience?\"",
            "english_hilali_khan": "He (Khidr) said: \"Did I not tell you, that you would not be able to have patience with me?\"",
            "english_rwwad": "He said, “Did I not tell you that you will never be able to have patience with me?”"
        }
    },
    {
        "id": 2212,
        "chapter": 18,
        "verse": 73,
        "arabic_text": "قَالَ لَا تُؤَاخِذۡنِي بِمَا نَسِيتُ وَلَا تُرۡهِقۡنِي مِنۡ أَمۡرِي عُسۡرٗا",
        "phonetic": "18.73 Qāla Lā Tu'uākhidhnī Bimā Nasītu Wa Lā Turhiqnī Min 'Amrī `Usrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:73)\na) If someone does something against his oath due to forgetfulness (should he make expiation?). And the Statement of Allâh:\n\"And there is no sin on you, concerning that in which you made a mistake.\" (V.33:5)\nAnd Allâh said:\n\"[Mûsâ (Moses) said to Khidr]: Call me not to account for what I forgot.\" (V.18:73)\nNarrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Allâh forgives my followers those (evil deeds) their ownselves may whisper or suggest to them as long as they do not act (on it) or speak.\" (Sahih Al-Bukhari, Vol. 8, Hadith No.657)\nb) Narrated Abu Hurairah رضي الله عنه: The Prophetصلى الله عليه وسلم said, \"If somebody eats something forgetfully while he is fasting, then he should complete his fast, for Allâh has made him eat and drink.\" (Sahih Al-Bukhari, Vol. 8, Hadith No.662).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"Do not blame me for what I forgot and do not overwhelm me in my matter with difficulty.\"",
            "english_hilali_khan": "[Mûsâ (Moses)] said: \"Call me not to account for what I forgot,[1] and be not hard upon me for my affair (with you).\"",
            "english_rwwad": "Moses said, “Do not take me to task for what I forgot, and do not make it too difficult for me to follow you.”"
        }
    },
    {
        "id": 2213,
        "chapter": 18,
        "verse": 74,
        "arabic_text": "فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلَٰمٗا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسٗا زَكِيَّةَۢ بِغَيۡرِ نَفۡسٖ لَّقَدۡ جِئۡتَ شَيۡـٔٗا نُّكۡرٗا",
        "phonetic": "18.74 Fānţalaqā Ĥattá 'Idhā Laqiyā Ghulāmāan Faqatalahu Qāla 'Aqatalta Nafsāan Zakīyatan Bighayri Nafsin Laqad Ji'ta Shay'āan Nukrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they set out, until when they met a boy, he [i.e., al-Khiḍr] killed him. [Moses] said, \"Have you killed a pure soul for other than [having killed] a soul? You have certainly done a deplorable thing.\"",
            "english_hilali_khan": "Then they both proceeded, till they met a boy, and he (Khidr) killed him. Mûsâ (Moses) said: \"Have you killed an innocent person who had killed none? Verily, you have committed a thing Nukr (a great Munkar - prohibited, evil, dreadful thing)!\"",
            "english_rwwad": "Then they proceeded until they met a boy, and the man killed him. Moses said, “Did you kill an innocent soul who killed none? You have done something monstrous!”"
        }
    },
    {
        "id": 2214,
        "chapter": 18,
        "verse": 75,
        "arabic_text": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا",
        "phonetic": "18.75 Qāla 'Alam 'Aqul Laka 'Innaka Lan Tastaţī`a Ma`iya Şabrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Al-Khiḍr] said, \"Did I not tell you that with me you would never be able to have patience?\"",
            "english_hilali_khan": "(Khidr) said: \"Did I not tell you that you can have no patience with me?\"",
            "english_rwwad": "The man said, “Did I not tell you that you will never be able to have patience with me?”"
        }
    },
    {
        "id": 2215,
        "chapter": 18,
        "verse": 76,
        "arabic_text": "قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۭ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا",
        "phonetic": "18.76 Qāla 'In Sa'altuka `An Shay'in Ba`dahā Falā Tuşāĥibnī Qad Balaghta Min Ladunnī `Udhrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"If I should ask you about anything after this, then do not keep me as a companion. You have obtained from me an excuse.\"",
            "english_hilali_khan": "[Mûsâ (Moses)] said: \"If I ask you anything after this, keep me not in your company, you have received an excuse from me.\"",
            "english_rwwad": "Moses said, “If I ask you about anything after this, do not keep me in your company, for then you would be excused concerning me.”"
        }
    },
    {
        "id": 2216,
        "chapter": 18,
        "verse": 77,
        "arabic_text": "فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا",
        "phonetic": "18.77 Fānţalaqā Ĥattá 'Idhā 'Atayā 'Ahla Qaryatin Astaţ`amā 'Ahlahā Fa'abaw 'An Yuđayyifūhumā Fawajadā Fīhā Jidārāan Yurīdu 'An Yanqađđa Fa'aqāmahu Qāla Law Shi'ta Lāttakhadhta `Alayhi 'Ajrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they set out, until when they came to the people of a town, they asked its people for food, but they refused to offer them hospitality. And they found therein a wall about to collapse, so he [i.e., al-Khiḍr] restored it. [Moses] said, \"If you wished, you could have taken for it a payment.\"",
            "english_hilali_khan": "Then they both proceeded, till, when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found therein a wall about to collapse and he (Khidr) set it up straight. [Mûsâ (Moses)] said: If you had wished, surely, you could have taken wages for it!\"",
            "english_rwwad": "Then they went on until they came to the people of a town. They asked its people for food, but they refused to offer them hospitality. They found there a wall that was about to collapse, but he repaired it. Moses said, “If you wished, you could have taken some payment for it.”"
        }
    },
    {
        "id": 2217,
        "chapter": 18,
        "verse": 78,
        "arabic_text": "قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا",
        "phonetic": "18.78 Qāla Hādhā Firāqu Baynī Wa Baynika Sa'unabbi'uka Bita'wīli Mā Lam Tastaţi` `Alayhi Şabrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Al-Khiḍr] said, \"This is parting between me and you. I will inform you of the interpretation of that about which you could not have patience.",
            "english_hilali_khan": "(Khidr) said: \"This is the parting between me and you, I will tell you the interpretation of (those) things over which you were unable to hold patience.",
            "english_rwwad": "The man said, “This is the parting of ways between me and you. I will inform you of the interpretation of that which you could not bear with patience."
        }
    },
    {
        "id": 2218,
        "chapter": 18,
        "verse": 79,
        "arabic_text": "أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا",
        "phonetic": "18.79 'Ammā As-Safīnatu Fakānat Limasākīna Ya`malūna Fī Al-Baĥri Fa'aradtu 'An 'A`ībahā Wa Kāna Warā'ahum Malikun Ya'khudhu Kulla Safīnatin Ghaşbāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "As for the ship, it belonged to poor people working at sea. So I intended to cause defect in it as there was after them a king who seized every [good] ship by force.",
            "english_hilali_khan": "\"As for the ship, it belonged to Masâkîn (poor people) working in the sea. So I wished to make a defective damage in it, as there was a king behind them who seized every ship by force.",
            "english_rwwad": "“As for the ship, it belonged to some poor people who worked at the sea. I wanted to make it defective because there was a king ahead of them who seized every [good] ship by force."
        }
    },
    {
        "id": 2219,
        "chapter": 18,
        "verse": 80,
        "arabic_text": "وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا",
        "phonetic": "18.80 Wa 'Ammā Al-Ghulāmu Fakāna 'Abawāhu Mu'uminayni Fakhashīnā 'An Yurhiqahumā Ţughyānāan Wa Kufrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And as for the boy, his parents were believers, and we feared that he would overburden them by transgression and disbelief.",
            "english_hilali_khan": "\"And as for the boy, his parents were believers, and we feared lest he should oppress them by rebellion and disbelief.",
            "english_rwwad": "“As for the boy, his parents were believers, and we feared that he would overburden them with his rebellion and disbelief."
        }
    },
    {
        "id": 2220,
        "chapter": 18,
        "verse": 81,
        "arabic_text": "فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا",
        "phonetic": "18.81 Fa'aradnā 'An Yubdilahumā Rabbuhumā Khayrāan Minhu Zakāatan Wa 'Aqraba Ruĥmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So we intended that their Lord should substitute for them one better than him in purity and nearer to mercy.",
            "english_hilali_khan": "\"So we intended that their Lord should change him for them for one better in righteousness and nearer to mercy.",
            "english_rwwad": "So we hoped that their Lord would give them another in his place, more righteous and tender-hearted."
        }
    },
    {
        "id": 2221,
        "chapter": 18,
        "verse": 82,
        "arabic_text": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا",
        "phonetic": "18.82 Wa 'Ammā Al-Jidāru Fakāna Lighulāmayni Yatīmayni Fī Al-Madīnati Wa Kāna Taĥtahu Kanzun Lahumā Wa Kāna 'Abūhumā Şāliĥāan Fa'arāda Rabbuka 'An Yablughā 'Ashuddahumā Wa Yastakhrijā Kanzahumā Raĥmatan Min Rabbika Wa Mā Fa`altuhu `An 'Amrī Dhālika Ta'wīlu Mā Lam Tasţi` `Alayhi Şabrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure for them, and their father had been righteous. So your Lord intended that they reach maturity and extract their treasure, as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of that about which you could not have patience.\"",
            "english_hilali_khan": "\"And as for the wall, it belonged to two orphan boys in the town; and there was under it a treasure belonging to them; and their father was a righteous man, and your Lord intended that they should attain their age of full strength and take out their treasure as a mercy from your Lord. And I did them not of my own accord. That is the interpretation of those (things) over which you could not hold patience.\"",
            "english_rwwad": "As for the wall, it belonged to two orphan boys in the city, and there was a treasure under it that belonged to them. Their father was a righteous man, so your Lord willed that they should reach their maturity and retrieve their treasure, as a mercy from your Lord; I did not do it of my own accord. This is the interpretation of that which you could not bear with patience.”"
        }
    },
    {
        "id": 2222,
        "chapter": 18,
        "verse": 83,
        "arabic_text": "وَيَسۡـَٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا",
        "phonetic": "18.83 Wa Yas'alūnaka `An Dhī Al-Qarnayni Qul Sa'atlū `Alaykum Minhu Dhikrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they ask you, [O Muḥammad], about Dhul-Qarnayn. Say, \"I will recite to you about him a report.\"",
            "english_hilali_khan": "And they ask you about Dhul-Qarnain. Say: \"I shall recite to you something of his story.\"",
            "english_rwwad": "They ask you about Dhul-Qarnayn. Say, “I will tell you something about him.”"
        }
    },
    {
        "id": 2223,
        "chapter": 18,
        "verse": 84,
        "arabic_text": "إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا",
        "phonetic": "18.84 'Innā Makkannā Lahu Fī Al-'Arđi Wa 'Ātaynāhu Min Kulli Shay'in Sababāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, We established him upon the earth, and We gave him from everything a way [i.e., means].",
            "english_hilali_khan": "Verily, We established him in the earth, and We gave him the means of everything.",
            "english_rwwad": "We established him on earth and gave him the means to achieve everything."
        }
    },
    {
        "id": 2224,
        "chapter": 18,
        "verse": 85,
        "arabic_text": "فَأَتۡبَعَ سَبَبًا",
        "phonetic": "18.85 Fa'atba`a Sababāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he followed a way",
            "english_hilali_khan": "So he followed a way.",
            "english_rwwad": "He pursued a course,"
        }
    },
    {
        "id": 2225,
        "chapter": 18,
        "verse": 86,
        "arabic_text": "حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا",
        "phonetic": "18.86 Ĥattá 'Idhā Balagha Maghriba Ash-Shamsi Wajadahā Taghrubu Fī `Aynin Ĥami'atin Wa Wajada `Indahā Qawmāan Qulnā Yā Dhā Al-Qarnayni 'Immā 'An Tu`adhiba Wa 'Immā 'An Tattakhidha Fīhim Ĥusnāan",
        "footnotes": {
            "english_saheeh": "[795]- Another meaning is \"a body of hot water.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Until, when he reached the setting of the sun [i.e., the west], he found it [as if] setting in a body of dark water,[795] and he found near it a people. We [i.e., Allāh] said, \"O Dhul-Qarnayn, either you punish [them] or else adopt among them [a way of] goodness.\"",
            "english_hilali_khan": "Until, when he reached the setting place of the sun, he found it setting in a spring of black muddy (or hot) water. And he found near it a people. We (Allâh) said (by inspiration): \"O Dhul-Qarnain! Either you punish them, or treat them with kindness.\"",
            "english_rwwad": "until when he reached the far west, he found the sun setting into a dark water, and he found some people nearby. We said, “O Dhul-Qarnayn, either punish them or treat them with kindness.”"
        }
    },
    {
        "id": 2226,
        "chapter": 18,
        "verse": 87,
        "arabic_text": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا",
        "phonetic": "18.87 Qāla 'Ammā Man Žalama Fasawfa Nu`adhibuhu Thumma Yuraddu 'Ilá Rabbihi Fayu`adhibuhu `Adhābāan Nukrāan",
        "footnotes": {
            "english_saheeh": "[796]- Persists in disbelief and rebellion.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"As for one who wrongs,[796] we will punish him. Then he will be returned to his Lord, and He will punish him with a terrible punishment [i.e., Hellfire].",
            "english_hilali_khan": "He said: \"As for him (a disbeliever in the Oneness of Allâh) who does wrong, we shall punish him, and then he will be brought back unto his Lord, Who will punish him with a terrible torment (Hell).",
            "english_rwwad": "He said, “As for one who does wrong, we will punish him, then he will be brought back to his Lord, and He will punish him grievously."
        }
    },
    {
        "id": 2227,
        "chapter": 18,
        "verse": 88,
        "arabic_text": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا",
        "phonetic": "18.88 Wa 'Ammā Man 'Āmana Wa `Amila Şāliĥāan Falahu Jazā'an Al-Ĥusná Wa Sanaqūlu Lahu Min 'Amrinā Yusrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for one who believes and does righteousness, he will have a reward of the best [i.e., Paradise], and we [i.e., Dhul-Qarnayn] will speak to him from our command with ease.\"",
            "english_hilali_khan": "\"But as for him who believes (in Allâh’s Oneness) and works righteousness, he shall have the best reward, (Paradise), and we (Dhul-Qarnain) shall speak unto him mild words (as instructions).\"",
            "english_rwwad": "But he who believes and does righteous deeds, he will have the best reward, and we will enjoin upon him to do what is easy.”"
        }
    },
    {
        "id": 2228,
        "chapter": 18,
        "verse": 89,
        "arabic_text": "ثُمَّ أَتۡبَعَ سَبَبًا",
        "phonetic": "18.89 Thumma 'Atba`a Sababāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then he followed a way",
            "english_hilali_khan": "Then he followed another way,",
            "english_rwwad": "Then he pursued another course,"
        }
    },
    {
        "id": 2229,
        "chapter": 18,
        "verse": 90,
        "arabic_text": "حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا",
        "phonetic": "18.90 Ĥattá 'Idhā Balagha Maţli`a Ash-Shamsi Wajadahā Taţlu`u `Alá Qawmin Lam Naj`al Lahum Min Dūnihā Sitrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Until, when he came to the rising of the sun [i.e., the east], he found it rising on a people for whom We had not made against it any shield.",
            "english_hilali_khan": "Until, when he came to the rising place of the sun, he found it rising on a people for whom We (Allâh) had provided no shelter against the sun.",
            "english_rwwad": "until when he reached the far east, he found the sun rising on a people for whom We provided no shelter from it."
        }
    },
    {
        "id": 2230,
        "chapter": 18,
        "verse": 91,
        "arabic_text": "كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا",
        "phonetic": "18.91 Kadhālika Wa Qad 'Aĥaţnā Bimā Ladayhi Khubrāan",
        "footnotes": {
            "english_saheeh": "[797]- Such was the affair of Dhul-Qarnayn.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Thus.[797] And We had encompassed [all] that he had in knowledge.",
            "english_hilali_khan": "So (it was)! And We knew all about him (Dhul-Qarnain).",
            "english_rwwad": "So it was, and We had full knowledge about him."
        }
    },
    {
        "id": 2231,
        "chapter": 18,
        "verse": 92,
        "arabic_text": "ثُمَّ أَتۡبَعَ سَبَبًا",
        "phonetic": "18.92 Thumma 'Atba`a Sababāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then he followed a way.",
            "english_hilali_khan": "Then he followed (another) way,",
            "english_rwwad": "Then he pursued another course,"
        }
    },
    {
        "id": 2232,
        "chapter": 18,
        "verse": 93,
        "arabic_text": "حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا",
        "phonetic": "18.93 Ĥattá 'Idhā Balagha Bayna As-Saddayni Wajada Min Dūnihimā Qawmāan Lā Yakādūna Yafqahūna Qawlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Until, when he reached [a pass] between two mountains, he found beside them a people who could hardly understand [his] speech.",
            "english_hilali_khan": "Until, when he reached between two mountains, he found, before (near) them (those two mountains), a people who scarcely understood a word.",
            "english_rwwad": "until when he reached [a valley] between the two mountains, he found beyond them a people who could barely understand a word."
        }
    },
    {
        "id": 2233,
        "chapter": 18,
        "verse": 94,
        "arabic_text": "قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا",
        "phonetic": "18.94 Qālū Yā Dhā Al-Qarnayni 'Inna Ya'jūja Wa Ma'jūja Mufsidūna Fī Al-'Arđi Fahal Naj`alu Laka Kharjāan `Alá 'An Taj`ala Baynanā Wa Baynahum Saddāan",
        "footnotes": {
            "english_saheeh": "[798]- Savage tribes who had ravaged large parts of central Asia, committing every kind of atrocity.",
            "english_hilali_khan": "(V.18:94) Ya’jûj and Ma’jûj [Gog and Magog (people)]: To know about them in detail - please see Tafsir Al-Qurtubi, Vol. II, Pages 55-58.\nNarrated Zainab bint Jahsh that one day Allâh’s Messenger صلى الله عليه وسلم entered upon her in a state of fear and said, \" Lâ ilâha illallâh (none has the right to be worshipped but Allâh)! Woe to the Arabs from the great evil that has approached (them). Today a hole has been opened in the dam of Ya’jûj and Ma’jûj (Gog and Magog) like this.\" The Prophet صلى الله عليه وسلم made a circle with his index finger and thumb. Zainab bint Jahsh added: I said, \"O Allâh’s Messenger!, Shall we be destroyed though there will be righteous people among us?\" The Prophet صلى الله عليه وسلم said: \"Yes if Al-Khabath * (evil persons) increased.\" (Sahih Al-Bukhari, Vol.9, Hadith No.249).\n*The word Al-Khabath is interpreted as illegal sexual intercourse and illegitimate children and every kind of evil deed. (See Fath Al-Bari, Vol. 16, Page 225).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"O Dhul-Qarnayn, indeed Gog and Magog[798] are [great] corrupters in the land. So may we assign for you an expenditure that you might make between us and them a barrier?\"",
            "english_hilali_khan": "They said: \"O Dhul-Qarnain! Verily Ya’jûj and Ma’jûj (Gog and Magog)[1] are doing great mischief in the land. Shall we then pay you a tribute in order that you might erect a barrier between us and them?\"",
            "english_rwwad": "They said, “O Dhul-Qarnayn, Gog and Magog are spreading corruption in the land. Can we give you some payment in return for you to construct a barrier between us and them?”"
        }
    },
    {
        "id": 2234,
        "chapter": 18,
        "verse": 95,
        "arabic_text": "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا",
        "phonetic": "18.95 Qāla Mā Makkananī Fīhi Rabbī Khayrun Fa'a`īnūnī Biqūwatin 'Aj`al Baynakum Wa Baynahum Radmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"That in which my Lord has established me is better [than what you offer], but assist me with strength [i.e., manpower]; I will make between you and them a dam.",
            "english_hilali_khan": "He said: \"That (wealth, authority and power) in which my Lord had established me is better (than your tribute). So help me with strength (of men), I will erect between you and them a barrier.",
            "english_rwwad": "He said, “What my Lord has given me is better. But help me with manpower, I will construct a barricade between you and them."
        }
    },
    {
        "id": 2235,
        "chapter": 18,
        "verse": 96,
        "arabic_text": "ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا",
        "phonetic": "18.96 'Ātūnī Zubara Al-Ĥadīdi Ĥattá 'Idhā Sāwá Bayna Aş-Şadafayni Qāla Anfukhū Ĥattá 'Idhā Ja`alahu Nārāan Qāla 'Ātūnī 'Ufrigh `Alayhi Qiţrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Bring me bars of iron\" - until, when he had leveled [them] between the two mountain walls, he said, \"Blow [with bellows],\" until when he had made it [like] fire, he said, \"Bring me, that I may pour over it molten copper.\"",
            "english_hilali_khan": "\"Give me pieces (blocks) of iron;\" then, when he had filled up the gap between the two mountain-cliffs, he said: \"Blow;\" then when he had made them (red as) fire, he said: \"Bring me molten copper to pour over them.\"",
            "english_rwwad": "Bring me iron blocks” – until when he leveled between the two mountain-sides, he said, “Blow [with bellows],” until when he fired them up to extreme heat, he said, “Bring me molten copper to pour over it.”"
        }
    },
    {
        "id": 2236,
        "chapter": 18,
        "verse": 97,
        "arabic_text": "فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا",
        "phonetic": "18.97 Famā Asţā`ū 'An Yažharūhu Wa Mā Astaţā`ū Lahu Naqbāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they [i.e., Gog and Magog] were unable to pass over it, nor were they able [to effect] in it any penetration.",
            "english_hilali_khan": "So they [Ya’jûj and Ma’jûj (Gog and Magog)] could not scale it or dig through it.",
            "english_rwwad": "Thus they could not climb over it nor could they pierce it."
        }
    },
    {
        "id": 2237,
        "chapter": 18,
        "verse": 98,
        "arabic_text": "قَالَ هَٰذَا رَحۡمَةٞ مِّن رَّبِّيۖ فَإِذَا جَآءَ وَعۡدُ رَبِّي جَعَلَهُۥ دَكَّآءَۖ وَكَانَ وَعۡدُ رَبِّي حَقّٗا",
        "phonetic": "18.98 Qāla Hādhā Raĥmatun Min Rabbī Fa'idhā Jā'a Wa`du Rabbī Ja`alahu Dakkā'a Wa Kāna Wa`du Rabbī Ĥaqqāan",
        "footnotes": {
            "english_saheeh": "[799]- i.e., the Hour of Resurrection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Dhul-Qarnayn] said, \"This is a mercy from my Lord; but when the promise of my Lord[799] comes [i.e., approaches], He will make it level, and ever is the promise of my Lord true.\"",
            "english_hilali_khan": "(Dhul-Qarnain) said: \"This is a mercy from my Lord, but when the Promise of my Lord comes, He shall level it down to the ground. And the Promise of my Lord is ever true.\"",
            "english_rwwad": "He said, “This is a mercy from my Lord. But when the promise of my Lord comes to pass, He will raze it to the ground. The promise of my Lord is ever true.”"
        }
    },
    {
        "id": 2238,
        "chapter": 18,
        "verse": 99,
        "arabic_text": "۞ وَتَرَكۡنَا بَعۡضَهُمۡ يَوۡمَئِذٖ يَمُوجُ فِي بَعۡضٖۖ وَنُفِخَ فِي ٱلصُّورِ فَجَمَعۡنَٰهُمۡ جَمۡعٗا",
        "phonetic": "18.99 Wa Taraknā Ba`đahum Yawma'idhin Yamūju Fī Ba`đin Wa Nufikha Fī Aş-Şūri Fajama`nāhum Jam`āan",
        "footnotes": {
            "english_saheeh": "[800]- The day the dam is destroyed.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will leave them that day[800] surging over each other, and [then] the Horn will be blown, and We will assemble them in [one] assembly.",
            "english_hilali_khan": "And on that Day [i.e. the Day Ya’jûj and Ma’jûj (Gog and Magog) will come out], We shall leave them to surge like waves on one another; and the Trumpet will be blown, and We shall collect them (the creatures) all together.",
            "english_rwwad": "On that Day We will let some of them surge like waves over others, and the Trumpet will be blown, then We will gather them all together."
        }
    },
    {
        "id": 2239,
        "chapter": 18,
        "verse": 100,
        "arabic_text": "وَعَرَضۡنَا جَهَنَّمَ يَوۡمَئِذٖ لِّلۡكَٰفِرِينَ عَرۡضًا",
        "phonetic": "18.100 Wa `Arađnā Jahannama Yawma'idhin Lilkāfirīna `Arđāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will present Hell that Day to the disbelievers, on display -",
            "english_hilali_khan": "And on that Day We shall present Hell to the disbelievers, plain to view -",
            "english_rwwad": "On that Day We will show Hell to the disbelievers clearly,"
        }
    },
    {
        "id": 2240,
        "chapter": 18,
        "verse": 101,
        "arabic_text": "ٱلَّذِينَ كَانَتۡ أَعۡيُنُهُمۡ فِي غِطَآءٍ عَن ذِكۡرِي وَكَانُواْ لَا يَسۡتَطِيعُونَ سَمۡعًا",
        "phonetic": "18.101 Al-Ladhīna Kānat 'A`yunuhum Fī Ghiţā'in `An Dhikrī Wa Kānū Lā Yastaţī`ūna Sam`āan",
        "footnotes": {
            "english_saheeh": "[801]- i.e., Allāh's signs or the Qur’ān.\n[802]- They refused to listen to the Qur’ān or to understand it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those whose eyes had been within a cover [removed] from My remembrance,[801] and they were not able to hear.[802]",
            "english_hilali_khan": "(To) those whose eyes had been under a covering from My Reminder (this Qur’ân), and who could not bear to hear (it).",
            "english_rwwad": "those whose eyes were blind to My signs and they were unable to hear [the truth]."
        }
    },
    {
        "id": 2241,
        "chapter": 18,
        "verse": 102,
        "arabic_text": "أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا",
        "phonetic": "18.102 'Afaĥasiba Al-Ladhīna Kafarū 'An Yattakhidhū `Ibādī Min Dūnī 'Awliyā'a 'Innā 'A`tadnā Jahannama Lilkāfirīna Nuzulāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:102) Almighty Allâh says: \"They (Jews and Christians) took their rabbis and their monks to be their lords (by obeying them in things that they made lawful or unlawful according to their own desires without being ordered by Allâh) besides Allâh, and (they also took as their Lord) Messiah, son of Maryam (Mary), while they (Jews and Christians) were commanded [in the Taurât (Torah) and the Injeel (Gospel)] to worship none but one Ilâh (God - Allâh), Lâ ilâha illa Huwa (none has the right to be worshipped but He). Praise and Glory be to Him, (far above is He) from having the partners they associate (with Him).\" [The Qur’ân, Verse 9:31]\nOnce, while Allâh’s Messenger صلى الله عليه وسلم was reciting the above Verse, ‘Adi bin Hâtim said, \"O Allâh’s Prophet! They do not worship them (rabbis and monks).\" Allâh’s Messengerصلى الله عليه وسلم said, \"They certainly do. They (i.e. rabbis and monks) made legal things illegal, and illegal things legal, and they (i.e. Jews and Christians) followed them, and by doing so they really worshipped them.\" [Narrated by Ahmad, At-Tirmidhi, and Ibn Jarir. (Tafsîr At-Tabarî, Vol.10, Page No.114)]",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then do those who disbelieve think that they can take My servants instead of Me as allies? Indeed, We have prepared Hell for the disbelievers as a lodging.",
            "english_hilali_khan": "Do then those who disbelieved think that they can take My slaves [i.e., the angels, Allâh’s Messengers, ‘Îsâ (Jesus), son of Maryam (Mary)] as Auliyâ’ (lords, gods, protectors) besides Me? Verily, We have prepared Hell as an entertainment for the disbelievers (in the Oneness of Allâh - Islâmic Monotheism)[1].",
            "english_rwwad": "Do the disbelievers think that they can take My slaves as allies instead of Me? We have prepared Hell as a dwelling place for the disbelievers."
        }
    },
    {
        "id": 2242,
        "chapter": 18,
        "verse": 103,
        "arabic_text": "قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِينَ أَعۡمَٰلًا",
        "phonetic": "18.103 Qul Hal Nunabbi'ukum Bil-'Akhsarīna 'A`mālāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Shall we [believers] inform you of the greatest losers as to [their] deeds?",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Shall We tell you the greatest losers in respect of (their) deeds?",
            "english_rwwad": "Say, “Shall we inform you of the greatest losers in terms of their deeds?"
        }
    },
    {
        "id": 2243,
        "chapter": 18,
        "verse": 104,
        "arabic_text": "ٱلَّذِينَ ضَلَّ سَعۡيُهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ يَحۡسَبُونَ أَنَّهُمۡ يُحۡسِنُونَ صُنۡعًا",
        "phonetic": "18.104 Al-Ladhīna Đalla Sa`yuhum Fī Al-Ĥayāati Ad-Dunyā Wa Hum Yaĥsabūna 'Annahum Yuĥsinūna Şun`āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:104) For the acceptance of the righteous deeds it is stipulated that the following two basic conditions must be fulfilled:\na) The intentions while doing such deeds must be totally for Allâh’s sake only without any show-off or to gain praise or fame.\nb) Such a deed must be performed in accordance with the Sunnah of Allâh’s Messenger Muhammad bin ‘Abdullâh صلى الله عليه وسلم , the last of the Prophets and the Messengers.\nNarrated ‘Âishah رضي الله عنها : Allâh’s Messenger صلى الله عليه وسلم said, \"If somebody innovates something which is not present in our religion (of Islâmic Monotheism), then that thing will be rejected.\" (Sahih Al-Bukhari, Vol.3, Hadith No.861).\nIn another Hadith narrated ‘Âishah رضي الله عنها: The Prophet صلى الله عليه وسلم said: \"Whoever performs a (good) deed which we have not ordered (anyone) to do (or is not in accord with our religion of Islâmic Monotheism), then that deed will be rejected and will not be accepted.\" (Sahih Al-Bukhari, Vol.9, Chapter No.20 before Hadith No.449).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[They are] those whose effort is lost in worldly life, while they think that they are doing well in work.\"",
            "english_hilali_khan": "\"Those whose efforts have been wasted in this life while they thought that they were acquiring good by their deeds.[2]",
            "english_rwwad": "Those whose efforts in the life of this world are wasted, while they think that they are doing good.”"
        }
    },
    {
        "id": 2244,
        "chapter": 18,
        "verse": 105,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَلِقَآئِهِۦ فَحَبِطَتۡ أَعۡمَٰلُهُمۡ فَلَا نُقِيمُ لَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَزۡنٗا",
        "phonetic": "18.105 'Ūla'ika Al-Ladhīna Kafarū Bi'āyāti Rabbihim Wa Liqā'ihi Faĥabiţat 'A`māluhum Falā Nuqīmu Lahum Yawma Al-Qiyāmati Waznāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those are the ones who disbelieve in the verses of their Lord and in [their] meeting Him, so their deeds have become worthless; and We will not assign to them on the Day of Resurrection any weight [i.e., importance].",
            "english_hilali_khan": "\"They are those who deny the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord and the Meeting with Him (in the Hereafter). So their works are in vain, and on the Day of Resurrection, We shall assign no weight for them.",
            "english_rwwad": "It is those who disbelieve in the verses of their Lord and their meeting with Him; their deeds will be nullified, and We will give no weight to them on the Day of Resurrection."
        }
    },
    {
        "id": 2245,
        "chapter": 18,
        "verse": 106,
        "arabic_text": "ذَٰلِكَ جَزَآؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُواْ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَرُسُلِي هُزُوًا",
        "phonetic": "18.106 Dhālika Jazā'uuhum Jahannamu Bimā Kafarū Wa Attakhadhū 'Āyātī Wa Rusulī Huzūan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is their recompense - Hell - for what they denied and [because] they took My signs and My messengers in ridicule.",
            "english_hilali_khan": "\"That shall be their recompense, Hell; because they disbelieved and took My Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and My Messengers by way of jest and mockery.",
            "english_rwwad": "That is their recompense: Hell, because of their disbelief and taking My verses and messengers in ridicule."
        }
    },
    {
        "id": 2246,
        "chapter": 18,
        "verse": 107,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَانَتۡ لَهُمۡ جَنَّٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا",
        "phonetic": "18.107 'Inna Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Kānat Lahum Jannātu Al-Firdawsi Nuzulāan",
        "footnotes": {
            "english_saheeh": "[803]- i.e., the highest part of Paradise, al-Firdaus.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have believed and done righteous deeds - they will have the Gardens of Paradise[803] as a lodging,",
            "english_hilali_khan": "\"Verily those who believe (in the Oneness of Allâh - Islâmic Monotheism) and do righteous deeds, shall have the Gardens of Al-Firdaus (Paradise) for their entertainment.",
            "english_rwwad": "As for those who believe and do righteous deeds, they will have gardens of Paradise as a dwelling place,"
        }
    },
    {
        "id": 2247,
        "chapter": 18,
        "verse": 108,
        "arabic_text": "خَٰلِدِينَ فِيهَا لَا يَبۡغُونَ عَنۡهَا حِوَلٗا",
        "phonetic": "18.108 Khālidīna Fīhā Lā Yabghūna `Anhā Ĥiwalāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Wherein they abide eternally. They will not desire from it any transfer.",
            "english_hilali_khan": "\"Wherein they shall dwell (forever). No desire will they have for removal therefrom.\"",
            "english_rwwad": "abiding therein forever, never desiring to leave."
        }
    },
    {
        "id": 2248,
        "chapter": 18,
        "verse": 109,
        "arabic_text": "قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادٗا لِّكَلِمَٰتِ رَبِّي لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَٰتُ رَبِّي وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدٗا",
        "phonetic": "18.109 Qul Law Kāna Al-Baĥru Midādāan Likalimāti Rabbī Lanafida Al-Baĥru Qabla 'An Tanfada Kalimātu Rabbī Wa Law Ji'nā Bimithlihi Madadāan",
        "footnotes": {
            "english_saheeh": "[804]- The words of Allāh's unlimited knowledge or words describing His attributes and His grandeur or praise of Him (subḥānahu wa taʿālā).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"If the sea were ink for [writing] the words[804] of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it in [continual] supplement.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم to mankind): \"If the sea were ink for (writing) the Words of my Lord, surely, the sea would be exhausted before the Words of my Lord would be finished, even if We brought (another sea) like it for its aid.\"",
            "english_rwwad": "Say, “If the ocean were ink for [writing] the Words of my Lord, the ocean would surely run dry before the Words of my Lord are finished, even if We brought its like to resupply it.”"
        }
    },
    {
        "id": 2249,
        "chapter": 18,
        "verse": 110,
        "arabic_text": "قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ فَمَن كَانَ يَرۡجُواْ لِقَآءَ رَبِّهِۦ فَلۡيَعۡمَلۡ عَمَلٗا صَٰلِحٗا وَلَا يُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦٓ أَحَدَۢا",
        "phonetic": "18.110 Qul 'Innamā 'Anā Basharun Mithlukum Yūĥá 'Ilayya 'Annamā 'Ilahukum 'Ilahun Wāĥidun Faman Kāna Yarjū Liqā'a Rabbihi Falya`mal `Amalāan Şāliĥāan Wa Lā Yushrik Bi`ibādati Rabbihi 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.18:110) See the footnote of (V.6:31).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"I am only a man like you, to whom has been revealed that your god is one God. So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I am only a man like you. It has been revealed to me that your Ilâh (God) is One Ilâh (God - i.e. Allâh). So whoever hopes for the Meeting[3] with his Lord, let him work righteousness and associate none as a partner in the worship of his Lord.\"",
            "english_rwwad": "Say, “I am only a man like you; it has been revealed to me that your God is One God. So whoever hopes for the meeting with his Lord, let him do righteous deeds and associate none in the worship of his Lord.”"
        }
    }
]