[
    {
        "id": 2250,
        "chapter": 19,
        "verse": 1,
        "arabic_text": "كٓهيعٓصٓ",
        "phonetic": "19.1 Kāf-Hā-Yā-`Ayn-Şād",
        "footnotes": {
            "english_saheeh": "[806]- See footnote to 2:1",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Kāf, Hā, Yā, ʿAyn, Ṣād.[806]",
            "english_hilali_khan": "Kâf-Hâ-Yâ-‘Aîn-Sâd. [These letters are one of the miracles of the Qur’ân, and none but Allâh (Alone) knows their meanings].",
            "english_rwwad": "Kāf Ha Ya ‘Ayn Sād"
        }
    },
    {
        "id": 2251,
        "chapter": 19,
        "verse": 2,
        "arabic_text": "ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ",
        "phonetic": "19.2 Dhikru Raĥmati Rabbika `Abdahu Zakarīyā",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[This is] a mention of the mercy of your Lord to His servant Zechariah",
            "english_hilali_khan": "(This is) a mention of the mercy of your Lord to His slave Zakariyyâ (Zachariah).",
            "english_rwwad": "This is a reminder of the mercy of your Lord to His slave Zachariah,"
        }
    },
    {
        "id": 2252,
        "chapter": 19,
        "verse": 3,
        "arabic_text": "إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا",
        "phonetic": "19.3 'Idh Nādá Rabbahu Nidā'an Khafīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "When he called to his Lord a private call [i.e., supplication].",
            "english_hilali_khan": "When he called out his Lord (Allâh) a call in secret.",
            "english_rwwad": "When he called upon his Lord in private."
        }
    },
    {
        "id": 2253,
        "chapter": 19,
        "verse": 4,
        "arabic_text": "قَالَ رَبِّ إِنِّي وَهَنَ ٱلۡعَظۡمُ مِنِّي وَٱشۡتَعَلَ ٱلرَّأۡسُ شَيۡبٗا وَلَمۡ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيّٗا",
        "phonetic": "19.4 Qāla Rabbi 'Innī Wahana Al-`Ažmu Minnī Wa Ashta`ala Ar-Ra'su Shaybāan Wa Lam 'Akun Bidu`ā'ika Rabbi Shaqīyāan",
        "footnotes": {
            "english_saheeh": "[807]- Literally, \"ignited.\"  The spread of white hair throughout the head is likened to that of fire in the bush.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"My Lord, indeed my bones have weakened, and my head has filled[807] with white, and never have I been in my supplication to You, my Lord, unhappy [i.e., disappointed].",
            "english_hilali_khan": "He said: \"My Lord! Indeed my bones have grown feeble, and grey hair has spread on my head, And I have never been unblest in my invocation to You, O my Lord!",
            "english_rwwad": "He said, “My Lord, my bones have grown feeble, and gray hair has spread across my head, yet never have I been disappointed in my prayer to You, my Lord."
        }
    },
    {
        "id": 2254,
        "chapter": 19,
        "verse": 5,
        "arabic_text": "وَإِنِّي خِفۡتُ ٱلۡمَوَٰلِيَ مِن وَرَآءِي وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا فَهَبۡ لِي مِن لَّدُنكَ وَلِيّٗا",
        "phonetic": "19.5 Wa 'Innī Khiftu Al-Mawāliya Min Warā'ī Wa Kānati Amra'atī `Āqirāan Fahab Lī Min Ladunka Walīyāan",
        "footnotes": {
            "english_saheeh": "[808]- Those relatives from the father's side who would inherit religious authority.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And indeed, I fear the successors[808] after me, and my wife has been barren, so give me from Yourself an heir",
            "english_hilali_khan": "\"And verily I fear my relatives after me, and my wife is barren. So give me from Yourself an heir.",
            "english_rwwad": "And I fear my kinsmen after me, and my wife is barren; so grant me from Yourself an heir,"
        }
    },
    {
        "id": 2255,
        "chapter": 19,
        "verse": 6,
        "arabic_text": "يَرِثُنِي وَيَرِثُ مِنۡ ءَالِ يَعۡقُوبَۖ وَٱجۡعَلۡهُ رَبِّ رَضِيّٗا",
        "phonetic": "19.6 Yarithunī Wa Yarithu Min 'Āli Ya`qūba Wa Aj`alhu Rabbi Rađīyāan",
        "footnotes": {
            "english_saheeh": "[809]- Inherit from me religious knowledge and prophethood.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who will inherit me[809] and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"",
            "english_hilali_khan": "\"Who shall inherit me, and inherit (also) the posterity of Ya‘qûb (Jacob) (inheritance of the religious knowledge and Prophethood, not of wealth.). And make him, my Lord, one with whom You are Well-Pleased!\"",
            "english_rwwad": "who will inherit [prophethood] from me and from the house of Jacob, and make him, O Lord, well pleasing to You.”"
        }
    },
    {
        "id": 2256,
        "chapter": 19,
        "verse": 7,
        "arabic_text": "يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا",
        "phonetic": "19.7 Yā Zakarīyā 'Innā Nubashiruka Bighulāmin Asmuhu Yaĥyá Lam Naj`al Lahu Min Qablu Samīyāan",
        "footnotes": {
            "english_saheeh": "[810]- By Allāh (subḥānahu wa taʿālā) through the angels.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He was told],[810] \"O Zechariah, indeed We give you good tidings of a boy whose name will be John. We have not assigned to any before [this] name.\"",
            "english_hilali_khan": "(Allâh said) \"O Zakariyyâ (Zachariah)! Verily, We give you the glad tidings of a son, whose name will be Yahyâ (John). We have given that name to none before (him).\"",
            "english_rwwad": "[Allah said], “O Zachariah, We give you the glad tidings of a son, whose name will be John – a name that We have not given to anyone before.”"
        }
    },
    {
        "id": 2257,
        "chapter": 19,
        "verse": 8,
        "arabic_text": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا",
        "phonetic": "19.8 Qāla Rabbi 'Anná Yakūnu Lī Ghulāmun Wa Kānat Amra'atī `Āqirāan Wa Qad Balaghtu Mina Al-Kibari `Itīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"My Lord, how will I have a boy when my wife has been barren and I have reached extreme old age?\"",
            "english_hilali_khan": "He said: \"My Lord! How can I have a son, when my wife is barren, and I have reached the extreme old age.\"",
            "english_rwwad": "He said, “My Lord, how can I have a son when my wife is barren, and I have reached an extremely old age?”"
        }
    },
    {
        "id": 2258,
        "chapter": 19,
        "verse": 9,
        "arabic_text": "قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡـٔٗا",
        "phonetic": "19.9 Qāla Kadhālika Qāla Rabbuka Huwa `Alayya Hayyinun Wa Qad Khalaqtuka Min Qablu Wa Lam Taku Shay'āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[An angel] said, \"Thus [it will be]; your Lord says, 'It is easy for Me, for I created you before, while you were nothing.'\"",
            "english_hilali_khan": "He said: \"So (it will be). Your Lord says: It is easy for Me. Certainly I have created you before, when you had been nothing!\"",
            "english_rwwad": "[The angel] said, “Thus it will be; your Lord says, ‘It is easy for Me; I did create you before, when you were nothing.’”"
        }
    },
    {
        "id": 2259,
        "chapter": 19,
        "verse": 10,
        "arabic_text": "قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٖ سَوِيّٗا",
        "phonetic": "19.10 Qāla Rabbi Aj`al Lī 'Āyatan Qāla 'Āyatuka 'Allā Tukallima An-Nāsa Thalātha Layālin Sawīyāan",
        "footnotes": {
            "english_saheeh": "[811]- i.e., without illness or defect.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Zechariah] said, \"My Lord, make for me a sign.\" He said, \"Your sign is that you will not speak to the people for three nights, [being] sound.\"[811]",
            "english_hilali_khan": "[Zakariyyâ (Zachariah)] said: \"My Lord! Appoint for me a sign.\" He said: \"Your sign is that you shall not speak unto mankind for three nights, though having no bodily defect.\"",
            "english_rwwad": "Zachariah said, “My Lord, give me a sign.” He said, “Your sign is that you will not be able to speak to people for three nights, despite being sound.”"
        }
    },
    {
        "id": 2260,
        "chapter": 19,
        "verse": 11,
        "arabic_text": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡهِمۡ أَن سَبِّحُواْ بُكۡرَةٗ وَعَشِيّٗا",
        "phonetic": "19.11 Fakharaja `Alá Qawmihi Mina Al-Miĥrābi Fa'awĥá 'Ilayhim 'An Sabbiĥū Bukratan Wa `Ashīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he came out to his people from the prayer chamber and signaled to them to exalt [Allāh] in the morning and afternoon.",
            "english_hilali_khan": "Then he came out to his people from Al-Mihrâb (a praying place or a private room), and he told them by signs to glorify Allâh’s Praises in the morning and in the afternoon.",
            "english_rwwad": "Thereupon he came out to his people from the sanctuary, and signaled to them to glorify Allah morning and evening."
        }
    },
    {
        "id": 2261,
        "chapter": 19,
        "verse": 12,
        "arabic_text": "يَٰيَحۡيَىٰ خُذِ ٱلۡكِتَٰبَ بِقُوَّةٖۖ وَءَاتَيۡنَٰهُ ٱلۡحُكۡمَ صَبِيّٗا",
        "phonetic": "19.12 Yā Yaĥyá Khudhi Al-Kitāba Biqūwatin Wa 'Ātaynāhu Al-Ĥukma Şabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh said], \"O John, take the Scripture [i.e., adhere to it] with determination.\" And We gave him judgement [while yet] a boy",
            "english_hilali_khan": "(It was said to his son): \"O Yahyâ (John)! Hold fast the Scripture [the Taurât (Torah)].\" And We gave him wisdom while yet a child.",
            "english_rwwad": "[Allah said], “O John, hold the Scripture with all your strength.” And We gave him wisdom when he was still a child,"
        }
    },
    {
        "id": 2262,
        "chapter": 19,
        "verse": 13,
        "arabic_text": "وَحَنَانٗا مِّن لَّدُنَّا وَزَكَوٰةٗۖ وَكَانَ تَقِيّٗا",
        "phonetic": "19.13 Wa Ĥanānāan Min Ladunnā Wa Zakāatan Wa Kāna Taqīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And affection from Us and purity, and he was fearing of Allāh",
            "english_hilali_khan": "And (made him) sympathetic to men as a mercy (or a grant) from Us, and pure from sins [i.e. Yahyâ (John)] and he was righteous,",
            "english_rwwad": "as We made him compassionate and righteous, and he was fearing Allah,"
        }
    },
    {
        "id": 2263,
        "chapter": 19,
        "verse": 14,
        "arabic_text": "وَبَرَّۢا بِوَٰلِدَيۡهِ وَلَمۡ يَكُن جَبَّارًا عَصِيّٗا",
        "phonetic": "19.14 Wa Barrāan Biwālidayhi Wa Lam Yakun Jabbārāan `Aşīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And dutiful to his parents, and he was not a disobedient tyrant.",
            "english_hilali_khan": "And dutiful towards his parents, and he was neither arrogant nor disobedient (to Allâh or to his parents).",
            "english_rwwad": "and dutiful to his parents, and he was not an oppressor or disobedient."
        }
    },
    {
        "id": 2264,
        "chapter": 19,
        "verse": 15,
        "arabic_text": "وَسَلَٰمٌ عَلَيۡهِ يَوۡمَ وُلِدَ وَيَوۡمَ يَمُوتُ وَيَوۡمَ يُبۡعَثُ حَيّٗا",
        "phonetic": "19.15 Wa Salāmun `Alayhi Yawma Wulida Wa Yawma Yamūtu Wa Yawma Yub`athu Ĥayyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And peace be upon him the day he was born and the day he dies and the day he is raised alive.",
            "english_hilali_khan": "And Salâm (peace) be on him the day he was born, and the day he dies, and the day he will be raised up to life (again)!",
            "english_rwwad": "Peace be on him the day he was born, the day he will die, and the day he will be raised up to life again!"
        }
    },
    {
        "id": 2265,
        "chapter": 19,
        "verse": 16,
        "arabic_text": "وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ مَرۡيَمَ إِذِ ٱنتَبَذَتۡ مِنۡ أَهۡلِهَا مَكَانٗا شَرۡقِيّٗا",
        "phonetic": "19.16 Wa Adhkur Fī Al-Kitābi Maryama 'Idh Antabadhat Min 'Ahlihā Makānāan Sharqīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And mention, [O Muḥammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.",
            "english_hilali_khan": "And mention in the Book (the Qur’ân, O Muhammad صلى الله عليه وسلم the story of) Maryam (Mary), when she withdrew in seclusion from her family to a place facing east.",
            "english_rwwad": "And mention in the Book [the story of] Mary when she withdrew from her family to a place towards the east."
        }
    },
    {
        "id": 2266,
        "chapter": 19,
        "verse": 17,
        "arabic_text": "فَٱتَّخَذَتۡ مِن دُونِهِمۡ حِجَابٗا فَأَرۡسَلۡنَآ إِلَيۡهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَرٗا سَوِيّٗا",
        "phonetic": "19.17 Fāttakhadhat Min Dūnihim Ĥijābāan Fa'arsalnā 'Ilayhā Rūĥanā Fatamaththala Lahā Basharāan Sawīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And she took, in seclusion from them, a screen. Then We sent to her Our Angel [i.e., Gabriel], and he represented himself to her as a well-proportioned man.",
            "english_hilali_khan": "She placed a screen (to screen herself) from them; then We sent to her Our Ruh [angel Jibrîl (Gabriel)], and he appeared before her in the form of a man in all respects.",
            "english_rwwad": "She screened herself from them, then We sent to her Our Spirit [Gabriel] and he appeared before her in the form of a perfect human being."
        }
    },
    {
        "id": 2267,
        "chapter": 19,
        "verse": 18,
        "arabic_text": "قَالَتۡ إِنِّيٓ أَعُوذُ بِٱلرَّحۡمَٰنِ مِنكَ إِن كُنتَ تَقِيّٗا",
        "phonetic": "19.18 Qālat 'Innī 'A`ūdhu Bir-Raĥmani Minka 'In Kunta Taqīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "She said, \"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allāh.\"",
            "english_hilali_khan": "She said: \"Verily! I seek refuge with the Most Gracious (Allâh) from you, if you do fear Allâh.\"",
            "english_rwwad": "She said, “I seek refuge in the Most Compassionate from you; [do not approach me] if you fear Allah.”"
        }
    },
    {
        "id": 2268,
        "chapter": 19,
        "verse": 19,
        "arabic_text": "قَالَ إِنَّمَآ أَنَا۠ رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَٰمٗا زَكِيّٗا",
        "phonetic": "19.19 Qāla 'Innamā 'Anā Rasūlu Rabbiki Li'haba Laki Ghulāmāan Zakīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"I am only the messenger of your Lord to give you [news of] a pure boy [i.e., son].\"",
            "english_hilali_khan": "(The angel) said: \"I am only a messenger from your Lord, (to announce) to you the gift of a righteous son.\"",
            "english_rwwad": "He said, “I am only a messenger from your Lord to grant you a righteous son.”"
        }
    },
    {
        "id": 2269,
        "chapter": 19,
        "verse": 20,
        "arabic_text": "قَالَتۡ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞ وَلَمۡ أَكُ بَغِيّٗا",
        "phonetic": "19.20 Qālat 'Anná Yakūnu Lī Ghulāmun Wa Lam Yamsasnī Basharun Wa Lam 'Aku Baghīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "She said, \"How can I have a boy while no man has touched me and I have not been unchaste?\"",
            "english_hilali_khan": "She said: \"How can I have a son, when no man has touched me, nor am I unchaste?\"",
            "english_rwwad": "She said, “How can I have a son when no man has touched me, nor have I ever been unchaste?”"
        }
    },
    {
        "id": 2270,
        "chapter": 19,
        "verse": 21,
        "arabic_text": "قَالَ كَذَٰلِكِ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٞۖ وَلِنَجۡعَلَهُۥٓ ءَايَةٗ لِّلنَّاسِ وَرَحۡمَةٗ مِّنَّاۚ وَكَانَ أَمۡرٗا مَّقۡضِيّٗا",
        "phonetic": "19.21 Qāla Kadhāliki Qāla Rabbuki Huwa `Alayya Hayyinun Wa Linaj`alahu 'Āyatan Lilnnāsi Wa Raĥmatan Minnā Wa Kāna 'Amrāan Maqđīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Thus [it will be]; your Lord says, 'It is easy for Me, and We will make him a sign to the people and a mercy from Us. And it is a matter [already] decreed.'\"",
            "english_hilali_khan": "He said: \"So (it will be), your Lord said: ‘That is easy for Me (Allâh): And (We wish) to appoint him as a sign to mankind and a mercy from Us (Allâh), and it is a matter (already) decreed, (by Allâh).’ \"",
            "english_rwwad": "He said, “Thus it will be; your Lord says, ‘It is easy for Me; We make him a sign for people and a mercy from Us. This matter has already been decreed.’”"
        }
    },
    {
        "id": 2271,
        "chapter": 19,
        "verse": 22,
        "arabic_text": "۞ فَحَمَلَتۡهُ فَٱنتَبَذَتۡ بِهِۦ مَكَانٗا قَصِيّٗا",
        "phonetic": "19.22 Faĥamalat/hu Fāntabadhat Bihi Makānāan Qaşīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:22) \"And (remember) she who guarded her chastity [Virgin Maryam (Mary)], We breathed into (the sleeves of) her (shirt or garment) [through Our Rûh (Jibrîl - Gabriel)]*, and We made her and her son [‘Îsâ (Jesus)] a sign for Al-‘Âlamîn (the mankind and jinn).\" [The Qur’ân, Verse 21:91]\n* It is said that Jibrîl (Gabriel) had merely breathed in the sleeve of Maryam’s (Mary) shirt, and thus she conceived.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So she conceived him, and she withdrew with him to a remote place.",
            "english_hilali_khan": "miles from Jerusalem).",
            "english_rwwad": "So she conceived him and withdrew with him to a distant place."
        }
    },
    {
        "id": 2272,
        "chapter": 19,
        "verse": 23,
        "arabic_text": "فَأَجَآءَهَا ٱلۡمَخَاضُ إِلَىٰ جِذۡعِ ٱلنَّخۡلَةِ قَالَتۡ يَٰلَيۡتَنِي مِتُّ قَبۡلَ هَٰذَا وَكُنتُ نَسۡيٗا مَّنسِيّٗا",
        "phonetic": "19.23 Fa'ajā'ahā Al-Makhāđu 'Ilá Jidh`i An-Nakhlati Qālat Yā Laytanī Mittu Qabla Hādhā Wa Kuntu Nasyāan Mansīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the pains of childbirth drove her to the trunk of a palm tree. She said, \"Oh, I wish I had died before this and was in oblivion, forgotten.\"",
            "english_hilali_khan": "And the pains of childbirth drove her to the trunk of a date-palm. She said: \"Would that I had died before this, and had been forgotten and out of sight!\"",
            "english_rwwad": "The pains of labor drove her to the trunk of a palm tree. She said, “Oh, would that I had died before this and had been completely forgotten!”"
        }
    },
    {
        "id": 2273,
        "chapter": 19,
        "verse": 24,
        "arabic_text": "فَنَادَىٰهَا مِن تَحۡتِهَآ أَلَّا تَحۡزَنِي قَدۡ جَعَلَ رَبُّكِ تَحۡتَكِ سَرِيّٗا",
        "phonetic": "19.24 Fanādāhā Min Taĥtihā 'Allā Taĥzanī Qad Ja`ala Rabbuki Taĥtaki Sarīyāan",
        "footnotes": {
            "english_saheeh": "[812]- There is a difference of opinion among scholars as to whether \"he\" refers to the baby or to the angel.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But he[812] called her from below her, \"Do not grieve; your Lord has provided beneath you a stream.",
            "english_hilali_khan": "Then [the babe ‘Îsâ (Jesus) or Jibrîl (Gabriel)] cried unto her from below her, saying: \"Grieve not: your Lord has provided a water stream under you.",
            "english_rwwad": "Then the baby called her from beneath her, “Do not grieve; your Lord has provided a stream beneath you."
        }
    },
    {
        "id": 2274,
        "chapter": 19,
        "verse": 25,
        "arabic_text": "وَهُزِّيٓ إِلَيۡكِ بِجِذۡعِ ٱلنَّخۡلَةِ تُسَٰقِطۡ عَلَيۡكِ رُطَبٗا جَنِيّٗا",
        "phonetic": "19.25 Wa Huzzī 'Ilayki Bijidh`i An-Nakhlati Tusāqiţ `Alayki Ruţabāan Janīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And shake toward you the trunk of the palm tree; it will drop upon you ripe, fresh dates.",
            "english_hilali_khan": "\"And shake the trunk of date-palm towards you, it will let fall fresh ripe-dates upon you.\"",
            "english_rwwad": "Shake the trunk of the palm tree towards yourself; fresh ripe dates will drop upon you."
        }
    },
    {
        "id": 2275,
        "chapter": 19,
        "verse": 26,
        "arabic_text": "فَكُلِي وَٱشۡرَبِي وَقَرِّي عَيۡنٗاۖ فَإِمَّا تَرَيِنَّ مِنَ ٱلۡبَشَرِ أَحَدٗا فَقُولِيٓ إِنِّي نَذَرۡتُ لِلرَّحۡمَٰنِ صَوۡمٗا فَلَنۡ أُكَلِّمَ ٱلۡيَوۡمَ إِنسِيّٗا",
        "phonetic": "19.26 Fakulī Wa Ashrabī Wa Qarrī `Aynāan Fa'immā Taraynna Mina Al-Bashari 'Aĥadāan Faqūlī 'Innī Nadhartu Lilrraĥmani Şawmāan Falan 'Ukallima Al-Yawma 'Insīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So eat and drink and be contented. And if you see from among humanity anyone, say, 'Indeed, I have vowed to the Most Merciful abstention, so I will not speak today to [any] man.'\"",
            "english_hilali_khan": "\"So eat and drink and be glad. And if you see any human being, say: ‘Verily! I have vowed a fast unto the Most Gracious (Allâh) so I shall not speak to any human being this day.’\"",
            "english_rwwad": "Eat and drink, and be glad. And if you see any human being, say, ‘I have vowed silence to the Most Compassionate, so I will not talk to any human being today.’”"
        }
    },
    {
        "id": 2276,
        "chapter": 19,
        "verse": 27,
        "arabic_text": "فَأَتَتۡ بِهِۦ قَوۡمَهَا تَحۡمِلُهُۥۖ قَالُواْ يَٰمَرۡيَمُ لَقَدۡ جِئۡتِ شَيۡـٔٗا فَرِيّٗا",
        "phonetic": "19.27 Fa'atat Bihi Qawmahā Taĥmiluhu Qālū Yā Maryamu Laqad Ji'ti Shay'āan Farīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then she brought him to her people, carrying him. They said, \"O Mary, you have certainly done a thing unprecedented.",
            "english_hilali_khan": "Then she brought him (the baby) to her people, carrying him. They said: \"O Mary! Indeed you have brought a thing Fariyy (a mighty thing). [Tafsir Al-Tabari]",
            "english_rwwad": "Then she came to her people carrying him. They said, “O Mary, you have committed something monstrous!"
        }
    },
    {
        "id": 2277,
        "chapter": 19,
        "verse": 28,
        "arabic_text": "يَٰٓأُخۡتَ هَٰرُونَ مَا كَانَ أَبُوكِ ٱمۡرَأَ سَوۡءٖ وَمَا كَانَتۡ أُمُّكِ بَغِيّٗا",
        "phonetic": "19.28 Yā 'Ukhta Hārūna Mā Kāna 'Abūki Amra'a Saw'in Wa Mā Kānat 'Ummuki Baghīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:28) This Hârûn (Aaron) is not the brother of Mûsâ (Moses), but he was another pious man at the time of Maryam (Mary).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O sister [i.e., descendant] of Aaron, your father was not a man of evil, nor was your mother unchaste.\"",
            "english_hilali_khan": "\"O sister (i.e. the like) of Hârûn (Aaron)[1]! Your father was not a man who used to commit adultery, nor your mother was an unchaste woman.\"",
            "english_rwwad": "O sister of Aaron, your father was not a man of evil, nor was your mother unchaste.”"
        }
    },
    {
        "id": 2278,
        "chapter": 19,
        "verse": 29,
        "arabic_text": "فَأَشَارَتۡ إِلَيۡهِۖ قَالُواْ كَيۡفَ نُكَلِّمُ مَن كَانَ فِي ٱلۡمَهۡدِ صَبِيّٗا",
        "phonetic": "19.29 Fa'ashārat 'Ilayhi Qālū Kayfa Nukallimu Man Kāna Fī Al-Mahdi Şabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:29) See the footnote of (V.3:46).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So she pointed to him. They said, \"How can we speak to one who is in the cradle a child?\"",
            "english_hilali_khan": "Then she pointed to him. They said: \"How can we talk to one who is a child in the cradle?[2]\"",
            "english_rwwad": "Thereupon she pointed to him. They said, “How can we talk to someone who is still a baby in the cradle?”"
        }
    },
    {
        "id": 2279,
        "chapter": 19,
        "verse": 30,
        "arabic_text": "قَالَ إِنِّي عَبۡدُ ٱللَّهِ ءَاتَىٰنِيَ ٱلۡكِتَٰبَ وَجَعَلَنِي نَبِيّٗا",
        "phonetic": "19.30 Qāla 'Innī `Abdu Allāhi 'Ātāniya Al-Kitāba Wa Ja`alanī Nabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:30) See the footnote No.2 of (V.4:171).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Jesus] said, \"Indeed, I am the servant of Allāh. He has given me the Scripture and made me a prophet.",
            "english_hilali_khan": "\"He [‘Îsâ (Jesus)] said: \"Verily I am a slave of Allâh, He has given me the Scripture and made me a Prophet;[3]\"",
            "english_rwwad": "Jesus said, “I am a slave of Allah. He has given me the Scripture and made me a prophet."
        }
    },
    {
        "id": 2280,
        "chapter": 19,
        "verse": 31,
        "arabic_text": "وَجَعَلَنِي مُبَارَكًا أَيۡنَ مَا كُنتُ وَأَوۡصَٰنِي بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ مَا دُمۡتُ حَيّٗا",
        "phonetic": "19.31 Wa Ja`alanī Mubārakāan 'Ayna Mā Kuntu Wa 'Awşānī Biş-Şalāati Wa Az-Zakāati Mā Dumtu Ĥayyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And He has made me blessed wherever I am and has enjoined upon me prayer and zakāh as long as I remain alive",
            "english_hilali_khan": "\"And He has made me blessed wheresoever I be, and has enjoined on me Salât (prayer), and Zakât, as long as I live.\"",
            "english_rwwad": "He has made me blessed wherever I may be, and has enjoined upon me prayer and zakah as long as I am alive,"
        }
    },
    {
        "id": 2281,
        "chapter": 19,
        "verse": 32,
        "arabic_text": "وَبَرَّۢا بِوَٰلِدَتِي وَلَمۡ يَجۡعَلۡنِي جَبَّارٗا شَقِيّٗا",
        "phonetic": "19.32 Wa Barrāan Biwālidatī Wa Lam Yaj`alnī Jabbārāan Shaqīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [made me] dutiful to my mother, and He has not made me a wretched tyrant.",
            "english_hilali_khan": "\"And dutiful to my mother, and made me not arrogant, unblest.",
            "english_rwwad": "and has made me dutiful to my mother, and has not made me an oppressor or disobedient."
        }
    },
    {
        "id": 2282,
        "chapter": 19,
        "verse": 33,
        "arabic_text": "وَٱلسَّلَٰمُ عَلَيَّ يَوۡمَ وُلِدتُّ وَيَوۡمَ أَمُوتُ وَيَوۡمَ أُبۡعَثُ حَيّٗا",
        "phonetic": "19.33 Wa As-Salāmu `Alayya Yawma Wulidtu Wa Yawma 'Amūtu Wa Yawma 'Ub`athu Ĥayyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And peace is on me the day I was born and the day I will die and the day I am raised alive.\"",
            "english_hilali_khan": "\"And Salâm (peace) be upon me the day I was born, and the day I die, and the day I shall be raised alive!\"",
            "english_rwwad": "Peace is upon me the day I was born, the day I will die and the day I will be resurrected.”"
        }
    },
    {
        "id": 2283,
        "chapter": 19,
        "verse": 34,
        "arabic_text": "ذَٰلِكَ عِيسَى ٱبۡنُ مَرۡيَمَۖ قَوۡلَ ٱلۡحَقِّ ٱلَّذِي فِيهِ يَمۡتَرُونَ",
        "phonetic": "19.34 Dhālika `Īsá Abnu Maryama Qawla Al-Ĥaqqi Al-Ladhī Fīhi Yamtarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is Jesus, the son of Mary - the word of truth about which they are in dispute.",
            "english_hilali_khan": "Such is ‘Îsâ (Jesus), son of Maryam (Mary). (It is) a statement of truth, about which they doubt (or dispute).",
            "english_rwwad": "Such was Jesus, son of Mary – a word of truth about which they are in doubt."
        }
    },
    {
        "id": 2284,
        "chapter": 19,
        "verse": 35,
        "arabic_text": "مَا كَانَ لِلَّهِ أَن يَتَّخِذَ مِن وَلَدٖۖ سُبۡحَٰنَهُۥٓۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ",
        "phonetic": "19.35 Mā Kāna Lillāhi 'An Yattakhidha Min Waladin Subĥānahu 'Idhā Qađá 'Amrāan Fa'innamā Yaqūlu Lahu Kun Fayakūnu",
        "footnotes": {
            "english_saheeh": "[813]- i.e., far removed is He from any such need.",
            "english_hilali_khan": "(V.19:35) See the footnote of (V.2:116).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is not [befitting] for Allāh to take a son; exalted is He![813] When He decrees an affair, He only says to it, \"Be,\" and it is.",
            "english_hilali_khan": "It befits not (the Majesty of) Allâh that He should beget a son [this refers to the slander of Christians against Allâh, by saying that ‘Îsâ (Jesus) is the son of Allâh]. Glorified (and Exalted) be He (above all that they associate with Him). When He decrees a thing, He only says to it: \"Be!\" - and it is.[4]",
            "english_rwwad": "It is not befitting Allah to beget a son. Glory be to Him! When He decrees a matter, He only says to it, “Be,” and it is."
        }
    },
    {
        "id": 2285,
        "chapter": 19,
        "verse": 36,
        "arabic_text": "وَإِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ",
        "phonetic": "19.36 Wa 'Inna Allāha Rabbī Wa Rabbukum Fā`budūhu Hādhā Şirāţun Mustaqīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Jesus said], \"And indeed, Allāh is my Lord and your Lord, so worship Him. That is a straight path.\"",
            "english_hilali_khan": "[‘Îsâ (Jesus) said]: \"And verily Allâh is my Lord and your Lord. So worship Him (Alone). That is the Straight Path. (Allâh’s religion of Islâmic Monotheism which He did ordain for all of His Prophets).\" [Tafsir At-Tabarî]",
            "english_rwwad": "[Jesus said], “Indeed, Allah is my Lord and your Lord, so worship Him. This is a straight path.”"
        }
    },
    {
        "id": 2286,
        "chapter": 19,
        "verse": 37,
        "arabic_text": "فَٱخۡتَلَفَ ٱلۡأَحۡزَابُ مِنۢ بَيۡنِهِمۡۖ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِن مَّشۡهَدِ يَوۡمٍ عَظِيمٍ",
        "phonetic": "19.37 Fākhtalafa Al-'Aĥzābu Min Baynihim Fawaylun Lilladhīna Kafarū Min Mash/hadi Yawmin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:37) See the footnote of (V.3:103).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then the factions differed [concerning Jesus] from among them, so woe to those who disbelieved - from the scene of a tremendous Day.",
            "english_hilali_khan": "Then the sects differed [i.e. the Christians about ‘Îsâ (Jesus) عليه السلام], so woe unto the disbelievers [those who gave false witness by saying that ‘Îsâ (Jesus) is the son of Allâh] from the Meeting of a great Day (i.e. the Day of Resurrection, when they will be thrown in the blazing Fire)[5].",
            "english_rwwad": "But the factions differed among themselves [about him]. So woe to the disbelievers from the scene of a momentous Day!"
        }
    },
    {
        "id": 2287,
        "chapter": 19,
        "verse": 38,
        "arabic_text": "أَسۡمِعۡ بِهِمۡ وَأَبۡصِرۡ يَوۡمَ يَأۡتُونَنَا لَٰكِنِ ٱلظَّٰلِمُونَ ٱلۡيَوۡمَ فِي ضَلَٰلٖ مُّبِينٖ",
        "phonetic": "19.38 'Asmi` Bihim Wa 'Abşir Yawma Ya'tūnanā Lakini Až-Žālimūna Al-Yawma Fī Đalālin Mubīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "How [clearly] they will hear and see the Day they come to Us, but the wrongdoers today are in clear error.",
            "english_hilali_khan": "How clearly will they (polytheists and disbelievers in the Oneness of Allâh) see and hear the Day when they will appear before Us! But the Zalimûn (polytheists and wrong-doers) today are in plain error.",
            "english_rwwad": "How sharp they will hear and see on the Day they come to Us! But today the wrongdoers are clearly misguided."
        }
    },
    {
        "id": 2288,
        "chapter": 19,
        "verse": 39,
        "arabic_text": "وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡحَسۡرَةِ إِذۡ قُضِيَ ٱلۡأَمۡرُ وَهُمۡ فِي غَفۡلَةٖ وَهُمۡ لَا يُؤۡمِنُونَ",
        "phonetic": "19.39 Wa 'Andhirhum Yawma Al-Ĥasrati 'Idh Quđiya Al-'Amru Wa Hum Fī Ghaflatin Wa Hum Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "[814]- i.e., \"judged\" or \"accomplished.\"",
            "english_hilali_khan": "(V.19:39) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"On the Day of Resurrection, death will be brought forward in the shape of a black and white ram. Then a call-maker will call, ‘O people of Paradise!’ Thereupon they will stretch their necks and look carefully. The caller will say, ‘Do you know this?’ They will say: ‘Yes, this is death.’ By then all of them would have seen it. Then it will be announced again, ‘O people of Hell!’ They will stretch their necks and look carefully. The caller will say, ‘Do you know this?’ They will say, ‘Yes, this is death.’ \" And by then all of them would have seen it. Then it (that ram) will be slaughtered and the caller will say. ‘O people of Paradise! Eternity for you and no death. O people of Hell! Eternity for you and no death.’ Then the Prophet صلى الله عليه وسلم recited: \"And warn them (O Muhammad صلى الله عليه وسلم) of the Day of grief and regrets when the case has been decided, while (now) they (i.e. the people of the world) are in a state of carelessness and they believe not.\" (Sahih Al-Bukhari, Vol.6, Hadith No. 254).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And warn them, [O Muḥammad], of the Day of Regret, when the matter will be concluded;[814] and [yet], they are in [a state of] heedlessness, and they do not believe.",
            "english_hilali_khan": "And warn them (O Muhammad صلى الله عليه وسلم) of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not[1].",
            "english_rwwad": "Warn them of the Day of Remorse when all matters will be decided, but they are heedless and they do not believe."
        }
    },
    {
        "id": 2289,
        "chapter": 19,
        "verse": 40,
        "arabic_text": "إِنَّا نَحۡنُ نَرِثُ ٱلۡأَرۡضَ وَمَنۡ عَلَيۡهَا وَإِلَيۡنَا يُرۡجَعُونَ",
        "phonetic": "19.40 'Innā Naĥnu Narithu Al-'Arđa Wa Man `Alayhā Wa 'Ilaynā Yurja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, it is We who will inherit the earth and whoever is on it, and to Us they will be returned.",
            "english_hilali_khan": "Verily We will inherit the earth and whatsoever is thereon. And to Us they all shall be returned,",
            "english_rwwad": "It is We Who will inherit the earth and all those who are on it, and to Us they will be returned."
        }
    },
    {
        "id": 2290,
        "chapter": 19,
        "verse": 41,
        "arabic_text": "وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ إِبۡرَٰهِيمَۚ إِنَّهُۥ كَانَ صِدِّيقٗا نَّبِيًّا",
        "phonetic": "19.41 Wa Adhkur Fī Al-Kitābi 'Ibrāhīma 'Innahu Kāna Şiddīqāan Nabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And mention in the Book [the story of] Abraham. Indeed, he was a man of truth and a prophet.",
            "english_hilali_khan": "And mention in the Book (the Qur’ân) Ibrâhîm (Abraham). Verily he was a man of truth, a Prophet.",
            "english_rwwad": "And mention in the Book [the story of] Abraham. He was indeed a man of truth and a prophet."
        }
    },
    {
        "id": 2291,
        "chapter": 19,
        "verse": 42,
        "arabic_text": "إِذۡ قَالَ لِأَبِيهِ يَٰٓأَبَتِ لِمَ تَعۡبُدُ مَا لَا يَسۡمَعُ وَلَا يُبۡصِرُ وَلَا يُغۡنِي عَنكَ شَيۡـٔٗا",
        "phonetic": "19.42 'Idh Qāla Li'abīhi Yā 'Abati Lima Ta`budu Mā Lā Yasma`u Wa Lā Yubşiru Wa Lā Yughnī `Anka Shay'āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?",
            "english_hilali_khan": "When he said to his father: \"O my father! Why do you worship that which hears not, sees not and cannot avail you in anything?",
            "english_rwwad": "When he said to his father, “O my dear father, why do you worship something that neither hears nor sees, nor benefits you in any way?"
        }
    },
    {
        "id": 2292,
        "chapter": 19,
        "verse": 43,
        "arabic_text": "يَٰٓأَبَتِ إِنِّي قَدۡ جَآءَنِي مِنَ ٱلۡعِلۡمِ مَا لَمۡ يَأۡتِكَ فَٱتَّبِعۡنِيٓ أَهۡدِكَ صِرَٰطٗا سَوِيّٗا",
        "phonetic": "19.43 Yā 'Abati 'Innī Qad Jā'anī Mina Al-`Ilmi Mā Lam Ya'tika Fa Attabi`nī 'Ahdika Şirāţāan Sawīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O my father, indeed there has come to me of knowledge that which has not come to you, so follow me; I will guide you to an even path.",
            "english_hilali_khan": "\"O my father! Verily there has come to me of the knowledge that which came not unto you. So follow me, I will guide you to the Straight Path.",
            "english_rwwad": "O my dear father, there has come to me some knowledge that has not come to you, so follow me; I will guide you to a straight path."
        }
    },
    {
        "id": 2293,
        "chapter": 19,
        "verse": 44,
        "arabic_text": "يَٰٓأَبَتِ لَا تَعۡبُدِ ٱلشَّيۡطَٰنَۖ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلرَّحۡمَٰنِ عَصِيّٗا",
        "phonetic": "19.44 Yā 'Abati Lā Ta`budi Ash-Shayţāna 'Inna Ash-Shayţāna Kāna Lilrraĥmani `Aşīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O my father, do not worship [i.e., obey] Satan. Indeed Satan has ever been, to the Most Merciful, disobedient.",
            "english_hilali_khan": "\"O my father! Worship not Shaitân (Satan). Verily Shaitân (Satan) has been a rebel against the Most Gracious (Allâh).",
            "english_rwwad": "O my dear father, do not worship Satan. Indeed, Satan is rebellious against the Most Compassionate."
        }
    },
    {
        "id": 2294,
        "chapter": 19,
        "verse": 45,
        "arabic_text": "يَٰٓأَبَتِ إِنِّيٓ أَخَافُ أَن يَمَسَّكَ عَذَابٞ مِّنَ ٱلرَّحۡمَٰنِ فَتَكُونَ لِلشَّيۡطَٰنِ وَلِيّٗا",
        "phonetic": "19.45 Yā 'Abati 'Innī 'Akhāfu 'An Yamassaka `Adhābun Mina Ar-Raĥmāni Fatakūna Lilshayţāni Walīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire].\"",
            "english_hilali_khan": "\"O my father! Verily I fear lest a torment from the Most Gracious (Allâh) should overtake you, so that you become a companion of Shaitân (Satan) (in the Hell-fire).\" [Tafsir Al-Qurtubî]",
            "english_rwwad": "O my dear father, I truly fear that a punishment from the Most Compassionate may afflict you and that you may become a companion of Satan [in Hell].”"
        }
    },
    {
        "id": 2295,
        "chapter": 19,
        "verse": 46,
        "arabic_text": "قَالَ أَرَاغِبٌ أَنتَ عَنۡ ءَالِهَتِي يَٰٓإِبۡرَٰهِيمُۖ لَئِن لَّمۡ تَنتَهِ لَأَرۡجُمَنَّكَۖ وَٱهۡجُرۡنِي مَلِيّٗا",
        "phonetic": "19.46 Qāla 'Arāghibun 'Anta `An 'Ālihatī Yā 'Ibrāhīmu La'in Lam Tantahi La'arjumannaka Wa Ahjurnī Malīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[His father] said, \"Have you no desire for my gods, O Abraham? If you do not desist, I will surely stone you, so avoid me a prolonged time.\"",
            "english_hilali_khan": "He (the father) said: \"Do you reject my gods, O Ibrâhîm (Abraham)? If you stop not (this), I will indeed stone you. So get away from me safely (before I punish you).\"",
            "english_rwwad": "He said, “Are you turning away from my gods, O Abraham? If you do not desist, I will surely stone you. Keep away from me for a long time!”"
        }
    },
    {
        "id": 2296,
        "chapter": 19,
        "verse": 47,
        "arabic_text": "قَالَ سَلَٰمٌ عَلَيۡكَۖ سَأَسۡتَغۡفِرُ لَكَ رَبِّيٓۖ إِنَّهُۥ كَانَ بِي حَفِيّٗا",
        "phonetic": "19.47 Qāla Salāmun `Alayka Sa'astaghfiru Laka Rabbī 'Innahu Kāna Bī Ĥafīyāan",
        "footnotes": {
            "english_saheeh": "[815]- Meaning \"You are secure\" or \"I will not harm you.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Abraham] said, \"Peace [i.e., safety] will be upon you.[815] I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me.",
            "english_hilali_khan": "Ibrâhîm (Abraham) said: \"Peace be on you! I will ask Forgiveness of my Lord for you. Verily He is unto me Ever Most Gracious.",
            "english_rwwad": "Abraham said, “Peace be on you. I will seek my Lord’s forgiveness for you. Indeed, He is Most Gracious to me."
        }
    },
    {
        "id": 2297,
        "chapter": 19,
        "verse": 48,
        "arabic_text": "وَأَعۡتَزِلُكُمۡ وَمَا تَدۡعُونَ مِن دُونِ ٱللَّهِ وَأَدۡعُواْ رَبِّي عَسَىٰٓ أَلَّآ أَكُونَ بِدُعَآءِ رَبِّي شَقِيّٗا",
        "phonetic": "19.48 Wa 'A`tazilukum Wa Mā Tad`ūna Min Dūni Allāhi Wa 'Ad`ū Rabbī `Asá 'Allā 'Akūna Bidu`ā'i Rabbī Shaqīyāan",
        "footnotes": {
            "english_saheeh": "[816]- i.e., worship.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And I will leave you and those you invoke other than Allāh and will invoke[816] my Lord. I expect that I will not be in invocation to my Lord unhappy [i.e., disappointed].\"",
            "english_hilali_khan": "\"And I shall turn away from you and from those whom you invoke besides Allâh. And I shall call upon my Lord and I hope that I shall not be unblest in my invocation to my Lord.\"",
            "english_rwwad": "I will distance myself from you and from all that you supplicate besides Allah, and I will supplicate my Lord; perhaps my supplication to my Lord will not go unanswered.”"
        }
    },
    {
        "id": 2298,
        "chapter": 19,
        "verse": 49,
        "arabic_text": "فَلَمَّا ٱعۡتَزَلَهُمۡ وَمَا يَعۡبُدُونَ مِن دُونِ ٱللَّهِ وَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَۖ وَكُلّٗا جَعَلۡنَا نَبِيّٗا",
        "phonetic": "19.49 Falammā A`tazalahum Wa Mā Ya`budūna Min Dūni Allāhi Wahabnā Lahu 'Isĥāqa Wa Ya`qūba Wa Kullā Ja`alnā Nabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when he had left them and those they worshipped other than Allāh, We gave him Isaac and Jacob, and each [of them] We made a prophet.",
            "english_hilali_khan": "So when he had turned away from them and from those whom they worshipped besides Allâh, We gave him Ishâq (Isaac) and Ya‘qûb (Jacob), and each one of them We made a Prophet.",
            "english_rwwad": "When he distanced himself from them and what they worshiped besides Allah, We granted him Isaac and Jacob, and made each one of them a prophet."
        }
    },
    {
        "id": 2299,
        "chapter": 19,
        "verse": 50,
        "arabic_text": "وَوَهَبۡنَا لَهُم مِّن رَّحۡمَتِنَا وَجَعَلۡنَا لَهُمۡ لِسَانَ صِدۡقٍ عَلِيّٗا",
        "phonetic": "19.50 Wa Wahabnā Lahum Min Raĥmatinā Wa Ja`alnā Lahum Lisāna Şidqin `Alīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:50) See the footnote of (V.2:135) and the footnotes (A, B and C) of (V.16:121)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We gave them of Our mercy, and We made for them a mention [i.e., reputation] of high honor.",
            "english_hilali_khan": "And We gave them of Our Mercy (a good provision in plenty), and We granted them honour on the tongues (of all the nations, i.e. everybody remembers them with a good praise).[2]",
            "english_rwwad": "We bestowed upon them of Our mercy, and blessed them with a highly esteemed reputation."
        }
    },
    {
        "id": 2300,
        "chapter": 19,
        "verse": 51,
        "arabic_text": "وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ مُوسَىٰٓۚ إِنَّهُۥ كَانَ مُخۡلَصٗا وَكَانَ رَسُولٗا نَّبِيّٗا",
        "phonetic": "19.51 Wa Adhkur Fī Al-Kitābi Mūsá 'Innahu Kāna Mukhlaşāan Wa Kāna Rasūlāan Nabīyāan",
        "footnotes": {
            "english_saheeh": "[817]- A messenger (rasūl) is one who was charged by Allāh to reform society.  A prophet (nabī) is one who received revelation from Allāh, the latter being more numerous than the former.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And mention in the Book, Moses. Indeed, he was chosen, and he was a messenger and a prophet.[817]",
            "english_hilali_khan": "And mention in the Book (this Qur’ân) Mûsâ (Moses). Verily he was chosen and he was a Messenger (and) a Prophet.",
            "english_rwwad": "And mention in the Book [the story of] Moses. He was indeed a chosen one, and was a messenger and a prophet."
        }
    },
    {
        "id": 2301,
        "chapter": 19,
        "verse": 52,
        "arabic_text": "وَنَٰدَيۡنَٰهُ مِن جَانِبِ ٱلطُّورِ ٱلۡأَيۡمَنِ وَقَرَّبۡنَٰهُ نَجِيّٗا",
        "phonetic": "19.52 Wa Nādaynāhu Min Jānibi Aţ-Ţūri Al-'Aymani Wa Qarrabnāhu Najīyāan",
        "footnotes": {
            "english_saheeh": "[818]- Mount Sinai.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We called him from the side of the mount[818] at [his] right and brought him near, confiding [to him].",
            "english_hilali_khan": "And We called him from the right side of the Mount, and made him draw near to Us for a talk with him [Mûsâ (Moses)].",
            "english_rwwad": "We called him from the right side of the Mount Tūr [in Sinai] and We brought him near by conversing with him in private."
        }
    },
    {
        "id": 2302,
        "chapter": 19,
        "verse": 53,
        "arabic_text": "وَوَهَبۡنَا لَهُۥ مِن رَّحۡمَتِنَآ أَخَاهُ هَٰرُونَ نَبِيّٗا",
        "phonetic": "19.53 Wa Wahabnā Lahu Min Raĥmatinā 'Akhāhu Hārūna Nabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We gave him out of Our mercy his brother Aaron as a prophet.",
            "english_hilali_khan": "And We granted him his brother Hârûn (Aaron), (also) a Prophet, out of Our Mercy.",
            "english_rwwad": "And We granted him, by Our mercy, his brother Aaron, as a prophet."
        }
    },
    {
        "id": 2303,
        "chapter": 19,
        "verse": 54,
        "arabic_text": "وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ إِسۡمَٰعِيلَۚ إِنَّهُۥ كَانَ صَادِقَ ٱلۡوَعۡدِ وَكَانَ رَسُولٗا نَّبِيّٗا",
        "phonetic": "19.54 Wa Adhkur Fī Al-Kitābi 'Ismā`īla 'Innahu Kāna Şādiqa Al-Wa`di Wa Kāna Rasūlāan Nabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And mention in the Book, Ishmael. Indeed, he was true to his promise, and he was a messenger and a prophet.",
            "english_hilali_khan": "And mention in the Book (the Qur’ân) Ismâ‘îl (Ishmael). Verily he was true to what he promised, and he was a Messenger, (and) a Prophet.",
            "english_rwwad": "And mention in the Book [the story of] Ishmael. He was true to his promise, and was a messenger and a prophet."
        }
    },
    {
        "id": 2304,
        "chapter": 19,
        "verse": 55,
        "arabic_text": "وَكَانَ يَأۡمُرُ أَهۡلَهُۥ بِٱلصَّلَوٰةِ وَٱلزَّكَوٰةِ وَكَانَ عِندَ رَبِّهِۦ مَرۡضِيّٗا",
        "phonetic": "19.55 Wa Kāna Ya'muru 'Ahlahu Biş-Şalāati Wa Az-Zakāati Wa Kāna `Inda Rabbihi Marđīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he used to enjoin on his people prayer and zakāh and was to his Lord pleasing [i.e., accepted by Him].",
            "english_hilali_khan": "And he used to enjoin on his family and his people As-Salât (the prayers) and the Zakât and his Lord was pleased with him.",
            "english_rwwad": "He used to command his people to pray and give zakah, and his Lord was well pleased with him."
        }
    },
    {
        "id": 2305,
        "chapter": 19,
        "verse": 56,
        "arabic_text": "وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ إِدۡرِيسَۚ إِنَّهُۥ كَانَ صِدِّيقٗا نَّبِيّٗا",
        "phonetic": "19.56 Wa Adhkur Fī Al-Kitābi 'Idrīsa 'Innahu Kāna Şiddīqāan Nabīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.",
            "english_hilali_khan": "And mention in the Book (the Qur’ân) Idrîs (Enoch).Verily he was a man of truth, (and) a Prophet.",
            "english_rwwad": "And mention in the Book [the story of] Idrīs. He was a man of truth and a prophet."
        }
    },
    {
        "id": 2306,
        "chapter": 19,
        "verse": 57,
        "arabic_text": "وَرَفَعۡنَٰهُ مَكَانًا عَلِيًّا",
        "phonetic": "19.57 Wa Rafa`nāhu Makānāan `Alīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We raised him to a high station.",
            "english_hilali_khan": "And We raised him to a high station.",
            "english_rwwad": "And We raised him to a high status."
        }
    },
    {
        "id": 2307,
        "chapter": 19,
        "verse": 58,
        "arabic_text": "أُوْلَٰٓئِكَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّـۧنَ مِن ذُرِّيَّةِ ءَادَمَ وَمِمَّنۡ حَمَلۡنَا مَعَ نُوحٖ وَمِن ذُرِّيَّةِ إِبۡرَٰهِيمَ وَإِسۡرَٰٓءِيلَ وَمِمَّنۡ هَدَيۡنَا وَٱجۡتَبَيۡنَآۚ إِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُ ٱلرَّحۡمَٰنِ خَرُّواْۤ سُجَّدٗاۤ وَبُكِيّٗا۩",
        "phonetic": "19.58 'Ūlā'ika Al-Ladhīna 'An`ama Allāhu `Alayhim Mina An-Nabīyīna Min Dhurrīyati 'Ādama Wa Mimman Ĥamalnā Ma`a Nūĥin Wa Min Dhurrīyati 'Ibrāhīma Wa 'Isrā'īla Wa Mimman Hadaynā Wa Ajtabaynā 'Idhā Tutlá `Alayhim 'Āyātu Ar-Raĥmāni Kharrū Sujjadāan Wa Bukīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:58) Prostration: The reciter of the Qur’ân at this place should prostrate himself to Allâh, facing the Ka‘bah at Makkah.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those were the ones upon whom Allāh bestowed favor from among the prophets of the descendants of Adam and of those We carried [in the ship] with Noah, and of the descendants of Abraham and Israel [i.e., Jacob], and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.",
            "english_hilali_khan": "Those were they unto whom Allâh bestowed His Grace from among the Prophets, of the offspring of Adam, and of those whom We carried (in the ship) with Nûh (Noah), and of the offspring of Ibrâhîm (Abraham) and Israel, and from among those whom We guided and chose. When the Verses of the Most Gracious (Allâh) were recited unto them, they fell down prostrate and weeping.[1]",
            "english_rwwad": "These are the prophets whom Allah has favored from among the descendants of Adam, and from those whom We carried with Noah [in the Ark], and from the descendants of Abraham and Israel [Jacob], and from those whom We guided and chose. Whenever the verses of the Most Compassionate were recited to them, they fell down in prostration, weeping."
        }
    },
    {
        "id": 2308,
        "chapter": 19,
        "verse": 59,
        "arabic_text": "۞ فَخَلَفَ مِنۢ بَعۡدِهِمۡ خَلۡفٌ أَضَاعُواْ ٱلصَّلَوٰةَ وَٱتَّبَعُواْ ٱلشَّهَوَٰتِۖ فَسَوۡفَ يَلۡقَوۡنَ غَيًّا",
        "phonetic": "19.59 Fakhalafa Min Ba`dihim Khalfun 'Ađā`ū Aş-Şalāata Wa Attaba`ū Ash-Shahawāti Fasawfa Yalqawna Ghayyāan",
        "footnotes": {
            "english_saheeh": "[819]- Described as a valley in Hell or may be rendered \"the consequence of error.\"",
            "english_hilali_khan": "(V.19:59) Like drinking alcoholic drinks; giving false witnesses; eating unlawful things - meat of edible animals not slaughtered according to Allâh’s Order; taking intoxicants; narcotic drugs like opium, morphine, heroin, cannabis; committing crimes; evil wicked deeds like illegal sexual acts, murdering, taking others’ rights unlawfully, robbing, stealing, betraying, backbiting, slandering, telling lies.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But there came after them successors [i.e., later generations] who neglected prayer and pursued desires; so they are going to meet evil[819] -",
            "english_hilali_khan": "Then, there has succeeded them a posterity who have given up As-Salât (the prayers) [i.e. made their Salât (prayers) to be lost, either by not offering them or by not offering them perfectly or by not offering them in their proper fixed times] and have followed lusts.[2] So they will be thrown in Hell.",
            "english_rwwad": "But they were succeeded by generations who neglected prayer and pursued their desires; so they will meet their doom,"
        }
    },
    {
        "id": 2309,
        "chapter": 19,
        "verse": 60,
        "arabic_text": "إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحٗا فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ وَلَا يُظۡلَمُونَ شَيۡـٔٗا",
        "phonetic": "19.60 'Illā Man Tāba Wa 'Āmana Wa `Amila Şāliĥāan Fa'ūlā'ika Yadkhulūna Al-Jannata Wa Lā Yužlamūna Shay'āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": " (V.19:60) See the footnote of (V.9:121).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Except those who repent, believe and do righteousness; for those will enter Paradise and will not be wronged at all.",
            "english_hilali_khan": "Except those who repent and believe (in the Oneness of Allâh and His Messenger Muhammad صلى الله عليه وسلم), and work righteousness.[3] Such will enter Paradise and they will not be wronged in aught.",
            "english_rwwad": "except those who repent and believe, and do righteous deeds – it is they who will enter Paradise and they will not be wronged in the least."
        }
    },
    {
        "id": 2310,
        "chapter": 19,
        "verse": 61,
        "arabic_text": "جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدَ ٱلرَّحۡمَٰنُ عِبَادَهُۥ بِٱلۡغَيۡبِۚ إِنَّهُۥ كَانَ وَعۡدُهُۥ مَأۡتِيّٗا",
        "phonetic": "19.61 Jannāti `Adnin Allatī Wa`ada Ar-Raĥmānu `Ibādahu Bil-Ghaybi 'Innahu Kāna Wa`duhu Ma'tīyāan",
        "footnotes": {
            "english_saheeh": "[820]- Literally, \"that to which all will come.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Therein are] gardens of perpetual residence which the Most Merciful has promised His servants in the unseen. Indeed, His promise has ever been eminent.[820]",
            "english_hilali_khan": "(They will enter) ‘Adn (Eden) Paradise (everlasting Gardens), which the Most Gracious (Allâh) has promised to His slaves in the Unseen: Verily His Promise must come to pass.",
            "english_rwwad": "Gardens of Eternity which the Most Compassionate has promised His slaves who have not seen them. His promise will surely be fulfilled."
        }
    },
    {
        "id": 2311,
        "chapter": 19,
        "verse": 62,
        "arabic_text": "لَّا يَسۡمَعُونَ فِيهَا لَغۡوًا إِلَّا سَلَٰمٗاۖ وَلَهُمۡ رِزۡقُهُمۡ فِيهَا بُكۡرَةٗ وَعَشِيّٗا",
        "phonetic": "19.62 Lā Yasma`ūna Fīhā Laghwan 'Illā Salāmāan Wa Lahum Rizquhum Fīhā Bukratan Wa `Ashīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will not hear therein any ill speech - only [greetings of] peace - and they will have their provision therein, morning and afternoon.",
            "english_hilali_khan": "They shall not hear therein (in Paradise) any Laghw (dirty, false, evil vain talk), but only Salâm (salutations of peace). And they will have therein their sustenance, morning and afternoon. [See (V.40:55)].",
            "english_rwwad": "They will not hear therein any idle talk, except greetings of peace, and they will have their provision morning and evening."
        }
    },
    {
        "id": 2312,
        "chapter": 19,
        "verse": 63,
        "arabic_text": "تِلۡكَ ٱلۡجَنَّةُ ٱلَّتِي نُورِثُ مِنۡ عِبَادِنَا مَن كَانَ تَقِيّٗا",
        "phonetic": "19.63 Tilka Al-Jannatu Allatī Nūrithu Min `Ibādinā Man Kāna Taqīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is Paradise, which We give as inheritance to those of Our servants who were fearing of Allāh.",
            "english_hilali_khan": "Such is the Paradise which We shall give as an inheritance to those of Our slaves who have been Al-Muttaqûn (the pious - See V.2:2).",
            "english_rwwad": "Such is the Paradise which We will give as an inheritance to those of Our slaves who feared Allah."
        }
    },
    {
        "id": 2313,
        "chapter": 19,
        "verse": 64,
        "arabic_text": "وَمَا نَتَنَزَّلُ إِلَّا بِأَمۡرِ رَبِّكَۖ لَهُۥ مَا بَيۡنَ أَيۡدِينَا وَمَا خَلۡفَنَا وَمَا بَيۡنَ ذَٰلِكَۚ وَمَا كَانَ رَبُّكَ نَسِيّٗا",
        "phonetic": "19.64 Wa Mā Natanazzalu 'Illā Bi'amri Rabbika Lahu Mā Bayna 'Aydīnā Wa Mā Khalfanā Wa Mā Bayna Dhālika Wa Mā Kāna Rabbuka Nasīyāan",
        "footnotes": {
            "english_saheeh": "[821]- In answer to the Prophet's wish that Gabriel would visit him more often.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Gabriel said],[821] \"And we [angels] descend not except by the order of your Lord. To Him belongs that before us and that behind us and what is in between. And never is your Lord forgetful -",
            "english_hilali_khan": "And we (angels) descend not except by the Command of your Lord (O Muhammad صلى الله عليه وسلم). To Him belongs what is before us and what is behind us, and what is between those two; and your Lord is never forgetful -",
            "english_rwwad": "[Gabriel said], “We do not descend except with the command of your Lord. To Him belongs all that is before us and all that is behind us, and all that is in between. Your Lord is never forgetful."
        }
    },
    {
        "id": 2314,
        "chapter": 19,
        "verse": 65,
        "arabic_text": "رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا فَٱعۡبُدۡهُ وَٱصۡطَبِرۡ لِعِبَٰدَتِهِۦۚ هَلۡ تَعۡلَمُ لَهُۥ سَمِيّٗا",
        "phonetic": "19.65 Rabbu As-Samāwāti Wa Al-'Arđi Wa Mā Baynahumā Fā`bud/hu Wa Aşţabir Li`ibādatihi Hal Ta`lamu Lahu Samīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:65) See the footnote of (V.3:73).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Lord of the heavens and the earth and whatever is between them - so worship Him and have patience for His worship. Do you know of any similarity to Him?\"",
            "english_hilali_khan": "Lord of the heavens and the earth, and all that is between them, so worship Him (Alone) and be constant and patient in His worship. Do you know of any who is similar to Him? (of course none is similar or co-equal or comparable to Him, and He has none as partner with Him). [There is nothing like Him and He is the All-Hearer, the All-Seer].[1]",
            "english_rwwad": "Lord of the heavens and earth and all that is between them. So worship Him and be constant in worshiping Him. Do you know anyone equal to Him?”"
        }
    },
    {
        "id": 2315,
        "chapter": 19,
        "verse": 66,
        "arabic_text": "وَيَقُولُ ٱلۡإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوۡفَ أُخۡرَجُ حَيًّا",
        "phonetic": "19.66 Wa Yaqūlu Al-'Insānu 'A'idhā Mā Mittu Lasawfa 'Ukhraju Ĥayyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And man [i.e., the disbeliever] says, \"When I have died, am I going to be brought forth alive?\"",
            "english_hilali_khan": "And man (the disbeliever) says: \"When I am dead, shall I then be raised up alive?\"",
            "english_rwwad": "Man says, “Once I am dead, will I be raised to life again?”"
        }
    },
    {
        "id": 2316,
        "chapter": 19,
        "verse": 67,
        "arabic_text": "أَوَلَا يَذۡكُرُ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن قَبۡلُ وَلَمۡ يَكُ شَيۡـٔٗا",
        "phonetic": "19.67 'Awalā Yadhkuru Al-'Insānu 'Annā Khalaqnāhu Min Qablu Wa Lam Yaku Shay'āan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Does man not remember that We created him before, while he was nothing?",
            "english_hilali_khan": "Does not man remember that We created him before, while he was nothing?",
            "english_rwwad": "Does man not remember that We created him beforehand, when he was nothing?"
        }
    },
    {
        "id": 2317,
        "chapter": 19,
        "verse": 68,
        "arabic_text": "فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا",
        "phonetic": "19.68 Fawarabbika Lanaĥshurannahum Wa Ash-Shayāţīna Thumma Lanuĥđirannahum Ĥawla Jahannama Jithīyāan",
        "footnotes": {
            "english_saheeh": "[822]- i.e., fallen on their knees from terror or dragged there unwillingly on their knees.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.[822]",
            "english_hilali_khan": "So by your Lord, surely, We shall gather them together, and (also) the Shayâtîn (devils) (with them), then We shall bring them round Hell on their knees.",
            "english_rwwad": "By your Lord, We will surely gather them and the devils, then We will surely bring them all around Hell on their knees."
        }
    },
    {
        "id": 2318,
        "chapter": 19,
        "verse": 69,
        "arabic_text": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمۡ أَشَدُّ عَلَى ٱلرَّحۡمَٰنِ عِتِيّٗا",
        "phonetic": "19.69 Thumma Lananzi`anna Min Kulli Shī`atin 'Ayyuhum 'Ashaddu `Alá Ar-Raĥmāni `Itīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.",
            "english_hilali_khan": "Then indeed We shall drag out from every sect all those who were worst in obstinate rebellion against the Most Gracious (Allâh).",
            "english_rwwad": "Then We will surely drag out of every group those who were most rebellious against the Most Compassionate."
        }
    },
    {
        "id": 2319,
        "chapter": 19,
        "verse": 70,
        "arabic_text": "ثُمَّ لَنَحۡنُ أَعۡلَمُ بِٱلَّذِينَ هُمۡ أَوۡلَىٰ بِهَا صِلِيّٗا",
        "phonetic": "19.70 Thumma Lanaĥnu 'A`lamu Bial-Ladhīna Hum 'Awlá Bihā Şilīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, surely it is We who are most knowing of those most worthy of burning therein.",
            "english_hilali_khan": "Then, verily, We know best those who are most worthy of being burnt therein.",
            "english_rwwad": "For indeed We know best those who are most deserving to burn therein."
        }
    },
    {
        "id": 2320,
        "chapter": 19,
        "verse": 71,
        "arabic_text": "وَإِن مِّنكُمۡ إِلَّا وَارِدُهَاۚ كَانَ عَلَىٰ رَبِّكَ حَتۡمٗا مَّقۡضِيّٗا",
        "phonetic": "19.71 Wa 'In Minkum 'Illā Wa Ariduhā Kāna `Alá Rabbika Ĥatmāan Maqđīyāan",
        "footnotes": {
            "english_saheeh": "[823]- i.e., be exposed to it.  However, the people of Paradise will not be harmed thereby.",
            "english_hilali_khan": "(V.19:71) See the footnote (C) of (V.68:42).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there is none of you except he will come to it.[823] This is upon your Lord an inevitability decreed.",
            "english_hilali_khan": "There is not one of you but will pass over it (Hell): this is with your Lord; a Decree which must be accomplished.[2]",
            "english_rwwad": "There is none among you except that he will pass over it; a decree from your Lord that must be fulfilled."
        }
    },
    {
        "id": 2321,
        "chapter": 19,
        "verse": 72,
        "arabic_text": "ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا",
        "phonetic": "19.72 Thumma Nunajjī Al-Ladhīna Attaqaw Wa Nadharu Až-Žālimīna Fīhā Jithīyāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We will save those who feared Allāh and leave the wrongdoers within it, on their knees.",
            "english_hilali_khan": "Then We shall save those who used to fear Allâh and were dutiful to Him. And We shall leave the Zâlimûn (polytheists and wrongdoers) therein (humbled) to their knees (in Hell).",
            "english_rwwad": "Then We will save those who fear Allah and will leave the wrongdoers in it on their knees."
        }
    },
    {
        "id": 2322,
        "chapter": 19,
        "verse": 73,
        "arabic_text": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَيُّ ٱلۡفَرِيقَيۡنِ خَيۡرٞ مَّقَامٗا وَأَحۡسَنُ نَدِيّٗا",
        "phonetic": "19.73 Wa 'Idhā Tutlá `Alayhim 'Āyātunā Bayyinātin Qāla Al-Ladhīna Kafarū Lilladhīna 'Āmanū 'Ayyu Al-Farīqayni Khayrun Maqāmāan Wa 'Aĥsanu Nadīyāan",
        "footnotes": {
            "english_saheeh": "[824]- In regard to worldly interests.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Our verses are recited to them as clear evidences, those who disbelieve say to those who believe, \"Which of [our] two parties is best in position and best in association?\"[824]",
            "english_hilali_khan": "And when Our Clear Verses are recited to them, those who disbelieve (the rich and strong among the pagans of Quraish who live a life of luxury) say to those who believe (the weak, poor companions of Prophet Muhammad صلى الله عليه وسلم who have a hard life): \"Which of the two groups (i.e. believers or disbelievers) is best in (point of) position and as regards station (place of council for consultation).\"",
            "english_rwwad": "When Our verses are recited to them in all their clarity, the disbelievers say to the believers, “Which of the two parties is better in terms of dwellings and superior in social gatherings?”"
        }
    },
    {
        "id": 2323,
        "chapter": 19,
        "verse": 74,
        "arabic_text": "وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَحۡسَنُ أَثَٰثٗا وَرِءۡيٗا",
        "phonetic": "19.74 Wa Kam 'Ahlaknā Qablahum Min Qarnin Hum 'Aĥsanu 'Athāthāan Wa Ri'yāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how many a generation have We destroyed before them who were better in possessions and [outward] appearance?",
            "english_hilali_khan": "And how many a generation (past nations) have We destroyed before them, who were better in wealth, goods and outward appearance?",
            "english_rwwad": "How many generations We have destroyed before them who were superior in terms of wealth and outward appearance!"
        }
    },
    {
        "id": 2324,
        "chapter": 19,
        "verse": 75,
        "arabic_text": "قُلۡ مَن كَانَ فِي ٱلضَّلَٰلَةِ فَلۡيَمۡدُدۡ لَهُ ٱلرَّحۡمَٰنُ مَدًّاۚ حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ إِمَّا ٱلۡعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعۡلَمُونَ مَنۡ هُوَ شَرّٞ مَّكَانٗا وَأَضۡعَفُ جُندٗا",
        "phonetic": "19.75 Qul Man Kāna Fī Ađ-Đalālati Falyamdud Lahu Ar-Raĥmānu Maddāan Ĥattá 'Idhā Ra'aw Mā Yū`adūna 'Immā Al-`Adhāba Wa 'Immā As-Sā`ata Fasaya`lamūna Man Huwa Sharrun Makānāan Wa 'Ađ`afu Jundāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Whoever is in error - let the Most Merciful extend for him an extension [in wealth and time] until, when they see that which they were promised - either punishment [in this world] or the Hour [of resurrection] - they will come to know who is worst in position and weaker in soldiers.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم) whoever is in error, the Most Gracious (Allâh) will extend (the rope) to him, until, when they see that which they were promised, either the torment or the Hour, they will come to know who is worst in position, and who is weaker in forces. [This is the answer to the question in Verse No.19:73]",
            "english_rwwad": "Say, “Whoever is following misguidance, the Most Compassionate will give him respite, until they see what they were warned of – be it the punishment [in this world] or the Hour – only then will they realize who is in a worse abode and who has a smaller following.”"
        }
    },
    {
        "id": 2325,
        "chapter": 19,
        "verse": 76,
        "arabic_text": "وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهۡتَدَوۡاْ هُدٗىۗ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٞ مَّرَدًّا",
        "phonetic": "19.76 Wa Yazīdu Allāhu Al-Ladhīna Ahtadaw Hudáan Wa Al-Bāqiyātu Aş-Şāliĥātu Khayrun `Inda Rabbika Thawābāan Wa Khayrun Maraddāan",
        "footnotes": {
            "english_saheeh": "[825]- i.e., in the sight or evaluation of Allāh.",
            "english_hilali_khan": "(V.19:76) those who walk aright i.e. the true believers in the Oneness of Allâh - who fear Allâh much (abstain from all kinds of sins and evil deeds which He has forbidden), and love Allâh much (perform all kinds of good deeds which He has ordained).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Allāh increases those who were guided, in guidance, and the enduring good deeds are better to your Lord[825] for reward and better for recourse.",
            "english_hilali_khan": "And Allâh increases in guidance those who walk aright.[3] And the righteous good deeds that last, are better with your Lord, for reward and better for resort.",
            "english_rwwad": "Allah increases in guidance those who are guided, and the righteous deeds of lasting merit are better with your Lord in reward and better in return."
        }
    },
    {
        "id": 2326,
        "chapter": 19,
        "verse": 77,
        "arabic_text": "أَفَرَءَيۡتَ ٱلَّذِي كَفَرَ بِـَٔايَٰتِنَا وَقَالَ لَأُوتَيَنَّ مَالٗا وَوَلَدًا",
        "phonetic": "19.77 'Afara'ayta Al-Ladhī Kafara Bi'āyātinā Wa Qāla La'ūtayanna Mālāan Wa Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, have you seen he who disbelieved in Our verses and said, \"I will surely be given wealth and children [in the next life]\"?",
            "english_hilali_khan": "Have you seen him who disbelieved in Our Ayât (this Qur’ân and Muhammad صلى الله عليه وسلم) and said: \"I shall certainly be given wealth and children [if I will be alive (again)].\"",
            "english_rwwad": "Have you seen the one who rejects Our verses and says, “I will surely be given wealth and children [if I am resurrected]?”"
        }
    },
    {
        "id": 2327,
        "chapter": 19,
        "verse": 78,
        "arabic_text": "أَطَّلَعَ ٱلۡغَيۡبَ أَمِ ٱتَّخَذَ عِندَ ٱلرَّحۡمَٰنِ عَهۡدٗا",
        "phonetic": "19.78 'Āţţala`a Al-Ghayba 'Am Attakhadha `Inda Ar-Raĥmāni `Ahdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Has he looked into the unseen, or has he taken from the Most Merciful a promise?",
            "english_hilali_khan": "Has he known the Unseen or has he taken a covenant from the Most Gracious (Allâh)?",
            "english_rwwad": "Has he obtained knowledge of the unseen, or has he taken a pledge with the Most Compassionate?"
        }
    },
    {
        "id": 2328,
        "chapter": 19,
        "verse": 79,
        "arabic_text": "كـَلَّاۚ سَنَكۡتُبُ مَا يَقُولُ وَنَمُدُّ لَهُۥ مِنَ ٱلۡعَذَابِ مَدّٗا",
        "phonetic": "19.79 Kallā Sanaktubu Mā Yaqūlu Wa Namuddu Lahu Mina Al-`Adhābi Maddāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "No! We will record what he says and extend [i.e., increase] for him from the punishment extensively.",
            "english_hilali_khan": "Nay, We shall record what he says, and We shall increase his torment (in the Hell);",
            "english_rwwad": "Never! We will write down what he says and will prolong his punishment extensively."
        }
    },
    {
        "id": 2329,
        "chapter": 19,
        "verse": 80,
        "arabic_text": "وَنَرِثُهُۥ مَا يَقُولُ وَيَأۡتِينَا فَرۡدٗا",
        "phonetic": "19.80 Wa Narithuhu Mā Yaqūlu Wa Ya'tīnā Fardāan",
        "footnotes": {
            "english_saheeh": "[826]- Instead of giving him wealth and children in the Hereafter, Allāh will take from him those he had in worldly life at the time of his death.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will inherit him [in] what he mentions,[826] and he will come to Us alone.",
            "english_hilali_khan": "And We shall inherit from him (at his death) all that he talks of (i.e. wealth and children which We have bestowed upon him in this world), and he shall come to Us alone.",
            "english_rwwad": "We will inherit what he boasts of, and he will come to Us all alone."
        }
    },
    {
        "id": 2330,
        "chapter": 19,
        "verse": 81,
        "arabic_text": "وَٱتَّخَذُواْ مِن دُونِ ٱللَّهِ ءَالِهَةٗ لِّيَكُونُواْ لَهُمۡ عِزّٗا",
        "phonetic": "19.81 Wa Attakhadhū Min Dūni Allāhi 'Ālihatan Liyakūnū Lahum `Izzāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they have taken besides Allāh [false] deities that they would be for them [a source of] honor.",
            "english_hilali_khan": "And they have taken (for worship) âlihah (gods) besides Allâh, that they might give them honour, power and glory (and also protect them from Allâh’s punishment).",
            "english_rwwad": "They have taken gods other than Allah, in order that they may protect them [from punishment]."
        }
    },
    {
        "id": 2331,
        "chapter": 19,
        "verse": 82,
        "arabic_text": "كـَلَّاۚ سَيَكۡفُرُونَ بِعِبَادَتِهِمۡ وَيَكُونُونَ عَلَيۡهِمۡ ضِدًّا",
        "phonetic": "19.82 Kallā Sayakfurūna Bi`ibādatihim Wa Yakūnūna `Alayhim Điddāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "No! They [i.e., those \"gods\"] will deny their worship of them and will be against them opponents [on the Day of Judgement].",
            "english_hilali_khan": "Nay, but they (the so-called gods) will deny their worship of them, and become opponents to them (on the Day of Resurrection).",
            "english_rwwad": "Never! They will deny their worship and will become their enemies."
        }
    },
    {
        "id": 2332,
        "chapter": 19,
        "verse": 83,
        "arabic_text": "أَلَمۡ تَرَ أَنَّآ أَرۡسَلۡنَا ٱلشَّيَٰطِينَ عَلَى ٱلۡكَٰفِرِينَ تَؤُزُّهُمۡ أَزّٗا",
        "phonetic": "19.83 'Alam Tara 'Annā 'Arsalnā Ash-Shayāţīna `Alá Al-Kāfirīna Ta'uuzzuhum 'Azzāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do you not see that We have sent the devils upon the disbelievers, inciting them [to evil] with [constant] incitement?",
            "english_hilali_khan": "See you not that We have sent the Shayâtîn (devils) against the disbelievers to push them to do evil.",
            "english_rwwad": "Do you not see that We sent devils against the disbelievers constantly inciting them to sin?"
        }
    },
    {
        "id": 2333,
        "chapter": 19,
        "verse": 84,
        "arabic_text": "فَلَا تَعۡجَلۡ عَلَيۡهِمۡۖ إِنَّمَا نَعُدُّ لَهُمۡ عَدّٗا",
        "phonetic": "19.84 Falā Ta`jal `Alayhim 'Innamā Na`uddu Lahum `Addāan",
        "footnotes": {
            "english_saheeh": "[827]- Of breaths, of days, or of evil deeds.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So be not impatient over them. We only count out [i.e., allow] to them a [limited] number.[827]",
            "english_hilali_khan": "So make no haste against them; We only count out to them a (limited) number (of the days of the life of this world and delay their term so that they may increase in evil and sins).",
            "english_rwwad": "So do not be in haste about them; We are surely counting down their days."
        }
    },
    {
        "id": 2334,
        "chapter": 19,
        "verse": 85,
        "arabic_text": "يَوۡمَ نَحۡشُرُ ٱلۡمُتَّقِينَ إِلَى ٱلرَّحۡمَٰنِ وَفۡدٗا",
        "phonetic": "19.85 Yawma Naĥshuru Al-Muttaqīna 'Ilá Ar-Raĥmāni Wafdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day We will gather the righteous to the Most Merciful as a delegation",
            "english_hilali_khan": "unto the Most Gracious (Allâh), like a delegation (presented before a king for honour).",
            "english_rwwad": "The Day when We will gather the righteous before the Most Compassionate as honored guests,"
        }
    },
    {
        "id": 2335,
        "chapter": 19,
        "verse": 86,
        "arabic_text": "وَنَسُوقُ ٱلۡمُجۡرِمِينَ إِلَىٰ جَهَنَّمَ وِرۡدٗا",
        "phonetic": "19.86 Wa Nasūqu Al-Mujrimīna 'Ilá Jahannama Wirdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And will drive the criminals to Hell in thirst",
            "english_hilali_khan": "And We shall drive the Mujrimûn (polytheists, sinners, criminals, disbelievers in the Oneness of Allâh) to Hell, in a thirsty state (like a thirsty herd driven down to water).",
            "english_rwwad": "and We will drive the wicked to Hell like a thirsty herd."
        }
    },
    {
        "id": 2336,
        "chapter": 19,
        "verse": 87,
        "arabic_text": "لَّا يَمۡلِكُونَ ٱلشَّفَٰعَةَ إِلَّا مَنِ ٱتَّخَذَ عِندَ ٱلرَّحۡمَٰنِ عَهۡدٗا",
        "phonetic": "19.87 Lā Yamlikūna Ash-Shafā`ata 'Illā Mani Attakhadha `Inda Ar-Raĥmāni `Ahdāan",
        "footnotes": {
            "english_saheeh": "[828]- Not to worship other than Him.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "None will have [power of] intercession except he who had taken from the Most Merciful a covenant.[828]",
            "english_hilali_khan": "None shall have the power of intercession, but such a one as has received permission (or promise) from the Most Gracious (Allâh).",
            "english_rwwad": "None will have the power to intercede except those who have taken permission from the Most Compassionate."
        }
    },
    {
        "id": 2337,
        "chapter": 19,
        "verse": 88,
        "arabic_text": "وَقَالُواْ ٱتَّخَذَ ٱلرَّحۡمَٰنُ وَلَدٗا",
        "phonetic": "19.88 Wa Qālū Attakhadha Ar-Raĥmānu Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"The Most Merciful has taken [for Himself] a son.\"",
            "english_hilali_khan": "And they say: \"The Most Gracious (Allâh) has begotten a son (or offspring or children) [as the Jews say: ‘Uzair (Ezra) is the son of Allâh, and the Christians say that He has begotten a son [‘Îsâ (Jesus) عليه السلام], and the pagan Arabs say that He has begotten daughters (angels and others.)].\"",
            "english_rwwad": "They say, “The Most Compassionate has begotten a son.”"
        }
    },
    {
        "id": 2338,
        "chapter": 19,
        "verse": 89,
        "arabic_text": "لَّقَدۡ جِئۡتُمۡ شَيۡـًٔا إِدّٗا",
        "phonetic": "19.89 Laqad Ji'tum Shay'āan 'Iddāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "You have done an atrocious thing.",
            "english_hilali_khan": "Indeed you have brought forth (said) a terrible evil thing.",
            "english_rwwad": "You have made a monstrous statement,"
        }
    },
    {
        "id": 2339,
        "chapter": 19,
        "verse": 90,
        "arabic_text": "تَكَادُ ٱلسَّمَٰوَٰتُ يَتَفَطَّرۡنَ مِنۡهُ وَتَنشَقُّ ٱلۡأَرۡضُ وَتَخِرُّ ٱلۡجِبَالُ هَدًّا",
        "phonetic": "19.90 Takādu As-Samāwātu Yatafaţţarna Minhu Wa Tanshaqqu Al-'Arđu Wa Takhirru Al-Jibālu Haddāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The heavens almost rupture therefrom and the earth splits open and the mountains collapse in devastation",
            "english_hilali_khan": "Whereby the heavens are almost torn, and the earth is split asunder, and the mountains fall in ruins,",
            "english_rwwad": "at which the heavens are about to be torn apart, the earth split asunder, and the mountains tumble down."
        }
    },
    {
        "id": 2340,
        "chapter": 19,
        "verse": 91,
        "arabic_text": "أَن دَعَوۡاْ لِلرَّحۡمَٰنِ وَلَدٗا",
        "phonetic": "19.91 'An Da`aw Lilrraĥmani Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That they attribute to the Most Merciful a son.",
            "english_hilali_khan": "That they ascribe a son (or offspring or children) to the Most Gracious (Allâh).",
            "english_rwwad": "because they have ascribed to the Most Compassionate a son."
        }
    },
    {
        "id": 2341,
        "chapter": 19,
        "verse": 92,
        "arabic_text": "وَمَا يَنۢبَغِي لِلرَّحۡمَٰنِ أَن يَتَّخِذَ وَلَدًا",
        "phonetic": "19.92 Wa Mā Yanbaghī Lilrraĥmani 'An Yattakhidha Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is not appropriate for the Most Merciful that He should take a son.",
            "english_hilali_khan": "But it is not suitable for (the Majesty of) the Most Gracious (Allâh) that He should beget a son (or offspring or children).",
            "english_rwwad": "It is not appropriate for the Most Compassionate to beget a son."
        }
    },
    {
        "id": 2342,
        "chapter": 19,
        "verse": 93,
        "arabic_text": "إِن كُلُّ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ إِلَّآ ءَاتِي ٱلرَّحۡمَٰنِ عَبۡدٗا",
        "phonetic": "19.93 'In Kullu Man Fī As-Samāwāti Wa Al-'Arđi 'Illā 'Ātī Ar-Raĥmāni `Abdāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There is no one in the heavens and earth but that he comes to the Most Merciful as a servant.",
            "english_hilali_khan": "There is none in the heavens and the earth but comes unto the Most Gracious (Allâh) as a slave.",
            "english_rwwad": "There is none in the heavens and earth except that he will come to the Most Compassionate in full submission."
        }
    },
    {
        "id": 2343,
        "chapter": 19,
        "verse": 94,
        "arabic_text": "لَّقَدۡ أَحۡصَىٰهُمۡ وَعَدَّهُمۡ عَدّٗا",
        "phonetic": "19.94 Laqad 'Aĥşāhum Wa `Addahum `Addāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He has enumerated them and counted them a [full] counting.",
            "english_hilali_khan": "Verily He knows each one of them, and has counted them a full counting.",
            "english_rwwad": "He has counted them and numbered them precisely."
        }
    },
    {
        "id": 2344,
        "chapter": 19,
        "verse": 95,
        "arabic_text": "وَكُلُّهُمۡ ءَاتِيهِ يَوۡمَ ٱلۡقِيَٰمَةِ فَرۡدًا",
        "phonetic": "19.95 Wa Kulluhum 'Ātīhi Yawma Al-Qiyāmati Fardāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And all of them are coming to Him on the Day of Resurrection alone.",
            "english_hilali_khan": "And everyone of them will come to Him alone on the Day of Resurrection (without any helper, or protector or defender).",
            "english_rwwad": "Each one of them will come to Him on the Day of Resurrection all alone."
        }
    },
    {
        "id": 2345,
        "chapter": 19,
        "verse": 96,
        "arabic_text": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَيَجۡعَلُ لَهُمُ ٱلرَّحۡمَٰنُ وُدّٗا",
        "phonetic": "19.96 'Inna Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Sayaj`alu Lahumu Ar-Raĥmānu Wuddāan",
        "footnotes": {
            "english_saheeh": "[829]- From Himself and from among each other.",
            "english_hilali_khan": "(V.19:96) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"If Allâh loves a person, He calls Jibrîl (Gabriel) saying: Allâh loves so and so; O Jibrîl (Gabriel) love him.’ Jibrîl (Gabriel) would love him, and then Jibrîl (Gabriel) would make an announcement among the residents of the heavens, ‘Allâh loves so-and-so, therefore, you should love him also.’ So, all the residents of the heavens would love him and then he is granted the pleasure of the people of the earth.\" (Sahih Al-Bukhari, Vol. 8, Hadith No. 66).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection.[829]",
            "english_hilali_khan": "Verily, those who believe [in the Oneness of Allâh and in His Messenger (Muhammad صلى الله عليه وسلم)] and work deeds of righteousness, the Most Gracious (Allâh) will bestow love for them[1] (in the hearts of the believers).",
            "english_rwwad": "Those who believe and do righteous deeds, the Most Compassionate will endear them [to His creation]."
        }
    },
    {
        "id": 2346,
        "chapter": 19,
        "verse": 97,
        "arabic_text": "فَإِنَّمَا يَسَّرۡنَٰهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ ٱلۡمُتَّقِينَ وَتُنذِرَ بِهِۦ قَوۡمٗا لُّدّٗا",
        "phonetic": "19.97 Fa'innamā Yassarnāhu Bilisānika Litubashira Bihi Al-Muttaqīna Wa Tundhira Bihi Qawmāan Luddāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.19:97) Ludd:- The people who don’t believe in Allâh’s Oneness and His Prophet’s message and argue about everything that Allâh has ordained.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So, [O Muḥammad], We have only made it [i.e., the Qur’ān] easy in your tongue [i.e., the Arabic language] that you may give good tidings thereby to the righteous and warn thereby a hostile people.",
            "english_hilali_khan": "So We have made this (the Qur’ân) easy in your own tongue (O Muhammad صلى الله عليه وسلم), only that you may give glad tidings to the Muttaqûn (the pious - See V.2:2), and warn with it the Ludd[2] (most quarrelsome) people.",
            "english_rwwad": "We have made this [Qur’an] easy on your language so that you may give thereby glad tidings to the righteous and warn people who are contentious."
        }
    },
    {
        "id": 2347,
        "chapter": 19,
        "verse": 98,
        "arabic_text": "وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هَلۡ تُحِسُّ مِنۡهُم مِّنۡ أَحَدٍ أَوۡ تَسۡمَعُ لَهُمۡ رِكۡزَۢا",
        "phonetic": "19.98 Wa Kam 'Ahlaknā Qablahum Min Qarnin Hal Tuĥissu Minhum Min 'Aĥadin 'Aw Tasma`u Lahum Rikzāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how many have We destroyed before them of generations? Do you perceive of them anyone or hear from them a sound?",
            "english_hilali_khan": "And how many a generation before them have We destroyed! Can you (O Muhammad صلى الله عليه وسلم) find a single one of them or hear even a whisper of them?",
            "english_rwwad": "How many generations We destroyed before them! Do you sense a single one of them or even hear from them a whisper?"
        }
    }
]