[
    {
        "id": 2855,
        "chapter": 25,
        "verse": 1,
        "arabic_text": "تَبَارَكَ ٱلَّذِي نَزَّلَ ٱلۡفُرۡقَانَ عَلَىٰ عَبۡدِهِۦ لِيَكُونَ لِلۡعَٰلَمِينَ نَذِيرًا",
        "phonetic": "25.1 Tabāraka Al-Ladhī Nazzala Al-Furqāna `Alá `Abdihi Liyakūna Lil`ālamīna Nadhīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -",
            "english_hilali_khan": "Blessed be He Who sent down the criterion (of right and wrong, i.e. this Qur’ân) to His slave (Muhammad صلى الله عليه وسلم) that he may be a warner to the ‘Âlamîn (mankind and jinn).",
            "english_rwwad": "Blessed is the One Who has sent down the Criterion to His slave, so that he may be a warner to the worlds,"
        }
    },
    {
        "id": 2856,
        "chapter": 25,
        "verse": 2,
        "arabic_text": "ٱلَّذِي لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَمۡ يَتَّخِذۡ وَلَدٗا وَلَمۡ يَكُن لَّهُۥ شَرِيكٞ فِي ٱلۡمُلۡكِ وَخَلَقَ كُلَّ شَيۡءٖ فَقَدَّرَهُۥ تَقۡدِيرٗا",
        "phonetic": "25.2 Al-Ladhī Lahu Mulku As-Samāwāti Wa Al-'Arđi Wa Lam Yattakhidh Waladāan Wa Lam Yakun Lahu Sharīkun Fī Al-Mulki Wa Khalaqa Kulla Shay'in Faqaddarahu Taqdīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He to whom belongs the dominion of the heavens and the earth and who has not taken a son and has not had a partner in dominion and has created each thing and determined it with [precise] determination.",
            "english_hilali_khan": "He to Whom belongs the dominion of the heavens and the earth, and Who has begotten no son (children or offspring) and for Whom there is no partner in the dominion. He has created everything, and has measured it exactly according to its due measurements.",
            "english_rwwad": "He to Whom belongs the dominion of the heavens and earth, Who has never begotten a son, and has no partner in His dominion. He has created everything and measured it precisely."
        }
    },
    {
        "id": 2857,
        "chapter": 25,
        "verse": 3,
        "arabic_text": "وَٱتَّخَذُواْ مِن دُونِهِۦٓ ءَالِهَةٗ لَّا يَخۡلُقُونَ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ وَلَا يَمۡلِكُونَ لِأَنفُسِهِمۡ ضَرّٗا وَلَا نَفۡعٗا وَلَا يَمۡلِكُونَ مَوۡتٗا وَلَا حَيَوٰةٗ وَلَا نُشُورٗا",
        "phonetic": "25.3 Wa Attakhadhū Min Dūnihi 'Ālihatan Lā Yakhluqūna Shay'āan Wa Hum Yukhlaqūna Wa Lā Yamlikūna Li'nfusihim Đarrāan Wa Lā Naf`āan Wa Lā Yamlikūna Mawtāan Wa Lā Ĥayāatan Wa Lā Nushūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they have taken besides Him gods which create nothing, while they are created, and possess not for themselves any harm or benefit and possess not [power to cause] death or life or resurrection.",
            "english_hilali_khan": "3. Yet they have taken besides Him other alîhâh (gods) who created nothing but are themselves created, and possess neither harm nor benefit for themselves, and possess no power (of causing) death, nor (of giving) life, nor of raising the dead.",
            "english_rwwad": "They have taken besides Him other gods who can create nothing but are themselves created. Nor do they have power to harm or benefit themselves, nor do they have power to cause death, give life or resurrect the dead."
        }
    },
    {
        "id": 2858,
        "chapter": 25,
        "verse": 4,
        "arabic_text": "وَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّآ إِفۡكٌ ٱفۡتَرَىٰهُ وَأَعَانَهُۥ عَلَيۡهِ قَوۡمٌ ءَاخَرُونَۖ فَقَدۡ جَآءُو ظُلۡمٗا وَزُورٗا",
        "phonetic": "25.4 Wa Qāla Al-Ladhīna Kafarū 'In Hādhā 'Illā 'Ifkun Aftarāhu Wa 'A`ānahu `Alayhi Qawmun 'Ākharūna Faqad Jā'ū Žulmāan Wa Zūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who disbelieve say, \"This [Qur’ān] is not except a falsehood he invented, and another people assisted him in it.\" But they have committed an injustice and a lie.",
            "english_hilali_khan": "Those who disbelieve say: \"This (the Qur’ân) is nothing but a lie that he (Muhammad صلى الله عليه وسلم) has invented, and others have helped him at it. In fact they have produced an unjust wrong (thing) and a lie.\"",
            "english_rwwad": "Those who disbelieve say, “This [Qur’an] is nothing but a lie which he has fabricated, with the help of other people.” What they claim is totally unjust and false."
        }
    },
    {
        "id": 2859,
        "chapter": 25,
        "verse": 5,
        "arabic_text": "وَقَالُوٓاْ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٱكۡتَتَبَهَا فَهِيَ تُمۡلَىٰ عَلَيۡهِ بُكۡرَةٗ وَأَصِيلٗا",
        "phonetic": "25.5 Wa Qālū 'Asāţīru Al-'Awwalīna Aktatabahā Fahiya Tumlá `Alayhi Bukratan Wa 'Aşīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"Legends of the former peoples which he has written down, and they are dictated to him morning and afternoon.\"",
            "english_hilali_khan": "And they say: \"Tales of the ancients, which he has written down: and they are dictated to him morning and afternoon.\"",
            "english_rwwad": "And they say, “Ancient fables which he has written down; they are dictated to him morning and evening.”"
        }
    },
    {
        "id": 2860,
        "chapter": 25,
        "verse": 6,
        "arabic_text": "قُلۡ أَنزَلَهُ ٱلَّذِي يَعۡلَمُ ٱلسِّرَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّهُۥ كَانَ غَفُورٗا رَّحِيمٗا",
        "phonetic": "25.6 Qul 'Anzalahu Al-Ladhī Ya`lamu As-Sirra Fī As-Samāwāti Wa Al-'Arđi 'Innahu Kāna Ghafūrāan Raĥīmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"It has been revealed by He who knows [every] secret within the heavens and the earth. Indeed, He is ever Forgiving and Merciful.\"",
            "english_hilali_khan": "Say: \"It (this Qur’ân) has been sent down by Him (Allâh) (the Real Lord of the heavens and earth) Who knows the secret of the heavens and the earth. Truly, He is Oft-Forgiving, Most Merciful.\"",
            "english_rwwad": "Say, “It has been sent down by the One Who knows the secrets of the heavens and earth. He is All-Forgiving, Most Merciful.”"
        }
    },
    {
        "id": 2861,
        "chapter": 25,
        "verse": 7,
        "arabic_text": "وَقَالُواْ مَالِ هَٰذَا ٱلرَّسُولِ يَأۡكُلُ ٱلطَّعَامَ وَيَمۡشِي فِي ٱلۡأَسۡوَاقِ لَوۡلَآ أُنزِلَ إِلَيۡهِ مَلَكٞ فَيَكُونَ مَعَهُۥ نَذِيرًا",
        "phonetic": "25.7 Wa Qālū Māli Hādhā Ar-Rasūli Ya'kulu Aţ-Ţa`āma Wa Yamshī Fī Al-'Aswāqi Lawlā 'Unzila 'Ilayhi Malakun Fayakūna Ma`ahu Nadhīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"What is this messenger that eats food and walks in the markets? Why was there not sent down to him an angel so he would be with him a warner?",
            "english_hilali_khan": "And they say: \"Why does this Messenger (Muhammad صلى الله عليه وسلم) eat food, and walk about in the markets (as we). Why is not an angel sent down to him to be a warner with him?",
            "english_rwwad": "And they say, “What kind of messenger is this who eats food and walks in the markets? If only an angel had been sent down to him to be a warner with him,"
        }
    },
    {
        "id": 2862,
        "chapter": 25,
        "verse": 8,
        "arabic_text": "أَوۡ يُلۡقَىٰٓ إِلَيۡهِ كَنزٌ أَوۡ تَكُونُ لَهُۥ جَنَّةٞ يَأۡكُلُ مِنۡهَاۚ وَقَالَ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا",
        "phonetic": "25.8 'Aw Yulqá 'Ilayhi Kanzun 'Aw Takūnu Lahu Jannatun Ya'kulu Minhā Wa Qāla Až-Žālimūna 'In Tattabi`ūna 'Illā Rajulāan Masĥūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?\" And the wrongdoers say, \"You follow not but a man affected by magic.\"",
            "english_hilali_khan": "\"Or (why) has not a treasure been granted to him, or why has he not a garden whereof he may eat?\" And the Zâlimûn (polytheists and wrong-doers) say: \"You follow none but a man bewitched.\"",
            "english_rwwad": "or a treasure had been cast down to him, or he had a garden to eat from it.” The wrongdoers say, “You are following none but a bewitched man.”"
        }
    },
    {
        "id": 2863,
        "chapter": 25,
        "verse": 9,
        "arabic_text": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَٰلَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا",
        "phonetic": "25.9 Anžur Kayfa Đarabū Laka Al-'Amthāla Fađallū Falā Yastaţī`ūna Sabīlāan",
        "footnotes": {
            "english_saheeh": "[1009]- From their own imaginations in order to deny and discredit you.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Look how they strike for you comparisons;[1009] but they have strayed, so they cannot [find] a way.",
            "english_hilali_khan": "See how they coin similitudes for you, so they have gone astray, and they cannot find a (Right) Path.",
            "english_rwwad": "See how they call you names. Thus they have gone astray and cannot find a way."
        }
    },
    {
        "id": 2864,
        "chapter": 25,
        "verse": 10,
        "arabic_text": "تَبَارَكَ ٱلَّذِيٓ إِن شَآءَ جَعَلَ لَكَ خَيۡرٗا مِّن ذَٰلِكَ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ وَيَجۡعَل لَّكَ قُصُورَۢا",
        "phonetic": "25.10 Tabāraka Al-Ladhī 'In Shā'a Ja`ala Laka Khayrāan Min Dhālika Jannātin Tajrī Min Taĥtihā Al-'Anhāru Wa Yaj`al Laka Quşūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Blessed is He who, if He willed, could have made for you [something] better than that - gardens beneath which rivers flow - and could make for you palaces.",
            "english_hilali_khan": "Blessed be He Who, if He wills will assign you better than (all) that - Gardens under which rivers flow (Paradise) and will assign you palaces (i.e. in Paradise).",
            "english_rwwad": "Blessed is He Who, if He wills, could give you better than that: gardens under which rivers flow, and could give you palaces."
        }
    },
    {
        "id": 2865,
        "chapter": 25,
        "verse": 11,
        "arabic_text": "بَلۡ كَذَّبُواْ بِٱلسَّاعَةِۖ وَأَعۡتَدۡنَا لِمَن كَذَّبَ بِٱلسَّاعَةِ سَعِيرًا",
        "phonetic": "25.11 Bal Kadhabū Bis-Sā`ati Wa 'A`tadnā Liman Kadhaba Bis-Sā`ati Sa`īrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they have denied the Hour, and We have prepared for those who deny the Hour a Blaze.",
            "english_hilali_khan": "Nay, they deny the Hour (the Day of Resurrection), and for those who deny the Hour, We have prepared a flaming Fire (i.e. Hell).",
            "english_rwwad": "But they deny the Hour, and We have prepared for those who deny the Hour a Blazing Fire."
        }
    },
    {
        "id": 2866,
        "chapter": 25,
        "verse": 12,
        "arabic_text": "إِذَا رَأَتۡهُم مِّن مَّكَانِۭ بَعِيدٖ سَمِعُواْ لَهَا تَغَيُّظٗا وَزَفِيرٗا",
        "phonetic": "25.12 'Idhā Ra'at/hum Min Makānin Ba`īdin Sami`ū Lahā Taghayyužāan Wa Zafīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "When it [i.e., the Hellfire] sees them from a distant place, they will hear its fury and roaring.",
            "english_hilali_khan": "When it (Hell) sees them from a far place, they will hear its raging and its roaring.",
            "english_rwwad": "When it sees them from a far distance, they will hear its raging and roaring."
        }
    },
    {
        "id": 2867,
        "chapter": 25,
        "verse": 13,
        "arabic_text": "وَإِذَآ أُلۡقُواْ مِنۡهَا مَكَانٗا ضَيِّقٗا مُّقَرَّنِينَ دَعَوۡاْ هُنَالِكَ ثُبُورٗا",
        "phonetic": "25.13 Wa 'Idhā 'Ulqū Minhā Makānāan Đayyiqāan Muqarranīna Da`aw Hunālika Thubūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they are thrown into a narrow place therein bound in chains, they will cry out thereupon for destruction.",
            "english_hilali_khan": "And when they shall be thrown into a narrow place thereof, chained together, they will exclaim therein for destruction.",
            "english_rwwad": "And when they are thrown into a narrow space therein, chained together, they will cry out for death."
        }
    },
    {
        "id": 2868,
        "chapter": 25,
        "verse": 14,
        "arabic_text": "لَّا تَدۡعُواْ ٱلۡيَوۡمَ ثُبُورٗا وَٰحِدٗا وَٱدۡعُواْ ثُبُورٗا كَثِيرٗا",
        "phonetic": "25.14 Lā Tad`ū Al-Yawma Thubūrāan Wāĥidāan Wa Ad`ū Thubūrāan Kathīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[They will be told], \"Do not cry this Day for one destruction but cry for much destruction.\"",
            "english_hilali_khan": "Exclaim not today for one destruction, but exclaim for many destructions.",
            "english_rwwad": "Do not cry out this Day for death only once, but cry out many times.”"
        }
    },
    {
        "id": 2869,
        "chapter": 25,
        "verse": 15,
        "arabic_text": "قُلۡ أَذَٰلِكَ خَيۡرٌ أَمۡ جَنَّةُ ٱلۡخُلۡدِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۚ كَانَتۡ لَهُمۡ جَزَآءٗ وَمَصِيرٗا",
        "phonetic": "25.15 Qul 'Adhalika Khayrun 'Am Jannatu Al-Khuldi Allatī Wu`ida Al-Muttaqūna Kānat Lahum Jazā'an Wa Maşīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Is that better or the Garden of Eternity which is promised to the righteous? It will be for them a reward and destination.",
            "english_hilali_khan": "Say: (O Muhammad صلى الله عليه وسلم) \"Is that (torment) better or the Paradise of Ete - nity which is promised to the Muttaqûn (the pious - See V.2:2)?\" It will be theirs as a reward and as a final destination.",
            "english_rwwad": "Say, “Is that better or the Eternal Paradise which has been promised to the righteous?” It will be as a reward for them and as a final destination."
        }
    },
    {
        "id": 2870,
        "chapter": 25,
        "verse": 16,
        "arabic_text": "لَّهُمۡ فِيهَا مَا يَشَآءُونَ خَٰلِدِينَۚ كَانَ عَلَىٰ رَبِّكَ وَعۡدٗا مَّسۡـُٔولٗا",
        "phonetic": "25.16 Lahum Fīhā Mā Yashā'ūna Khālidīna Kāna `Alá Rabbika Wa`dāan Mas'ūlāan",
        "footnotes": {
            "english_saheeh": "[1010]- Or \"...a promise requested [for them by the angels].\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "For them therein is whatever they wish, [while] abiding eternally. It is ever upon your Lord a promise [worthy to be] requested.[1010]",
            "english_hilali_khan": "For them there will be therein all that they desire, and they will abide (there forever). It is a promise binding upon your Lord that must be fulfilled.",
            "english_rwwad": "They will have there whatever they wish for, abiding therein forever. That is a promise that your Lord has taken upon Himself.”"
        }
    },
    {
        "id": 2871,
        "chapter": 25,
        "verse": 17,
        "arabic_text": "وَيَوۡمَ يَحۡشُرُهُمۡ وَمَا يَعۡبُدُونَ مِن دُونِ ٱللَّهِ فَيَقُولُ ءَأَنتُمۡ أَضۡلَلۡتُمۡ عِبَادِي هَٰٓؤُلَآءِ أَمۡ هُمۡ ضَلُّواْ ٱلسَّبِيلَ",
        "phonetic": "25.17 Wa Yawma Yaĥshuruhum Wa Mā Ya`budūna Min Dūni Allāhi Fayaqūlu 'A'antum 'Ađlaltum `Ibādī Hā'uulā' 'Am Hum Đallū As-Sabīla",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.25:17) Narrated Mu‘âdh bin Jabal رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"O Mu‘âdh! Do you know what Allâh’s Right upon His slaves is?\" I said, \"Allâh and His Messenger know better.\" The Prophet صلى الله عليه وسلم said, \"To worship Him (Allâh) Alone and to join none in worship with Him (Allâh). Do you know what their right upon Him is?\" I replied, \"Allâh and His Messenger know better.\" The Prophet صلى الله عليه وسلم said, \"Not to punish them (if they did so).\" (Sahih Al-Bukhari, Vol. 9, Hadith No. 470).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] the Day He will gather them and that which they worship besides Allāh and will say, \"Did you mislead these, My servants, or did they [themselves] stray from the way?\"",
            "english_hilali_khan": "And on the Day when He will gather them together and that which they worship besides Allâh [idols, angels, pious men, saints][1]. He will say: \"Was it you who misled these My slaves or did they (themselves) stray from the (Right) Path?\"",
            "english_rwwad": "On the Day when He will gather them along with those whom they worshiped besides Allah, He will say, “Did you mislead these slaves of Mine, or did they stray from the right way on their own?”"
        }
    },
    {
        "id": 2872,
        "chapter": 25,
        "verse": 18,
        "arabic_text": "قَالُواْ سُبۡحَٰنَكَ مَا كَانَ يَنۢبَغِي لَنَآ أَن نَّتَّخِذَ مِن دُونِكَ مِنۡ أَوۡلِيَآءَ وَلَٰكِن مَّتَّعۡتَهُمۡ وَءَابَآءَهُمۡ حَتَّىٰ نَسُواْ ٱلذِّكۡرَ وَكَانُواْ قَوۡمَۢا بُورٗا",
        "phonetic": "25.18 Qālū Subĥānaka Mā Kāna Yanbaghī Lanā 'An Nattakhidha Min Dūnika Min 'Awliyā'a Wa Lakin Matta`tahum Wa 'Ābā'ahum Ĥattá Nasū Adh-Dhikra Wa Kānū Qawmāan Būrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will say, \"Exalted are You! It was not for us to take besides You any allies [i.e., protectors]. But You provided comforts for them and their fathers until they forgot the message and became a people ruined.\"",
            "english_hilali_khan": "They will say: \"Glorified be You! It was not for us to take any Auliyâ’ (Protectors, Helpers) besides You, but You gave them and their fathers comfort till they forgot the warning, and became a lost people (doomed to total loss).",
            "english_rwwad": "They will say, “Glory be to You! It was not for us to take besides You any guardians. But You provided for them and their forefathers pleasures, until they forgot the message, for they were a ruined people.”"
        }
    },
    {
        "id": 2873,
        "chapter": 25,
        "verse": 19,
        "arabic_text": "فَقَدۡ كَذَّبُوكُم بِمَا تَقُولُونَ فَمَا تَسۡتَطِيعُونَ صَرۡفٗا وَلَا نَصۡرٗاۚ وَمَن يَظۡلِم مِّنكُمۡ نُذِقۡهُ عَذَابٗا كَبِيرٗا",
        "phonetic": "25.19 Faqad Kadhabūkum Bimā Taqūlūna Famā Tastaţī`ūna Şarfāan Wa Lā Naşrāan Wa Man Yažlim Minkum Nudhiqhu `Adhābāan Kabīrāan",
        "footnotes": {
            "english_saheeh": "[1011]- At the time of Judgement the false objects of worship will betray their worshippers and deny them.\n[1012]- Specifically, association of others with Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they will deny you, [disbelievers], in what you say,[1011] and you cannot avert [punishment] or [find] help. And whoever commits injustice[1012] among you - We will make him taste a great punishment.",
            "english_hilali_khan": "Thus they (false gods - all deities other than Allâh) will belie you (polytheists) regarding what you say (that they are gods besides Allâh): then you can neither avert (the punishment), nor get help. And whoever among you does wrong (i.e. sets up rivals to Allâh), We shall make him taste a great torment.",
            "english_rwwad": "Thus they [the idols] will deny all what you say, so you cannot avert [punishment] nor can get any help. Whoever among you does wrong, We will make him taste a great punishment."
        }
    },
    {
        "id": 2874,
        "chapter": 25,
        "verse": 20,
        "arabic_text": "وَمَآ أَرۡسَلۡنَا قَبۡلَكَ مِنَ ٱلۡمُرۡسَلِينَ إِلَّآ إِنَّهُمۡ لَيَأۡكُلُونَ ٱلطَّعَامَ وَيَمۡشُونَ فِي ٱلۡأَسۡوَاقِۗ وَجَعَلۡنَا بَعۡضَكُمۡ لِبَعۡضٖ فِتۡنَةً أَتَصۡبِرُونَۗ وَكَانَ رَبُّكَ بَصِيرٗا",
        "phonetic": "25.20 Wa Mā 'Arsalnā Qablaka Mina Al-Mursalīna 'Illā 'Innahum Laya'kulūna Aţ-Ţa`āma Wa Yamshūna Fī Al-'Aswāqi Wa Ja`alnā Ba`đakum Liba`đin Fitnatan 'Ataşbirūna Wa Kāna Rabbuka Başīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We did not send before you, [O Muḥammad], any of the messengers except that they ate food and walked in the markets. And We have made some of you [people] as trial for others - will you have patience? And ever is your Lord, Seeing.",
            "english_hilali_khan": "And We never sent before you (O Muhammad صلى الله عليه وسلم) any of the Messengers but verily, they ate food and walked in the markets. And We have made some of you as a trial for others: will you have patience? And your Lord is Ever All-Seer (of everything).",
            "english_rwwad": "We did not send any messengers before you [O Prophet] except that they ate food and walked in the markets. We have made some of you as a trial for others. Will you have patience? For your Lord is All-Seeing."
        }
    },
    {
        "id": 2875,
        "chapter": 25,
        "verse": 21,
        "arabic_text": "۞ وَقَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا لَوۡلَآ أُنزِلَ عَلَيۡنَا ٱلۡمَلَٰٓئِكَةُ أَوۡ نَرَىٰ رَبَّنَاۗ لَقَدِ ٱسۡتَكۡبَرُواْ فِيٓ أَنفُسِهِمۡ وَعَتَوۡ عُتُوّٗا كَبِيرٗا",
        "phonetic": "25.21 Wa Qāla Al-Ladhīna Lā Yarjūna Liqā'anā Lawlā 'Unzila `Alaynā Al-Malā'ikatu 'Aw Nará Rabbanā Laqadi Astakbarū Fī 'Anfusihim Wa `Ataw `Utūwāan Kabīrāan",
        "footnotes": {
            "english_saheeh": "[1013]- Additional meanings are \"among themselves\" and \"over [the matter of] themselves.\"",
            "english_hilali_khan": "(V.25:21) See the footnote of (V.22:9).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who do not expect the meeting with Us say, \"Why were not angels sent down to us, or [why] do we [not] see our Lord?\" They have certainly become arrogant within themselves[1013] and [become] insolent with great insolence.",
            "english_hilali_khan": "And those who expect not a Meeting with Us (i.e. those who deny the Day of Resurrection and the life of the Hereafter) said: \"Why are not the angels sent down to us, or why do we not see our Lord?\" Indeed they think too highly of themselves, and are scornful with great pride.[1]",
            "english_rwwad": "Those who do not expect to meet Us say, “Why are angels not sent down to us or why do we not see our Lord?” They have been too proud of themselves, and have transgressed immensely."
        }
    },
    {
        "id": 2876,
        "chapter": 25,
        "verse": 22,
        "arabic_text": "يَوۡمَ يَرَوۡنَ ٱلۡمَلَٰٓئِكَةَ لَا بُشۡرَىٰ يَوۡمَئِذٖ لِّلۡمُجۡرِمِينَ وَيَقُولُونَ حِجۡرٗا مَّحۡجُورٗا",
        "phonetic": "25.22 Yawma Yarawna Al-Malā'ikata Lā Bushrá Yawma'idhin Lilmujrimīna Wa Yaqūlūna Ĥijrāan Maĥjūrāan",
        "footnotes": {
            "english_saheeh": "[1014]- i.e., at the time of death.\n[1015]- Referring to any good tidings.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The day they see the angels[1014] - no good tidings will there be that day for the criminals, and [the angels] will say, \"Prevented and inaccessible.\"[1015]",
            "english_hilali_khan": "On the Day they will see the angels - no glad tidings will there be for the Mujrimûn (criminals, disbelievers, polytheists, sinners) that day. And they (angels) will say: \"All kinds of glad tidings are forbidden to you,\" [none will be allowed to enter Paradise except the one who said: Lâ ilâha illallâh, \"(none has the right to be worshipped but Allâh) and acted practically on its legal orders and obligations. See the footnote of V.2:193)].",
            "english_rwwad": "On the Day when they see the angels, there will be no glad tidings for the wicked, and [the angels] will say, “Absolutely forbidden for you.”"
        }
    },
    {
        "id": 2877,
        "chapter": 25,
        "verse": 23,
        "arabic_text": "وَقَدِمۡنَآ إِلَىٰ مَا عَمِلُواْ مِنۡ عَمَلٖ فَجَعَلۡنَٰهُ هَبَآءٗ مَّنثُورًا",
        "phonetic": "25.23 Wa Qadimnā 'Ilá Mā `Amilū Min `Amalin Faja`alnāhu Habā'an Manthūrāan",
        "footnotes": {
            "english_saheeh": "[1016]- On the Day of Judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will approach [i.e., regard][1016] what they have done of deeds and make them as dust dispersed.",
            "english_hilali_khan": "And We shall turn to whatever deeds they (disbelievers, polytheists, sinners) did, and We shall make such deeds as scattered floating particles of dust.",
            "english_rwwad": "We will turn to whatever deeds they did and turn them into scattered dust."
        }
    },
    {
        "id": 2878,
        "chapter": 25,
        "verse": 24,
        "arabic_text": "أَصۡحَٰبُ ٱلۡجَنَّةِ يَوۡمَئِذٍ خَيۡرٞ مُّسۡتَقَرّٗا وَأَحۡسَنُ مَقِيلٗا",
        "phonetic": "25.24 'Aşĥābu Al-Jannati Yawma'idhin Khayrun Mustaqarrāan Wa 'Aĥsanu Maqīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The companions of Paradise, that Day, are [in] a better settlement and better resting place.",
            "english_hilali_khan": "The dwellers of Paradise (i.e. those who deserved it through their Islamic Monotheistic Faith and their deeds of righteousness) will, on that Day, have the best abode, and have the fairest of places for repose.",
            "english_rwwad": "On that Day the people of Paradise will have the best abode and the finest resting place."
        }
    },
    {
        "id": 2879,
        "chapter": 25,
        "verse": 25,
        "arabic_text": "وَيَوۡمَ تَشَقَّقُ ٱلسَّمَآءُ بِٱلۡغَمَٰمِ وَنُزِّلَ ٱلۡمَلَٰٓئِكَةُ تَنزِيلًا",
        "phonetic": "25.25 Wa Yawma Tashaqqaqu As-Samā'u Bil-Ghamāmi Wa Nuzzila Al-Malā'ikatu Tanzīlāan",
        "footnotes": {
            "english_saheeh": "[1017]- Within which are the angels.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] the Day when the heaven will split open with [emerging] clouds,[1017] and the angels will be sent down in successive descent.",
            "english_hilali_khan": "And (remember) the Day when the heaven shall be rent asunder with clouds, and the angels will be sent down, with a grand descending.",
            "english_rwwad": "On the Day when the sky will split asunder with clouds, and the angels will be sent down in succession."
        }
    },
    {
        "id": 2880,
        "chapter": 25,
        "verse": 26,
        "arabic_text": "ٱلۡمُلۡكُ يَوۡمَئِذٍ ٱلۡحَقُّ لِلرَّحۡمَٰنِۚ وَكَانَ يَوۡمًا عَلَى ٱلۡكَٰفِرِينَ عَسِيرٗا",
        "phonetic": "25.26 Al-Mulku Yawma'idhin Al-Ĥaqqu Lilrraĥmani Wa Kāna Yawmāan `Alá Al-Kāfirīna `Asīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "True sovereignty, that Day, is for the Most Merciful. And it will be upon the disbelievers a difficult Day.",
            "english_hilali_khan": "The sovereignty on that Day will be the true (sovereignty), belonging to the Most Gracious (Allâh), and it will be a hard Day for the disbelievers (those who disbelieve in the Oneness of Allâh - Islâmic Monotheism).",
            "english_rwwad": "The true dominion on that Day belongs to the Most Compassionate, and it will be a hard day for the disbelievers."
        }
    },
    {
        "id": 2881,
        "chapter": 25,
        "verse": 27,
        "arabic_text": "وَيَوۡمَ يَعَضُّ ٱلظَّالِمُ عَلَىٰ يَدَيۡهِ يَقُولُ يَٰلَيۡتَنِي ٱتَّخَذۡتُ مَعَ ٱلرَّسُولِ سَبِيلٗا",
        "phonetic": "25.27 Wa Yawma Ya`ađđu Až-Žālimu `Alá Yadayhi Yaqūlu Yā Laytanī Attakhadhtu Ma`a Ar-Rasūli Sabīlāan",
        "footnotes": {
            "english_saheeh": "[1018]- i.e., followed the Prophet (ﷺ) on a path of guidance.",
            "english_hilali_khan": "(V.25:27) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.[1018]",
            "english_hilali_khan": "And (remember) the Day when the Zâlim (wrong-doer, oppressor, polytheist) will bite at his hands, he will say: \"Oh! Would that I had taken a path with the Messenger (Muhammad صلى الله عليه وسلم).[2]",
            "english_rwwad": "On that Day, the wrongdoer will bite his hands saying, “Would that I had taken a way with the Messenger!"
        }
    },
    {
        "id": 2882,
        "chapter": 25,
        "verse": 28,
        "arabic_text": "يَٰوَيۡلَتَىٰ لَيۡتَنِي لَمۡ أَتَّخِذۡ فُلَانًا خَلِيلٗا",
        "phonetic": "25.28 Yā Waylatī Laytanī Lam 'Attakhidh Fulānāan Khalīlāan",
        "footnotes": {
            "english_saheeh": "[1019]- The person who misguided him.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Oh, woe to me! I wish I had not taken that one[1019] as a friend.",
            "english_hilali_khan": "\"Ah! Woe to me! Would that I had never taken so-and-so as a Khalîl (an intimate friend)!",
            "english_rwwad": "Woe to me! Would that I had not taken so-and-so as a close friend!"
        }
    },
    {
        "id": 2883,
        "chapter": 25,
        "verse": 29,
        "arabic_text": "لَّقَدۡ أَضَلَّنِي عَنِ ٱلذِّكۡرِ بَعۡدَ إِذۡ جَآءَنِيۗ وَكَانَ ٱلشَّيۡطَٰنُ لِلۡإِنسَٰنِ خَذُولٗا",
        "phonetic": "25.29 Laqad 'Ađallanī `Ani Adh-Dhikri Ba`da 'Idh Jā'anī Wa Kāna Ash-Shayţānu Lil'insāni Khadhūlāan",
        "footnotes": {
            "english_saheeh": "[1020]- i.e., the Qur’ān or the remembrance of Allāh.\n[1021]- Forsaking him once he has led him into evil.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He led me away from the remembrance[1020] after it had come to me. And ever is Satan, to man, a deserter.\"[1021]",
            "english_hilali_khan": "\"He indeed led me astray from the Reminder (this Qur’ân) after it had come to me. And Shaitân (Satan) is to man ever a deserter in the hour of need.\" [Tafsir Al-Qurtubi]",
            "english_rwwad": "He led me astray from the Reminder after it had come to me.” Satan always betrays man."
        }
    },
    {
        "id": 2884,
        "chapter": 25,
        "verse": 30,
        "arabic_text": "وَقَالَ ٱلرَّسُولُ يَٰرَبِّ إِنَّ قَوۡمِي ٱتَّخَذُواْ هَٰذَا ٱلۡقُرۡءَانَ مَهۡجُورٗا",
        "phonetic": "25.30 Wa Qāla Ar-Rasūlu Yā Rabbi 'Inna Qawmī Attakhadhū Hādhā Al-Qur'āna Mahjūrāan",
        "footnotes": {
            "english_saheeh": "[1022]- i.e., avoiding it, not listening to or understanding it, not living by it, or preferring something else to it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the Messenger has said, \"O my Lord, indeed my people have taken this Qur’ān as [a thing] abandoned.\"[1022]",
            "english_hilali_khan": "And the Messenger (Muhammad صلى الله عليه وسلم) will say: \"O my Lord! Verily, my people deserted this Qur’ân (neither listened to it, nor acted on its laws and teachings).",
            "english_rwwad": "The Messenger said, “O my Lord, my people have taken this Qur’an as a thing to be abandoned.”"
        }
    },
    {
        "id": 2885,
        "chapter": 25,
        "verse": 31,
        "arabic_text": "وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ عَدُوّٗا مِّنَ ٱلۡمُجۡرِمِينَۗ وَكَفَىٰ بِرَبِّكَ هَادِيٗا وَنَصِيرٗا",
        "phonetic": "25.31 Wa Kadhalika Ja`alnā Likulli Nabīyin `Adūwāan Mina Al-Mujrimīna Wa Kafá Birabbika Hādīāan Wa Naşīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus have We made for every prophet an enemy from among the criminals. But sufficient is your Lord as a guide and a helper.",
            "english_hilali_khan": "Thus have We made for every Prophet an enemy among the Mujrimûn (disbelievers, polytheists, criminals). But Sufficient is your Lord as a Guide and Helper.",
            "english_rwwad": "Thus did we assign for every prophet an enemy from among the wicked, but your Lord is sufficient as a Guide and Helper."
        }
    },
    {
        "id": 2886,
        "chapter": 25,
        "verse": 32,
        "arabic_text": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ٱلۡقُرۡءَانُ جُمۡلَةٗ وَٰحِدَةٗۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَۖ وَرَتَّلۡنَٰهُ تَرۡتِيلٗا",
        "phonetic": "25.32 Wa Qāla Al-Ladhīna Kafarū Lawlā Nuzzila `Alayhi Al-Qur'ānu Jumlatan Wāĥidatan Kadhālika Linuthabbita Bihi Fu'uādaka Wa Rattalnāhu Tartīlāan",
        "footnotes": {
            "english_saheeh": "[1023]- Also, \"recited it with distinct recitation.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who disbelieve say, \"Why was the Qur’ān not revealed to him all at once?\" Thus [it is] that We may strengthen thereby your heart. And We have spaced it distinctly.[1023]",
            "english_hilali_khan": "years.).",
            "english_rwwad": "Those who disbelieve say, “Why was the Qur’an not sent down to him all at once?” [We sent it] in this way so that We may strengthen your heart thereby, and We have revealed it in a gradual manner."
        }
    },
    {
        "id": 2887,
        "chapter": 25,
        "verse": 33,
        "arabic_text": "وَلَا يَأۡتُونَكَ بِمَثَلٍ إِلَّا جِئۡنَٰكَ بِٱلۡحَقِّ وَأَحۡسَنَ تَفۡسِيرًا",
        "phonetic": "25.33 Wa Lā Ya'tūnaka Bimathalin 'Illā Ji'nāka Bil-Ĥaqqi Wa 'Aĥsana Tafsīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they do not come to you with an example [i.e., argument] except that We bring you the truth and the best explanation.",
            "english_hilali_khan": "And no example or similitude do they bring (to oppose or to find fault in you or in this Qur’ân), but We reveal to you the truth (against that similitude or example), and the better explanation thereof.",
            "english_rwwad": "Whenever they bring you an argument, We bring you the truth and the best explanation."
        }
    },
    {
        "id": 2888,
        "chapter": 25,
        "verse": 34,
        "arabic_text": "ٱلَّذِينَ يُحۡشَرُونَ عَلَىٰ وُجُوهِهِمۡ إِلَىٰ جَهَنَّمَ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ سَبِيلٗا",
        "phonetic": "25.34 Al-Ladhīna Yuĥsharūna `Alá Wujūhihim 'Ilá Jahannama 'Ūlā'ika Sharrun Makānāan Wa 'Ađallu Sabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.25:34) See the footnote of (V.17:97).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The ones who are gathered on their faces to Hell - those are the worst in position and farthest astray in [their] way.",
            "english_hilali_khan": "Those who will be gathered to Hell (prone) on their faces, such will be in an evil state, and most astray from the (Straight) Path.[1]",
            "english_rwwad": "Those who will be dragged on their faces to Hell – they will be in the worst position and farthest astray from the right path."
        }
    },
    {
        "id": 2889,
        "chapter": 25,
        "verse": 35,
        "arabic_text": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَجَعَلۡنَا مَعَهُۥٓ أَخَاهُ هَٰرُونَ وَزِيرٗا",
        "phonetic": "25.35 Wa Laqad 'Ātaynā Mūsá Al-Kitāba Wa Ja`alnā Ma`ahu 'Akhāhu Hārūna Wazīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly given Moses the Scripture and appointed with him his brother Aaron as an assistant.",
            "english_hilali_khan": "And indeed We gave Mûsâ (Moses) the Scripture [the Taurât (Torah)], and placed his brother Hârûn (Aaron) with him as a helper;",
            "english_rwwad": "We gave Moses the Scripture and appointed with him his brother Aaron as a helper."
        }
    },
    {
        "id": 2890,
        "chapter": 25,
        "verse": 36,
        "arabic_text": "فَقُلۡنَا ٱذۡهَبَآ إِلَى ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا فَدَمَّرۡنَٰهُمۡ تَدۡمِيرٗا",
        "phonetic": "25.36 Faqulnā Adh/habā 'Ilá Al-Qawmi Al-Ladhīna Kadhabū Bi'āyātinā Fadammarnāhum Tadmīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We said, \"Go both of you to the people who have denied Our signs.\" Then We destroyed them with [complete] destruction.",
            "english_hilali_khan": "And We said: \"Go you both to the people who have denied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.).\" Then We destroyed them with utter destruction.",
            "english_rwwad": "We said, “Go, both of you, to the people who have rejected Our signs.” Then We destroyed them utterly."
        }
    },
    {
        "id": 2891,
        "chapter": 25,
        "verse": 37,
        "arabic_text": "وَقَوۡمَ نُوحٖ لَّمَّا كَذَّبُواْ ٱلرُّسُلَ أَغۡرَقۡنَٰهُمۡ وَجَعَلۡنَٰهُمۡ لِلنَّاسِ ءَايَةٗۖ وَأَعۡتَدۡنَا لِلظَّٰلِمِينَ عَذَابًا أَلِيمٗا",
        "phonetic": "25.37 Wa Qawma Nūĥin Lammā Kadhabū Ar-Rusula 'Aghraqnāhum Wa Ja`alnāhum Lilnnāsi 'Āyatan Wa 'A`tadnā Lilžžālimīna `Adhābāan 'Alīmāan",
        "footnotes": {
            "english_saheeh": "[1024]- Their denial of Noah was as if they had denied all those who brought the same message from Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the people of Noah - when they denied the messengers,[1024] We drowned them, and We made them for mankind a sign. And We have prepared for the wrongdoers a painful punishment.",
            "english_hilali_khan": "And Nûh’s (Noah) people, when they denied the Messengers, We drowned them, and We made them as a sign for mankind. And We have prepared a painful torment for the Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "Also the people of Noah, when they rejected the messengers, We drowned them and made them an example for mankind. And We have prepared for the wrongdoers a painful punishment."
        }
    },
    {
        "id": 2892,
        "chapter": 25,
        "verse": 38,
        "arabic_text": "وَعَادٗا وَثَمُودَاْ وَأَصۡحَٰبَ ٱلرَّسِّ وَقُرُونَۢا بَيۡنَ ذَٰلِكَ كَثِيرٗا",
        "phonetic": "25.38 Wa `Ādāan Wa Thamūda Wa 'Aşĥāba Ar-Rassi Wa Qurūnāan Bayna Dhālika Kathīrāan",
        "footnotes": {
            "english_saheeh": "[1025]- Said to be a people who denied Prophet Shuʿayb or possibly those mentioned in Sūrah Yā Seen, 36:13-29.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [We destroyed] ʿAad and Thamūd and the companions of the well[1025] and many generations between them.",
            "english_hilali_khan": "And (also) ‘Âd and Thamûd, and the Dwellers of Ar-Rass, and many generations in between.",
            "english_rwwad": "Also [We destroyed] ‘Ād and Thamūd, and the people of the Well, and many generations between them."
        }
    },
    {
        "id": 2893,
        "chapter": 25,
        "verse": 39,
        "arabic_text": "وَكُلّٗا ضَرَبۡنَا لَهُ ٱلۡأَمۡثَٰلَۖ وَكُلّٗا تَبَّرۡنَا تَتۡبِيرٗا",
        "phonetic": "25.39 Wa Kullāan Đarabnā Lahu Al-'Amthāla Wa Kullāan Tabbarnā Tatbīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And for each We presented examples [as warnings], and each We destroyed with [total] destruction.",
            "english_hilali_khan": "And for each (of them) We put forward examples (as proofs and lessons), and each (of them) We brought to utter ruin (because of their disbelief and evil deeds).",
            "english_rwwad": "To each We gave examples [of the previous nations], and each We destroyed completely."
        }
    },
    {
        "id": 2894,
        "chapter": 25,
        "verse": 40,
        "arabic_text": "وَلَقَدۡ أَتَوۡاْ عَلَى ٱلۡقَرۡيَةِ ٱلَّتِيٓ أُمۡطِرَتۡ مَطَرَ ٱلسَّوۡءِۚ أَفَلَمۡ يَكُونُواْ يَرَوۡنَهَاۚ بَلۡ كَانُواْ لَا يَرۡجُونَ نُشُورٗا",
        "phonetic": "25.40 Wa Laqad 'Ataw `Alá Al-Qaryati Allatī 'Umţirat Maţara As-Saw'i 'Afalam Yakūnū Yarawnahā Bal Kānū Lā Yarjūna Nushūrāan",
        "footnotes": {
            "english_saheeh": "[1026]- So they do not benefit from lessons of the past.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they have already come upon the town which was showered with a rain of evil [i.e., stones]. So have they not seen it? But they are not expecting resurrection.[1026]",
            "english_hilali_khan": "And indeed they have passed by the town [of Prophet Lût (Lot)] on which was rained the evil rain. Did they (disbelievers) not then see it (with their own eyes)? Nay! But they used not to expect any resurrection.",
            "english_rwwad": "They have surely passed by the town that was destroyed by a terrible rain [of stones]. Have they not seen it? But they do not expect to be resurrected."
        }
    },
    {
        "id": 2895,
        "chapter": 25,
        "verse": 41,
        "arabic_text": "وَإِذَا رَأَوۡكَ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَٰذَا ٱلَّذِي بَعَثَ ٱللَّهُ رَسُولًا",
        "phonetic": "25.41 Wa 'Idhā R'awka 'In Yattakhidhūnaka 'Illā Huzūan 'Ahadhā Al-Ladhī Ba`atha Allāhu Rasūlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they see you, [O Muḥammad], they take you not except in ridicule, [saying], \"Is this the one whom Allāh has sent as a messenger?",
            "english_hilali_khan": "And when they see you (O Muhammad صلى الله عليه وسلم), they treat you only in mockery (saying): \"Is this the one whom Allâh has sent as a Messenger?",
            "english_rwwad": "When they see you [O Prophet], they only ridicule you, “Is this the one whom Allah has sent as a messenger?"
        }
    },
    {
        "id": 2896,
        "chapter": 25,
        "verse": 42,
        "arabic_text": "إِن كَادَ لَيُضِلُّنَا عَنۡ ءَالِهَتِنَا لَوۡلَآ أَن صَبَرۡنَا عَلَيۡهَاۚ وَسَوۡفَ يَعۡلَمُونَ حِينَ يَرَوۡنَ ٱلۡعَذَابَ مَنۡ أَضَلُّ سَبِيلًا",
        "phonetic": "25.42 'In Kāda Layuđillunā `An 'Ālihatinā Lawlā 'An Şabarnā `Alayhā Wa Sawfa Ya`lamūna Ĥīna Yarawna Al-`Adhāba Man 'Ađallu Sabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He almost would have misled us from our gods had we not been steadfast in [worship of] them.\" But they are going to know, when they see the punishment, who is farthest astray in [his] way.",
            "english_hilali_khan": "\"He would have nearly misled us from our âlihah (gods), had it not been that we were patient and constant in their worship!\" And they will know when they see the torment, who it is that is most astray from the (Right) Path!",
            "english_rwwad": "He would have almost led us astray from our gods, if we had not been so devoted to them.” But when they see the punishment, they will come to know who is further astray from the right way."
        }
    },
    {
        "id": 2897,
        "chapter": 25,
        "verse": 43,
        "arabic_text": "أَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ أَفَأَنتَ تَكُونُ عَلَيۡهِ وَكِيلًا",
        "phonetic": "25.43 'Ara'ayta Mani Attakhadha 'Ilahahu Hawāhu 'Afa'anta Takūnu `Alayhi Wa Kīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you seen the one who takes as his god his own desire? Then would you be responsible for him?",
            "english_hilali_khan": "Have you (O Muhammad صلى الله عليه وسلم) seen him who has taken as his ilâh (god) his own vain desire? Would you then be a Wakîl (a disposer of his affairs or a watcher) over him?",
            "english_rwwad": "Have you [O Prophet] seen the one who takes his desire as his god, will you then be a keeper over him?"
        }
    },
    {
        "id": 2898,
        "chapter": 25,
        "verse": 44,
        "arabic_text": "أَمۡ تَحۡسَبُ أَنَّ أَكۡثَرَهُمۡ يَسۡمَعُونَ أَوۡ يَعۡقِلُونَۚ إِنۡ هُمۡ إِلَّا كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّ سَبِيلًا",
        "phonetic": "25.44 'Am Taĥsabu 'Anna 'Aktharahum Yasma`ūna 'Aw Ya`qilūna 'In Hum 'Illā Kāl'an`ām Bal Hum 'Ađallu Sabīlāan",
        "footnotes": {
            "english_saheeh": "[1027]- i.e., cattle or sheep, that follow without question wherever they are led.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or do you think that most of them hear or reason? They are not except like livestock.[1027] Rather, they are [even] more astray in [their] way.",
            "english_hilali_khan": "Or do you think that most of them hear or understand? They are only like cattle - nay, they are even farther astray from the Path (i.e. even worse than cattle).",
            "english_rwwad": "Do you think that most of them hear or understand? They are just like livestock, rather they are further astray from the right way."
        }
    },
    {
        "id": 2899,
        "chapter": 25,
        "verse": 45,
        "arabic_text": "أَلَمۡ تَرَ إِلَىٰ رَبِّكَ كَيۡفَ مَدَّ ٱلظِّلَّ وَلَوۡ شَآءَ لَجَعَلَهُۥ سَاكِنٗا ثُمَّ جَعَلۡنَا ٱلشَّمۡسَ عَلَيۡهِ دَلِيلٗا",
        "phonetic": "25.45 'Alam Tará 'Ilá Rabbika Kayfa Madda Až-Žilla Wa Law Shā'a Laja`alahu Sākināan Thumma Ja`alnā Ash-Shamsa `Alayhi Dalīlāan",
        "footnotes": {
            "english_saheeh": "[1028]- i.e., showing the existence of a shadow or making it apparent by contrast.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you not considered your Lord - how He extends the shadow, and if He willed, He could have made it stationary? Then We made the sun for it an indication.[1028]",
            "english_hilali_khan": "Have you not seen how your Lord spread the shadow. If He willed, He could have made it still - But We have made the sun its guide (i.e. after the sunrise, the shadow shrinks and vanishes at midnoon and then again appears in the afternoon with the decline of the sun, and had there been no sunlight, there would have been no shadow).",
            "english_rwwad": "Do you not see how your Lord extends the shade? If He had willed, He could have made it still. Then We made the sun an indication for it."
        }
    },
    {
        "id": 2900,
        "chapter": 25,
        "verse": 46,
        "arabic_text": "ثُمَّ قَبَضۡنَٰهُ إِلَيۡنَا قَبۡضٗا يَسِيرٗا",
        "phonetic": "25.46 Thumma Qabađnāhu 'Ilaynā Qabđāan Yasīrāan",
        "footnotes": {
            "english_saheeh": "[1029]- i.e., when the sun is overhead at noon.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We [retract and] hold it with Us for a brief grasp.[1029]",
            "english_hilali_khan": "Then We withdraw it to Us a gradual concealed withdrawal.",
            "english_rwwad": "Then We gradually draw it towards Us [as the sun climbs up]?"
        }
    },
    {
        "id": 2901,
        "chapter": 25,
        "verse": 47,
        "arabic_text": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِبَاسٗا وَٱلنَّوۡمَ سُبَاتٗا وَجَعَلَ ٱلنَّهَارَ نُشُورٗا",
        "phonetic": "25.47 Wa Huwa Al-Ladhī Ja`ala Lakumu Al-Layla Libāsāan Wa An-Nawma Subātāan Wa Ja`ala An-Nahāra Nushūrāan",
        "footnotes": {
            "english_saheeh": "[1030]- Covering you in darkness and providing rest.\n[1031]- For renewal of life and activity.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who has made the night for you as clothing[1030] and sleep [a means for] rest and has made the day a resurrection.[1031]",
            "english_hilali_khan": "And it is He Who makes the night a covering for you, and the sleep (as) a repose, and makes the day Nushûr (i.e. getting up and going about here and there for daily work, after one’s sleep at night, or like resurrection after one’s death).",
            "english_rwwad": "It is He Who has made the night as a garment for you, and made sleep for rest; and has made daytime for returning to life."
        }
    },
    {
        "id": 2902,
        "chapter": 25,
        "verse": 48,
        "arabic_text": "وَهُوَ ٱلَّذِيٓ أَرۡسَلَ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ طَهُورٗا",
        "phonetic": "25.48 Wa Huwa Al-Ladhī 'Arsala Ar-Riyāĥa Bushrāan Bayna Yaday Raĥmatihi Wa 'Anzalnā Mina As-Samā'i Mā'an Ţahūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who sends the winds as good tidings before His mercy [i.e., rainfall], and We send down from the sky pure water",
            "english_hilali_khan": "And it is He Who sends the winds as heralds of glad tidings, going before His Mercy (rain); and We send down pure water from the sky.",
            "english_rwwad": "It is He Who sends the winds as harbingers before His mercy, and We send down from the sky pure water,"
        }
    },
    {
        "id": 2903,
        "chapter": 25,
        "verse": 49,
        "arabic_text": "لِّنُحۡـِۧيَ بِهِۦ بَلۡدَةٗ مَّيۡتٗا وَنُسۡقِيَهُۥ مِمَّا خَلَقۡنَآ أَنۡعَٰمٗا وَأَنَاسِيَّ كَثِيرٗا",
        "phonetic": "25.49 Linuĥyiya Bihi Baldatan Maytāan Wa Nusqiyahu Mimmā Khalaqnā 'An`āmāan Wa 'Anāsīya Kathīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That We may bring to life thereby a dead land and give it as drink to those We created of numerous livestock and men.",
            "english_hilali_khan": "That We may give life thereby to a dead land, and We give to drink thereof many of the cattle and men that We had created.",
            "english_rwwad": "so that We may revive therewith a dead land, and quench the thirst of countless beasts and humans We have created."
        }
    },
    {
        "id": 2904,
        "chapter": 25,
        "verse": 50,
        "arabic_text": "وَلَقَدۡ صَرَّفۡنَٰهُ بَيۡنَهُمۡ لِيَذَّكَّرُواْ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا",
        "phonetic": "25.50 Wa Laqad Şarrafnāhu Baynahum Liyadhakkarū Fa'abá 'Aktharu An-Nāsi 'Illā Kufūrāan",
        "footnotes": {
            "english_saheeh": "[1032]- Of Allāh's ability to bring the dead to life.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly distributed it among them that they might be reminded,[1032] but most of the people refuse except disbelief.",
            "english_hilali_khan": "And indeed We have distributed it (rain or water) amongst them in order that they may remember (the Grace of Allâh,) but most men (refuse to accept the Truth or Faith and) accept nothing but disbelief or ingratitude.",
            "english_rwwad": "We distribute it among them so that they may take heed, but most people persist in their ingratitude."
        }
    },
    {
        "id": 2905,
        "chapter": 25,
        "verse": 51,
        "arabic_text": "وَلَوۡ شِئۡنَا لَبَعَثۡنَا فِي كُلِّ قَرۡيَةٖ نَّذِيرٗا",
        "phonetic": "25.51 Wa Law Shi'nā Laba`athnā Fī Kulli Qaryatin Nadhīrāan",
        "footnotes": {
            "english_saheeh": "[1033]- However, Allāh willed that Prophet Muḥammad (ﷺ) be sent as the final messenger for all peoples of the earth until the Day of Resurrection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if We had willed, We could have sent into every city a warner.[1033]",
            "english_hilali_khan": "And had We willed, We would have raised a warner in every town.",
            "english_rwwad": "If We had willed, We could have sent to each town a warner."
        }
    },
    {
        "id": 2906,
        "chapter": 25,
        "verse": 52,
        "arabic_text": "فَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَجَٰهِدۡهُم بِهِۦ جِهَادٗا كَبِيرٗا",
        "phonetic": "25.52 Falā Tuţi`i Al-Kāfirīna Wa Jāhid/hum Bihi Jihādāan Kabīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So do not obey the disbelievers, and strive against them with it [i.e., the Qur’ān] a great striving.",
            "english_hilali_khan": "So obey not the disbelievers, but strive against them (by preaching) with the utmost endeavour with it (the Qur’ân).",
            "english_rwwad": "So do not obey the disbelievers, but strive against them with this [Qur’an] a great striving."
        }
    },
    {
        "id": 2907,
        "chapter": 25,
        "verse": 53,
        "arabic_text": "۞ وَهُوَ ٱلَّذِي مَرَجَ ٱلۡبَحۡرَيۡنِ هَٰذَا عَذۡبٞ فُرَاتٞ وَهَٰذَا مِلۡحٌ أُجَاجٞ وَجَعَلَ بَيۡنَهُمَا بَرۡزَخٗا وَحِجۡرٗا مَّحۡجُورٗا",
        "phonetic": "25.53 Wa Huwa Al-Ladhī Maraja Al-Baĥrayni Hādhā `Adhbun Furātun Wa Hadhā Milĥun 'Ujājun Wa Ja`ala Baynahumā Barzakhāan Wa Ĥijrāan Maĥjūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who has released [simultaneously] the two seas [i.e., bodies of water], one fresh and sweet and one salty and bitter, and He placed between them a barrier and prohibiting partition.",
            "english_hilali_khan": "And it is He Who has let free the two seas (kinds of water): this is palatable and sweet, and that is salt and bitter; and He has set a barrier and a complete partition between them.",
            "english_rwwad": "It is He Who merges the two bodies of water: one fresh and palatable and the other salty and bitter, and He has made between them a barrier and an insurmountable partition."
        }
    },
    {
        "id": 2908,
        "chapter": 25,
        "verse": 54,
        "arabic_text": "وَهُوَ ٱلَّذِي خَلَقَ مِنَ ٱلۡمَآءِ بَشَرٗا فَجَعَلَهُۥ نَسَبٗا وَصِهۡرٗاۗ وَكَانَ رَبُّكَ قَدِيرٗا",
        "phonetic": "25.54 Wa Huwa Al-Ladhī Khalaqa Mina Al-Mā'i Basharāan Faja`alahu Nasabāan Wa Şihrāan Wa Kāna Rabbuka Qadīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who has created from water [i.e., semen] a human being and made him [a relative by] lineage and marriage. And ever is your Lord competent [concerning creation].",
            "english_hilali_khan": "And it is He Who has created man from water, and has appointed for him kindred by blood, and kindred by marriage. And your Lord is Ever All-Powerful to do what He wills.",
            "english_rwwad": "It is He Who created human beings from water, then made between them bonds of kinship and marriage, for your Lord is Most Capable."
        }
    },
    {
        "id": 2909,
        "chapter": 25,
        "verse": 55,
        "arabic_text": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُهُمۡ وَلَا يَضُرُّهُمۡۗ وَكَانَ ٱلۡكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرٗا",
        "phonetic": "25.55 Wa Ya`budūna Min Dūni Allāhi Mā Lā Yanfa`uhum Wa Lā Yađurruhum Wa Kāna Al-Kāfiru `Alá Rabbihi Žahīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they worship rather than Allāh that which does not benefit them or harm them, and the disbeliever is ever, against his Lord, an assistant [to Satan].",
            "english_hilali_khan": "And they (disbelievers, polytheists) worship besides Allâh that which can neither profit them nor harm them; and the disbeliever is ever a helper (of the Satan) against his Lord.",
            "english_rwwad": "Yet they worship besides Allah that which can neither benefit nor harm them; the disbeliever always collaborates against his Lord."
        }
    },
    {
        "id": 2910,
        "chapter": 25,
        "verse": 56,
        "arabic_text": "وَمَآ أَرۡسَلۡنَٰكَ إِلَّا مُبَشِّرٗا وَنَذِيرٗا",
        "phonetic": "25.56 Wa Mā 'Arsalnāka 'Illā Mubashirāan Wa Nadhīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have not sent you, [O Muḥammad], except as a bringer of good tidings and a warner.",
            "english_hilali_khan": "And We have sent you (O Muhammad صلى الله عليه وسلم) only as a bearer of glad tidings and a warner.",
            "english_rwwad": "We have not sent you [O Prophet] except as a bearer of glad tidings and a warner."
        }
    },
    {
        "id": 2911,
        "chapter": 25,
        "verse": 57,
        "arabic_text": "قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٍ إِلَّا مَن شَآءَ أَن يَتَّخِذَ إِلَىٰ رَبِّهِۦ سَبِيلٗا",
        "phonetic": "25.57 Qul Mā 'As'alukum `Alayhi Min 'Ajrin 'Illā Man Shā'a 'An Yattakhidha 'Ilá Rabbihi Sabīlāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"I do not ask of you for it any payment - only that whoever wills might take to his Lord a way.\"",
            "english_hilali_khan": "Say: \"No reward do I ask of you for this (that which I have brought from my Lord and its preaching), save that whosoever wills may take a Path to his Lord.",
            "english_rwwad": "Say, “I do not ask you for any reward for it, except that anyone who wishes to take a path to his Lord.”"
        }
    },
    {
        "id": 2912,
        "chapter": 25,
        "verse": 58,
        "arabic_text": "وَتَوَكَّلۡ عَلَى ٱلۡحَيِّ ٱلَّذِي لَا يَمُوتُ وَسَبِّحۡ بِحَمۡدِهِۦۚ وَكَفَىٰ بِهِۦ بِذُنُوبِ عِبَادِهِۦ خَبِيرًا",
        "phonetic": "25.58 Wa Tawakkal `Alá Al-Ĥayyi Al-Ladhī Lā Yamūtu Wa Sabbiĥ Biĥamdihi Wa Kafá Bihi Bidhunūbi `Ibādihi Khabīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And rely upon the Ever-Living who does not die, and exalt [Allāh] with His praise. And sufficient is He to be, with the sins of His servants, [fully] Aware -",
            "english_hilali_khan": "And put your trust (O Muhammad صلى الله عليه وسلم) in the Ever Living One Who dies not, and glorify His Praises, and Sufficient is He as the All-Knower of the sins of His slaves,",
            "english_rwwad": "Put your trust in the Ever-Living Who never dies, and glorify Him with praise. He is Sufficient as All-Aware of the sins of His slaves –"
        }
    },
    {
        "id": 2913,
        "chapter": 25,
        "verse": 59,
        "arabic_text": "ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ ٱلرَّحۡمَٰنُ فَسۡـَٔلۡ بِهِۦ خَبِيرٗا",
        "phonetic": "25.59 Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Wa Mā Baynahumā Fī Sittati 'Ayyāmin Thumma Astawá `Alá Al-`Arshi Ar-Raĥmānu Fās'al Bihi Khabīrāan",
        "footnotes": {
            "english_saheeh": "[1034]- See footnotes to 2:19 and 7:54.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He who created the heavens and the earth and what is between them in six days and then established Himself above the Throne[1034] - the Most Merciful, so ask about Him one well informed [i.e., the Prophet (ﷺ)].",
            "english_hilali_khan": "Who created the heavens and the earth and all that is between them in six Days. Then He (Istawâ ) rose over the Throne (in a manner that suits His Majesty). The Most Gracious (Allâh)! Ask Him (O Prophet Muhammad صلى الله عليه وسلم , concerning His Qualities: His rising over His Throne, His creations, etc.), as He is Al-Khabîr (The All-Knower of everything i.e. Allâh).",
            "english_rwwad": "it is He Who created the heavens and earth and all that is between them in six Days, then rose over the Throne. He is the Most Compassionate, so ask about Him the One Who is All-Aware."
        }
    },
    {
        "id": 2914,
        "chapter": 25,
        "verse": 60,
        "arabic_text": "وَإِذَا قِيلَ لَهُمُ ٱسۡجُدُواْۤ لِلرَّحۡمَٰنِ قَالُواْ وَمَا ٱلرَّحۡمَٰنُ أَنَسۡجُدُ لِمَا تَأۡمُرُنَا وَزَادَهُمۡ نُفُورٗا۩",
        "phonetic": "25.60 Wa 'Idhā Qīla Lahum Asjudū Lilrraĥmani Qālū Wa Mā Ar-Raĥmānu 'Anasjudu Limā Ta'murunā Wa Zādahum Nufūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when it is said to them, \"Prostrate to the Most Merciful,\" they say, \"And what is the Most Merciful? Should we prostrate to that which you order us?\" And it increases them in aversion.",
            "english_hilali_khan": "And when it is said to them: \"Prostrate yourselves to the Most Gracious (Allâh)! they say: \"And what is the Most Gracious? Shall we fall down in prostration to that which you (O Muhammad صلى الله عليه وسلم) command us?\" And it increases in them only aversion.",
            "english_rwwad": "When it is said to them, “Prostrate to the Most Compassionate,” they say, “What is ‘the Most Compassionate?’ Shall we prostrate to what you order us?” And it only increases them in aversion."
        }
    },
    {
        "id": 2915,
        "chapter": 25,
        "verse": 61,
        "arabic_text": "تَبَارَكَ ٱلَّذِي جَعَلَ فِي ٱلسَّمَآءِ بُرُوجٗا وَجَعَلَ فِيهَا سِرَٰجٗا وَقَمَرٗا مُّنِيرٗا",
        "phonetic": "25.61 Tabāraka Al-Ladhī Ja`ala Fī As-Samā'i Burūjāan Wa Ja`ala Fīhā Sirājāan Wa Qamarāan Munīrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Blessed is He who has placed in the sky great stars and placed therein a [burning] lamp and luminous moon.",
            "english_hilali_khan": "Blessed be He Who has placed in the heaven big stars, and has placed therein a great lamp (sun), and a moon giving light.",
            "english_rwwad": "Blessed is He Who placed in the sky constellations, and placed therein a radiant lamp and a luminous moon."
        }
    },
    {
        "id": 2916,
        "chapter": 25,
        "verse": 62,
        "arabic_text": "وَهُوَ ٱلَّذِي جَعَلَ ٱلَّيۡلَ وَٱلنَّهَارَ خِلۡفَةٗ لِّمَنۡ أَرَادَ أَن يَذَّكَّرَ أَوۡ أَرَادَ شُكُورٗا",
        "phonetic": "25.62 Wa Huwa Al-Ladhī Ja`ala Al-Layla Wa An-Nahāra Khilfatan Liman 'Arāda 'An Yadhakkara 'Aw 'Arāda Shukūrāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who has made the night and the day in succession for whoever desires to remember or desires gratitude.",
            "english_hilali_khan": "And He it is Who has put the night and the day in succession, for such who desires to remember or desires to show his gratitude.",
            "english_rwwad": "It is He Who made the night and the day to follow each other so that everyone who wishes may reflect or become grateful."
        }
    },
    {
        "id": 2917,
        "chapter": 25,
        "verse": 63,
        "arabic_text": "وَعِبَادُ ٱلرَّحۡمَٰنِ ٱلَّذِينَ يَمۡشُونَ عَلَى ٱلۡأَرۡضِ هَوۡنٗا وَإِذَا خَاطَبَهُمُ ٱلۡجَٰهِلُونَ قَالُواْ سَلَٰمٗا",
        "phonetic": "25.63 Wa `Ibādu Ar-Raĥmāni Al-Ladhīna Yamshūna `Alá Al-'Arđi Hawnāan Wa 'Idhā Khāţabahumu Al-Jāhilūna Qālū Salāmāan",
        "footnotes": {
            "english_saheeh": "[1035]- i.e., gently, with dignity but without arrogance.\n[1036]- Or \"safety,\" i.e., words free from fault or evil.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the servants of the Most Merciful are those who walk upon the earth easily,[1035] and when the ignorant address them [harshly], they say [words of] peace,[1036]",
            "english_hilali_khan": "And the (faithful) slaves of the Most Gracious (Allâh) are those who walk on the earth in humility and sedateness, and when the foolish address them (with bad words) they reply back with mild words of gentleness.",
            "english_rwwad": "The slaves of the Most Compassionate are those who walk on earth humbly, and when the ignorant address them, they only say words of peace;"
        }
    },
    {
        "id": 2918,
        "chapter": 25,
        "verse": 64,
        "arabic_text": "وَٱلَّذِينَ يَبِيتُونَ لِرَبِّهِمۡ سُجَّدٗا وَقِيَٰمٗا",
        "phonetic": "25.64 Wa Al-Ladhīna Yabītūna Lirabbihim Sujjadāan Wa Qiyāmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.25:64) Ibn ‘Abbâs رضي الله عنهما said: \"Whosoever prayed two Rak‘at or more after the ‘Isha’ (night) prayer, will be considered like those mentioned in this Verse.\" And Al-Kalbi said: \"Whosoever prayed two Rak‘at after the Maghrib (evening) prayer, and four Rak‘at after the ‘Ishâ (night) prayer will be considered like those mentioned in this Verse.\" (Tafsîr Al-Qurtubî).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who spend [part of] the night to their Lord prostrating and standing [in prayer]",
            "english_hilali_khan": "And those who spend the night in worship of their Lord, prostrate and standing.[1]",
            "english_rwwad": "and those who spend the night prostrating and standing before their Lord;"
        }
    },
    {
        "id": 2919,
        "chapter": 25,
        "verse": 65,
        "arabic_text": "وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ٱصۡرِفۡ عَنَّا عَذَابَ جَهَنَّمَۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
        "phonetic": "25.65 Wa Al-Ladhīna Yaqūlūna Rabbanā Aşrif `Annā `Adhāba Jahannama 'Inna `Adhābahā Kāna Gharāmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who say, \"Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering;",
            "english_hilali_khan": "And those who say: \"Our Lord! Avert from us the torment of Hell. Verily its torment is ever an inseparable, permanent punishment.\"",
            "english_rwwad": "and those who say, “Our Lord, turn the punishment of Hell away from us, for its punishment is unrelenting.”"
        }
    },
    {
        "id": 2920,
        "chapter": 25,
        "verse": 66,
        "arabic_text": "إِنَّهَا سَآءَتۡ مُسۡتَقَرّٗا وَمُقَامٗا",
        "phonetic": "25.66 'Innahā Sā'at Mustaqarrāan Wa Muqāmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, it is evil as a settlement and residence.\"",
            "english_hilali_khan": "Evil indeed it (Hell) is as an abode and as a place to rest in.",
            "english_rwwad": "It is an evil place to settle and an evil abode.”"
        }
    },
    {
        "id": 2921,
        "chapter": 25,
        "verse": 67,
        "arabic_text": "وَٱلَّذِينَ إِذَآ أَنفَقُواْ لَمۡ يُسۡرِفُواْ وَلَمۡ يَقۡتُرُواْ وَكَانَ بَيۡنَ ذَٰلِكَ قَوَامٗا",
        "phonetic": "25.67 Wa Al-Ladhīna 'Idhā 'Anfaqū Lam Yusrifū Wa Lam Yaqturū Wa Kāna Bayna Dhālika Qawāmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [they are] those who, when they spend, do so not excessively or sparingly but are ever, between that, [justly] moderate",
            "english_hilali_khan": "And those who, when they spend, are neither extravagant nor niggardly, but hold a medium (way) between those (extremes).",
            "english_rwwad": "And those who neither spend wastefully nor stingily, but are moderate between them;"
        }
    },
    {
        "id": 2922,
        "chapter": 25,
        "verse": 68,
        "arabic_text": "وَٱلَّذِينَ لَا يَدۡعُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ وَلَا يَقۡتُلُونَ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّ وَلَا يَزۡنُونَۚ وَمَن يَفۡعَلۡ ذَٰلِكَ يَلۡقَ أَثَامٗا",
        "phonetic": "25.68 Wa Al-Ladhīna Lā Yad`ūna Ma`a Allāhi 'Ilahāan 'Ākhara Wa Lā Yaqtulūna An-Nafsa Allatī Ĥarrama Allāhu 'Illā Bil-Ĥaqqi Wa Lā Yaznūna Wa Man Yaf`al Dhālika Yalqa 'Athāmāan",
        "footnotes": {
            "english_saheeh": "[1037]- Or \"worship.\"",
            "english_hilali_khan": "(V.25:68)\nA) See the footnote of (V.2:22).\nB) See the footnote of (V.4:135).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who do not invoke[1037] with Allāh another deity or kill the soul which Allāh has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever should do that will meet a penalty.",
            "english_hilali_khan": "And those who invoke not any other ilâh (god) along with Allâh, nor kill such person as Allâh has forbidden, except for just cause, nor commit illegal sexual intercourse - and whoever does this shall receive the punishment.[1]",
            "english_rwwad": "and those who do not invoke besides Allah another god, and who do not kill a soul whom Allah has forbidden, except in the course of justice, and who do not commit adultery, for whoever does any of this will face the penalty,"
        }
    },
    {
        "id": 2923,
        "chapter": 25,
        "verse": 69,
        "arabic_text": "يُضَٰعَفۡ لَهُ ٱلۡعَذَابُ يَوۡمَ ٱلۡقِيَٰمَةِ وَيَخۡلُدۡ فِيهِۦ مُهَانًا",
        "phonetic": "25.69 Yuđā`af Lahu Al-`Adhābu Yawma Al-Qiyāmati Wa Yakhlud Fīhi Muhānāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Multiplied for him is the punishment on the Day of Resurrection, and he will abide therein humiliated -",
            "english_hilali_khan": "The torment will be doubled to him on the Day of Resurrection, and he will abide therein in disgrace;",
            "english_rwwad": "the punishment will be doubled for him on the Day of Resurrection, wherein he will remain disgraced forever,"
        }
    },
    {
        "id": 2924,
        "chapter": 25,
        "verse": 70,
        "arabic_text": "إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلٗا صَٰلِحٗا فَأُوْلَٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَٰتٖۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا",
        "phonetic": "25.70 'Illā Man Tāba Wa 'Āmana Wa `Amila `Amalāan Şāliĥāan Fa'ūlā'ika Yubaddilu Allāhu Sayyi'ātihim Ĥasanātin Wa Kāna Allāhu Ghafūrāan Raĥīmāan ",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.25:70) Islam demolishes all the previous evil deeds and so do migration (for Allah’s sake) and Hajj (pilgrimage to Makkah). [Al-Lu’lu’ Wal-Marjan, Vol. 1, Chapter 52, Page 205]\nNarrated Ibn ‘Abbâs رضي الله عنهما: Some pagans who committed murders in great number and committed illegal sexual intercourse excessively, came to Muhammad صلى الله عليه وسلم and said: \"O Muhammad! Whatever you say, and invite people to, is good, but we wish if you could inform us whether we can make an expiation for our (past evil) deeds.\" So the Divine Verses came: \"Those who invoke not with Allah any other god, nor kill such person as Allah has forbidden except for just cause, nor commit illegal sexual intercourse.\" (V.25:68) \"...Except those who repent...\" (V.25:70).\nAnd there was also revealed: \"Say: O My slaves who have transgressed against their ownselves! (by committing sins), despair not of the Mercy of Allah.\" (V.39:53). (Sahih Al-Bukhari, Vol. 6, Hadîth No. 334).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Except for those who repent, believe and do righteous work. For them Allāh will replace their evil deeds with good. And ever is Allāh Forgiving and Merciful.",
            "english_hilali_khan": "Except those who repent and believe (in Islâmic Monotheism), and do righteous deeds; for those, Allâh will change their sins into good deeds, and Allâh is Oft-Forgiving, Most Merciful.[2]",
            "english_rwwad": "except those who repent and believe, and do righteous deeds; for them Allah will change their evil deeds into good deeds, for Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 2925,
        "chapter": 25,
        "verse": 71,
        "arabic_text": "وَمَن تَابَ وَعَمِلَ صَٰلِحٗا فَإِنَّهُۥ يَتُوبُ إِلَى ٱللَّهِ مَتَابٗا",
        "phonetic": "25.71 Wa Man Tāba Wa `Amila Şāliĥāan Fa'innahu Yatūbu 'Ilá Allāhi Matābāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he who repents and does righteousness does indeed turn to Allāh with [accepted] repentance.",
            "english_hilali_khan": "And whosoever repents and does righteous good deeds; then verily, he repents towards Allâh with true repentance.",
            "english_rwwad": "Whoever repents and does righteous deeds has turned to Allah with sincere repentance."
        }
    },
    {
        "id": 2926,
        "chapter": 25,
        "verse": 72,
        "arabic_text": "وَٱلَّذِينَ لَا يَشۡهَدُونَ ٱلزُّورَ وَإِذَا مَرُّواْ بِٱللَّغۡوِ مَرُّواْ كِرَامٗا",
        "phonetic": "25.72 Wa Al-Ladhīna Lā Yash/hadūna Az-Zūra Wa 'Idhā Marrū Bil-Laghwi Marrū Kirāmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [they are] those who do not testify to falsehood, and when they pass near ill speech, they pass by with dignity.",
            "english_hilali_khan": "And those who do not bear witness to falsehood, and if they pass by some evil play or evil talk, they pass by it with dignity.",
            "english_rwwad": "And those who do not witness falsehood, and when they pass by futility, they pass by with dignity;"
        }
    },
    {
        "id": 2927,
        "chapter": 25,
        "verse": 73,
        "arabic_text": "وَٱلَّذِينَ إِذَا ذُكِّرُواْ بِـَٔايَٰتِ رَبِّهِمۡ لَمۡ يَخِرُّواْ عَلَيۡهَا صُمّٗا وَعُمۡيَانٗا",
        "phonetic": "25.73 Wa Al-Ladhīna 'Idhā Dhukkirū Bi'āyāti Rabbihim Lam Yakhirrū `Alayhā Şummāan Wa `Umyānāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who, when reminded of the verses of their Lord, do not fall upon them deaf and blind.",
            "english_hilali_khan": "And those who, when they are reminded of the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord, fall not deaf and blind thereat.",
            "english_rwwad": "and those who, when they are reminded with the verses of their Lord, they do not turn a deaf ear or a blind eye to them;"
        }
    },
    {
        "id": 2928,
        "chapter": 25,
        "verse": 74,
        "arabic_text": "وَٱلَّذِينَ يَقُولُونَ رَبَّنَا هَبۡ لَنَا مِنۡ أَزۡوَٰجِنَا وَذُرِّيَّٰتِنَا قُرَّةَ أَعۡيُنٖ وَٱجۡعَلۡنَا لِلۡمُتَّقِينَ إِمَامًا",
        "phonetic": "25.74 Wa Al-Ladhīna Yaqūlūna Rabbanā Hab Lanā Min 'Azwājinā Wa Dhurrīyātinā Qurrata 'A`yunin Wa Aj`alnā Lilmuttaqīna 'Imāmāan",
        "footnotes": {
            "english_saheeh": "[1038]- i.e., a source of happiness due to their righteousness.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who say, \"Our Lord, grant us from among our wives and offspring comfort to our eyes[1038] and make us a leader [i.e., example] for the righteous.\"",
            "english_hilali_khan": "And those who say: \"Our Lord! Bestow on us from our wives and our offspring the comfort of our eyes, and make us leaders of the Muttaqûn(the pious. See V.2:2).\"",
            "english_rwwad": "and those who say, “Our Lord, let our spouses and children be a source of joy for us, and make us good examples for the righteous.”"
        }
    },
    {
        "id": 2929,
        "chapter": 25,
        "verse": 75,
        "arabic_text": "أُوْلَٰٓئِكَ يُجۡزَوۡنَ ٱلۡغُرۡفَةَ بِمَا صَبَرُواْ وَيُلَقَّوۡنَ فِيهَا تَحِيَّةٗ وَسَلَٰمًا",
        "phonetic": "25.75 'Ūlā'ika Yujzawna Al-Ghurfata Bimā Şabarū Wa Yulaqqawna Fīhā Taĥīyatan Wa Salāmāan",
        "footnotes": {
            "english_saheeh": "[1039]- The most elevated portion of Paradise.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those will be awarded the Chamber[1039] for what they patiently endured, and they will be received therein with greetings and [words of] peace,",
            "english_hilali_khan": "Those will be rewarded with the highest place (in Paradise) because of their patience. Therein they shall be met with greetings and the word of peace and respect.",
            "english_rwwad": "It is they who will be rewarded with high palaces [in Paradise] for their perseverance, and they will be received therein with salutations and greetings of peace,"
        }
    },
    {
        "id": 2930,
        "chapter": 25,
        "verse": 76,
        "arabic_text": "خَٰلِدِينَ فِيهَاۚ حَسُنَتۡ مُسۡتَقَرّٗا وَمُقَامٗا",
        "phonetic": "25.76 Khālidīna Fīhā Ĥasunat Mustaqarrāan Wa Muqāmāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Abiding eternally therein. Good is the settlement and residence.",
            "english_hilali_khan": "Abiding therein - excellent it is as an abode, and as a place to rest in.",
            "english_rwwad": "abiding therein forever. What an excellent abode and a resting place!"
        }
    },
    {
        "id": 2931,
        "chapter": 25,
        "verse": 77,
        "arabic_text": "قُلۡ مَا يَعۡبَؤُاْ بِكُمۡ رَبِّي لَوۡلَا دُعَآؤُكُمۡۖ فَقَدۡ كَذَّبۡتُمۡ فَسَوۡفَ يَكُونُ لِزَامَۢا",
        "phonetic": "25.77 Qul Mā Ya`ba'u Bikum Rabbī Lawlā Du`ā'uukum Faqad Kadhabtum Fasawfa Yakūnu Lizāmāan",
        "footnotes": {
            "english_saheeh": "[1040]- i.e., faith and worship.  An alternative meaning is \"What would my Lord do with you...\"\n[1041]- It will remain with them, causing punishment to be required and imperative upon them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"What would my Lord care for you if not for your supplication?\"[1040] For you [disbelievers] have denied, so it [i.e., your denial] is going to be adherent.[1041]",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم to the disbelievers): \"My Lord pays attention to you only because of your invocation to Him. But now you have indeed denied (Him). So the torment will be yours for ever (inseparable, permanent punishment).\"",
            "english_rwwad": "Say [O Prophet], “My Lord would not care at all about you, were it not for your supplication. Now since you have rejected [the truth], the inevitable is bound to come.”"
        }
    }
]