[
    {
        "id": 3409,
        "chapter": 30,
        "verse": 1,
        "arabic_text": "الٓمٓ",
        "phonetic": "30.1 'Alif-Lām-Mīm",
        "footnotes": {
            "english_saheeh": "[1138]- See footnote to 2:1.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Alif, Lām, Meem.[1138]",
            "english_hilali_khan": "1. Alif-Lâm-Mîm.",
            "english_rwwad": "Alif Lām Mīm."
        }
    },
    {
        "id": 3410,
        "chapter": 30,
        "verse": 2,
        "arabic_text": "غُلِبَتِ ٱلرُّومُ",
        "phonetic": "30.2 Ghulibati Ar-Rūmu",
        "footnotes": {
            "english_saheeh": "[1139]- By the Persians.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Byzantines have been defeated[1139]",
            "english_hilali_khan": "The Romans have been defeated.",
            "english_rwwad": "The Romans have been defeated"
        }
    },
    {
        "id": 3411,
        "chapter": 30,
        "verse": 3,
        "arabic_text": "فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُونَ",
        "phonetic": "30.3 Fī 'Adná Al-'Arđi Wa Hum Min Ba`di Ghalabihim Sayaghlibūna",
        "footnotes": {
            "english_saheeh": "[1140]- Another meaning is \"in the lowest land.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "In the nearest land.[1140] But they, after their defeat, will overcome",
            "english_hilali_khan": "In the nearest land (Syria, Iraq, Jordan, and Palestine), and they, after their defeat, will be victorious.",
            "english_rwwad": "in a nearby land, but they will gain victory after their defeat"
        }
    },
    {
        "id": 3412,
        "chapter": 30,
        "verse": 4,
        "arabic_text": "فِي بِضۡعِ سِنِينَۗ لِلَّهِ ٱلۡأَمۡرُ مِن قَبۡلُ وَمِنۢ بَعۡدُۚ وَيَوۡمَئِذٖ يَفۡرَحُ ٱلۡمُؤۡمِنُونَ",
        "phonetic": "30.4 Fī Biđ`i Sinīna Lillāhi Al-'Amru Min Qablu Wa Min Ba`du Wa Yawma'idhin Yafraĥu Al-Mu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Within three to nine years. To Allāh belongs the command [i.e., decree] before and after. And that day the believers will rejoice",
            "english_hilali_khan": "Within three to nine years. The decision of the matter, before and after (these events) is only with Allâh, (before the defeat of the Romans by the Persians, and after the defeat of the Persians by the Romans). And on that Day, the believers (i.e. Muslims) will rejoice (at the victory given by Allâh to the Romans against the Persians) -",
            "english_rwwad": "within a few years. To Allah belongs the whole matter before and after [the victory]. On that day the believers will rejoice"
        }
    },
    {
        "id": 3413,
        "chapter": 30,
        "verse": 5,
        "arabic_text": "بِنَصۡرِ ٱللَّهِۚ يَنصُرُ مَن يَشَآءُۖ وَهُوَ ٱلۡعَزِيزُ ٱلرَّحِيمُ",
        "phonetic": "30.5 Binaşri Allāhi Yanşuru Man Yashā'u Wa Huwa Al-`Azīzu Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "[1141]- i.e., the victory given by Allāh to a people of the Scripture (Christians) over the Magians of Persia.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "In the victory of Allāh.[1141] He gives victory to whom He wills, and He is the Exalted in Might, the Merciful.",
            "english_hilali_khan": "With the help of Allâh. He helps whom He wills, and He is the All-Mighty, the Most Merciful.",
            "english_rwwad": "at the victory granted by Allah. He gives victory to whom He wills, and He is the All-Mighty, the Most Merciful."
        }
    },
    {
        "id": 3414,
        "chapter": 30,
        "verse": 6,
        "arabic_text": "وَعۡدَ ٱللَّهِۖ لَا يُخۡلِفُ ٱللَّهُ وَعۡدَهُۥ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
        "phonetic": "30.6 Wa`da Allāhi Lā Yukhlifu Allāhu Wa`dahu Wa Lakinna 'Akthara An-Nāsi Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[It is] the promise of Allāh. Allāh does not fail in His promise, but most of the people do not know.",
            "english_hilali_khan": "(It is) a Promise of Allâh (i.e. Allâh will give victory to the Romans against the Persians), and Allâh fails not in His Promise, but most of men know not.",
            "english_rwwad": "This is the promise of Allah. Allah never breaks His promise, but most people do not know."
        }
    },
    {
        "id": 3415,
        "chapter": 30,
        "verse": 7,
        "arabic_text": "يَعۡلَمُونَ ظَٰهِرٗا مِّنَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ عَنِ ٱلۡأٓخِرَةِ هُمۡ غَٰفِلُونَ",
        "phonetic": "30.7 Ya`lamūna Žāhirāan Mina Al-Ĥayāati Ad-Dunyā Wa Hum `Ani Al-'Ākhirati Hum Ghāfilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They know what is apparent of the worldly life, but they, of the Hereafter, are unaware.",
            "english_hilali_khan": "They know only the outside appearance of the life of the world (i.e. the matters of their livelihood, like irrigating or sowing or reaping, etc.), and they are heedless of the Hereafter.",
            "english_rwwad": "They only know the apparent life of this world, but they are heedless of the Hereafter."
        }
    },
    {
        "id": 3416,
        "chapter": 30,
        "verse": 8,
        "arabic_text": "أَوَلَمۡ يَتَفَكَّرُواْ فِيٓ أَنفُسِهِمۗ مَّا خَلَقَ ٱللَّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۗ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ بِلِقَآيِٕ رَبِّهِمۡ لَكَٰفِرُونَ",
        "phonetic": "30.8 'Awalam Yatafakkarū Fī 'Anfusihim Mā Khalaqa Allāhu As-Samāwāti Wa Al-'Arđa Wa Mā Baynahumā 'Illā Bil-Ĥaqqi Wa 'Ajalin Musammáan Wa 'Inna Kathīrāan Mina An-Nāsi Biliqā'i Rabbihim Lakāfirūna",
        "footnotes": {
            "english_saheeh": "[1142]- An additional meaning is \"Do they not contemplate concerning themselves.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not contemplate within themselves?[1142] Allāh has not created the heavens and the earth and what is between them except in truth and for a specified term. And indeed, many of the people, in the meeting with their Lord, are disbelievers.",
            "english_hilali_khan": "Do they not think deeply (in their ownselves) about themselves (how Allâh created them from nothing, and similarly He will resurrect them)? Allâh has created not the heavens and the earth, and all that is between them, except with truth and for an appointed term. And indeed many of mankind deny the Meeting with their Lord. [Tafsir At-Tabarî].",
            "english_rwwad": "Do they not reflect on themselves? Allah did not create the heavens and earth and all that is between them except for a true purpose and for an appointed term, but most people deny the meeting with their Lord."
        }
    },
    {
        "id": 3417,
        "chapter": 30,
        "verse": 9,
        "arabic_text": "أَوَلَمۡ يَسِيرُواْ فِي ٱلۡأَرۡضِ فَيَنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَانُوٓاْ أَشَدَّ مِنۡهُمۡ قُوَّةٗ وَأَثَارُواْ ٱلۡأَرۡضَ وَعَمَرُوهَآ أَكۡثَرَ مِمَّا عَمَرُوهَا وَجَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ",
        "phonetic": "30.9 'Awalam Yasīrū Fī Al-'Arđi Fayanžurū Kayfa Kāna `Āqibatu Al-Ladhīna Min Qablihim Kānū 'Ashadda Minhum Qūwatan Wa 'Athārū Al-'Arđa Wa `Amarūhā 'Akthara Mimmā `Amarūhā Wa Jā'at/hum Rusuluhum Bil-Bayyināti Famā Kāna Allāhu Liyažlimahum Wa Lakin Kānū 'Anfusahum Yažlimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have they not traveled through the earth and observed how was the end of those before them? They were greater than them in power, and they plowed [or excavated] the earth and built it up more than they [i.e., the Makkans] have built it up, and their messengers came to them with clear evidences. And Allāh would not ever have wronged them, but they were wronging themselves.",
            "english_hilali_khan": "Do they not travel in the land, and see what was the end of those before them? They were superior to them in strength, and they tilled the earth and populated it in greater numbers than these (pagans) have done: and there came to them their Messengers with clear proofs. Surely, Allâh wronged them not, but they used to wrong themselves.",
            "english_rwwad": "Have they not traveled through the land to see how was the end of those who came before them? They were more powerful than them, and they tilled the land and built it more than these people have ever built. Their messengers came to them with clear proofs. It was not Allah Who wronged them, but it was they who wronged themselves."
        }
    },
    {
        "id": 3418,
        "chapter": 30,
        "verse": 10,
        "arabic_text": "ثُمَّ كَانَ عَٰقِبَةَ ٱلَّذِينَ أَسَٰٓـُٔواْ ٱلسُّوٓأَىٰٓ أَن كَذَّبُواْ بِـَٔايَٰتِ ٱللَّهِ وَكَانُواْ بِهَا يَسۡتَهۡزِءُونَ",
        "phonetic": "30.10 Thumma Kāna `Āqibata Al-Ladhīna 'Asā'ū As-Sū'á 'An Kadhabū Bi'āyāti Allāhi Wa Kānū Bihā Yastahzi'ūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then the end of those who did evil was the worst [consequence] because they denied the signs of Allāh and used to ridicule them.",
            "english_hilali_khan": "Then evil was the end of those who did evil, because they belied the Ayât (proofs, evidence, verses, lessons, signs, revelations, Messengers, etc.) of Allâh and made a mockery of them.",
            "english_rwwad": "Then the end of the evildoers was utterly evil because they rejected the signs of Allah and used to ridicule them."
        }
    },
    {
        "id": 3419,
        "chapter": 30,
        "verse": 11,
        "arabic_text": "ٱللَّهُ يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ ثُمَّ إِلَيۡهِ تُرۡجَعُونَ",
        "phonetic": "30.11 Allāhu Yabda'u Al-Khalqa Thumma Yu`īduhu Thumma 'Ilayhi Turja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh begins creation; then He will repeat it; then to Him you will be returned.",
            "english_hilali_khan": "Allâh (Alone) originates the creation, then He will repeat it, then to Him you will be returned.",
            "english_rwwad": "Allah brings the creation into being, then He will repeat it, then to Him you will be returned."
        }
    },
    {
        "id": 3420,
        "chapter": 30,
        "verse": 12,
        "arabic_text": "وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يُبۡلِسُ ٱلۡمُجۡرِمُونَ",
        "phonetic": "30.12 Wa Yawma Taqūmu As-Sā`atu Yublisu Al-Mujrimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the Day the Hour appears the criminals will be in despair.",
            "english_hilali_khan": "And on the Day when the Hour will be established, the Mujrimûn (disbelievers, sinners, criminals, polytheists) will be plunged into destruction with (deep regrets, sorrows, and) despair.",
            "english_rwwad": "On the Day when the Hour begins, the wicked will be in utmost despair."
        }
    },
    {
        "id": 3421,
        "chapter": 30,
        "verse": 13,
        "arabic_text": "وَلَمۡ يَكُن لَّهُم مِّن شُرَكَآئِهِمۡ شُفَعَٰٓؤُاْ وَكَانُواْ بِشُرَكَآئِهِمۡ كَٰفِرِينَ",
        "phonetic": "30.13 Wa Lam Yakun Lahum Min Shurakā'ihim Shufa`ā'u Wa Kānū Bishurakā'ihim Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there will not be for them among their [alleged] partners any intercessors, and they will [then] be disbelievers in their partners.",
            "english_hilali_khan": "No intercessors will they have from those whom they made equal with Allâh (partners i.e. their so-called associate gods), and they will (themselves) reject and deny their partners.",
            "english_rwwad": "They will have no intercessors among their [so-called] partners, rather they will disown those partners."
        }
    },
    {
        "id": 3422,
        "chapter": 30,
        "verse": 14,
        "arabic_text": "وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يَوۡمَئِذٖ يَتَفَرَّقُونَ",
        "phonetic": "30.14 Wa Yawma Taqūmu As-Sā`atu Yawma'idhin Yatafarraqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the Day the Hour appears - that Day they will become separated.",
            "english_hilali_khan": "And on the Day when the Hour will be established - that Day shall (all men) be separated (i.e. the believers will be separated from the disbelievers).",
            "english_rwwad": "On the Day when the Hour begins, the people will then be separated:"
        }
    },
    {
        "id": 3423,
        "chapter": 30,
        "verse": 15,
        "arabic_text": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَهُمۡ فِي رَوۡضَةٖ يُحۡبَرُونَ",
        "phonetic": "30.15 Fa'ammā Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Fahum Fī Rawđatin Yuĥbarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And as for those who had believed and done righteous deeds, they will be in a garden [of Paradise], delighted.",
            "english_hilali_khan": "Then as for those who believed (in the Oneness of Allâh - Islâmic Monotheism) and did righteous good deeds, such shall be honoured and made to enjoy luxurious life (forever) in a Garden of Delight (Paradise).",
            "english_rwwad": "As for those who believed and did righteous deeds, they will be rejoicing in a garden [of Paradise]."
        }
    },
    {
        "id": 3424,
        "chapter": 30,
        "verse": 16,
        "arabic_text": "وَأَمَّا ٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَا وَلِقَآيِٕ ٱلۡأٓخِرَةِ فَأُوْلَٰٓئِكَ فِي ٱلۡعَذَابِ مُحۡضَرُونَ",
        "phonetic": "30.16 Wa 'Ammā Al-Ladhīna Kafarū Wa Kadhabū Bi'āyātinā Wa Liqā'i Al-'Ākhirati Fa'ūlā'ika Fī Al-`Adhābi Muĥđarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for those who disbelieved and denied Our verses and the meeting of the Hereafter, those will be brought into the punishment [to remain].",
            "english_hilali_khan": "And as for those who disbelieved and belied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, Allâh’s Messengers, Resurrection, etc.), and the Meeting of the Hereafter, such shall be brought forth to the torment (in the Hell-fire).",
            "english_rwwad": "And as for those who disbelieved, and rejected Our signs and the meeting of the Hereafter, they will be arraigned for punishment."
        }
    },
    {
        "id": 3425,
        "chapter": 30,
        "verse": 17,
        "arabic_text": "فَسُبۡحَٰنَ ٱللَّهِ حِينَ تُمۡسُونَ وَحِينَ تُصۡبِحُونَ",
        "phonetic": "30.17 Fasubĥāna Allāhi Ĥīna Tumsūna Wa Ĥīna Tuşbiĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So exalted is Allāh when you reach the evening and when you reach the morning.",
            "english_hilali_khan": "So glorify Allâh [above all that (evil) they associate with Him (O believers)] when you come up to the evening [i.e. offer the (Maghrib ) sunset and (‘Ishâ’) night prayers], and when you enter the morning [i.e. offer the (Fajr) morning prayer].",
            "english_rwwad": "So glory be to Allah in the evening and in the morning,"
        }
    },
    {
        "id": 3426,
        "chapter": 30,
        "verse": 18,
        "arabic_text": "وَلَهُ ٱلۡحَمۡدُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَعَشِيّٗا وَحِينَ تُظۡهِرُونَ",
        "phonetic": "30.18 Wa Lahu Al-Ĥamdu Fī As-Samāwāti Wa Al-'Arđi Wa `Ashīyāan Wa Ĥīna Tužhirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Him is [due all] praise throughout the heavens and the earth. And [exalted is He] at night and when you are at noon.",
            "english_hilali_khan": "And His are all the praises and thanks in the heavens and the earth; and (glorify Him) in the afternoon (i.e. offer ‘Asr prayer) and when you come up to the time, when the day begins to decline (i.e. offer Zuhr prayer). (Ibn ‘Abbâs said: \"These are the five compulsory congregational prayers mentioned in the Qur’ân).\" [Tafsir At-Tabari]",
            "english_rwwad": "and all praise is due to Him in the heavens and earth – and [glorify Him] in the afternoon and at noon."
        }
    },
    {
        "id": 3427,
        "chapter": 30,
        "verse": 19,
        "arabic_text": "يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَيُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّ وَيُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ وَكَذَٰلِكَ تُخۡرَجُونَ",
        "phonetic": "30.19 Yukhriju Al-Ĥayya Mina Al-Mayyiti Wa Yukhriju Al-Mayyita Mina Al-Ĥayyi Wa Yuĥyī Al-'Arđa Ba`da Mawtihā Wa Kadhalika Tukhrajūna",
        "footnotes": {
            "english_saheeh": "[1143]- Of the graves or out of the earth at the time of resurrection.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He brings the living out of the dead and brings the dead out of the living and brings to life the earth after its lifelessness. And thus will you be brought out.[1143]",
            "english_hilali_khan": "He brings out the living from the dead, and brings out the dead from the living. And He revives the earth after its death. And thus shall you be brought out (resurrected).",
            "english_rwwad": "He brings the living out of the dead and the dead out of the living, and gives life to the earth after its death. This is how you will be brought forth."
        }
    },
    {
        "id": 3428,
        "chapter": 30,
        "verse": 20,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَكُم مِّن تُرَابٖ ثُمَّ إِذَآ أَنتُم بَشَرٞ تَنتَشِرُونَ",
        "phonetic": "30.20 Wa Min 'Āyātihi 'An Khalaqakum Min Turābin Thumma 'Idhā 'Antum Basharun Tantashirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is that He created you from dust; then, suddenly you were human beings dispersing [throughout the earth].",
            "english_hilali_khan": "And among His Signs is this, that He created you (Adam) from dust, and then [Hawwâ’ (Eve) from Adam’s rib, and then his offspring from the semen, and], - behold you are human beings scattered!",
            "english_rwwad": "Among His signs is that He created you from dust, then you became human beings spreading [on the earth]."
        }
    },
    {
        "id": 3429,
        "chapter": 30,
        "verse": 21,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا لِّتَسۡكُنُوٓاْ إِلَيۡهَا وَجَعَلَ بَيۡنَكُم مَّوَدَّةٗ وَرَحۡمَةًۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ",
        "phonetic": "30.21 Wa Min 'Āyātihi 'An Khalaqa Lakum Min 'Anfusikum 'Azwājāan Litaskunū 'Ilayhā Wa Ja`ala Baynakum Mawaddatan Wa Raĥmatan 'Inna Fī Dhālika La'āyātin Liqawmin Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is that He created for you from yourselves mates that you may find tranquility in them; and He placed between you affection and mercy. Indeed in that are signs for a people who give thought.",
            "english_hilali_khan": "And among His Signs is this, that He created for you wives from among yourselves, that you may find repose in them, and He has put between you affection and mercy. Verily, in that are indeed signs for a people who reflect.",
            "english_rwwad": "And among His signs is that He created for you spouses from among yourselves that you may find comfort in them, and He placed between you love and mercy. Indeed, there are signs in this for people who reflect."
        }
    },
    {
        "id": 3430,
        "chapter": 30,
        "verse": 22,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦ خَلۡقُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفُ أَلۡسِنَتِكُمۡ وَأَلۡوَٰنِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّلۡعَٰلِمِينَ",
        "phonetic": "30.22 Wa Min 'Āyātihi Khalqu As-Samāwāti Wa Al-'Arđi Wa Akhtilāfu 'Alsinatikum Wa 'Alwānikum 'Inna Fī Dhālika La'āyātin Lil`ālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is the creation of the heavens and the earth and the diversity of your languages and your colors. Indeed in that are signs for those of knowledge.",
            "english_hilali_khan": "And among His Signs is the creation of the heavens and the earth, and the difference of your languages and colours. Verily, in that are indeed signs for men of sound knowledge.",
            "english_rwwad": "And among His signs is the creation of the heavens and earth, and the diversity of your tongues and colors. Indeed, there are signs in this for those who have knowledge."
        }
    },
    {
        "id": 3431,
        "chapter": 30,
        "verse": 23,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦ مَنَامُكُم بِٱلَّيۡلِ وَٱلنَّهَارِ وَٱبۡتِغَآؤُكُم مِّن فَضۡلِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَسۡمَعُونَ",
        "phonetic": "30.23 Wa Min 'Āyātihi Manāmukum Bil-Layli Wa An-Nahāri Wa Abtighā'uukum Min Fađlihi 'Inna Fī Dhālika La'āyātin Liqawmin Yasma`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.30:23) It is a sign from among the Signs of Allah that a person goes to sleep; the medical world up to now does not know exactly why a person goes to sleep. There are only theories. So this Qur’ân is a miracle from Allah, and not an invented tale as the disbelievers (in the Oneness of Allah) argue.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is your sleep by night and day and your seeking of His bounty. Indeed in that are signs for a people who listen.",
            "english_hilali_khan": "And among His Signs is your sleep[1] by night and by day, and your seeking of His Bounty. Verily, in that are indeed signs for a people who listen.",
            "english_rwwad": "And among His signs is your sleep by night and day, and your seeking of His bounty [by day]. Indeed, there are signs in this for people who listen."
        }
    },
    {
        "id": 3432,
        "chapter": 30,
        "verse": 24,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦ يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنَزِّلُ مِنَ ٱلسَّمَآءِ مَآءٗ فَيُحۡيِۦ بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ",
        "phonetic": "30.24 Wa Min 'Āyātihi Yurīkumu Al-Barqa Khawfāan Wa Ţama`āan Wa Yunazzilu Mina As-Samā'i Mā'an Fayuĥyī Bihi Al-'Arđa Ba`da Mawtihā 'Inna Fī Dhālika La'āyātin Liqawmin Ya`qilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is [that] He shows you the lightning [causing] fear and aspiration, and He sends down rain from the sky by which He brings to life the earth after its lifelessness. Indeed in that are signs for a people who use reason.",
            "english_hilali_khan": "And among His Signs is that He shows you the lightning, for fear and for hope, and He sends down water (rain) from the sky, and therewith revives the earth after its death. Verily, in that are indeed signs for a people who understand.",
            "english_rwwad": "And among His signs is that He shows you lightning, causing fear and hope, and He sends down water from the sky, reviving therewith the earth after its death. Indeed, there are signs in this for people who understand."
        }
    },
    {
        "id": 3433,
        "chapter": 30,
        "verse": 25,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦٓ أَن تَقُومَ ٱلسَّمَآءُ وَٱلۡأَرۡضُ بِأَمۡرِهِۦۚ ثُمَّ إِذَا دَعَاكُمۡ دَعۡوَةٗ مِّنَ ٱلۡأَرۡضِ إِذَآ أَنتُمۡ تَخۡرُجُونَ",
        "phonetic": "30.25 Wa Min 'Āyātihi 'An Taqūma As-Samā'u Wa Al-'Arđu Bi'amrihi Thumma 'Idhā Da`ākum Da`watan Mina Al-'Arđi 'Idhā 'Antum Takhrujūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is that the heaven and earth stand [i.e., remain] by His command. Then when He calls you with a [single] call from the earth, immediately you will come forth.",
            "english_hilali_khan": "And among His Signs is that the heaven and the earth stand by His Command. Then afterwards when He will call you by a single call, behold, you will come out from the earth (i.e. from your graves for reckoning and recompense).",
            "english_rwwad": "And among His signs is that the sky and earth are maintained by His command. Then when He calls you out of the earth, you will immediately come forth."
        }
    },
    {
        "id": 3434,
        "chapter": 30,
        "verse": 26,
        "arabic_text": "وَلَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ",
        "phonetic": "30.26 Wa Lahu Man Fī As-Samāwāti Wa Al-'Arđi Kullun Lahu Qānitūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Him belongs whoever is in the heavens and earth. All are to Him devoutly obedient.",
            "english_hilali_khan": "To Him belongs whatever is in the heavens and the earth. All are obedient to Him.",
            "english_rwwad": "To Him belong all those who are in the heavens and earth; all are devotedly obedient to Him."
        }
    },
    {
        "id": 3435,
        "chapter": 30,
        "verse": 27,
        "arabic_text": "وَهُوَ ٱلَّذِي يَبۡدَؤُاْ ٱلۡخَلۡقَ ثُمَّ يُعِيدُهُۥ وَهُوَ أَهۡوَنُ عَلَيۡهِۚ وَلَهُ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
        "phonetic": "30.27 Wa Huwa Al-Ladhī Yabda'u Al-Khalqa Thumma Yu`īduhu Wa Huwa 'Ahwanu `Alayhi Wa Lahu Al-Mathalu Al-'A`lá Fī As-Samāwāti Wa Al-'Arđi Wa Huwa Al-`Azīzu Al-Ĥakīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who begins creation; then He repeats it, and that is [even] easier for Him. To Him belongs the highest description [i.e., attribute] in the heavens and earth. And He is the Exalted in Might, the Wise.",
            "english_hilali_khan": "And He it is Who originates the creation, then He will repeat it (after it has been perished); and this is easier for Him. His is the highest description (i.e. none has the right to be worshipped but He, and there is nothing comparable unto Him) in the heavens and in the earth. And He is the All-Mighty, the All-Wise.",
            "english_rwwad": "It is He Who originates the creation then repeats it, which is easier for Him. To Him belong the most sublime attributes in the heavens and earth, and He is the All-Mighty, the All-Wise."
        }
    },
    {
        "id": 3436,
        "chapter": 30,
        "verse": 28,
        "arabic_text": "ضَرَبَ لَكُم مَّثَلٗا مِّنۡ أَنفُسِكُمۡۖ هَل لَّكُم مِّن مَّا مَلَكَتۡ أَيۡمَٰنُكُم مِّن شُرَكَآءَ فِي مَا رَزَقۡنَٰكُمۡ فَأَنتُمۡ فِيهِ سَوَآءٞ تَخَافُونَهُمۡ كَخِيفَتِكُمۡ أَنفُسَكُمۡۚ كَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡقِلُونَ",
        "phonetic": "30.28 Đaraba Lakum Mathalāan Min 'Anfusikum Hal Lakum Min Mā Malakat 'Aymānukum Min Shurakā'a Fī Mā Razaqnākum Fa'antum Fīhi Sawā'un Takhāfūnahum Kakhīfatikum 'Anfusakum Kadhālika Nufaşşilu Al-'Āyāti Liqawmin Ya`qilūna",
        "footnotes": {
            "english_saheeh": "[1144]- See footnote to 16:71.",
            "english_hilali_khan": "(V.30:28) That is: How do you join to Us partners of that which We created, while you for yourselves will not accept partners from your slaves?.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He presents to you an example from yourselves. Do you have among those whom your right hands possess [i.e., slaves] any partners in what We have provided for you so that you are equal therein [and] would fear them as your fear of one another [within a partnership]?[1144] Thus do We detail the verses for a people who use reason.",
            "english_hilali_khan": "He sets forth for you a parable from your ownselves: Do you have partners among those whom your right hands possess (i.e. your slaves) to share as equals in the wealth We have bestowed on you whom you fear as you fear each other? Thus do We explain the signs in detail to a people who have sense.[1]",
            "english_rwwad": "He makes this comparison for you from your own lives: do you have among your slaves any partners who equally share with you whatever wealth we have given you, so you are fearing them as you fear one another? This is how We make the verses clear for people who understand."
        }
    },
    {
        "id": 3437,
        "chapter": 30,
        "verse": 29,
        "arabic_text": "بَلِ ٱتَّبَعَ ٱلَّذِينَ ظَلَمُوٓاْ أَهۡوَآءَهُم بِغَيۡرِ عِلۡمٖۖ فَمَن يَهۡدِي مَنۡ أَضَلَّ ٱللَّهُۖ وَمَا لَهُم مِّن نَّٰصِرِينَ",
        "phonetic": "30.29 Bal Attaba`a Al-Ladhīna Žalamū 'Ahwā'ahum Bighayri `Ilmin Faman Yahdī Man 'Ađalla Allāhu Wa Mā Lahum Min Nāşirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who wrong follow their [own] desires without knowledge. Then who can guide one whom Allāh has sent astray? And for them there are no helpers.",
            "english_hilali_khan": "Nay, but those who do wrong follow their own lusts without knowledge. Then who will guide him whom Allâh has sent astray? And for such there will be no helpers.",
            "english_rwwad": "In fact, the wrongdoers follow their own desires without any knowledge. Who can guide those whom Allah caused to stray? They will have no helpers."
        }
    },
    {
        "id": 3438,
        "chapter": 30,
        "verse": 30,
        "arabic_text": "فَأَقِمۡ وَجۡهَكَ لِلدِّينِ حَنِيفٗاۚ فِطۡرَتَ ٱللَّهِ ٱلَّتِي فَطَرَ ٱلنَّاسَ عَلَيۡهَاۚ لَا تَبۡدِيلَ لِخَلۡقِ ٱللَّهِۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
        "phonetic": "30.30 Fa'aqim Wajhaka Lilddīni Ĥanīfāan Fiţrata Allāhi Allatī Faţara An-Nāsa `Alayhā Lā Tabdīla Likhalqi Allāhi Dhālika Ad-Dīnu Al-Qayyimu Wa Lakinna 'Akthara An-Nāsi Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[1145]- The natural inborn inclination of man to worship his Creator prior to the corruption of his nature by external influences.  Thus, Islāmic monotheism is described as the religion of fiṭrah - that of the inherent nature of mankind.\n[1146]- i.e., let people remain true to their fiṭrah within the religion of Islām.",
            "english_hilali_khan": "(V.30:30) See the footnote of (V.10:19).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So direct your face [i.e., self] toward the religion, inclining to truth. [Adhere to] the fiṭrah[1145] of Allāh upon which He has created [all] people. No change should there be in the creation of Allāh.[1146] That is the correct religion, but most of the people do not know.",
            "english_hilali_khan": "So set you (O Muhammad صلى الله عليه وسلم) your face towards the religion (of pure Islâmic Monotheism) Hanîf (worship none but Allâh Alone). Allâh’s Fitrah (i.e. Allâh’s Islâmic Monotheism) with which He has created mankind. No change let there be in Khalq-illâh (i.e. the religion of Allâh - Islâmic Monotheism): that is the straight religion, but most of men know not.[2] [Tafsir At-Tabarî]",
            "english_rwwad": "Adhere sincerely to the true religion in all uprightness. This is the natural disposition with which Allah has created mankind. There is no change in Allah’s creation. This is the straight religion, but most people do not know."
        }
    },
    {
        "id": 3439,
        "chapter": 30,
        "verse": 31,
        "arabic_text": "۞ مُنِيبِينَ إِلَيۡهِ وَٱتَّقُوهُ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَلَا تَكُونُواْ مِنَ ٱلۡمُشۡرِكِينَ",
        "phonetic": "30.31 Munībīna 'Ilayhi Wa Attaqūhu Wa 'Aqīmū Aş-Şalāata Wa Lā Takūnū Mina Al-Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Adhere to it], turning in repentance to Him, and fear Him and establish prayer and do not be of those who associate others with Allāh",
            "english_hilali_khan": "(And remain always) turning in repentance to Him (only), and be afraid and dutiful to Him; and perform As-Salât (Iqâmat-as-Salât) and be not of Al-Mushrikûn (the polytheists, idolaters, disbelievers in the Oneness of Allah).",
            "english_rwwad": "Turn to Him [in repentance] and fear Him, and establish prayer, and do not be among those who associate partners with Allah,"
        }
    },
    {
        "id": 3440,
        "chapter": 30,
        "verse": 32,
        "arabic_text": "مِنَ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗاۖ كُلُّ حِزۡبِۭ بِمَا لَدَيۡهِمۡ فَرِحُونَ",
        "phonetic": "30.32 Mina Al-Ladhīna Farraqū Dīnahum Wa Kānū Shiya`āan Kullu Ĥizbin Bimā Ladayhim Fariĥūna",
        "footnotes": {
            "english_saheeh": "[1147]- Of beliefs, opinions, customs, etc.",
            "english_hilali_khan": "(V.30:32) See the footnote of (V.3:103).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Or] of those who have divided their religion and become sects, every faction rejoicing in what it has.[1147]",
            "english_hilali_khan": "Of those who split up their religion (i.e. who left the true Islâmic Monotheism), and became sects, [i.e. they invented new things in the religion (Bid‘ah ), and followed their vain desires], each sect rejoicing in that which is with it.[3]",
            "english_rwwad": "those who split up their religion and became sects, each party rejoicing in what it has."
        }
    },
    {
        "id": 3441,
        "chapter": 30,
        "verse": 33,
        "arabic_text": "وَإِذَا مَسَّ ٱلنَّاسَ ضُرّٞ دَعَوۡاْ رَبَّهُم مُّنِيبِينَ إِلَيۡهِ ثُمَّ إِذَآ أَذَاقَهُم مِّنۡهُ رَحۡمَةً إِذَا فَرِيقٞ مِّنۡهُم بِرَبِّهِمۡ يُشۡرِكُونَ",
        "phonetic": "30.33 Wa 'Idhā Massa An-Nāsa Đurrun Da`aw Rabbahum Munībīna 'Ilayhi Thumma 'Idhā 'Adhāqahum Minhu Raĥmatan 'Idhā Farīqun Minhum Birabbihim Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when adversity touches the people, they call upon their Lord, turning in repentance to Him. Then when He lets them taste mercy from Him, at once a party of them associate others with their Lord,",
            "english_hilali_khan": "And when harm touches men, they cry sincerely only to their Lord (Allâh), turning to Him in repentance; but when He gives them a taste of His Mercy, behold, a party of them associates partners in worship with their Lord.",
            "english_rwwad": "When people are afflicted with hardship, they cry out to their Lord, turning to Him penitently. But as soon as He gives them a taste of His mercy, some of them associate partners with their Lord,"
        }
    },
    {
        "id": 3442,
        "chapter": 30,
        "verse": 34,
        "arabic_text": "لِيَكۡفُرُواْ بِمَآ ءَاتَيۡنَٰهُمۡۚ فَتَمَتَّعُواْ فَسَوۡفَ تَعۡلَمُونَ",
        "phonetic": "30.34 Liyakfurū Bimā 'Ātaynāhum Fatamatta`ū Fasawfa Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[1148]- Or \"So let them deny what We have granted them.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So that they will deny what We have granted them.[1148] Then enjoy yourselves, for you are going to know.",
            "english_hilali_khan": "So as to be ungrateful for the graces which We have bestowed on them. Then enjoy (your short life); but you will come to know.",
            "english_rwwad": "showing their ingratitude for what We have given them. Then enjoy yourselves for a while, but you will soon come to know."
        }
    },
    {
        "id": 3443,
        "chapter": 30,
        "verse": 35,
        "arabic_text": "أَمۡ أَنزَلۡنَا عَلَيۡهِمۡ سُلۡطَٰنٗا فَهُوَ يَتَكَلَّمُ بِمَا كَانُواْ بِهِۦ يُشۡرِكُونَ",
        "phonetic": "30.35 'Am 'Anzalnā `Alayhim Sulţānāan Fahuwa Yatakallamu Bimā Kānū Bihi Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or have We sent down to them an authority [i.e., a proof or scripture], and it speaks of what they have been associating with Him?",
            "english_hilali_khan": "Or have We revealed to them an authority (a Scripture), which speaks of that which they have been associating with Him?",
            "english_rwwad": "Is it that We have sent down to them any authority that speaks in support of their associating partners with Him?"
        }
    },
    {
        "id": 3444,
        "chapter": 30,
        "verse": 36,
        "arabic_text": "وَإِذَآ أَذَقۡنَا ٱلنَّاسَ رَحۡمَةٗ فَرِحُواْ بِهَاۖ وَإِن تُصِبۡهُمۡ سَيِّئَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ إِذَا هُمۡ يَقۡنَطُونَ",
        "phonetic": "30.36 Wa 'Idhā 'Adhaqnā An-Nāsa Raĥmatan Fariĥū Bihā Wa 'In Tuşibhum Sayyi'atun Bimā Qaddamat 'Aydīhim 'Idhā Hum Yaqnaţūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when We let the people taste mercy, they rejoice therein, but if evil afflicts them for what their hands have put forth, immediately they despair.",
            "english_hilali_khan": "And when We cause mankind to taste of mercy, they rejoice therein; but when some evil afflicts them because of (evil deeds and sins) that their (own) hands have sent forth, behold, they are in despair!",
            "english_rwwad": "When We give people a taste of mercy, they rejoice in pride. But when they are afflicted with evil because of what their hands have done, they fall into utter despair."
        }
    },
    {
        "id": 3445,
        "chapter": 30,
        "verse": 37,
        "arabic_text": "أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "30.37 'Awalam Yaraw 'Anna Allāha Yabsuţu Ar-Rizqa Liman Yashā'u Wa Yaqdiru 'Inna Fī Dhālika La'āyātin Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not see that Allāh extends provision for whom He wills and restricts [it]? Indeed in that are signs for a people who believe.",
            "english_hilali_khan": "Do they not see that Allâh enlarges the provision for whom He wills and straitens (it for whom He wills). Verily, in that are indeed signs for a people who believe.",
            "english_rwwad": "Do they not see that Allah extends provision to whom He wills or restricts it? Indeed, there are signs in this for people who believe."
        }
    },
    {
        "id": 3446,
        "chapter": 30,
        "verse": 38,
        "arabic_text": "فَـَٔاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِۚ ذَٰلِكَ خَيۡرٞ لِّلَّذِينَ يُرِيدُونَ وَجۡهَ ٱللَّهِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
        "phonetic": "30.38 Fa'āti Dhā Al-Qurbá Ĥaqqahu Wa Al-Miskīna Wa Abna As-Sabīli Dhālika Khayrun Lilladhīna Yurīdūna Wajha Allāhi Wa 'Ūlā'ika Humu Al-Mufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So give the relative his right, as well as the needy and the traveler. That is best for those who desire the face [i.e., approval] of Allāh, and it is they who will be the successful.",
            "english_hilali_khan": "So give to the kindred his due, and to Al-Miskîn (the poor) and to the wayfarer. That is best for those who seek Allâh’s Countenance; and it is they who will be successful.",
            "english_rwwad": "So give your close relatives their due, and the needy, and the wayfarer. That is best for those who seek Allah’s pleasure, and it is they who will be successful."
        }
    },
    {
        "id": 3447,
        "chapter": 30,
        "verse": 39,
        "arabic_text": "وَمَآ ءَاتَيۡتُم مِّن رِّبٗا لِّيَرۡبُوَاْ فِيٓ أَمۡوَٰلِ ٱلنَّاسِ فَلَا يَرۡبُواْ عِندَ ٱللَّهِۖ وَمَآ ءَاتَيۡتُم مِّن زَكَوٰةٖ تُرِيدُونَ وَجۡهَ ٱللَّهِ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُضۡعِفُونَ",
        "phonetic": "30.39 Wa Mā 'Ātaytum Min Ribāan Liyarbuwā Fī 'Amwāli An-Nāsi Falā Yarbū `Inda Allāhi Wa Mā 'Ātaytum Min Zakāatin Turīdūna Wajha Allāhi Fa'ūlā'ika Humu Al-Muđ`ifūna",
        "footnotes": {
            "english_saheeh": "[1149]- The phrase includes several connotations, among them:  a) that which is given as usury or interest, b) that which is given on the condition that it be repaid with interest, and c) a gift given with the intention of obtaining from the recipient greater benefit or a larger gift.\n[1150]- The meaning of ṣadaqah (voluntary charity) is included here.\n[1151]- Of their blessings on earth and their rewards in the Hereafter.",
            "english_hilali_khan": "(V.30:39) See Tafsîr Ibn Kathir",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And whatever you give for interest [i.e., advantage] to increase within the wealth of people[1149] will not increase with Allāh. But what you give in zakāh,[1150] desiring the face [i.e., approval] of Allāh - those are the multipliers.[1151]",
            "english_hilali_khan": "And that which you give in gift[1] (to others), in order that it may increase (your wealth by expecting to get a better one in return) from other people’s property, has no increase with Allâh; but that which you give in Zakât (sadaqa - charity etc.) seeking Allâh’s Countenance, then those, they shall have manifold increase.",
            "english_rwwad": "Whatever you lend in usury in order to gain more at the expense of people’s wealth, it will not increase [in reward] with Allah. But whatever you give as charity, seeking Allah’s pleasure – it is they who will have multiple reward."
        }
    },
    {
        "id": 3448,
        "chapter": 30,
        "verse": 40,
        "arabic_text": "ٱللَّهُ ٱلَّذِي خَلَقَكُمۡ ثُمَّ رَزَقَكُمۡ ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡۖ هَلۡ مِن شُرَكَآئِكُم مَّن يَفۡعَلُ مِن ذَٰلِكُم مِّن شَيۡءٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ",
        "phonetic": "30.40 Allāhu Al-Ladhī Khalaqakum Thumma Razaqakum Thumma Yumītukum Thumma Yuĥyīkum Hal Min Shurakā'ikum Man Yaf`alu Min Dhālikum Min Shay'in Subĥānahu Wa Ta`ālá `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh is the one who created you, then provided for you, then will cause you to die, and then will give you life. Are there any of your \"partners\" who does anything of that? Exalted is He and high above what they associate with Him.",
            "english_hilali_khan": "Allâh is He Who created you, then provided food for you, then will cause you to die, then (again) He will give you life (on the Day of Resurrection). Is there any of your (so-called) partners (of Allâh) that do anything of that? Glory be to Him! And Exalted be He above all that (evil) they associate (with Him).",
            "english_rwwad": "It is Allah Who created you, then gave you provision, then He will cause you to die, and then will bring you back to life. Is there anyone of your [so-called] partners who can do anything of this? Glorified and Exalted is He far above what they associate with Him!"
        }
    },
    {
        "id": 3449,
        "chapter": 30,
        "verse": 41,
        "arabic_text": "ظَهَرَ ٱلۡفَسَادُ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ بِمَا كَسَبَتۡ أَيۡدِي ٱلنَّاسِ لِيُذِيقَهُم بَعۡضَ ٱلَّذِي عَمِلُواْ لَعَلَّهُمۡ يَرۡجِعُونَ",
        "phonetic": "30.41 Žahara Al-Fasādu Fī Al-Barri Wa Al-Baĥri Bimā Kasabat 'Aydī An-Nāsi Liyudhīqahum Ba`đa Al-Ladhī `Amilū La`allahum Yarji`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Corruption has appeared throughout the land and sea by [reason of] what the hands of people have earned so He [i.e., Allāh] may let them taste part of [the consequence of] what they have done that perhaps they will return [to righteousness].",
            "english_hilali_khan": "Evil (sins and disobedience to Allâh) has appeared on land and sea because of what the hands of men have earned (by oppression and evil deeds), that He (Allâh) may make them taste a part of that which they have done, in order that they may return (by repenting to Allâh, and begging His Pardon).",
            "english_rwwad": "Corruption has appeared on land and sea because of what people’s hands have earned, so that He may cause them to taste the consequence of some of their deeds, so that they may return."
        }
    },
    {
        "id": 3450,
        "chapter": 30,
        "verse": 42,
        "arabic_text": "قُلۡ سِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلَّذِينَ مِن قَبۡلُۚ كَانَ أَكۡثَرُهُم مُّشۡرِكِينَ",
        "phonetic": "30.42 Qul Sīrū Fī Al-'Arđi Fānžurū Kayfa Kāna `Āqibatu Al-Ladhīna Min Qablu Kāna 'Aktharuhum Mushrikīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"Travel through the land and observe how was the end of those before. Most of them were associators [of others with Allāh].",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Travel in the land and see what was the end of those before (you)! Most of them were Mushrikûn (polytheists, idolaters, disbelievers in the Oneness of Allah).\"",
            "english_rwwad": "Say, “Travel through the land and see how was the end of those who came before – most of them associated partners with Allah.”"
        }
    },
    {
        "id": 3451,
        "chapter": 30,
        "verse": 43,
        "arabic_text": "فَأَقِمۡ وَجۡهَكَ لِلدِّينِ ٱلۡقَيِّمِ مِن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۖ يَوۡمَئِذٖ يَصَّدَّعُونَ",
        "phonetic": "30.43 Fa'aqim Wajhaka Lilddīni Al-Qayyimi Min Qabli 'An Ya'tiya Yawmun Lā Maradda Lahu Mina Allāhi Yawma'idhin Yaşşadda`ūna",
        "footnotes": {
            "english_saheeh": "[1152]- Into those destined for Paradise and those destined for Hell.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So direct your face [i.e., self] toward the correct religion before a Day comes from Allāh of which there is no repelling. That Day, they will be divided.[1152]",
            "english_hilali_khan": "So set you (O Muhammad صلى الله عليه وسلم) your face (in obedience to Allâh, your Lord) to the straight and right religion (Islâmic Monotheism), before there comes from Allâh a Day which none can avert. On that Day men shall be divided [(in two groups), a group in Paradise and a group in Hell].",
            "english_rwwad": "Adhere sincerely to the true religion before there comes a Day that cannot be averted from Allah. On that Day people will be divided."
        }
    },
    {
        "id": 3452,
        "chapter": 30,
        "verse": 44,
        "arabic_text": "مَن كَفَرَ فَعَلَيۡهِ كُفۡرُهُۥۖ وَمَنۡ عَمِلَ صَٰلِحٗا فَلِأَنفُسِهِمۡ يَمۡهَدُونَ",
        "phonetic": "30.44 Man Kafara Fa`alayhi Kufruhu Wa Man `Amila Şāliĥāan Fali'anfusihim Yamhadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever disbelieves - upon him is [the consequence of] his disbelief. And whoever does righteousness - they are for themselves preparing,",
            "english_hilali_khan": "Whosoever disbelieves will suffer from his disbelief, and whosoever does righteous good deeds (by practising Islâmic Monotheism), then such will prepare a good place (in Paradise) for themselves (and will be saved by Allâh from His Torment).",
            "english_rwwad": "Whoever disbelieves will bear [the burden of] his disbelief, and whoever does righteous deeds, they are preparing for themselves [a place in Paradise],"
        }
    },
    {
        "id": 3453,
        "chapter": 30,
        "verse": 45,
        "arabic_text": "لِيَجۡزِيَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِن فَضۡلِهِۦٓۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡكَٰفِرِينَ",
        "phonetic": "30.45 Liyajziya Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Min Fađlihi 'Innahu Lā Yuĥibbu Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That He may reward those who have believed and done righteous deeds out of His bounty. Indeed, He does not like the disbelievers.",
            "english_hilali_khan": "That He may reward those who believe (in the Oneness of Allâh - Islâmic Monotheism), and do righteous good deeds, out of His Bounty. Verily, He likes not the disbelievers.",
            "english_rwwad": "so that He may reward those who believe and do righteous deeds out of His grace. Indeed, He does not like the disbelievers."
        }
    },
    {
        "id": 3454,
        "chapter": 30,
        "verse": 46,
        "arabic_text": "وَمِنۡ ءَايَٰتِهِۦٓ أَن يُرۡسِلَ ٱلرِّيَاحَ مُبَشِّرَٰتٖ وَلِيُذِيقَكُم مِّن رَّحۡمَتِهِۦ وَلِتَجۡرِيَ ٱلۡفُلۡكُ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ",
        "phonetic": "30.46 Wa Min 'Āyātihi 'An Yursila Ar-Riyāĥa Mubashirātin Wa Liyudhīqakum Min Raĥmatihi Wa Litajriya Al-Fulku Bi'amrihi Wa Litabtaghū Min Fađlihi Wa La`allakum Tashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And of His signs is that He sends the winds as bringers of good tidings and to let you taste His mercy [i.e., rain] and so the ships may sail at His command and so you may seek of His bounty, and perhaps you will be grateful.",
            "english_hilali_khan": "And among His Signs is this, that He sends the winds as glad tidings, giving you a taste of His Mercy (i.e. rain), and that the ships may sail at His Command, and that you may seek of His Bounty, in order that you may be thankful.",
            "english_rwwad": "Among His signs is that He sends the winds as harbingers [of rain], so that He may give you a taste of His mercy, and that the ships may sail by His command, and that you may seek His bounty, and so that you may be grateful."
        }
    },
    {
        "id": 3455,
        "chapter": 30,
        "verse": 47,
        "arabic_text": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ رُسُلًا إِلَىٰ قَوۡمِهِمۡ فَجَآءُوهُم بِٱلۡبَيِّنَٰتِ فَٱنتَقَمۡنَا مِنَ ٱلَّذِينَ أَجۡرَمُواْۖ وَكَانَ حَقًّا عَلَيۡنَا نَصۡرُ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "30.47 Wa Laqad 'Arsalnā Min Qablika Rusulāan 'Ilá Qawmihim Fajā'ūhum Bil-Bayyināti Fāntaqamnā Mina Al-Ladhīna 'Ajramū Wa Kāna Ĥaqqāan `Alaynā Naşru Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[1153]- i.e., aid or the bestowal of victory.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have already sent messengers before you to their peoples, and they came to them with clear evidences; then We took retribution from those who committed crimes, and incumbent upon Us was support[1153] of the believers.",
            "english_hilali_khan": "And indeed We did send Messengers before you (O Muhammad صلى الله عليه وسلم) to their own peoples. They came to them with clear proofs, then, We took vengeance on those who committed crimes (disbelief, setting partners in worship with Allâh, sins); and (as for) the believers, it was incumbent upon Us to help (them).",
            "english_rwwad": "Indeed, We sent before you messengers to their people, and they came to them with clear signs. Then We took vengeance on those who persisted in wickedness, for it is incumbent upon Us to help the believers."
        }
    },
    {
        "id": 3456,
        "chapter": 30,
        "verse": 48,
        "arabic_text": "ٱللَّهُ ٱلَّذِي يُرۡسِلُ ٱلرِّيَٰحَ فَتُثِيرُ سَحَابٗا فَيَبۡسُطُهُۥ فِي ٱلسَّمَآءِ كَيۡفَ يَشَآءُ وَيَجۡعَلُهُۥ كِسَفٗا فَتَرَى ٱلۡوَدۡقَ يَخۡرُجُ مِنۡ خِلَٰلِهِۦۖ فَإِذَآ أَصَابَ بِهِۦ مَن يَشَآءُ مِنۡ عِبَادِهِۦٓ إِذَا هُمۡ يَسۡتَبۡشِرُونَ",
        "phonetic": "30.48 Allāhu Al-Ladhī Yursilu Ar-Riyāĥa Fatuthīru Saĥābāan Fayabsuţuhu Fī As-Samā'i Kayfa Yashā'u Wa Yaj`aluhu Kisafāan Fatará Al-Wadqa Yakhruju Min Khilālihi Fa'idhā 'Aşāba Bihi Man Yashā'u Min `Ibādihi 'Idhā Hum Yastabshirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is Allāh who sends the winds, and they stir the clouds and spread them in the sky however He wills, and He makes them fragments so you see the rain emerge from within them. And when He causes it to fall upon whom He wills of His servants, immediately they rejoice",
            "english_hilali_khan": "Allâh is He Who sends the winds, so that they raise clouds, and spread them along the sky as He wills, and then break them into fragments, until you see rain drops come forth from their midst! Then when He has made them fall on whom of His slaves as He wills, lo, they rejoice!",
            "english_rwwad": "It is Allah Who sends the winds that stir up clouds, then He spreads them in the sky as He wills, and He splits them into different fragments, then you see the rain pouring down from their midst. Then as soon as He makes it fall upon whoever He wills of His slaves, they rejoice,"
        }
    },
    {
        "id": 3457,
        "chapter": 30,
        "verse": 49,
        "arabic_text": "وَإِن كَانُواْ مِن قَبۡلِ أَن يُنَزَّلَ عَلَيۡهِم مِّن قَبۡلِهِۦ لَمُبۡلِسِينَ",
        "phonetic": "30.49 Wa 'In Kānū Min Qabli 'An Yunazzala `Alayhim Min Qablihi Lamublisīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Although they were, before it was sent down upon them - before that, in despair.",
            "english_hilali_khan": "And verily before that (rain) - just before it was sent down upon them - they were in despair!",
            "english_rwwad": "although they had lost all hope before it was sent down to them."
        }
    },
    {
        "id": 3458,
        "chapter": 30,
        "verse": 50,
        "arabic_text": "فَٱنظُرۡ إِلَىٰٓ ءَاثَٰرِ رَحۡمَتِ ٱللَّهِ كَيۡفَ يُحۡيِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ ذَٰلِكَ لَمُحۡيِ ٱلۡمَوۡتَىٰۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ",
        "phonetic": "30.50 Fānžur 'Ilá 'Āthāri Raĥmati Allāhi Kayfa Yuĥyī Al-'Arđa Ba`da Mawtihā 'Inna Dhālika Lamuĥyī Al-Mawtá Wa Huwa `Alá Kulli Shay'in Qadīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So observe the effects of the mercy of Allāh - how He gives life to the earth after its lifelessness. Indeed, that [same one] will give life to the dead, and He is over all things competent.",
            "english_hilali_khan": "Look then at the effects (results) of Allâh’s Mercy: how He revives the earth after its death. Verily, that (Allâh) (Who revived the earth after its death) shall indeed raise the dead (on the Day of Resurrection), and He is Able to do all things.",
            "english_rwwad": "See then the effects of Allah’s mercy, how He revives the earth after its death. Indeed, it is He Who will raise the dead, and He is Most Capable of all things."
        }
    },
    {
        "id": 3459,
        "chapter": 30,
        "verse": 51,
        "arabic_text": "وَلَئِنۡ أَرۡسَلۡنَا رِيحٗا فَرَأَوۡهُ مُصۡفَرّٗا لَّظَلُّواْ مِنۢ بَعۡدِهِۦ يَكۡفُرُونَ",
        "phonetic": "30.51 Wa La'in 'Arsalnā Rīĥāan Fara'awhu Muşfarrāan Lažallū Min Ba`dihi Yakfurūna",
        "footnotes": {
            "english_saheeh": "[1154]- Denying and ungrateful for the previous favors of Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But if We should send a [bad] wind and they saw [their crops] turned yellow, they would remain thereafter disbelievers.[1154]",
            "english_hilali_khan": "And if We send a wind [which would spoil the green growth (tilth) brought up by the previous rain], and they see (their tilth) turn yellow - behold, they then (after their being glad,) would become unthankful (to their Lord Allâh as) disbelievers. [Tafsir At-Tabari]",
            "english_rwwad": "But if We send a [harmful] wind and they see [their crops] turning yellow, they become ungrateful thereafter."
        }
    },
    {
        "id": 3460,
        "chapter": 30,
        "verse": 52,
        "arabic_text": "فَإِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ",
        "phonetic": "30.52 Fa'innaka Lā Tusmi`u Al-Mawtá Wa Lā Tusmi`u Aş-Şumma Ad-Du`ā'a 'Idhā Wa Llaw Mudbirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So indeed, you will not make the dead hear, nor will you make the deaf hear the call when they turn their backs, retreating.",
            "english_hilali_khan": "So verily, you (O Muhammad صلى الله عليه وسلم) cannot make the dead to hear (i.e. the disbelievers), nor can you make the deaf to hear the call, when they show their backs and turn away.",
            "english_rwwad": "You cannot make the dead hear, nor can you make the deaf hear the call when they turn their backs and walk away."
        }
    },
    {
        "id": 3461,
        "chapter": 30,
        "verse": 53,
        "arabic_text": "وَمَآ أَنتَ بِهَٰدِ ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ",
        "phonetic": "30.53 Wa Mā 'Anta Bihādī Al-`Umyi `An Đalālatihim 'In Tusmi`u 'Illā Man Yu'uminu Bi'āyātinā Fahum Muslimūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you cannot guide the blind away from their error. You will only make hear those who believe in Our verses so they are Muslims [in submission to Allāh].",
            "english_hilali_khan": "And you (O Muhammad صلى الله عليه وسلم) cannot guide the blind from their straying; you can make to hear only those who believe in Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), and have submitted to Allâh in Islâm (as Muslims).",
            "english_rwwad": "Nor can you guide the blind out of their misguidance. You cannot make anyone hear except those who believe in Our verses, for they are ready to submit [to Allah]."
        }
    },
    {
        "id": 3462,
        "chapter": 30,
        "verse": 54,
        "arabic_text": "۞ ٱللَّهُ ٱلَّذِي خَلَقَكُم مِّن ضَعۡفٖ ثُمَّ جَعَلَ مِنۢ بَعۡدِ ضَعۡفٖ قُوَّةٗ ثُمَّ جَعَلَ مِنۢ بَعۡدِ قُوَّةٖ ضَعۡفٗا وَشَيۡبَةٗۚ يَخۡلُقُ مَا يَشَآءُۚ وَهُوَ ٱلۡعَلِيمُ ٱلۡقَدِيرُ",
        "phonetic": "30.54 Allāhu Al-Ladhī Khalaqakum Min Đa`fin Thumma Ja`ala Min Ba`di Đa`fin Qūwatan Thumma Ja`ala Min Ba`di Qūwatin Đa`fāan Wa Shaybatan Yakhluqu Mā Yashā'u Wa Huwa Al-`Alīmu Al-Qadīru",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh is the one who created you from weakness, then made after weakness strength, then made after strength weakness and white hair. He creates what He wills, and He is the Knowing, the Competent.",
            "english_hilali_khan": "Allâh is He Who created you in (a state of) weakness, then gave you strength after weakness, then after strength gave (you) weakness and grey hair. He creates what He wills. And it is He Who is the All-Knowing, the All-Powerful (i.e. Able to do all things).",
            "english_rwwad": "It is Allah Who created you in a state of weakness, then after weakness He gave you strength, then after strength He made you weak and old. He creates what He wills, and He is the All-Knowing, the Most Capable."
        }
    },
    {
        "id": 3463,
        "chapter": 30,
        "verse": 55,
        "arabic_text": "وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يُقۡسِمُ ٱلۡمُجۡرِمُونَ مَا لَبِثُواْ غَيۡرَ سَاعَةٖۚ كَذَٰلِكَ كَانُواْ يُؤۡفَكُونَ",
        "phonetic": "30.55 Wa Yawma Taqūmu As-Sā`atu Yuqsimu Al-Mujrimūna Mā Labithū Ghayra Sā`atin Kadhālika Kānū Yu'ufakūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the Day the Hour appears the criminals will swear they had remained but an hour. Thus they were deluded.",
            "english_hilali_khan": "And on the Day that the Hour will be established, the Mujrimûn (criminals, disbelievers, polytheists, sinners) will swear that they stayed not but an hour - thus were they ever deluded [away from the truth (i.e. they used to tell lies and take false oaths, and turn away from the truth) in this life of the world)]",
            "english_rwwad": "On the Day when the Hour begins, the wicked will swear that they had not stayed [in this world] more than an hour. This is how they were deluded [from the truth]."
        }
    },
    {
        "id": 3464,
        "chapter": 30,
        "verse": 56,
        "arabic_text": "وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَٱلۡإِيمَٰنَ لَقَدۡ لَبِثۡتُمۡ فِي كِتَٰبِ ٱللَّهِ إِلَىٰ يَوۡمِ ٱلۡبَعۡثِۖ فَهَٰذَا يَوۡمُ ٱلۡبَعۡثِ وَلَٰكِنَّكُمۡ كُنتُمۡ لَا تَعۡلَمُونَ",
        "phonetic": "30.56 Wa Qāla Al-Ladhīna 'Ūtū Al-`Ilma Wa Al-'Īmāna Laqad Labithtum Fī Kitābi Allāhi 'Ilá Yawmi Al-Ba`thi Fahadhā Yawmu Al-Ba`thi Wa Lakinnakum Kuntum Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[1155]- i.e., acknowledge the truth.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who were given knowledge and faith will say, \"You remained the extent of Allāh's decree until the Day of Resurrection, and this is the Day of Resurrection, but you did not used to know.\"[1155]",
            "english_hilali_khan": "And those who have been bestowed with knowledge and faith will say: \"Indeed you have stayed according to the Decree of Allâh, until the Day of Resurrection: so this is the Day of Resurrection, but you knew not.\"",
            "english_rwwad": "As for those who were given knowledge and faith will say, “You did stay, according to Allah’s decree, till the Day of Resurrection. This is the Day of Resurrection, but you did not know.”"
        }
    },
    {
        "id": 3465,
        "chapter": 30,
        "verse": 57,
        "arabic_text": "فَيَوۡمَئِذٖ لَّا يَنفَعُ ٱلَّذِينَ ظَلَمُواْ مَعۡذِرَتُهُمۡ وَلَا هُمۡ يُسۡتَعۡتَبُونَ",
        "phonetic": "30.57 Fayawma'idhin Lā Yanfa`u Al-Ladhīna Žalamū Ma`dhiratuhum Wa Lā Hum Yusta`tabūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So that Day, their excuse will not benefit those who wronged, nor will they be asked to appease [Allāh].",
            "english_hilali_khan": "So on that Day no excuse of theirs will avail those who did wrong (by associating partners in worship with Allâh, and by denying the Day of Resurrection), nor will they be allowed (then) to return to seek Allâh’s Pleasure (by having Islâmic Faith with righteous deeds and by giving up polytheism, sins and crimes with repentance).",
            "english_rwwad": "On that Day, no excuse will benefit the wrongdoers, nor will they be allowed to make amends."
        }
    },
    {
        "id": 3466,
        "chapter": 30,
        "verse": 58,
        "arabic_text": "وَلَقَدۡ ضَرَبۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖۚ وَلَئِن جِئۡتَهُم بِـَٔايَةٖ لَّيَقُولَنَّ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ أَنتُمۡ إِلَّا مُبۡطِلُونَ",
        "phonetic": "30.58 Wa Laqad Đarabnā Lilnnāsi Fī Hādhā Al-Qur'āni Min Kulli Mathalin Wa La'in Ji'tahum Bi'āyatin Layaqūlanna Al-Ladhīna Kafarū 'In 'Antum 'Illā Mubţilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly presented to the people in this Qur’ān from every [kind of] example. But, [O Muḥammad], if you should bring them a sign, the disbelievers will surely say, \"You [believers] are but falsifiers.\"",
            "english_hilali_khan": "And indeed We have set forth for mankind, in this Qur’ân every kind of parable. But if you (O Muhammad صلى الله عليه وسلم) bring to them any sign or proof (as an evidence for the truth of your Prophethood), the disbelievers are sure to say (to the believers): \"You follow nothing but falsehood, and magic.\"",
            "english_rwwad": "We have presented in this Qur’an every kind of example for mankind. But no matter what sign you bring them, the disbelievers will surely say, “You follow nothing but falsehood.”"
        }
    },
    {
        "id": 3467,
        "chapter": 30,
        "verse": 59,
        "arabic_text": "كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلَّذِينَ لَا يَعۡلَمُونَ",
        "phonetic": "30.59 Kadhālika Yaţba`u Allāhu `Alá Qulūbi Al-Ladhīna Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[1156]- i.e., those who do not wish to know the truth and refuse it.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Thus does Allāh seal the hearts of those who do not know.[1156]",
            "english_hilali_khan": "Thus does Allâh seal up the hearts of those who know not [the proofs and evidence of the Oneness of Allâh i.e. those who try not to understand true facts that which you (Muhammad صلى الله عليه وسلم) have brought to them].",
            "english_rwwad": "This is how Allah seals the hearts of those who have no knowledge."
        }
    },
    {
        "id": 3468,
        "chapter": 30,
        "verse": 60,
        "arabic_text": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞۖ وَلَا يَسۡتَخِفَّنَّكَ ٱلَّذِينَ لَا يُوقِنُونَ",
        "phonetic": "30.60 Fāşbir 'Inna Wa`da Allāhi Ĥaqqun Wa Lā Yastakhiffannaka Al-Ladhīna Lā Yūqinūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So be patient. Indeed, the promise of Allāh is truth. And let them not disquiet you who are not certain [in faith].",
            "english_hilali_khan": "So be patient (O Muhammad صلى الله عليه وسلم). Verily, the Promise of Allâh is true; and let not those who have no certainty of faith, discourage you from conveying Allâh’s Message (which you are obliged to convey).",
            "english_rwwad": "So be patient, for Allah’s promise is true, and do not let those who have no faith discourage you."
        }
    }
]