[
    {
        "id": 3503,
        "chapter": 32,
        "verse": 1,
        "arabic_text": "الٓمٓ",
        "phonetic": "32.1 'Alif-Lām-Mīm",
        "footnotes": {
            "english_saheeh": "[1170]- See footnote to 2:1.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Alif, Lām, Meem.[1170]",
            "english_hilali_khan": "Alif-Lâm-Mîm.",
            "english_rwwad": "Alif Lām Mīm."
        }
    },
    {
        "id": 3504,
        "chapter": 32,
        "verse": 2,
        "arabic_text": "تَنزِيلُ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "32.2 Tanzīlu Al-Kitābi Lā Rayba Fīhi Min Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[This is] the revelation of the Book about which there is no doubt from the Lord of the worlds.",
            "english_hilali_khan": "The revelation of the Book (this Qur’ân) in which there is no doubt is from the Lord of the ‘Âlamîn (mankind, jinn and all that exists)!",
            "english_rwwad": "The revelation of the Book, about which there is no doubt, is from the Lord of the worlds."
        }
    },
    {
        "id": 3505,
        "chapter": 32,
        "verse": 3,
        "arabic_text": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۚ بَلۡ هُوَ ٱلۡحَقُّ مِن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَهۡتَدُونَ",
        "phonetic": "32.3 'Am Yaqūlūna Aftarāhu Bal Huwa Al-Ĥaqqu Min Rabbika Litundhira Qawmāan Mā 'Atāhum Min Nadhīrin Min Qablika La`allahum Yahtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or do they say, \"He invented it\"? Rather, it is the truth from your Lord, [O Muḥammad], that you may warn a people to whom no warner has come before you [so] perhaps they will be guided.",
            "english_hilali_khan": "Or say they: \"He (Muhammad صلى الله عليه وسلم) has fabricated it?\" Nay, it is the truth from your Lord, so that you may warn a people to whom no warner has come before you (O Muhammad صلى الله عليه وسلم): in order that they may be guided.",
            "english_rwwad": "Or do they say, “He has fabricated it.”? No, it is the truth from your Lord so that you may warn a people to whom no warner has come before you, in order that they may be guided."
        }
    },
    {
        "id": 3506,
        "chapter": 32,
        "verse": 4,
        "arabic_text": "ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ مَا لَكُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا شَفِيعٍۚ أَفَلَا تَتَذَكَّرُونَ",
        "phonetic": "32.4 Allāhu Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Wa Mā Baynahumā Fī Sittati 'Ayyāmin Thumma Astawá `Alá Al-`Arshi Mā Lakum Min Dūnihi Min Wa Līyin Wa Lā Shafī`in 'Afalā Tatadhakkarūna",
        "footnotes": {
            "english_saheeh": "[1171]- See footnotes to 2:19 and 7:54.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is Allāh who created the heavens and the earth and whatever is between them in six days; then He established Himself above the Throne.[1171] You have not besides Him any protector or any intercessor; so will you not be reminded?",
            "english_hilali_khan": "Allâh it is He Who has created the heavens and the earth, and all that is between them in six Days. Then He rose over (Istawâ ) the Throne (in a manner that suits His Majesty). You (mankind) have none, besides Him, as a Walî (protector or helper) or an intercessor. Will you not then remember (or receive admonition)?",
            "english_rwwad": "It is Allah Who created the heavens and earth and all that is between them in six Days, then rose over the Throne. You have no protector or intercessor other than Him. Will you not then take heed?"
        }
    },
    {
        "id": 3507,
        "chapter": 32,
        "verse": 5,
        "arabic_text": "يُدَبِّرُ ٱلۡأَمۡرَ مِنَ ٱلسَّمَآءِ إِلَى ٱلۡأَرۡضِ ثُمَّ يَعۡرُجُ إِلَيۡهِ فِي يَوۡمٖ كَانَ مِقۡدَارُهُۥٓ أَلۡفَ سَنَةٖ مِّمَّا تَعُدُّونَ",
        "phonetic": "32.5 Yudabbiru Al-'Amra Mina As-Samā'i 'Ilá Al-'Arđi Thumma Ya`ruju 'Ilayhi Fī Yawmin Kāna Miqdāruhu 'Alfa Sanatin Mimmā Ta`uddūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He arranges [each] matter from the heaven to the earth; then it will ascend to Him in a Day, the extent of which is a thousand years of those which you count.",
            "english_hilali_khan": "He manages and regulates (every) affair from the heavens to the earth; then it (affair) will go up to Him, in one Day, the space whereof is a thousand years of your reckoning (i.e. reckoning of our present world’s time).",
            "english_rwwad": "He manages every matter from the heaven to the earth, then everything ascends to Him on a Day the length of which is a thousand years by your reckoning."
        }
    },
    {
        "id": 3508,
        "chapter": 32,
        "verse": 6,
        "arabic_text": "ذَٰلِكَ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡعَزِيزُ ٱلرَّحِيمُ",
        "phonetic": "32.6 Dhālika `Ālimu Al-Ghaybi Wa Ash-Shahādati Al-`Azīzu Ar-Raĥīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That is the Knower of the unseen and the witnessed, the Exalted in Might, the Merciful,",
            "english_hilali_khan": "That is He: the All-Knower of the unseen and the seen, the All-Mighty, the Most Merciful.",
            "english_rwwad": "Such is the All-Knower of the unseen and the seen, the All-Mighty, the Most Merciful,"
        }
    },
    {
        "id": 3509,
        "chapter": 32,
        "verse": 7,
        "arabic_text": "ٱلَّذِيٓ أَحۡسَنَ كُلَّ شَيۡءٍ خَلَقَهُۥۖ وَبَدَأَ خَلۡقَ ٱلۡإِنسَٰنِ مِن طِينٖ",
        "phonetic": "32.7 Al-Ladhī 'Aĥsana Kulla Shay'in Khalaqahu Wa Bada'a Khalqa Al-'Insāni Min Ţīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who perfected everything which He created and began the creation of man from clay.",
            "english_hilali_khan": "Who made everything He has created good and He began the creation of man from clay.",
            "english_rwwad": "Who perfected everything He created, and initiated the creation of man from clay."
        }
    },
    {
        "id": 3510,
        "chapter": 32,
        "verse": 8,
        "arabic_text": "ثُمَّ جَعَلَ نَسۡلَهُۥ مِن سُلَٰلَةٖ مِّن مَّآءٖ مَّهِينٖ",
        "phonetic": "32.8 Thumma Ja`ala Naslahu Min Sulālatin Min Mā'in Mahīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then He made his posterity out of the extract of a liquid disdained.",
            "english_hilali_khan": "Then He made his offspring from semen of despised water (male and female sexual discharge).",
            "english_rwwad": "Then He made his progeny from the extract of a worthless fluid."
        }
    },
    {
        "id": 3511,
        "chapter": 32,
        "verse": 9,
        "arabic_text": "ثُمَّ سَوَّىٰهُ وَنَفَخَ فِيهِ مِن رُّوحِهِۦۖ وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَۚ قَلِيلٗا مَّا تَشۡكُرُونَ",
        "phonetic": "32.9 Thumma Sawwāhu Wa Nafakha Fīhi Min Rūĥihi Wa Ja`ala Lakumu As-Sam`a Wa Al-'Abşāra Wa Al-'Af'idata Qalīlāan Mā Tashkurūna",
        "footnotes": {
            "english_saheeh": "[1172]- i.e., element of life.  See footnote to 15:29.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then He proportioned him and breathed into him from His [created] soul[1172] and made for you hearing and vision and hearts [i.e., intellect]; little are you grateful.",
            "english_hilali_khan": "Then He fashioned him in due proportion, and breathed into him the soul (created by Allâh for that person); and He gave you hearing (ears), sight (eyes) and hearts. Little is the thanks you give!",
            "english_rwwad": "Then He fashioned him and breathed into him of His [created] soul. He granted you hearing, sight and intellect; yet little it is that you give thanks."
        }
    },
    {
        "id": 3512,
        "chapter": 32,
        "verse": 10,
        "arabic_text": "وَقَالُوٓاْ أَءِذَا ضَلَلۡنَا فِي ٱلۡأَرۡضِ أَءِنَّا لَفِي خَلۡقٖ جَدِيدِۭۚ بَلۡ هُم بِلِقَآءِ رَبِّهِمۡ كَٰفِرُونَ",
        "phonetic": "32.10 Wa Qālū 'A'idhā Đalalnā Fī Al-'Arđi 'A'innā Lafī Khalqin Jadīdin Bal Hum Biliqā'i Rabbihim Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"When we are lost [i.e., disintegrated] within the earth, will we indeed be [recreated] in a new creation?\" Rather, they are, in the meeting with their Lord, disbelievers.",
            "english_hilali_khan": "And they say: \"When we are (dead and become) lost in the earth, shall we indeed be created anew?\" Nay, but they deny the Meeting with their Lord!",
            "english_rwwad": "They say, “What! Is it that when we are disintegrated into the earth, will we then be created anew?” Rather, they deny the meeting with their Lord."
        }
    },
    {
        "id": 3513,
        "chapter": 32,
        "verse": 11,
        "arabic_text": "۞ قُلۡ يَتَوَفَّىٰكُم مَّلَكُ ٱلۡمَوۡتِ ٱلَّذِي وُكِّلَ بِكُمۡ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ",
        "phonetic": "32.11 Qul Yatawaffākum Malaku Al-Mawti Al-Ladhī Wukkila Bikum Thumma 'Ilá Rabbikum Turja`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"The angel of death who has been entrusted with you will take you. Then to your Lord you will be returned.\"",
            "english_hilali_khan": "Say: \"The angel of death, who is set over you, will take your souls. Then you shall be brought to your Lord.\"",
            "english_rwwad": "Say, “The angel of death, who is in charge of you, will take your souls, then to your Lord you will be brought back.”"
        }
    },
    {
        "id": 3514,
        "chapter": 32,
        "verse": 12,
        "arabic_text": "وَلَوۡ تَرَىٰٓ إِذِ ٱلۡمُجۡرِمُونَ نَاكِسُواْ رُءُوسِهِمۡ عِندَ رَبِّهِمۡ رَبَّنَآ أَبۡصَرۡنَا وَسَمِعۡنَا فَٱرۡجِعۡنَا نَعۡمَلۡ صَٰلِحًا إِنَّا مُوقِنُونَ",
        "phonetic": "32.12 Wa Law Tará 'Idhi Al-Mujrimūna Nākisū Ru'ūsihim `Inda Rabbihim Rabbanā 'Abşarnā Wa Sami`nā Fārji`nā Na`mal Şāliĥāan 'Innā Mūqinūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If you could but see when the criminals are hanging their heads before their Lord, [saying], \"Our Lord, we have seen and heard, so return us [to the world]; we will work righteousness. Indeed, we are [now] certain.\"",
            "english_hilali_khan": "And if you only could see when the Mujrimûn (criminals, disbelievers, polytheists, sinners) shall hang their heads before their Lord (saying): \"Our Lord! We have now seen and heard, so send us back (to the world), that we will do righteous good deeds. Verily! We now believe with certainty.\"",
            "english_rwwad": "If only you could see the wicked lowering their heads before their Lord, “Our Lord, we have now seen and heard. Send us back; we will do righteous deeds. Now we truly have faith.”"
        }
    },
    {
        "id": 3515,
        "chapter": 32,
        "verse": 13,
        "arabic_text": "وَلَوۡ شِئۡنَا لَأٓتَيۡنَا كُلَّ نَفۡسٍ هُدَىٰهَا وَلَٰكِنۡ حَقَّ ٱلۡقَوۡلُ مِنِّي لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِينَ",
        "phonetic": "32.13 Wa Law Shi'nā La'ātaynā Kulla Nafsin Hudāhā Wa Lakin Ĥaqqa Al-Qawlu Minnī La'amla'anna Jahannama Mina Al-Jinnati Wa An-Nāsi 'Ajma`īna",
        "footnotes": {
            "english_saheeh": "[1173]- Deserved by the evildoers.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if We had willed, We could have given every soul its guidance, but the word[1173] from Me will come into effect [that] \"I will surely fill Hell with jinn and people all together.",
            "english_hilali_khan": "And if We had willed, surely We would have given every person his guidance, but the Word from Me took effect (about evil-doers), that I will fill Hell with jinn and mankind together.",
            "english_rwwad": "If We had willed, We could have given every soul its guidance, but My Word will be fulfilled: “I will certainly fill up Hell with jinn and men all together.”"
        }
    },
    {
        "id": 3516,
        "chapter": 32,
        "verse": 14,
        "arabic_text": "فَذُوقُواْ بِمَا نَسِيتُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَآ إِنَّا نَسِينَٰكُمۡۖ وَذُوقُواْ عَذَابَ ٱلۡخُلۡدِ بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "32.14 Fadhūqū Bimā Nasītum Liqā'a Yawmikum Hādhā 'Innā Nasīnākum Wa Dhūqū `Adhāba Al-Khuldi Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So taste [punishment] because you forgot the meeting of this, your Day; indeed, We have [accordingly] forgotten you. And taste the punishment of eternity for what you used to do.\"",
            "english_hilali_khan": "Then taste you (the torment of the Fire) because of your forgetting the Meeting of this Day of yours. Surely We too will forget you: so taste you the abiding torment for what you used to do.",
            "english_rwwad": "So taste [the punishment] because you forgot the meeting of this Day of yours. We too will forgot you. Taste the eternal punishment for what you used to do.”"
        }
    },
    {
        "id": 3517,
        "chapter": 32,
        "verse": 15,
        "arabic_text": "إِنَّمَا يُؤۡمِنُ بِـَٔايَٰتِنَا ٱلَّذِينَ إِذَا ذُكِّرُواْ بِهَا خَرُّواْۤ سُجَّدٗاۤ وَسَبَّحُواْ بِحَمۡدِ رَبِّهِمۡ وَهُمۡ لَا يَسۡتَكۡبِرُونَ۩",
        "phonetic": "32.15 'Innamā Yu'uminu Bi'āyātinā Al-Ladhīna 'Idhā Dhukkirū Bihā Kharrū Sujjadāan Wa Sabbaĥū Biĥamdi Rabbihim Wa Hum Lā Yastakbirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.32:15): See the footnote of (V.22:9).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Only those believe in Our verses who, when they are reminded by them, fall down in prostration and exalt [Allāh] with praise of their Lord, and they are not arrogant.",
            "english_hilali_khan": "Only those believe in Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), who, when they are reminded of them, fall down prostrate, and glorify the Praises of their Lord, and they are not proud.[1]",
            "english_rwwad": "The true believers in Our verses are only those who, when they are reminded of them, fall in prostration and glorify their Lord with praise, and they do not show arrogance."
        }
    },
    {
        "id": 3518,
        "chapter": 32,
        "verse": 16,
        "arabic_text": "تَتَجَافَىٰ جُنُوبُهُمۡ عَنِ ٱلۡمَضَاجِعِ يَدۡعُونَ رَبَّهُمۡ خَوۡفٗا وَطَمَعٗا وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
        "phonetic": "32.16 Tatajāfá Junūbuhum `Ani Al-Mađāji`i Yad`ūna Rabbahum Khawfāan Wa Ţama`āan Wa Mimmā Razaqnāhum Yunfiqūna",
        "footnotes": {
            "english_saheeh": "[1174]- In the cause of Allāh.",
            "english_hilali_khan": "(V.32:16) Narrated Mu‘âdh bin Jabal رضي الله عنه: The Prophet (Allâh’s Messenger صلى الله عليه وسلم) said to him: \"May I show you the gates of goodness? (They are): (1) Fasting is a screen from Hell. (2) As-Sadaqâh (deeds of charity in Allâh’s Cause) extinguishes (removes) the sins, as the water extinguishes the fire. (3) Standing in Salât (performing of prayers) by a person during the middle (or the last third) part of a night.\" Then Prophet صلى الله عليه وسلم recited: \"Their sides forsake their beds.\" (V.32:16) (Abu Dâwûd and Tirmidhi) (Tafsîr Al-Qurtubî).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Their sides part [i.e., they arise] from [their] beds; they supplicate their Lord in fear and aspiration, and from what We have provided them, they spend.[1174]",
            "english_hilali_khan": "Their sides forsake their beds, to invoke their Lord in fear and hope, and they spend (in charity in Allâh’s Cause) out of what We have bestowed on them.[2]",
            "english_rwwad": "They forsake their beds, supplicating their Lord with fear and hope, and spend out of what We have provided for them."
        }
    },
    {
        "id": 3519,
        "chapter": 32,
        "verse": 17,
        "arabic_text": "فَلَا تَعۡلَمُ نَفۡسٞ مَّآ أُخۡفِيَ لَهُم مِّن قُرَّةِ أَعۡيُنٖ جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "32.17 Falā Ta`lamu Nafsun Mā 'Ukhfiya Lahum Min Qurrati 'A`yunin Jazā'an Bimā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.32:17) See the footnote (b) of (V.51:30).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And no soul knows what has been hidden for them of comfort for eyes [i.e., satisfaction] as reward for what they used to do.",
            "english_hilali_khan": "No person knows what is kept hidden for them of joy as a reward for what they used to do.[3]",
            "english_rwwad": "No soul knows what delights are kept hidden for them as a reward for what they used to do."
        }
    },
    {
        "id": 3520,
        "chapter": 32,
        "verse": 18,
        "arabic_text": "أَفَمَن كَانَ مُؤۡمِنٗا كَمَن كَانَ فَاسِقٗاۚ لَّا يَسۡتَوُۥنَ",
        "phonetic": "32.18 'Afaman Kāna Mu'umināan Kaman Kāna Fāsiqāan Lā Yastawūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then is one who was a believer like one who was defiantly disobedient? They are not equal.",
            "english_hilali_khan": "Is then he who is a believer like him who is a Fâsiq (disbeliever and disobedient to Allâh)? Not equal are they.",
            "english_rwwad": "Is one who is a believer like one who is an evildoer? They are not equal."
        }
    },
    {
        "id": 3521,
        "chapter": 32,
        "verse": 19,
        "arabic_text": "أَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَلَهُمۡ جَنَّٰتُ ٱلۡمَأۡوَىٰ نُزُلَۢا بِمَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "32.19 'Ammā Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Falahum Jannātu Al-Ma'wá Nuzulāan Bimā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "As for those who believed and did righteous deeds, for them will be the Gardens of Refuge as accommodation for what they used to do.",
            "english_hilali_khan": "As for those who believe (in the Oneness of Allâh - Islâmic Monotheism) and do righteous good deeds, for them are Gardens (Paradise) as an entertainment for what they used to do.",
            "english_rwwad": "As for those who believe and do righteous deeds, they will have gardens to dwell in, as an accommodation for what they used to do."
        }
    },
    {
        "id": 3522,
        "chapter": 32,
        "verse": 20,
        "arabic_text": "وَأَمَّا ٱلَّذِينَ فَسَقُواْ فَمَأۡوَىٰهُمُ ٱلنَّارُۖ كُلَّمَآ أَرَادُوٓاْ أَن يَخۡرُجُواْ مِنۡهَآ أُعِيدُواْ فِيهَا وَقِيلَ لَهُمۡ ذُوقُواْ عَذَابَ ٱلنَّارِ ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ",
        "phonetic": "32.20 Wa 'Ammā Al-Ladhīna Fasaqū Fama'wāhumu An-Nāru Kullamā 'Arādū 'An Yakhrujū Minhā 'U`īdū Fīhā Wa Qīla Lahum Dhūqū `Adhāba An-Nāri Al-Ladhī Kuntum Bihi Tukadhibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for those who defiantly disobeyed, their refuge is the Fire. Every time they wish to emerge from it, they will be returned to it while it is said to them, \"Taste the punishment of the Fire which you used to deny.\"",
            "english_hilali_khan": "And as for those who are Fâsiqûn (disbelievers and disobedient to Allâh), their abode will be the Fire, every time they wish to get away therefrom, they will be put back thereto, and it will be said to them: \"Taste you the torment of the Fire which you used to deny.\"",
            "english_rwwad": "But those who are rebellious, their abode will be the Fire. Every time they try to escape from it, they will be driven back into it, and it will be said to them, “Taste the punishment of the Fire which you used to deny.”"
        }
    },
    {
        "id": 3523,
        "chapter": 32,
        "verse": 21,
        "arabic_text": "وَلَنُذِيقَنَّهُم مِّنَ ٱلۡعَذَابِ ٱلۡأَدۡنَىٰ دُونَ ٱلۡعَذَابِ ٱلۡأَكۡبَرِ لَعَلَّهُمۡ يَرۡجِعُونَ",
        "phonetic": "32.21 Wa Lanudhīqannahum Mina Al-`Adhābi Al-'Adná Dūna Al-`Adhābi Al-'Akbari La`allahum Yarji`ūna",
        "footnotes": {
            "english_saheeh": "[1175]- i.e., the disasters and calamities of this world.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will surely let them taste the nearer punishment[1175] short of the greater punishment that perhaps they will return [i.e., repent].",
            "english_hilali_khan": "And verily, We will make them taste of the near torment (i.e. the torment in the life of this world, i.e. disasters, calamities, etc.) prior to the supreme torment (in the Hereafter), in order that they may (repent and) return (i.e. accept Islâm).",
            "english_rwwad": "We will certainly make them taste some minor punishment [in this life] prior to the greater punishment, so that they may return."
        }
    },
    {
        "id": 3524,
        "chapter": 32,
        "verse": 22,
        "arabic_text": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔايَٰتِ رَبِّهِۦ ثُمَّ أَعۡرَضَ عَنۡهَآۚ إِنَّا مِنَ ٱلۡمُجۡرِمِينَ مُنتَقِمُونَ",
        "phonetic": "32.22 Wa Man 'Ažlamu Mimman Dhukkira Bi'āyāti Rabbihi Thumma 'A`rađa `Anhā 'Innā Mina Al-Mujrimīna Muntaqimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them? Indeed We, from the criminals, will take retribution.",
            "english_hilali_khan": "And who does more wrong than he who is reminded of the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of his Lord, then turns aside therefrom? Verily, We shall exact retribution from the Mujrimûn (criminals, disbelievers, polytheists, sinners).",
            "english_rwwad": "Who does greater wrong than one who is reminded of the verses of his Lord, then turns away from them? We will surely take vengeance upon the wicked."
        }
    },
    {
        "id": 3525,
        "chapter": 32,
        "verse": 23,
        "arabic_text": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَلَا تَكُن فِي مِرۡيَةٖ مِّن لِّقَآئِهِۦۖ وَجَعَلۡنَٰهُ هُدٗى لِّبَنِيٓ إِسۡرَٰٓءِيلَ",
        "phonetic": "32.23 Wa Laqad 'Ātaynā Mūsá Al-Kitāba Falā Takun Fī Miryatin Min Liqā'ihi Wa Ja`alnāhu Hudáan Libanī 'Isrā'īla",
        "footnotes": {
            "english_saheeh": "[1176]- i.e., Muḥammad's meeting Moses on the night of al-Miʿrāj (ascent).",
            "english_hilali_khan": "(V.32:23): [Al-Mi‘râj المعراج - See the footnote of (V.53:12), Hadîth No.429].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We certainly gave Moses the Scripture, so do not be in doubt over his meeting.[1176] And We made it [i.e., the Torah] guidance for the Children of Israel.",
            "english_hilali_khan": "And indeed We gave Mûsa (Moses) the Scripture [the Taurât (Torah)] So be not you in doubt of meeting him [i.e. when you met Mûsa (Moses) during the night of Al-Isrâ’ and Al-Mi‘râj [1] over the heavens]. And We made it [the Taurât (Torah)] a guide to the Children of Israel.",
            "english_rwwad": "We gave Moses the Scripture, so do not doubt about meeting him, and We made it a guide for the Children of Israel."
        }
    },
    {
        "id": 3526,
        "chapter": 32,
        "verse": 24,
        "arabic_text": "وَجَعَلۡنَا مِنۡهُمۡ أَئِمَّةٗ يَهۡدُونَ بِأَمۡرِنَا لَمَّا صَبَرُواْۖ وَكَانُواْ بِـَٔايَٰتِنَا يُوقِنُونَ",
        "phonetic": "32.24 Wa Ja`alnā Minhum 'A'immatan Yahdūna Bi'amrinā Lammā Şabarū Wa Kānū Bi'āyātinā Yūqinūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We made from among them leaders guiding by Our command when they were patient and [when] they were certain of Our signs.",
            "english_hilali_khan": "And We made from among them (Children of Israel), leaders, giving guidance under Our Command, when they were patient and used to believe with certainty in Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.).",
            "english_rwwad": "We made some of them leaders, guiding by Our command, because they observed patience and firmly believed in Our signs."
        }
    },
    {
        "id": 3527,
        "chapter": 32,
        "verse": 25,
        "arabic_text": "إِنَّ رَبَّكَ هُوَ يَفۡصِلُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ",
        "phonetic": "32.25 'Inna Rabbaka Huwa Yafşilu Baynahum Yawma Al-Qiyāmati Fīmā Kānū Fīhi Yakhtalifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
            "english_hilali_khan": "Verily, your Lord will judge between them, on the Day of Resurrection, concerning that wherein they used to differ.",
            "english_rwwad": "Indeed, it is your Lord Who will judge between them on the Day of Resurrection concerning that over which they used to differ."
        }
    },
    {
        "id": 3528,
        "chapter": 32,
        "verse": 26,
        "arabic_text": "أَوَلَمۡ يَهۡدِ لَهُمۡ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّنَ ٱلۡقُرُونِ يَمۡشُونَ فِي مَسَٰكِنِهِمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٍۚ أَفَلَا يَسۡمَعُونَ",
        "phonetic": "32.26 'Awalam Yahdi Lahum Kam 'Ahlaknā Min Qablihim Mina Al-Qurūni Yamshūna Fī Masākinihim 'Inna Fī Dhālika La'āyātin 'Afalā Yasma`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Has it not become clear to them how many generations We destroyed before them, [as] they walk among their dwellings? Indeed in that are signs; then do they not hear?",
            "english_hilali_khan": "Is it not a guidance for them: how many generations We have destroyed before them in whose dwellings they do walk about? Verily, therein indeed are signs. Would they not then listen?",
            "english_rwwad": "Is it not yet clear to them how many generations We destroyed before them, in whose dwellings they now walk about? Indeed, there are signs in this. Do they not then listen?"
        }
    },
    {
        "id": 3529,
        "chapter": 32,
        "verse": 27,
        "arabic_text": "أَوَلَمۡ يَرَوۡاْ أَنَّا نَسُوقُ ٱلۡمَآءَ إِلَى ٱلۡأَرۡضِ ٱلۡجُرُزِ فَنُخۡرِجُ بِهِۦ زَرۡعٗا تَأۡكُلُ مِنۡهُ أَنۡعَٰمُهُمۡ وَأَنفُسُهُمۡۚ أَفَلَا يُبۡصِرُونَ",
        "phonetic": "32.27 'Awalam Yaraw 'Annā Nasūqu Al-Mā'a 'Ilá Al-'Arđi Al-Juruzi Fanukhriju Bihi Zar`āan Ta'kulu Minhu 'An`āmuhum Wa 'Anfusuhum 'Afalā Yubşirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have they not seen that We drive water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?",
            "english_hilali_khan": "Have they not seen how We drive water to the dry land that has no vegetation, and therewith bring forth crops providing food for their cattle and themselves? Will they not then see?",
            "english_rwwad": "Do they not see that We drive water to parched land, producing thereby crops of which their cattle and they themselves eat? Do they not then see?"
        }
    },
    {
        "id": 3530,
        "chapter": 32,
        "verse": 28,
        "arabic_text": "وَيَقُولُونَ مَتَىٰ هَٰذَا ٱلۡفَتۡحُ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "32.28 Wa Yaqūlūna Matá Hādhā Al-Fatĥu 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "[1177]- Or \"decision,\" i.e., judgement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they say, \"When will be this conquest,[1177] if you should be truthful?\"",
            "english_hilali_khan": "They say: \"When will this Fath (Decision) be (between us and you, i.e. the Day of Resurrection), if you are telling the truth?\"",
            "english_rwwad": "They say, “When will this Decision be if you are truthful?”"
        }
    },
    {
        "id": 3531,
        "chapter": 32,
        "verse": 29,
        "arabic_text": "قُلۡ يَوۡمَ ٱلۡفَتۡحِ لَا يَنفَعُ ٱلَّذِينَ كَفَرُوٓاْ إِيمَٰنُهُمۡ وَلَا هُمۡ يُنظَرُونَ",
        "phonetic": "32.29 Qul Yawma Al-Fatĥi Lā Yanfa`u Al-Ladhīna Kafarū 'Īmānuhum Wa Lā Hum Yunžarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"On the Day of Conquest the belief of those who had disbelieved will not benefit them, nor will they be reprieved.\"",
            "english_hilali_khan": "Say: \"On the Day of Al-Fath (Decision), no profit will it be to those who disbelieve if they (then) believe! Nor will they be granted a respite.\"",
            "english_rwwad": "Say, “On the Day of Decision the belief of those who disbelieved will not benefit them, nor will they be given any respite.”"
        }
    },
    {
        "id": 3532,
        "chapter": 32,
        "verse": 30,
        "arabic_text": "فَأَعۡرِضۡ عَنۡهُمۡ وَٱنتَظِرۡ إِنَّهُم مُّنتَظِرُونَ",
        "phonetic": "32.30 Fa'a`riđ `Anhum Wa Antažir 'Innahum Muntažirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So turn away from them and wait. Indeed, they are waiting.",
            "english_hilali_khan": "So turn aside from them (O Muhammad صلى الله عليه وسلم) and await: verily, they (too) are awaiting.",
            "english_rwwad": "So turn away from them and wait; they too are waiting."
        }
    }
]