[
    {
        "id": 5104,
        "chapter": 58,
        "verse": 1,
        "arabic_text": "قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ",
        "phonetic": "58.1 Qad Sami`a Allāhu Qawla Allatī Tujādiluka Fī Zawjihā Wa Tashtakī 'Ilá Allāhi Wa Allāhu Yasma`u Taĥāwurakumā 'Inna Allāha Samī`un Başīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Certainly has Allāh heard the speech of the one who argues [i.e., pleads] with you, [O Muḥammad], concerning her husband and directs her complaint to Allāh. And Allāh hears your dialogue; indeed, Allāh is Hearing and Seeing.",
            "english_hilali_khan": "1. Indeed Allâh has heard the statement of her (Khaulah bint Tha‘labah) that disputes with you (O Muhammad صلى الله عليه وسلم) concerning her husband (Aus bin As-Sâmit), and complains to Allâh. And Allâh hears the argument between you both. Verily, Allâh is All-Hearer, All-Seer.",
            "english_rwwad": "Indeed, Allah has heard the words of the woman who was arguing with you [O Prophet] concerning her husband, and was complaining to Allah. Allah has heard the discussion between the two of you, for Allah is All-Hearing, All-Seeing."
        }
    },
    {
        "id": 5105,
        "chapter": 58,
        "verse": 2,
        "arabic_text": "ٱلَّذِينَ يُظَٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَٰتِهِمۡۖ إِنۡ أُمَّهَٰتُهُمۡ إِلَّا ٱلَّٰٓـِٔي وَلَدۡنَهُمۡۚ وَإِنَّهُمۡ لَيَقُولُونَ مُنكَرٗا مِّنَ ٱلۡقَوۡلِ وَزُورٗاۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ",
        "phonetic": "58.2 Al-Ladhīna Yužāhirūna Minkum Min Nisā'ihim Mā Hunna 'Ummahātihim 'In 'Ummahātuhum 'Illā Al-Lā'ī Waladnahum Wa 'Innahum Layaqūlūna Munkarāan Mina Al-Qawli Wa Zūrāan Wa 'Inna Allāha La`afūwun Ghafūrun",
        "footnotes": {
            "english_saheeh": "[1639]- The saying by a husband to his wife, \"You are to me like the back of my mother,\" meaning unlawful to approach.  This was a type of divorce practiced by the Arabs before the prophethood of Muḥammad (ﷺ).",
            "english_hilali_khan": "(V.58:2) Az-Zihâr الظهار is the saying of a husband to his wife: You are to me like the back of my mother (i.e. unlawful for me to approach).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who pronounce ẓihār[1639] among you [to separate] from their wives - they are not [consequently] their mothers. Their mothers are none but those who gave birth to them. And indeed, they are saying an objectionable statement and a falsehood. But indeed, Allāh is Pardoning and Forgiving.",
            "english_hilali_khan": "Those among you who make their wives unlawful to them by (Zihâr الظهار)[1] (i.e. by saying to them \"You are like my mother’s back,\") they cannot be their mothers. None can be their mothers except those who gave them birth. And verily, they utter an ill word and a lie. And verily, Allâh is Oft-Pardoning, Oft-Forgiving.",
            "english_rwwad": "As for those among you who divorce their wives by likening them to their mothers, they are not their mothers; their mothers are none but those who gave birth to them. They utter words that are abhorrent and false, but Allah is Most Pardoning, Most Forgiving."
        }
    },
    {
        "id": 5106,
        "chapter": 58,
        "verse": 3,
        "arabic_text": "وَٱلَّذِينَ يُظَٰهِرُونَ مِن نِّسَآئِهِمۡ ثُمَّ يَعُودُونَ لِمَا قَالُواْ فَتَحۡرِيرُ رَقَبَةٖ مِّن قَبۡلِ أَن يَتَمَآسَّاۚ ذَٰلِكُمۡ تُوعَظُونَ بِهِۦۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ",
        "phonetic": "58.3 Wa Al-Ladhīna Yužāhirūna Min Nisā'ihim Thumma Ya`ūdūna Limā Qālū Fataĥrīru Raqabatin Min Qabli 'An Yatamāssā Dhālikum Tū`ažūna Bihi Wa Allāhu Bimā Ta`malūna Khabīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those who pronounce ẓihār from their wives and then [wish to] go back on what they said - then [there must be] the freeing of a slave before they touch one another. That is what you are admonished thereby; and Allāh is Aware of what you do.",
            "english_hilali_khan": "And those who make unlawful to them their wives by Zihâr and wish to free themselves from what they uttered, (the penalty) in that case is the freeing of a slave before they touch each other. That is an admonition to you (so that you may not repeat such an ill thing). And Allâh is All-Aware of what you do.",
            "english_rwwad": "But those who divorce their wives by likening them to their mothers then retract what they said, they must free a slave before they are intimate with each other. This is what you are admonished, and Allah is All-Aware of what you do."
        }
    },
    {
        "id": 5107,
        "chapter": 58,
        "verse": 4,
        "arabic_text": "فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ مِن قَبۡلِ أَن يَتَمَآسَّاۖ فَمَن لَّمۡ يَسۡتَطِعۡ فَإِطۡعَامُ سِتِّينَ مِسۡكِينٗاۚ ذَٰلِكَ لِتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦۚ وَتِلۡكَ حُدُودُ ٱللَّهِۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٌ",
        "phonetic": "58.4 Faman Lam Yajid Faşiyāmu Shahrayni Mutatābi`ayni Min Qabli 'An Yatamāssā Faman Lam Yastaţi` Fa'iţ`āmu Sittīna Miskīnāan Dhālika Litu'uminū Billāhi Wa Rasūlihi Wa Tilka Ĥudūdu Allāhi Wa Lilkāfirīna `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "[1640]- See footnote to 4:92.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he who does not find [a slave] - then a fast for two months consecutively[1640] before they touch one another; and he who is unable - then the feeding of sixty poor persons. That is for you to believe [completely] in Allāh and His Messenger; and those are the limits [set by] Allāh. And for the disbelievers is a painful punishment.",
            "english_hilali_khan": "And he who finds not (the money for freeing a slave) must fast two successive months before they both touch each other. And he who is unable to do so, should feed sixty Miskîns (poor). That is in order that you may have perfect Faith in Allâh and His Messenger. These are the limits set by Allâh. And for disbelievers, there is a painful torment.",
            "english_rwwad": "But whoever cannot afford this must fast for two consecutive months before the couple have intimate relation with each other. But if he is unable to do that, he must feed sixty needy people. This is so that you may truly believe in Allah and His Messenger. These are the limits ordained by Allah, and for the disbelievers there will be a painful punishment."
        }
    },
    {
        "id": 5108,
        "chapter": 58,
        "verse": 5,
        "arabic_text": "إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥ كُبِتُواْ كَمَا كُبِتَ ٱلَّذِينَ مِن قَبۡلِهِمۡۚ وَقَدۡ أَنزَلۡنَآ ءَايَٰتِۭ بَيِّنَٰتٖۚ وَلِلۡكَٰفِرِينَ عَذَابٞ مُّهِينٞ",
        "phonetic": "58.5 'Inna Al-Ladhīna Yuĥāddūna Allāha Wa Rasūlahu Kubitū Kamā Kubita Al-Ladhīna Min Qablihim Wa Qad 'Anzalnā 'Āyātin Bayyinātin Wa Lilkāfirīna `Adhābun Muhīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.58:5) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who oppose Allāh and His Messenger are abased as those before them were abased. And We have certainly sent down verses of clear evidence. And for the disbelievers is a humiliating punishment",
            "english_hilali_khan": "Verily, those who oppose Allâh and His Messenger (Muhammad صلى الله عليه وسلم)[2] will be disgraced, as those before them (among the past nation) were disgraced. And We have sent down clear Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.). And for the disbelievers is a disgracing torment.",
            "english_rwwad": "Indeed, those who oppose Allah and His Messenger will be debased, just as those who came before them were debased, for We have surely sent down clear signs. And for the disbelievers there will be a humiliating punishment."
        }
    },
    {
        "id": 5109,
        "chapter": 58,
        "verse": 6,
        "arabic_text": "يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيُنَبِّئُهُم بِمَا عَمِلُوٓاْۚ أَحۡصَىٰهُ ٱللَّهُ وَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ",
        "phonetic": "58.6 Yawma Yab`athuhumu Allāhu Jamī`āan Fayunabbi'uhum Bimā `Amilū 'Aĥşāhu Allāhu Wa Nasūhu Wa Allāhu `Alá Kulli Shay'in Shahīdun",
        "footnotes": {
            "english_saheeh": "[1641]- See footnote to 4:79.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day when Allāh will resurrect them all and inform them of what they did. Allāh had enumerated it, while they forgot it; and Allāh is, over all things, Witness.[1641]",
            "english_hilali_khan": "On the Day when Allâh will resurrect them all together (i.e. on the Day of Resurrection) and inform them of what they did. Allâh has kept account of it, while they have forgotten it. And Allâh is Witness over all things.",
            "english_rwwad": "On the Day when Allah will resurrect them all together, and will inform them of what they did; Allah has kept their complete record, while they have forgotten it. For Allah is Witness over all things."
        }
    },
    {
        "id": 5110,
        "chapter": 58,
        "verse": 7,
        "arabic_text": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ",
        "phonetic": "58.7 'Alam Tará 'Anna Allāha Ya`lamu Mā Fī As-Samāwāti Wa Mā Fī Al-'Arđi Mā Yakūnu Min Najwá Thalāthatin 'Illā Huwa Rābi`uhum Wa Lā Khamsatin 'Illā Huwa Sādisuhum Wa Lā 'Adná Min Dhālika Wa Lā 'Akthara 'Illā Huwa Ma`ahum 'Ayna Mā Kānū Thumma Yunabbi'uhum Bimā `Amilū Yawma Al-Qiyāmati 'Inna Allāha Bikulli Shay'in `Alīmun",
        "footnotes": {
            "english_saheeh": "[1642]- Through His knowledge of them and their secrets.",
            "english_hilali_khan": "(V.58:7) See the footnote of (V.11:18)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you not considered that Allāh knows what is in the heavens and what is on the earth? There are not three in a private conversation but that He is the fourth of them,[1642] nor are there five but that He is the sixth of them - and no less than that and no more except that He is with them [in knowledge] wherever they are. Then He will inform them of what they did, on the Day of Resurrection. Indeed Allāh is, of all things, Knowing.",
            "english_hilali_khan": "7. Have you not seen that Allâh knows whatsoever is in the heavens and whatsoever is on the earth? There is no Najwâ[1] (secret counsel) of three but He is their fourth (with His Knowledge, while He Himself is over the Throne, over the seventh heaven), nor of five but He is their sixth (with His Knowledge), nor of less than that or more but He is with them (with His Knowledge) wheresoever they may be. And afterwards on the Day of Resurrection He will inform them of what they did. Verily, Allâh is the All-Knower of everything.",
            "english_rwwad": "Do you not see that Allah knows all that is in the heavens and all that is on earth? No secret consultation takes place between three, but He is their fourth, or between five, but He is their sixth, or between fewer or more than that, but He is with them wherever they may be. Then He will inform them of what they did on the Day of Resurrection. Indeed, Allah is All-Knowing of everything."
        }
    },
    {
        "id": 5111,
        "chapter": 58,
        "verse": 8,
        "arabic_text": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ",
        "phonetic": "58.8 'Alam Tará 'Ilá Al-Ladhīna Nuhū `Ani An-Najwá Thumma Ya`ūdūna Limā Nuhū `Anhu Wa Yatanājawna Bil-'Ithmi Wa Al-`Udwāni Wa Ma`şiyati Ar-Rasūli Wa 'Idhā Jā'ūka Ĥayyawka Bimā Lam Yuĥayyika Bihi Allāhu Wa Yaqūlūna Fī 'Anfusihim Lawlā Yu`adhibunā Allāhu Bimā Naqūlu Ĥasbuhum Jahannamu Yaşlawnahā Fabi'sa Al-Maşīru",
        "footnotes": {
            "english_saheeh": "[1643]- This is in reference to the Jews who would greet the Muslims with the words \"Death be upon you,\" rather than \"Peace.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you not considered those who were forbidden from private conversation [i.e., ridicule and conspiracy] and then return to that which they were forbidden and converse among themselves about sin and aggression and disobedience to the Messenger? And when they come to you, they greet you with that [word] by which Allāh does not greet you[1643] and say among themselves, \"Why does Allāh not punish us for what we say?\" Sufficient for them is Hell, which they will [enter to] burn, and wretched is the destination.",
            "english_hilali_khan": "Have you not seen those who were forbidden to hold secret counsels, and afterwards returned to that which they had been forbidden, and conspired together for sin and wrong doing and disobedience to the Messenger (Muhammad صلى الله عليه وسلم). And when they come to you, they greet you with a greeting wherewith Allâh greets you not, and say within themselves: \"Why should Allâh punish us not for what we say?\" Hell will be sufficient for them; they will burn therein. And worst indeed is that destination!",
            "english_rwwad": "Have you not seen those who were forbidden from holding secret talks, yet they go back to do what they were forbidden from, conspiring in sin and aggression, and in disobedience to the Messenger? When they come to you, they greet you other than the way Allah greets you, and they say to one another, “Why does Allah not punish us for what we say?” Sufficient is Hell for them; they will enter it. What a terrible destination!"
        }
    },
    {
        "id": 5112,
        "chapter": 58,
        "verse": 9,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ",
        "phonetic": "58.9 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Idhā Tanājaytum Falā Tatanājaw Bil-'Ithmi Wa Al-`Udwāni Wa Ma`şiyati Ar-Rasūli Wa Tanājaw Bil-Birri Wa At-Taqwá Wa Attaqū Allāha Al-Ladhī 'Ilayhi Tuĥsharūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, when you converse privately, do not converse about sin and aggression and disobedience to the Messenger but converse about righteousness and piety. And fear Allāh, to whom you will be gathered.",
            "english_hilali_khan": "O you who believe! When you hold secret counsel, do it not for sin and wrong-doing, and disobedience towards the Messenger (Muhammad صلى الله عليه وسلم), but do it for Al-Birr (righteousness) and Taqwâ (virtues and piety); and fear Allâh unto Whom you shall be gathered.",
            "english_rwwad": "O you who believe, when you hold secret talk, do not do so in sin and aggression, and in disobedience to the Messenger, rather do so in righteousness and piety. And fear Allah, to Whom you will be gathered."
        }
    },
    {
        "id": 5113,
        "chapter": 58,
        "verse": 10,
        "arabic_text": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡـًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ",
        "phonetic": "58.10 'Innamā An-Najwá Mina Ash-Shayţāni Liyaĥzuna Al-Ladhīna 'Āmanū Wa Laysa Biđārrihim Shay'āan 'Illā Bi'idhni Allāhi Wa `Alá Allāhi Falyatawakkali Al-Mu'uminūna",
        "footnotes": {
            "english_saheeh": "[1644]- The reference may be to the sinful type of conversation, as mentioned in the previous verses, or to the practice of two persons speaking in confidence in the presence of a third, which might lead him to assume that he is the subject of their conversation.  Such behavior was prohibited by the Prophet (ﷺ) in narrations of al-Bukhārī and Muslim.",
            "english_hilali_khan": "(V.58:10) See the footnote (A) of (V.12:67).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Private conversation is only from Satan that he may grieve those who have believed,[1644] but he will not harm them at all except by permission of Allāh. And upon Allāh let the believers rely.",
            "english_hilali_khan": "Secret counsels (conspiracies) are only from Shaitân (Satan), in order that he may cause grief to the believers. But he cannot harm them in the least, except as Allâh permits. And in Allâh let the believers put their trust[2].",
            "english_rwwad": "Secret talks are only prompted by Satan to grieve the believers, but he cannot harm them in the least except with Allah’s permission. So let the believers put their trust in Allah."
        }
    },
    {
        "id": 5114,
        "chapter": 58,
        "verse": 11,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ",
        "phonetic": "58.11 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Idhā Qīla Lakum Tafassaĥū Fī Al-Majālisi Fāfsaĥū Yafsaĥi Allāhu Lakum Wa 'Idhā Qīla Anshuzū Fānshuzū Yarfa`i Allāhu Al-Ladhīna 'Āmanū Minkum Wa Al-Ladhīna 'Ūtū Al-`Ilma Darajātin Wa Allāhu Bimā Ta`malūna Khabīrun",
        "footnotes": {
            "english_saheeh": "[1645]- In His mercy, in Paradise, or in everything good.\n[1646]- To prayer, to battle, or to good deeds.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, when you are told, \"Space yourselves\" in assemblies, then make space; Allāh will make space for you.[1645] And when you are told, \"Arise,\"[1646] then arise; Allāh will raise those who have believed among you and those who were given knowledge, by degrees. And Allāh is Aware of what you do.",
            "english_hilali_khan": "O you who believe! When you are told to make room in the assemblies, (spread out and) make room. Allâh will give you (ample) room (from His Mercy). And when you are told to rise up [for prayers, or Jihâd (holy fighting in Allâh’s cause), or for any other good deed], rise up. Allâh will exalt in degree those of you who believe, and those who have been granted knowledge. And Allâh is Well-Acquainted with what you do.",
            "english_rwwad": "O you who believe, when you are told to make room in your gatherings, then make room; Allah will give you abundance. And when you are told to rise, then rise; Allah will raise in ranks those who believed from among you and those who are given knowledge. And Allah is All-Aware of what you do."
        }
    },
    {
        "id": 5115,
        "chapter": 58,
        "verse": 12,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَٰجَيۡتُمُ ٱلرَّسُولَ فَقَدِّمُواْ بَيۡنَ يَدَيۡ نَجۡوَىٰكُمۡ صَدَقَةٗۚ ذَٰلِكَ خَيۡرٞ لَّكُمۡ وَأَطۡهَرُۚ فَإِن لَّمۡ تَجِدُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ",
        "phonetic": "58.12 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Idhā Nājaytumu Ar-Rasūla Faqaddimū Bayna Yaday Najwākum Şadaqatan Dhālika Khayrun Lakum Wa 'Aţharu Fa'in Lam Tajidū Fa'inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, when you [wish to] privately consult the Messenger, present before your consultation a charity. That is better for you and purer. But if you find not [the means] - then indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "O you who believe! When you (want to) consult the Messenger (Muhammad صلى الله عليه وسلم) in private, spend something in charity before your private consultation. That will be better and purer for you. But if you find not (the means for it), then verily, Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "O you who believe, when you consult the Messenger in private, give something in charity before your consultation; that is better for you and more conducive to purity. But if you do not have the means, then Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 5116,
        "chapter": 58,
        "verse": 13,
        "arabic_text": "ءَأَشۡفَقۡتُمۡ أَن تُقَدِّمُواْ بَيۡنَ يَدَيۡ نَجۡوَىٰكُمۡ صَدَقَٰتٖۚ فَإِذۡ لَمۡ تَفۡعَلُواْ وَتَابَ ٱللَّهُ عَلَيۡكُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ",
        "phonetic": "58.13 'A'ashfaqtum 'An Tuqaddimū Bayna Yaday Najwākum Şadaqātin Fa'idh Lam Taf`alū Wa Tāba Allāhu `Alaykum Fa'aqīmū Aş-Şalāata Wa 'Ātū Az-Zakāata Wa 'Aţī`ū Allāha Wa Rasūlahu Wa Allāhu Khabīrun Bimā Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you feared to present before your consultation charities? Then when you do not and Allāh has forgiven you, then [at least] establish prayer and give zakāh and obey Allāh and His Messenger. And Allāh is Aware of what you do.",
            "english_hilali_khan": "Are you afraid of spending in charity before your private consultation (with him)? If then you do it not, and Allâh has forgiven you, then (at least) perform Salât (Iqâmat-as-Salât ) and give Zakât and obey Allâh (i.e. do all that Allâh and His Messenger صلى الله عليه وسلم order you to do). And Allâh is All-Aware of what you do.",
            "english_rwwad": "Are you afraid of giving charities before your consultations with him? If you are unable to do so, and Allah has pardoned you, then establish prayer and give zakah, and obey Allah and His Messenger. And Allah is All-Aware of what you do."
        }
    },
    {
        "id": 5117,
        "chapter": 58,
        "verse": 14,
        "arabic_text": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ تَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِم مَّا هُم مِّنكُمۡ وَلَا مِنۡهُمۡ وَيَحۡلِفُونَ عَلَى ٱلۡكَذِبِ وَهُمۡ يَعۡلَمُونَ",
        "phonetic": "58.14 'Alam Tará 'Ilá Al-Ladhīna Tawallaw Qawmāan Ghađiba Allāhu `Alayhim Mā Hum Minkum Wa Lā Minhum Wa Yaĥlifūna `Alá Al-Kadhibi Wa Hum Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Have you not considered those who make allies of a people with whom Allāh has become angry? They are neither of you nor of them, and they swear to untruth while they know [they are lying].",
            "english_hilali_khan": "Have you (O Muhammad صلى الله عليه وسلم) not seen those (hypocrites) who take as friends a people upon whom is the Wrath of Allâh (i.e. Jews)? They are neither of you (Muslims) nor of them (Jews), and they swear to a lie while they know.",
            "english_rwwad": "Do you not see those [hypocrites] who take as allies people who have incurred Allah’s wrath. They are neither of you nor of them, and they swear falsely while they know."
        }
    },
    {
        "id": 5118,
        "chapter": 58,
        "verse": 15,
        "arabic_text": "أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابٗا شَدِيدًاۖ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "58.15 'A`adda Allāhu Lahum `Adhābāan Shadīdāan 'Innahum Sā'a Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has prepared for them a severe punishment. Indeed, it was evil that they were doing.",
            "english_hilali_khan": "Allâh has prepared for them a severe torment. Evil indeed is that which they used to do.",
            "english_rwwad": "Allah has prepared for them a severe punishment. Evil is indeed what they do."
        }
    },
    {
        "id": 5119,
        "chapter": 58,
        "verse": 16,
        "arabic_text": "ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِ فَلَهُمۡ عَذَابٞ مُّهِينٞ",
        "phonetic": "58.16 Attakhadhū 'Aymānahum Junnatan Faşaddū `An Sabīli Allāhi Falahum `Adhābun Muhīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They took their [false] oaths as a cover, so they averted [people] from the way of Allāh, and for them is a humiliating punishment.",
            "english_hilali_khan": "They have made their oaths a screen (for their evil actions). Thus they hinder (men) from the Path of Allâh: so they shall have a humiliating torment.",
            "english_rwwad": "They have taken their oaths as a shield, in order to hinder people from the way of Allah. For them there will be a humiliating punishment."
        }
    },
    {
        "id": 5120,
        "chapter": 58,
        "verse": 17,
        "arabic_text": "لَّن تُغۡنِيَ عَنۡهُمۡ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُم مِّنَ ٱللَّهِ شَيۡـًٔاۚ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ",
        "phonetic": "58.17 Lan Tughniya `Anhum 'Amwāluhum Wa Lā 'Awlāduhum Mina Allāhi Shay'āan 'Ūlā'ika 'Aşĥābu An-Nāri Hum Fīhā Khālidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Never will their wealth or their children avail them against Allāh at all. Those are the companions of the Fire; they will abide therein eternally",
            "english_hilali_khan": "Their children and their wealth will avail them nothing against Allâh. They will be the dwellers of the Fire to dwell therein forever.",
            "english_rwwad": "Neither their wealth nor their children will avail them anything against Allah. They are the people of the Fire; they will abide therein forever."
        }
    },
    {
        "id": 5121,
        "chapter": 58,
        "verse": 18,
        "arabic_text": "يَوۡمَ يَبۡعَثُهُمُ ٱللَّهُ جَمِيعٗا فَيَحۡلِفُونَ لَهُۥ كَمَا يَحۡلِفُونَ لَكُمۡ وَيَحۡسَبُونَ أَنَّهُمۡ عَلَىٰ شَيۡءٍۚ أَلَآ إِنَّهُمۡ هُمُ ٱلۡكَٰذِبُونَ",
        "phonetic": "58.18 Yawma Yab`athuhumu Allāhu Jamī`āan Fayaĥlifūna Lahu Kamā Yaĥlifūna Lakum Wa Yaĥsabūna 'Annahum `Alá Shay'in 'Alā 'Innahum Humu Al-Kādhibūna",
        "footnotes": {
            "english_saheeh": "[1647]- They assume that their lies will be believed and that they will escape detection as they did in worldly life.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "On the Day Allāh will resurrect them all, and they will swear to Him as they swear to you and think that they are [standing] on something.[1647] Unquestionably, it is they who are the liars.",
            "english_hilali_khan": "On the Day when Allâh will resurrect them all together (for their account); then they will swear to Him as they swear to you (O Muslims). And they think that they have something (to stand upon). Verily, they are liars!",
            "english_rwwad": "On the Day when Allah will raise them all, they will swear to Him as they swear to you, thinking that they have something to stand on. Indeed, it is they who are the liars."
        }
    },
    {
        "id": 5122,
        "chapter": 58,
        "verse": 19,
        "arabic_text": "ٱسۡتَحۡوَذَ عَلَيۡهِمُ ٱلشَّيۡطَٰنُ فَأَنسَىٰهُمۡ ذِكۡرَ ٱللَّهِۚ أُوْلَٰٓئِكَ حِزۡبُ ٱلشَّيۡطَٰنِۚ أَلَآ إِنَّ حِزۡبَ ٱلشَّيۡطَٰنِ هُمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "58.19 Astaĥwadha `Alayhimu Ash-Shayţānu Fa'ansāhum Dhikra Allāhi 'Ūlā'ika Ĥizbu Ash-Shayţāni 'Alā 'Inna Ĥizba Ash-Shayţāni Humu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Satan has overcome them and made them forget the remembrance of Allāh. Those are the party of Satan. Unquestionably, the party of Satan - they will be the losers.",
            "english_hilali_khan": "Shaitân (Satan) has overpowered them. So he has made them forget the remembrance of Allâh. They are the party of Shaitân (Satan). Verily, it is the party of Shaitan (Satan) that will be the losers!",
            "english_rwwad": "Satan has taken hold of them and has thus caused them to forget the remembrance of Allah. They are the party of Satan. Indeed, the party of Satan will be the losers."
        }
    },
    {
        "id": 5123,
        "chapter": 58,
        "verse": 20,
        "arabic_text": "إِنَّ ٱلَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُۥٓ أُوْلَٰٓئِكَ فِي ٱلۡأَذَلِّينَ",
        "phonetic": "58.20 'Inna Al-Ladhīna Yuĥāddūna Allāha Wa Rasūlahu 'Ūlā'ika Fī Al-'Adhallīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, the ones who oppose Allāh and His Messenger - those will be among the most humbled.",
            "english_hilali_khan": "Those who oppose Allâh and His Messenger (Muhammad صلى الله عليه وسلم) they will be among the lowest (most humiliated).",
            "english_rwwad": "Indeed, those who oppose Allah and His Messenger, they are among the most debased."
        }
    },
    {
        "id": 5124,
        "chapter": 58,
        "verse": 21,
        "arabic_text": "كَتَبَ ٱللَّهُ لَأَغۡلِبَنَّ أَنَا۠ وَرُسُلِيٓۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ",
        "phonetic": "58.21 Kataba Allāhu La'aghlibanna 'Anā Wa Rusulī 'Inna Allāha Qawīyun `Azīzun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh has written [i.e., decreed], \"I will surely overcome, I and My messengers.\" Indeed, Allāh is Powerful and Exalted in Might.",
            "english_hilali_khan": "Allâh has decreed: \"Verily, it is I and My Messengers who shall be the victorious.\" Verily, Allâh is All-Powerful, All-Mighty.",
            "english_rwwad": "Allah has decreed, “I and My messengers will surely prevail.” Indeed, Allah is All-Powerful, All-Mighty."
        }
    },
    {
        "id": 5125,
        "chapter": 58,
        "verse": 22,
        "arabic_text": "لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ",
        "phonetic": "58.22 Lā Tajidu Qawmāan Yu'uminūna Billāhi Wa Al-Yawmi Al-'Ākhiri Yuwāddūna Man Ĥādda Allāha Wa Rasūlahu Wa Law Kānū 'Ābā'ahum 'Aw 'Abnā'ahum 'Aw 'Ikhwānahum 'Aw `Ashīratahum 'Ūlā'ika Kataba Fī Qulūbihimu Al-'Īmāna Wa 'Ayyadahum Birūĥin Minhu Wa Yudkhiluhum Jannātin Tajrī Min Taĥtihā Al-'Anhāru Khālidīna Fīhā Rađiya Allāhu `Anhum Wa Rađū `Anhu 'Ūlā'ika Ĥizbu Allāhi 'Alā 'Inna Ĥizba Allāhi Humu Al-Mufliĥūna",
        "footnotes": {
            "english_saheeh": "[1648]- i.e., \"that which gives life,\" explained as the guidance of the Qur’ān or victory over their opponents.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "You will not find a people who believe in Allāh and the Last Day having affection for those who oppose Allāh and His Messenger, even if they were their fathers or their sons or their brothers or their kindred. Those - He has decreed within their hearts faith and supported them with spirit[1648] from Him. And We will admit them to gardens beneath which rivers flow, wherein they abide eternally. Allāh is pleased with them, and they are pleased with Him - those are the party of Allāh. Unquestionably, the party of Allāh - they are the successful.",
            "english_hilali_khan": "You (O Muhammad صلى الله عليه وسلم) will not find any people who believe in Allâh and the Last Day, making friendship with those who oppose Allâh and His Messenger (Muhammad صلى الله عليه وسلم), even though they were their fathers or their sons or their brothers or their kindred (people). For such He has written Faith in their hearts, and strengthened them with Rûh (proofs, light and true guidance) from Himself. And He will admit them to Gardens (Paradise) under which rivers flow to dwell therein (forever). Allâh is pleased with them, and they with Him. They are the Party of Allâh. Verily, it is the Party of Allâh that will be the successful.",
            "english_rwwad": "You will not find any people who believe in Allah and the Last Day taking as allies those who oppose Allah and His Messenger, even if they were their parents, their children, their brothers, or their kindred. It is they in whose hearts Allah has instilled faith and strengthened them with a spirit from Him. He will admit them to gardens under which rivers flow, abiding therein forever. Allah is pleased with them and they are pleased with Allah. They are the party of Allah. Indeed, it is the party of Allah that will be the successful."
        }
    }
]