[
    {
        "id": 5150,
        "chapter": 60,
        "verse": 1,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
        "phonetic": "60.1 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Tattakhidhū `Adūwī Wa `Adūwakum 'Awliyā'a Tulqūna 'Ilayhim Bil-Mawaddati Wa Qad Kafarū Bimā Jā'akum Mina Al-Ĥaqqi Yukhrijūna Ar-Rasūla Wa 'Īyākum 'An Tu'uminū Billāhi Rabbikum 'In Kuntum Kharajtum Jihādāan Fī Sabīlī Wa Abtighā'a Marđātī Tusirrūna 'Ilayhim Bil-Mawaddati Wa 'Anā 'A`lamu Bimā 'Akhfaytum Wa Mā 'A`lantum Wa Man Yaf`alhu Minkum Faqad Đalla Sawā'a As-Sabīli",
        "footnotes": {
            "english_saheeh": "[1672]- i.e., close associates and friends.",
            "english_hilali_khan": "(V.60:1) See (V.3:149) and its footnote.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, do not take My enemies and your enemies as allies,[1672] extending to them affection while they have disbelieved in what came to you of the truth, having driven out the Prophet and yourselves [only] because you believe in Allāh, your Lord. If you have come out for jihād [i.e., fighting or striving] in My cause and seeking means to My approval, [take them not as friends]. You confide to them affection [i.e., instruction], but I am most knowing of what you have concealed and what you have declared. And whoever does it among you has certainly strayed from the soundness of the way.",
            "english_hilali_khan": "O you who believe! Take not My enemies and your enemies (i.e. disbelievers and polytheists) as friends, showing affection towards them, while they have disbelieved in what has come to you of the truth (i.e. Islâmic Monotheism, this Qur’ân, and Muhammad صلى الله عليه وسلم), and have driven out the Messenger (Muhammad صلى الله عليه وسلم) and yourselves (from your homeland) because you believe in Allâh your Lord! If you have come forth to strive in My Cause and to seek My Good Pleasure, (then take not these disbelievers and polytheists as your friends). You show friendship to them in secret, while I am All-Aware of what you conceal and what you reveal. And whosoever of you (Muslims) does that, then indeed he has gone (far) astray from the Straight Path[1].",
            "english_rwwad": "O you who believe, do not take My enemies and your enemies as allies, offering them friendship even though they rejected the truth that has come to you, and they have driven out the Messenger and yourselves [from Makkah] simply because you believe in Allah, your Lord – if you have emigrated to struggle in My cause and seek My pleasure. How can you disclose secrets [of the believers], showing them friendship, when I know best all that you conceal and all that you reveal? Whoever among you does that has truly strayed from the straight path."
        }
    },
    {
        "id": 5151,
        "chapter": 60,
        "verse": 2,
        "arabic_text": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ",
        "phonetic": "60.2 'In Yathqafūkum Yakūnū Lakum 'A`dā'an Wa Yabsuţū 'Ilaykum 'Aydiyahum Wa 'Alsinatahum Bis-Sū'i Wa Waddū Law Takfurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "If they gain dominance over you, they would be [i.e., behave] to you as enemies and extend against you their hands and their tongues with evil, and they wish you would disbelieve.",
            "english_hilali_khan": "Should they gain the upper hand over you, they would behave to you as enemies, and stretch forth their hands and their tongues against you with evil, and they desire that you should disbelieve.",
            "english_rwwad": "If they gain the upper hand over you, they would be your [open] enemies, and would stretch their hands and tongues towards you to harm you, and they wish that you too would disbelieve."
        }
    },
    {
        "id": 5152,
        "chapter": 60,
        "verse": 3,
        "arabic_text": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ",
        "phonetic": "60.3 Lan Tanfa`akum 'Arĥāmukum Wa Lā 'Awlādukum Yawma Al-Qiyāmati Yafşilu Baynakum Wa Allāhu Bimā Ta`malūna Başīrun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you. And Allāh, of what you do, is Seeing.",
            "english_hilali_khan": "Neither your relatives nor your children will benefit you on the Day of Resurrection (against Allâh). He will judge between you. And Allâh is the All-Seer of what you do.",
            "english_rwwad": "Neither your relatives nor your children will benefit you on the Day of Resurrection; He will judge between you, and Allah is All-Seeing of what you do."
        }
    },
    {
        "id": 5153,
        "chapter": 60,
        "verse": 4,
        "arabic_text": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ",
        "phonetic": "60.4 Qad Kānat Lakum 'Uswatun Ĥasanatun Fī 'Ibrāhīma Wa Al-Ladhīna Ma`ahu 'Idh Qālū Liqawmihim 'Innā Bura'ā'u Minkum Wa Mimmā Ta`budūna Min Dūni Allāhi Kafarnā Bikum Wa Badā Baynanā Wa Baynakumu Al-`Adāwatu Wa Al-Baghđā'u 'Abadāan Ĥattá Tu'uminū Billāhi Waĥdahu 'Illā Qawla 'Ibrāhīma Li'abīhi La'astaghfiranna Laka Wa Mā 'Amliku Laka Mina Allāhi Min Shay'in Rabbanā `Alayka Tawakkalnā Wa 'Ilayka 'Anabnā Wa 'Ilayka Al-Maşīru",
        "footnotes": {
            "english_saheeh": "[1673]- An example to be followed.",
            "english_hilali_khan": "(V.60:4) See the Qur’ân Verses (V.9:114), (V.19:41-49) and (V.26:70-86)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There has already been for you an excellent pattern[1673] in Abraham and those with him, when they said to their people, \"Indeed, we are disassociated from you and from whatever you worship other than Allāh. We have denied you, and there has appeared between us and you animosity and hatred forever until you believe in Allāh alone\" - except for the saying of Abraham to his father, \"I will surely ask forgiveness for you, but I have not [power to do] for you anything against Allāh. Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.",
            "english_hilali_khan": "Indeed there has been an excellent example for you in Ibrâhîm (Abraham) and those with him, when they said to their people: \"Verily, we are free from you and whatever you worship besides Allâh: we have rejected you, and there has started between us and you hostility and hatred for ever until you believe in Allâh Alone\" - except the saying of Ibrâhîm (Abraham) to his father: \"Verily, I will ask forgiveness (from Allâh) for you, but I have no power to do anything for you before Allâh.[2]\" Our Lord! In You (Alone) we put our trust, and to You (Alone) we turn in repentance, and to You (Alone) is (our) final Return.",
            "english_rwwad": "Indeed, you have a good example in Abraham and those with him, when they said to their people, “We dissociate ourselves from you and whatever you worship besides Allah. We renounce you, and the enmity and hatred have arisen between us and you forever until you believe in Allah alone”, except for Abraham when he said to his father, “I will seek forgiveness for you, but I cannot protect you from Allah in the least.” “Our Lord, in You we put our trust and to You we turn, and to You is the final return.”"
        }
    },
    {
        "id": 5154,
        "chapter": 60,
        "verse": 5,
        "arabic_text": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ",
        "phonetic": "60.5 Rabbanā Lā Taj`alnā Fitnatan Lilladhīna Kafarū Wa Aghfir Lanā Rabbanā 'Innaka 'Anta Al-`Azīzu Al-Ĥakīmu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Our Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.\"",
            "english_hilali_khan": "\"Our Lord! Make us not a trial for the disbelievers, and forgive us, Our Lord! Verily, You, only You, are the All-Mighty, the All-Wise.\"",
            "english_rwwad": "Our Lord, do not make us subject to the persecution of those who disbelieve; and forgive us, our Lord. Indeed, You are the All-Mighty, the All-Wise.”"
        }
    },
    {
        "id": 5155,
        "chapter": 60,
        "verse": 6,
        "arabic_text": "لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ",
        "phonetic": "60.6 Laqad Kāna Lakum Fīhim 'Uswatun Ĥasanatun Liman Kāna Yarjū Allāha Wa Al-Yawma Al-'Ākhira Wa Man Yatawalla Fa'inna Allāha Huwa Al-Ghanīyu Al-Ĥamīdu",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "There has certainly been for you in them an excellent pattern for anyone whose hope is in Allāh and the Last Day. And whoever turns away - then indeed, Allāh is the Free of need, the Praiseworthy.",
            "english_hilali_khan": "Certainly, there has been in them an excellent example for you to follow - for those who look forward to (the Meeting with) Allâh and the Last Day. And whosoever turns away, then verily, Allâh is Rich (Free of all needs), Worthy of all Praise.",
            "english_rwwad": "You certainly have a good example in them, for those who look forward with hope to Allah and the Last Day. But whoever turns away, Allah is indeed the Self-Sufficient, the Praiseworthy."
        }
    },
    {
        "id": 5156,
        "chapter": 60,
        "verse": 7,
        "arabic_text": "۞ عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ",
        "phonetic": "60.7 `Asá Allāhu 'An Yaj`ala Baynakum Wa Bayna Al-Ladhīna `Ādaytum Minhum Mawaddatan Wa Allāhu Qadīrun Wa Allāhu Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[1674]- To accomplish this or whatever He should will.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Perhaps Allāh will put, between you and those to whom you have been enemies among them, affection. And Allāh is competent,[1674] and Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "Perhaps Allâh will make friendship between you and those whom you hold as enemies. And Allâh has power (over all things), and Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "It may be that Allah will bring about friendship between you and those of them whom you hold as enemies. Allah is Most Capable, and Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 5157,
        "chapter": 60,
        "verse": 8,
        "arabic_text": "لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ",
        "phonetic": "60.8 Lā Yanhākumu Allāhu `Ani Al-Ladhīna Lam Yuqātilūkum Fī Ad-Dīni Wa Lam Yukhrijūkum Min Diyārikum 'An Tabarrūhum Wa Tuqsiţū 'Ilayhim 'Inna Allāha Yuĥibbu Al-Muqsiţīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allāh loves those who act justly.",
            "english_hilali_khan": "Allâh does not forbid you to deal justly and kindly with those who fought not against you on account of religion nor drove you out of your homes. Verily, Allâh loves those who deal with equity.",
            "english_rwwad": "Allah does not forbid you from being kind and just to those who did not fight against you nor did they drive you out of your homes. Indeed, Allah loves those who are just."
        }
    },
    {
        "id": 5158,
        "chapter": 60,
        "verse": 9,
        "arabic_text": "إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ",
        "phonetic": "60.9 'Innamā Yanhākumu Allāhu `Ani Al-Ladhīna Qātalūkum Fī Ad-Dīni Wa 'Akhrajūkum Min Diyārikum Wa Žāharū `Alá 'Ikhrājikum 'An Tawallawhum Wa Man Yatawallahum Fa'ūlā'ika Humu Až-Žālimūna",
        "footnotes": {
            "english_saheeh": "[1675]- See footnote to verse 1 of this sūrah.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Allāh only forbids you from those who fight you because of religion and expel you from your homes and aid in your expulsion - [forbids] that you make allies[1675] of them. And whoever makes allies of them, then it is those who are the wrongdoers.",
            "english_hilali_khan": "It is only as regards those who fought against you on account of religion, and have driven you out of your homes, and helped to drive you out, that Allâh forbids you to befriend them. And whosoever will befriend them, then such are the Zâlimûn (wrong-doers - those who disobey Allâh).",
            "english_rwwad": "Allah only forbids you from taking as allies those who fought against you on account of your religion, and drove you out of your homes or helped others in driving you out. Whoever takes them as allies, it is they who are the wrongdoers."
        }
    },
    {
        "id": 5159,
        "chapter": 60,
        "verse": 10,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡـَٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡـَٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
        "phonetic": "60.10 Yā 'Ayyuhā Al-Ladhīna 'Āmanū 'Idhā Jā'akumu Al-Mu'uminātu Muhājirātin Fāmtaĥinūhunna Allāhu 'A`lamu Bi'īmānihinna Fa'in `Alimtumūhunna Mu'uminātin Falā Tarji`ūhunna 'Ilá Al-Kuffāri Lā Hunna Ĥillun Lahum Wa Lā Hum Yaĥillūna Lahunna Wa 'Ātūhum Mā 'Anfaqū Wa Lā Junāĥa `Alaykum 'An Tankiĥūhunna 'Idhā 'Ātaytumūhunna 'Ujūrahunna Wa Lā Tumsikū Bi`işami Al-Kawāfiri Wa As'alū Mā 'Anfaqtum Wa Līas'alū Mā 'Anfaqū Dhālikum Ĥukmu Allāhi Yaĥkumu Baynakum Wa Allāhu `Alīmun Ĥakīmun",
        "footnotes": {
            "english_saheeh": "[1676]- For marriage, i.e., compensate their loss.\n[1677]- When a disbelieving wife chose to join the disbelievers, a Muslim husband could demand in return the equivalent of her mahr.  Likewise, the disbelievers had a similar right when a believing woman joined the Muslims.  This and the following verses were revealed subsequent to the Treaty of al-Ḥudaybiyyah.",
            "english_hilali_khan": "(V.60:10) Mahr: Bridal-money given by the husband to his wife at the time of wedding.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, when the believing women come to you as emigrants, examine [i.e., test] them. Allāh is most knowing as to their faith. And if you know them to be believers, then do not return them to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give them [i.e., the disbelievers] what they have spent.[1676] And there is no blame upon you if you marry them when you have given them their due compensation [i.e., mahr]. And hold not to marriage bonds with disbelieving women, but ask for what you have spent and let them [i.e., the disbelievers] ask for what they have spent.[1677] That is the judgement of Allāh; He judges between you. And Allāh is Knowing and Wise.",
            "english_hilali_khan": "O you who believe! When believing women come to you as emigrants, examine them; Allâh knows best as to their Faith, then if you ascertain that they are true believers send them not back to the disbelievers. They are not lawful (wives) for the disbelievers nor are the disbelievers lawful (husbands) for them. But give them (the disbelievers) that (amount of money) which they have spent [as their Mahr][1] to them. And there will be no sin on you to marry them if you have paid their Mahr to them. Likewise hold not the disbelieving women as wives, and ask for (the return of) that which you have spent (as Mahr ) and let them (the disbelievers) ask back for that which they have spent. That is the Judgement of Allâh, He judges between you. And Allâh is All-Knowing, All-Wise.",
            "english_rwwad": "O you who believe, when the believing women come to you as migrants, test their sincerity, although Allah knows best about their faith. Then if you find them to be believers, do not send them back to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give the disbelievers whatever [dowries] they have spent. And there is no blame on you if you marry them, as long as you give them their dowries. Do not hold on to the marriage ties with the disbelieving women; ask for repayment of whatever [dowries] you have spent, and let the disbelievers ask for repayment of whatever [dowries] they have spent. This is the ruling of Allah that He judges between you, and Allah is All-Knowing, All-Wise."
        }
    },
    {
        "id": 5160,
        "chapter": 60,
        "verse": 11,
        "arabic_text": "وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَـَٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ",
        "phonetic": "60.11 Wa 'In Fātakum Shay'un Min 'Azwājikum 'Ilá Al-Kuffāri Fa`āqabtum Fa'ātū Al-Ladhīna Dhahabat 'Azwājuhum Mithla Mā 'Anfaqū Wa Attaqū Allāha Al-Ladhī 'Antum Bihi Mu'uminūna",
        "footnotes": {
            "english_saheeh": "[1678]- From the side of the disbelievers, i.e., war booty or a believing woman seeking refuge with the Muslims.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you have lost any of your wives to the disbelievers and you subsequently obtain [something],[1678] then give those whose wives have gone the equivalent of what they had spent. And fear Allāh, in whom you are believers.",
            "english_hilali_khan": "And if any of your wives have gone from you to the disbelievers, (as apostates and you asked them to return back your Mahr but they refused) - then you went out for a Ghazwah (military expedition) (against them and) gained booty; then pay from that booty to those whose wives have gone, the equivalent of what they had spent (on their Mahr ). And fear Allâh in Whom you believe.",
            "english_rwwad": "If any of your wives desert you and join the disbelievers [without returning your dowries], and later you take spoils from them, then give to those whose wives have deserted them the equivalent of what they had spent. And fear Allah, in Whom you believe."
        }
    },
    {
        "id": 5161,
        "chapter": 60,
        "verse": 12,
        "arabic_text": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡـٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ",
        "phonetic": "60.12 Yā 'Ayyuhā An-Nabīyu 'Idhā Jā'aka Al-Mu'uminātu Yubāyi`naka `Alá 'An Lā Yushrikna Billāhi Shay'āan Wa Lā Yasriqna Wa Lā Yaznīna Wa Lā Yaqtulna 'Awlādahunna Wa Lā Ya'tīna Bibuhtānin Yaftarīnahu Bayna 'Aydīhinna Wa 'Arjulihinna Wa Lā Ya`şīnaka Fī Ma`rūfin Fabāyi`hunna Wa Astaghfir Lahunna Allāha 'Inna Allāha Ghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "[1679]- This is an allusion to pregnancy and childbirth, i.e., to falsely attribute a child (whether adopted or born of adultery) to a woman's husband.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O Prophet, when the believing women come to you pledging to you that they will not associate anything with Allāh, nor will they steal, nor will they commit unlawful sexual intercourse, nor will they kill their children, nor will they bring forth a slander they have invented between their arms and legs,[1679] nor will they disobey you in what is right - then accept their pledge and ask forgiveness for them of Allāh. Indeed, Allāh is Forgiving and Merciful.",
            "english_hilali_khan": "O Prophet! When believing women come to you to give you the Bai‘ah (pledge), that they will not associate anything in worship with Allâh, that they will not steal, that they will not commit illegal sexual intercourse, that they will not kill their children, that they will not utter slander, intentionally forging falsehood (i.e. by making illegal children belonging to their husbands), and that they will not disobey you in Ma‘rûf (Islâmic Monotheism and all that which Islâm ordains), then accept their Bai‘ah (pledge), and ask Allâh to forgive them. Verily, Allâh is Oft-Forgiving, Most Merciful.",
            "english_rwwad": "O Prophet, when the believing women come to you, pledging to you that they will not associate anything with Allah, that they will not steal, that they will not commit fornication, that they will not kill their children, that they will not falsely attribute [illegitimate] children to their husbands between their arms and their legs, that they will not disobey you in what is right, then accept their pledge and ask Allah to forgive them. Indeed, Allah is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 5162,
        "chapter": 60,
        "verse": 13,
        "arabic_text": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ",
        "phonetic": "60.13 Yā 'Ayyuhā Al-Ladhīna 'Āmanū Lā Tatawallaw Qawmāan Ghađiba Allāhu `Alayhim Qad Ya'isū Mina Al-'Ākhirati Kamā Ya'isa Al-Kuffāru Min 'Aşĥābi Al-Qubūri",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O you who have believed, do not make allies of a people with whom Allāh has become angry. They have despaired of [reward in] the Hereafter just as the disbelievers have despaired of [meeting] the companions [i.e., inhabitants] of the graves.",
            "english_hilali_khan": "O you who believe! Take not as friends the people who incurred the Wrath of Allâh (i.e. the Jews). Surely, they have despaired of (receiving any good in) the Hereafter, just as the disbelievers have despaired of those (buried) in graves (that they will not be resurrected on the Day of Resurrection).",
            "english_rwwad": "O you who believe, do not take as allies a people whom Allah is displeased with. They have lost hope in the Hereafter, just as the disbelievers have lost hope in those who are in the graves."
        }
    }
]