[
    {
        "id": 954,
        "chapter": 7,
        "verse": 1,
        "arabic_text": "الٓمٓصٓ",
        "phonetic": "7.1 'Alif-Lām-Mīm-Şād",
        "footnotes": {
            "english_saheeh": "[363]- See footnote to 2:1.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Alif, Lām, Meem, Ṣād.[363]",
            "english_hilali_khan": "Alif-Lâm-Mîm-Sâd. [These letters are one of the miracles of the Qur’ân and none but Allâh (Alone) knows their meanings.]",
            "english_rwwad": "Alif Lām Mīm Sād."
        }
    },
    {
        "id": 955,
        "chapter": 7,
        "verse": 2,
        "arabic_text": "كِتَٰبٌ أُنزِلَ إِلَيۡكَ فَلَا يَكُن فِي صَدۡرِكَ حَرَجٞ مِّنۡهُ لِتُنذِرَ بِهِۦ وَذِكۡرَىٰ لِلۡمُؤۡمِنِينَ",
        "phonetic": "7.2 Kitābun 'Unzila 'Ilayka Falā Yakun Fī Şadrika Ĥarajun Minhu Litundhira Bihi Wa Dhikrá Lilmu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[This is] a Book revealed to you, [O Muḥammad] - so let there not be in your breast distress therefrom - that you may warn thereby and as a reminder to the believers.",
            "english_hilali_khan": "(This is the) Book (the Qur’ân) sent down unto you (O Muhammad صلى الله عليه وسلم), so let not your breast be narrow therefrom, that you warn thereby; and a reminder unto the believers.",
            "english_rwwad": "This is a Book that has been sent down to you [O Prophet], so do not let your heart be troubled by it; so that you may warn thereby and as a reminder to the believers."
        }
    },
    {
        "id": 956,
        "chapter": 7,
        "verse": 3,
        "arabic_text": "ٱتَّبِعُواْ مَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُمۡ وَلَا تَتَّبِعُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَۗ قَلِيلٗا مَّا تَذَكَّرُونَ",
        "phonetic": "7.3 Attabi`ū Mā 'Unzila 'Ilaykum Min Rabbikum Wa Lā Tattabi`ū Min Dūnihi 'Awliyā'a Qalīlāan Mā Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Follow, [O mankind], what has been revealed to you from your Lord and do not follow other than Him any allies. Little do you remember.",
            "english_hilali_khan": "[Say (O Muhammad صلى الله عليه وسلم) to these idolaters (pagan Arabs) of your folk:] Follow what has been sent down unto you from your Lord (the Qur’ân and Prophet Muhammad’s Sunnah), and follow not any Auliyâ’ (protectors and helpers who order you to associate partners in worship with Allâh), besides Him (Allâh). Little do you remember!",
            "english_rwwad": "Follow [O mankind] what has been sent down to you from your Lord, and do not follow any guardians besides Him. Little it is that you take heed!"
        }
    },
    {
        "id": 957,
        "chapter": 7,
        "verse": 4,
        "arabic_text": "وَكَم مِّن قَرۡيَةٍ أَهۡلَكۡنَٰهَا فَجَآءَهَا بَأۡسُنَا بَيَٰتًا أَوۡ هُمۡ قَآئِلُونَ",
        "phonetic": "7.4 Wa Kam Min Qaryatin 'Ahlaknāhā Fajā'ahā Ba'sunā Bayātāan 'Aw Hum Qā'ilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And how many cities have We destroyed, and Our punishment came to them at night or while they were sleeping at noon.",
            "english_hilali_khan": "And a great number of towns (their population) We destroyed (for their crimes). Our torment came upon them (suddenly) by night or while they were taking their midday nap.",
            "english_rwwad": "How many towns We have destroyed, and Our punishment came upon them at night or while they were taking midday rest."
        }
    },
    {
        "id": 958,
        "chapter": 7,
        "verse": 5,
        "arabic_text": "فَمَا كَانَ دَعۡوَىٰهُمۡ إِذۡ جَآءَهُم بَأۡسُنَآ إِلَّآ أَن قَالُوٓاْ إِنَّا كُنَّا ظَٰلِمِينَ",
        "phonetic": "7.5 Famā Kāna Da`wāhum 'Idh Jā'ahum Ba'sunā 'Illā 'An Qālū 'Innā Kunnā Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And their declaration when Our punishment came to them was only that they said, \"Indeed, we were wrongdoers!\"",
            "english_hilali_khan": "No cry did they utter when Our Torment came upon them but this: \"Verily, we were Zâlimûn (polytheists and wrong-doers)\".",
            "english_rwwad": "Their only cry, when Our punishment came upon them, was, “We were indeed wrongdoers.”"
        }
    },
    {
        "id": 959,
        "chapter": 7,
        "verse": 6,
        "arabic_text": "فَلَنَسۡـَٔلَنَّ ٱلَّذِينَ أُرۡسِلَ إِلَيۡهِمۡ وَلَنَسۡـَٔلَنَّ ٱلۡمُرۡسَلِينَ",
        "phonetic": "7.6 Falanas'alanna Al-Ladhīna 'Ursila 'Ilayhim Wa Lanas'alanna Al-Mursalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We will surely question those to whom [a message] was sent, and We will surely question the messengers.",
            "english_hilali_khan": "Then surely, We shall question those (people) to whom it (the Book) was sent and verily, We shall question the Messengers.",
            "english_rwwad": "So We will surely question those to whom the messengers were sent, and We will surely question the messengers themselves."
        }
    },
    {
        "id": 960,
        "chapter": 7,
        "verse": 7,
        "arabic_text": "فَلَنَقُصَّنَّ عَلَيۡهِم بِعِلۡمٖۖ وَمَا كُنَّا غَآئِبِينَ",
        "phonetic": "7.7 Falanaquşşanna `Alayhim Bi`ilmin Wa Mā Kunnā Ghā'ibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We will surely relate [their deeds] to them with knowledge, and We were not [at all] absent.",
            "english_hilali_khan": "Then surely, We shall narrate unto them (their whole story) with knowledge, and indeed We have not been absent.",
            "english_rwwad": "Then We will surely give them full account [of their deeds] on the basis of knowledge, for We were never absent."
        }
    },
    {
        "id": 961,
        "chapter": 7,
        "verse": 8,
        "arabic_text": "وَٱلۡوَزۡنُ يَوۡمَئِذٍ ٱلۡحَقُّۚ فَمَن ثَقُلَتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
        "phonetic": "7.8 Wa Al-Waznu Yawma'idhin Al-Ĥaqqu Faman Thaqulat Mawāzīnuhu Fa'ūlā'ika Humu Al-Mufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:8) The Statement of Allâh عز وجل:\n\"And We shall set up balances of justice on the Day of Resurrection.\" (V.21:47).\nThe deeds and the statement of Adam’s offspring will be weighed.\nNarrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, (There are) two words (expressions or sayings) which are dear to the Most Gracious (Allâh) and very easy for the tongue to say, but very heavy in the balance. They are: سبحان الله وبحمده - سبحان الله العظيم\nSubhân Allâhi-wa bihamdihi - Subhân Allâhil-‘Azîm’ \" (Sahih Al-Bukhârî, Vol. 9. hadîth No.652).\n‘Glorified be Allâh and praised be He’ - ‘Glorified be Allâh, the Most Great.’ (or I deem Allâh above all those unsuitable things ascribed to Him, and free Him from resembling anything whatsoever, and I glorify His Praises! I deem Allâh, the Most Great above all those unsuitable things ascribed to Him and free Him from resembling anything whatsoever).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the weighing [of deeds] that Day will be the truth. So those whose scales are heavy - it is they who will be the successful.",
            "english_hilali_khan": "And the weighing on that day (Day of Resurrection) will be the true (weighing)[1]. So as for those whose scale (of good deeds) will be heavy, they will be the successful (by entering Paradise).",
            "english_rwwad": "The weighing [of deeds] on that Day will be true and just. Those whose scales [of good deeds] are heavy, it is they who will be the successful."
        }
    },
    {
        "id": 962,
        "chapter": 7,
        "verse": 9,
        "arabic_text": "وَمَنۡ خَفَّتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُم بِمَا كَانُواْ بِـَٔايَٰتِنَا يَظۡلِمُونَ",
        "phonetic": "7.9 Wa Man Khaffat Mawāzīnuhu Fa'ūlā'ika Al-Ladhīna Khasirū 'Anfusahum Bimā Kānū Bi'āyātinā Yažlimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those whose scales are light - they are the ones who will lose themselves for what injustice they were doing toward Our verses.",
            "english_hilali_khan": "And as for those whose scale will be light, they are those who will lose their ownselves (by entering Hell) because they denied and rejected Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.).",
            "english_rwwad": "But those whose scales are light, it is they who have lost their own souls, because they wrongfully rejected Our verses."
        }
    },
    {
        "id": 963,
        "chapter": 7,
        "verse": 10,
        "arabic_text": "وَلَقَدۡ مَكَّنَّٰكُمۡ فِي ٱلۡأَرۡضِ وَجَعَلۡنَا لَكُمۡ فِيهَا مَعَٰيِشَۗ قَلِيلٗا مَّا تَشۡكُرُونَ",
        "phonetic": "7.10 Wa Laqad Makkannākum Fī Al-'Arđi Wa Ja`alnā Lakum Fīhā Ma`āyisha Qalīlāan Mā Tashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly established you upon the earth and made for you therein ways of livelihood. Little are you grateful.",
            "english_hilali_khan": "And surely, We gave you authority on the earth and appointed for you therein provisions (for your life). Little thanks do you give.",
            "english_rwwad": "We established you on earth and provided you with means of livelihood therein. Little do you give thanks."
        }
    },
    {
        "id": 964,
        "chapter": 7,
        "verse": 11,
        "arabic_text": "وَلَقَدۡ خَلَقۡنَٰكُمۡ ثُمَّ صَوَّرۡنَٰكُمۡ ثُمَّ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ لَمۡ يَكُن مِّنَ ٱلسَّٰجِدِينَ",
        "phonetic": "7.11 Wa Laqad Khalaqnākum Thumma Şawwarnākum Thumma Qulnā Lilmalā'ikati Asjudū Li'dama Fasajadū 'Illā 'Iblīsa Lam Yakun Mina As-Sājidīna",
        "footnotes": {
            "english_saheeh": "[364]- Satan.  See footnote to 2:34.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly created you, [O mankind], and given you [human] form. Then We said to the angels, \"Prostrate to Adam\"; so they prostrated, except for Iblees.[364] He was not of those who prostrated.",
            "english_hilali_khan": "And surely, We created you (your father Adam) and then gave you shape (the noble shape of a human being); then We told the angels, \"Prostrate yourselves to Adam\", and they prostrated themselves, except Iblîs (Satan), he refused to be of those who prostrated themselves.",
            "english_rwwad": "We surely created you, then shaped you, then We said to the angels, “Prostrate before Adam,” so they prostrated, except Iblīs [Satan], who was not one of those who prostrated."
        }
    },
    {
        "id": 965,
        "chapter": 7,
        "verse": 12,
        "arabic_text": "قَالَ مَا مَنَعَكَ أَلَّا تَسۡجُدَ إِذۡ أَمَرۡتُكَۖ قَالَ أَنَا۠ خَيۡرٞ مِّنۡهُ خَلَقۡتَنِي مِن نَّارٖ وَخَلَقۡتَهُۥ مِن طِينٖ",
        "phonetic": "7.12 Qāla Mā Mana`aka 'Allā Tasjuda 'Idh 'Amartuka Qāla 'Anā Khayrun Minhu Khalaqtanī Min Nārin Wa Khalaqtahu Min Ţīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"What prevented you from prostrating when I commanded you?\" [Satan] said, \"I am better than him. You created me from fire and created him from clay [i.e., earth].\"",
            "english_hilali_khan": "(Allâh) said: \"What prevented you (O Iblîs) that you did not prostrate yourself, when I commanded you?\" Iblîs said: \"I am better than him (Adam), You created me from fire, and him You created from clay.\"",
            "english_rwwad": "Allah said, “What prevented you from prostrating when I ordered you?” He said, “I am better than him; You created me from fire and created him from clay.”"
        }
    },
    {
        "id": 966,
        "chapter": 7,
        "verse": 13,
        "arabic_text": "قَالَ فَٱهۡبِطۡ مِنۡهَا فَمَا يَكُونُ لَكَ أَن تَتَكَبَّرَ فِيهَا فَٱخۡرُجۡ إِنَّكَ مِنَ ٱلصَّٰغِرِينَ",
        "phonetic": "7.13 Qāla Fāhbiţ Minhā Famā Yakūnu Laka 'An Tatakabbara Fīhā Fākhruj 'Innaka Mina Aş-Şāghirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"Descend from it [i.e., Paradise], for it is not for you to be arrogant therein. So get out; indeed, you are of the debased.\"",
            "english_hilali_khan": "(Allâh) said: \"(O Iblîs) get down from this (Paradise), it is not for you to be arrogant here. Get out, for you are of those humiliated and disgraced.\"",
            "english_rwwad": "Allah said, “Then get down from here! It is not for you to show arrogance here. Get out, for you are one of the disgraced.”"
        }
    },
    {
        "id": 967,
        "chapter": 7,
        "verse": 14,
        "arabic_text": "قَالَ أَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ",
        "phonetic": "7.14 Qāla 'Anžirnī 'Ilá Yawmi Yub`athūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Satan] said, \"Reprieve me until the Day they are resurrected.\"",
            "english_hilali_khan": "(Iblîs) said: \"Allow me respite till the Day they are raised up (i.e. the Day of Resurrection).\"",
            "english_rwwad": "He said, “Grant me respite until the Day they are resurrected.”"
        }
    },
    {
        "id": 968,
        "chapter": 7,
        "verse": 15,
        "arabic_text": "قَالَ إِنَّكَ مِنَ ٱلۡمُنظَرِينَ",
        "phonetic": "7.15 Qāla 'Innaka Mina Al-Munžarīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"Indeed, you are of those reprieved.\"",
            "english_hilali_khan": "(Allâh) said: \"You are of those respited.\"",
            "english_rwwad": "Allah said, “You are of those who are granted respite’’."
        }
    },
    {
        "id": 969,
        "chapter": 7,
        "verse": 16,
        "arabic_text": "قَالَ فَبِمَآ أَغۡوَيۡتَنِي لَأَقۡعُدَنَّ لَهُمۡ صِرَٰطَكَ ٱلۡمُسۡتَقِيمَ",
        "phonetic": "7.16 Qāla Fabimā 'Aghwaytanī La'aq`udanna Lahum Şirāţaka Al-Mustaqīma",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Satan] said, \"Because You have put me in error, I will surely sit in wait for them [i.e., mankind] on Your straight path.",
            "english_hilali_khan": "(Iblîs) said: \"Because You have sent me astray, surely I will sit in wait against them (human beings) on Your Straight Path.",
            "english_rwwad": "He said, “Since You have led me astray, I will certainly lie in wait for them on Your straight path."
        }
    },
    {
        "id": 970,
        "chapter": 7,
        "verse": 17,
        "arabic_text": "ثُمَّ لَأٓتِيَنَّهُم مِّنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ وَعَنۡ أَيۡمَٰنِهِمۡ وَعَن شَمَآئِلِهِمۡۖ وَلَا تَجِدُ أَكۡثَرَهُمۡ شَٰكِرِينَ",
        "phonetic": "7.17 Thumma La'ātiyannahum Min Bayni 'Aydīhim Wa Min Khalfihim Wa `An 'Aymānihim Wa `An Shamā'ilihim Wa Lā Tajidu 'Aktharahum Shākirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then I will come to them from before them and from behind them and on their right and on their left, and You will not find most of them grateful [to You].\"",
            "english_hilali_khan": "\"Then I will come to them from before them and behind them, from their right and from their left, and You will not find most of them as thankful ones (i.e. they will not be dutiful to You).\"",
            "english_rwwad": "Then I will come against them from their front and from their back, from their right and from their left, and You will not find most of them grateful.”"
        }
    },
    {
        "id": 971,
        "chapter": 7,
        "verse": 18,
        "arabic_text": "قَالَ ٱخۡرُجۡ مِنۡهَا مَذۡءُومٗا مَّدۡحُورٗاۖ لَّمَن تَبِعَكَ مِنۡهُمۡ لَأَمۡلَأَنَّ جَهَنَّمَ مِنكُمۡ أَجۡمَعِينَ",
        "phonetic": "7.18 Qāla Akhruj Minhā Madh'ūmāan Madĥūrāan Laman Tabi`aka Minhum La'amla'anna Jahannama Minkum 'Ajma`īna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"Depart from it [i.e., Paradise], reproached and expelled. Whoever follows you among them - I will surely fill Hell with you, all together.\"",
            "english_hilali_khan": "(Allâh) said (to Iblîs): \"Get out from this (Paradise), disgraced and expelled. Whoever of them (mankind) will follow you, then surely I will fill Hell with you all.\"",
            "english_rwwad": "Allah said, “Get out of here, disgraced and expelled! I will certainly fill Hell with you and those who follow you all together.”"
        }
    },
    {
        "id": 972,
        "chapter": 7,
        "verse": 19,
        "arabic_text": "وَيَٰٓـَٔادَمُ ٱسۡكُنۡ أَنتَ وَزَوۡجُكَ ٱلۡجَنَّةَ فَكُلَا مِنۡ حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ",
        "phonetic": "7.19 Wa Yā'ādamu Askun 'Anta Wa Zawjuka Al-Jannata Fakulā Min Ĥaythu Shi'tumā Wa Lā Taqrabā Hadhihi Ash-Shajarata Fatakūnā Mina Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And \"O Adam, dwell, you and your wife, in Paradise and eat from wherever you will but do not approach this tree, lest you be among the wrongdoers.\"",
            "english_hilali_khan": "\"And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the Zâlimûn (unjust and wrong-doers).\"",
            "english_rwwad": "“O Adam, dwell in Paradise, you and your wife, and eat from wherever you wish, but do not approach this tree, or else you will both be among the wrongdoers.”"
        }
    },
    {
        "id": 973,
        "chapter": 7,
        "verse": 20,
        "arabic_text": "فَوَسۡوَسَ لَهُمَا ٱلشَّيۡطَٰنُ لِيُبۡدِيَ لَهُمَا مَا وُۥرِيَ عَنۡهُمَا مِن سَوۡءَٰتِهِمَا وَقَالَ مَا نَهَىٰكُمَا رَبُّكُمَا عَنۡ هَٰذِهِ ٱلشَّجَرَةِ إِلَّآ أَن تَكُونَا مَلَكَيۡنِ أَوۡ تَكُونَا مِنَ ٱلۡخَٰلِدِينَ",
        "phonetic": "7.20 Fawaswasa Lahumā Ash-Shayţānu Liyubdiya Lahumā Mā Wūriya `Anhumā Min Saw'ātihimā Wa Qāla Mā Nahākumā Rabbukumā `An Hadhihi Ash-Shajarati 'Illā 'An Takūnā Malakayni 'Aw Takūnā Mina Al-Khālidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But Satan whispered to them to make apparent to them that which was concealed from them of their private parts. He said, \"Your Lord did not forbid you this tree except that you become angels or become of the immortal.\"",
            "english_hilali_khan": "Then Shaitân (Satan) whispered suggestions to them both in order to uncover that which was hidden from them of their private parts (before); he said: \"Your Lord did not forbid you this tree save that you should become angels or become of the immortals.\"",
            "english_rwwad": "Then Satan whispered to them in order to expose what was hidden from them of their private parts. He said, “Your Lord has only forbidden to you this tree to prevent you from becoming angels or immortals.”"
        }
    },
    {
        "id": 974,
        "chapter": 7,
        "verse": 21,
        "arabic_text": "وَقَاسَمَهُمَآ إِنِّي لَكُمَا لَمِنَ ٱلنَّٰصِحِينَ",
        "phonetic": "7.21 Wa Qāsamahumā 'Innī Lakumā Lamina An-Nāşiĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he swore [by Allāh] to them, \"Indeed, I am to you from among the sincere advisors.\"",
            "english_hilali_khan": "And he [Shaitân (Satan)] swore by Allâh to them both (saying): \"Verily, I am one of the sincere well-wishers for you both.\"",
            "english_rwwad": "And he swore to them, “I am indeed your sincere adviser.”"
        }
    },
    {
        "id": 975,
        "chapter": 7,
        "verse": 22,
        "arabic_text": "فَدَلَّىٰهُمَا بِغُرُورٖۚ فَلَمَّا ذَاقَا ٱلشَّجَرَةَ بَدَتۡ لَهُمَا سَوۡءَٰتُهُمَا وَطَفِقَا يَخۡصِفَانِ عَلَيۡهِمَا مِن وَرَقِ ٱلۡجَنَّةِۖ وَنَادَىٰهُمَا رَبُّهُمَآ أَلَمۡ أَنۡهَكُمَا عَن تِلۡكُمَا ٱلشَّجَرَةِ وَأَقُل لَّكُمَآ إِنَّ ٱلشَّيۡطَٰنَ لَكُمَا عَدُوّٞ مُّبِينٞ",
        "phonetic": "7.22 Fadallāhumā Bighurūrin Falammā Dhāqā Ash-Shajarata Badat Lahumā Saw'ātuhumā Wa Ţafiqā Yakhşifāni `Alayhimā Min Waraqi Al-Jannati Wa Nādāhumā Rabbuhumā 'Alam 'Anhakumā `An Tilkumā Ash-Shajarati Wa 'Aqul Lakumā 'Inna Ash-Shayţāna Lakumā `Adūwun Mubīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he made them fall, through deception. And when they tasted of the tree, their private parts became apparent to them, and they began to fasten together over themselves from the leaves of Paradise. And their Lord called to them, \"Did I not forbid you from that tree and tell you that Satan is to you a clear enemy?\"",
            "english_hilali_khan": "So he misled them with deception. Then when they tasted of the tree, that which was hidden from them of their shame (private parts) became manifest to them and they began to cover themselves with the leaves of Paradise (in order to cover their shame). And their Lord called out to them (saying): \"Did I not forbid you that tree and tell you: Verily, Shaitân (Satan) is an open enemy unto you?\"",
            "english_rwwad": "So he deluded them both with deception. When they tasted the tree, their private parts became visible to them, so they began to put together leaves of the Garden to cover themselves. Their Lord called them, “Did I not forbid you from that tree and tell you that Satan is your sworn enemy?”"
        }
    },
    {
        "id": 976,
        "chapter": 7,
        "verse": 23,
        "arabic_text": "قَالَا رَبَّنَا ظَلَمۡنَآ أَنفُسَنَا وَإِن لَّمۡ تَغۡفِرۡ لَنَا وَتَرۡحَمۡنَا لَنَكُونَنَّ مِنَ ٱلۡخَٰسِرِينَ",
        "phonetic": "7.23 Qālā Rabbanā Žalamnā 'Anfusanā Wa 'In Lam Taghfir Lanā Wa Tarĥamnā Lanakūnanna Mina Al-Khāsirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.\"",
            "english_hilali_khan": "They said: \"Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your Mercy, we shall certainly be of the losers.\"",
            "english_rwwad": "They said, “Our Lord, we have wronged ourselves; if You do not forgive us and have mercy upon us, we will surely be among the losers.”"
        }
    },
    {
        "id": 977,
        "chapter": 7,
        "verse": 24,
        "arabic_text": "قَالَ ٱهۡبِطُواْ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ وَلَكُمۡ فِي ٱلۡأَرۡضِ مُسۡتَقَرّٞ وَمَتَٰعٌ إِلَىٰ حِينٖ",
        "phonetic": "7.24 Qāla Ahbiţū Ba`đukum Liba`đin `Adūwun Wa Lakum Fī Al-'Arđi Mustaqarrun Wa Matā`un 'Ilá Ĥīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"Descend, being to one another enemies. And for you on the earth is a place of settlement and enjoyment [i.e., provision] for a time.\"",
            "english_hilali_khan": "(Allâh) said: \"Get down, one of you is an enemy to the other [i.e. Adam, Hawwâ’ (Eve), and Shaitân (Satan)]. On earth will be a dwelling-place for you and an enjoyment for a time.\"",
            "english_rwwad": "Allah said, “Get down as enemies to one another. You will find a dwelling place on earth and provision for an appointed time.”"
        }
    },
    {
        "id": 978,
        "chapter": 7,
        "verse": 25,
        "arabic_text": "قَالَ فِيهَا تَحۡيَوۡنَ وَفِيهَا تَمُوتُونَ وَمِنۡهَا تُخۡرَجُونَ",
        "phonetic": "7.25 Qāla Fīhā Taĥyawna Wa Fīhā Tamūtūna Wa Minhā Tukhrajūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Therein you will live, and therein you will die, and from it you will be brought forth.\"",
            "english_hilali_khan": "He said: \"Therein you shall live, and therein you shall die, and from it you shall be brought out (i.e. resurrected).\"",
            "english_rwwad": "He said, “There you will live, and there you will die, and from there you will be raised again.”"
        }
    },
    {
        "id": 979,
        "chapter": 7,
        "verse": 26,
        "arabic_text": "يَٰبَنِيٓ ءَادَمَ قَدۡ أَنزَلۡنَا عَلَيۡكُمۡ لِبَاسٗا يُوَٰرِي سَوۡءَٰتِكُمۡ وَرِيشٗاۖ وَلِبَاسُ ٱلتَّقۡوَىٰ ذَٰلِكَ خَيۡرٞۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِ لَعَلَّهُمۡ يَذَّكَّرُونَ",
        "phonetic": "7.26 Yā Banī 'Ādama Qad 'Anzalnā `Alaykum Libāsāan Yuwārī Saw''ātikum Wa Rīshāan Wa Libāsu At-Taqwá Dhālika Khayrun Dhālika Min 'Āyā Ti Allāhi La`allahum Yadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:26) It is said that the pagan Arabs in the Pre-Islâmic Period of Ignorance used to do Tawâf (going round) of the Ka‘bah in a naked state. So when Islâm became victorious and Makkah was conquered, the pagans and the polytheists were forbidden to enter Makkah, and none was allowed to do Tawâf of the Ka‘bah in a naked state.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O children of Adam, We have bestowed upon you clothing to conceal your private parts and as adornment. But the clothing of righteousness - that is best. That is from the signs of Allāh that perhaps they will remember.",
            "english_hilali_khan": "O Children of Adam! We have bestowed raiment upon you to cover yourselves (screen your private parts) and as an adornment; and the raiment of righteousness, that is better. Such are among the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allâh, that they may remember (i.e. leave falsehood and follow truth[1]).",
            "english_rwwad": "O children of Adam, We have given you garments that cover your private parts and as an adornment. However, the garment of piety is best. That is one of the signs of Allah, so that they may take heed."
        }
    },
    {
        "id": 980,
        "chapter": 7,
        "verse": 27,
        "arabic_text": "يَٰبَنِيٓ ءَادَمَ لَا يَفۡتِنَنَّكُمُ ٱلشَّيۡطَٰنُ كَمَآ أَخۡرَجَ أَبَوَيۡكُم مِّنَ ٱلۡجَنَّةِ يَنزِعُ عَنۡهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوۡءَٰتِهِمَآۚ إِنَّهُۥ يَرَىٰكُمۡ هُوَ وَقَبِيلُهُۥ مِنۡ حَيۡثُ لَا تَرَوۡنَهُمۡۗ إِنَّا جَعَلۡنَا ٱلشَّيَٰطِينَ أَوۡلِيَآءَ لِلَّذِينَ لَا يُؤۡمِنُونَ",
        "phonetic": "7.27 Yā Banī 'Ādama Lā Yaftinannakumu Ash-Shayţānu Kamā 'Akhraja 'Abawaykum Mina Al-Jannati Yanzi`u `Anhumā Libāsahumā Liyuriyahumā Saw''ātihimā 'Innahu Yarākum Huwa Wa Qabīluhu Min Ĥaythu Lā Tarawnahum 'Innā Ja`alnā Ash-Shayā Ţīna 'Awliyā 'A Lilladhīna Lā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "[365]- The garments of Paradise.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O children of Adam, let not Satan tempt you as he removed your parents from Paradise, stripping them of their clothing[365] to show them their private parts. Indeed, he sees you, he and his tribe, from where you do not see them. Indeed, We have made the devils allies to those who do not believe.",
            "english_hilali_khan": "O Children of Adam! Let not Shaitân (Satan) deceive you, as he got your parents [Adam and Hawwâ’ (Eve)] out of Paradise, stripping them of their raiments, to show them their private parts. Verily, he and Qabîluhu (his soldiers from the jinn or his tribe) see you from where you cannot see them. Verily, We made the Shayâtin (devils) Auliyâ’ (protectors and helpers) for those who believe not.",
            "english_rwwad": "O children of Adam, do not let Satan seduce you as he caused your parents to be expelled from the Garden, stripping them of their garments and making their private parts visible to them. He and his offspring see you from where you cannot see them. We have made the devils allies to those who disbelieve."
        }
    },
    {
        "id": 981,
        "chapter": 7,
        "verse": 28,
        "arabic_text": "وَإِذَا فَعَلُواْ فَٰحِشَةٗ قَالُواْ وَجَدۡنَا عَلَيۡهَآ ءَابَآءَنَا وَٱللَّهُ أَمَرَنَا بِهَاۗ قُلۡ إِنَّ ٱللَّهَ لَا يَأۡمُرُ بِٱلۡفَحۡشَآءِۖ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ",
        "phonetic": "7.28 Wa 'Idhā Fa`alū Fāĥishatan Qālū Wajadnā `Alayhā 'Ābā'anā Wa Allāhu 'Amaranā Bihā Qul 'Inna Allāha Lā Ya'muru Bil-Faĥshā'i 'Ataqūlūna `Alá Allāhi Mā Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they commit an immorality, they say, \"We found our fathers doing it, and Allāh has ordered us to do it.\" Say, \"Indeed, Allāh does not order immorality. Do you say about Allāh that which you do not know?\"",
            "english_hilali_khan": "And when they commit a Fâhishah (evil deed, going round the Ka‘bah in naked state, and every kind of unlawful sexual intercourse), they say: \"We found our fathers doing it, and Allâh has commanded it on us.\" Say: \"Nay, Allâh never commands Fâhishah. Do you say of Allâh what you know not?\"",
            "english_rwwad": "When they commit a shameful act, they say, “We found our forefathers doing it, and Allah has enjoined it upon us.” Say, “Allah never enjoins shameful acts. Do you say about Allah something of which you have no knowledge?”"
        }
    },
    {
        "id": 982,
        "chapter": 7,
        "verse": 29,
        "arabic_text": "قُلۡ أَمَرَ رَبِّي بِٱلۡقِسۡطِۖ وَأَقِيمُواْ وُجُوهَكُمۡ عِندَ كُلِّ مَسۡجِدٖ وَٱدۡعُوهُ مُخۡلِصِينَ لَهُ ٱلدِّينَۚ كَمَا بَدَأَكُمۡ تَعُودُونَ",
        "phonetic": "7.29 Qul 'Amara Rabbī Bil-Qisţi Wa 'Aqīmū Wujūhakum `Inda Kulli Masjidin Wa Ad`ūhu Mukhlişīna Lahu Ad-Dīna Kamā Bada'akum Ta`ūdūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"My Lord has ordered justice and that you direct yourselves [to the Qiblah] at every place [or time] of prostration, and invoke Him, sincere to Him in religion.\" Just as He originated you, you will return [to life] -",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): My Lord has commanded justice and (said) that you should face Him only (i.e. worship none but Allâh and face the Qiblah, i.e. the Ka‘bah at Makkah during prayers) in every place of worship, in prayers (and not to face other false deities and idols), and invoke Him only making your religion sincere to Him (by not joining in worship any partner with Him and with the intention that you are doing your deeds for Allâh’s sake only). As He brought you (into being) in the beginning, so shall you be brought into being [on the Day of Resurrection in two groups, one as a blessed one (believers), and the other as a wretched one (disbelievers)].",
            "english_rwwad": "Say [O Prophet], “My Lord has enjoined doing what is right; direct your faces [to Him alone] wherever you pray; call upon Him with sincere devotion to Him. Just as He created you first, so you will be brought back to life.”"
        }
    },
    {
        "id": 983,
        "chapter": 7,
        "verse": 30,
        "arabic_text": "فَرِيقًا هَدَىٰ وَفَرِيقًا حَقَّ عَلَيۡهِمُ ٱلضَّلَٰلَةُۚ إِنَّهُمُ ٱتَّخَذُواْ ٱلشَّيَٰطِينَ أَوۡلِيَآءَ مِن دُونِ ٱللَّهِ وَيَحۡسَبُونَ أَنَّهُم مُّهۡتَدُونَ",
        "phonetic": "7.30 Farīqāan Hadá Wa Farīqāan Ĥaqqa `Alayhimu Ađ-Đalālatu 'Innahumu Attakhadhū Ash-Shayāţīna 'Awliyā'a Min Dūni Allāhi Wa Yaĥsabūna 'Annahum Muhtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "A group [of you] He guided, and a group deserved [to be in] error. Indeed, they [i.e., the latter] had taken the devils as allies instead of Allāh while they thought that they were guided.",
            "english_hilali_khan": "A group He has guided, and a group deserved to be in error; (because) surely they took the Shayâtîn (devils) as Auliyâ’ (protectors and helpers) instead of Allâh, and think that they are guided.",
            "english_rwwad": "A group He has guided, and another group deserved to go stray. They have taken devils as their guardians instead of Allah, thinking that they are guided."
        }
    },
    {
        "id": 984,
        "chapter": 7,
        "verse": 31,
        "arabic_text": "۞ يَٰبَنِيٓ ءَادَمَ خُذُواْ زِينَتَكُمۡ عِندَ كُلِّ مَسۡجِدٖ وَكُلُواْ وَٱشۡرَبُواْ وَلَا تُسۡرِفُوٓاْۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡرِفِينَ",
        "phonetic": "7.31 Yā Banī 'Ādama Khudhū Zīnatakum `Inda Kulli Masjidin Wa Kulū Wa Ashrabū Wa Lā Tusrifū 'Innahu Lā Yuĥibbu Al-Musrifīna",
        "footnotes": {
            "english_saheeh": "[366]- Literally, \"place of prostration,\" meaning any place that a Muslim prays upon the earth.  The term may also refer specifically to a mosque.",
            "english_hilali_khan": "(V.7:31) It is obligatory to wear the clothes while praying. And the Statement of Allâh عز وجل: \"Take your adornment [(by wearing your clean clothes) covering completely the ‘Aurah (covering of one’s ‘Aurah means: while praying, a male must cover himself with clothes from the umbilicus of his abdomen up to his knees, and it is better that both his shoulders should be covered. And a female must cover all her body and feet except face, and it is better that both her hands are also covered)], while praying and going round (the Tawâf of) the Ka‘bah.\nIn how many (what sort of) clothes a woman should pray? ‘Ikrimah said, \"If she can cover all her body with one garment, it is sufficient.\"\nIt is agreed by the majority of the religious scholars that a woman while praying should cover herself completely except her face, and it is better that she should cover her hands with gloves or cloth. but her feet must be covered either with a long dress or she must wear socks to cover her feet. This verdict is based on the Prophet’s statement (Abu Dâwûd).\nNarrated ‘Âishah رضي الله عنها: Allâh’s Messenger صلى الله عليه وسلم used to offer the Fajr prayer and some believing women covered with their veiling sheets used to attend the Fajr prayer with him, and then they would return to their homes unrecognized. (Sahih Al-Bukhâri, Vol.1, hadîth No.368).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O children of Adam, take your adornment [i.e., wear your clothing] at every masjid,[366] and eat and drink, but be not excessive. Indeed, He likes not those who commit excess.",
            "english_hilali_khan": "O Children of Adam! Take your adornment (by wearing your clean clothes), while praying[1] and going round (the Tawâf of) the Ka‘bah, and eat and drink but waste not by extravagance, certainly He (Allâh) likes not Al-Musrifûn (those who waste by extravagance).",
            "english_rwwad": "O children of Adam, dress well for every prayer. Eat and drink, but do not waste, for He does not like the wasteful."
        }
    },
    {
        "id": 985,
        "chapter": 7,
        "verse": 32,
        "arabic_text": "قُلۡ مَنۡ حَرَّمَ زِينَةَ ٱللَّهِ ٱلَّتِيٓ أَخۡرَجَ لِعِبَادِهِۦ وَٱلطَّيِّبَٰتِ مِنَ ٱلرِّزۡقِۚ قُلۡ هِيَ لِلَّذِينَ ءَامَنُواْ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا خَالِصَةٗ يَوۡمَ ٱلۡقِيَٰمَةِۗ كَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ",
        "phonetic": "7.32 Qul Man Ĥarrama Zīnata Allāhi Allatī 'Akhraja Li`ibādihi Wa Aţ-Ţayyibāti Mina Ar-Rizqi Qul Hiya Lilladhīna 'Āmanū Fī Al-Ĥayāati Ad-Dunyā Khālişatan Yawma Al-Qiyāmati Kadhālika Nufaşşilu Al-'Āyāti Liqawmin Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Who has forbidden the adornment of [i.e., from] Allāh which He has produced for His servants and the good [lawful] things of provision?\" Say, \"They are for those who believed during the life of this world, exclusively [for them] on the Day of Resurrection.\" Thus do We detail the verses for a people who know.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"Who has forbidden the adornment with clothes given by Allâh, which He has produced for His slaves, and At-Taiyyibât [all kinds of Halâl (lawful) things] of food?\" Say: \"They are, in the life of this world, for those who believe, (and) exclusively for them (believers) on the Day of Resurrection (the disbelievers will not share them).\" Thus We explain the Ayât (Islâmic laws) in detail for people who have knowledge.",
            "english_rwwad": "Say, “Who has forbidden the adornments and lawful provisions that Allah has brought forth for His slaves?” Say, “They are for the believers in the life of this world, and they will be exclusively for them on the Day of Resurrection. This is how We make the verses clear for people who have knowledge.”"
        }
    },
    {
        "id": 986,
        "chapter": 7,
        "verse": 33,
        "arabic_text": "قُلۡ إِنَّمَا حَرَّمَ رَبِّيَ ٱلۡفَوَٰحِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَ وَٱلۡإِثۡمَ وَٱلۡبَغۡيَ بِغَيۡرِ ٱلۡحَقِّ وَأَن تُشۡرِكُواْ بِٱللَّهِ مَا لَمۡ يُنَزِّلۡ بِهِۦ سُلۡطَٰنٗا وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ",
        "phonetic": "7.33 Qul 'Innamā Ĥarrama Rabbiya Al-Fawāĥisha Mā Žahara Minhā Wa Mā Baţana Wa Al-'Ithma Wa Al-Baghya Bighayri Al-Ĥaqqi Wa 'An Tushrikū Billāhi Mā Lam Yunazzil Bihi Sulţānāan Wa 'An Taqūlū `Alá Allāhi Mā Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[367]- Any unlawful deed.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"My Lord has only forbidden immoralities - what is apparent of them and what is concealed - and sin,[367] and oppression without right, and that you associate with Allāh that for which He has not sent down authority, and that you say about Allāh that which you do not know.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"(But) the things that my Lord has indeed forbidden are Al-Fawâhish (great evil sins and every kind of unlawful sexual intercourse) whether committed openly or secretly, sins (of all kinds), unrighteous oppression, joining partners (in worship) with Allâh for which He has given no authority, and saying things about Allâh of which you have no knowledge.\"",
            "english_rwwad": "Say, “My Lord has forbidden shameful acts done openly or in secret, sinfulness, unjustified aggression, associating partners with Allah for which He has not sent down any authority, and saying about Allah that of which you have no knowledge.”"
        }
    },
    {
        "id": 987,
        "chapter": 7,
        "verse": 34,
        "arabic_text": "وَلِكُلِّ أُمَّةٍ أَجَلٞۖ فَإِذَا جَآءَ أَجَلُهُمۡ لَا يَسۡتَأۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ",
        "phonetic": "7.34 Wa Likulli 'Ummatin 'Ajalun Fa'idhā Jā'a 'Ajaluhum Lā Yasta'khirūna Sā`atan Wa Lā Yastaqdimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And for every nation is a [specified] term. So when their time has come, they will not remain behind an hour, nor will they precede [it].",
            "english_hilali_khan": "And every nation has its appointed term; when their term comes, neither can they delay it nor can they advance it an hour (or a moment).",
            "english_rwwad": "Each nation has its appointed time. When their appointed time comes, they cannot delay it for a moment or bring it forward."
        }
    },
    {
        "id": 988,
        "chapter": 7,
        "verse": 35,
        "arabic_text": "يَٰبَنِيٓ ءَادَمَ إِمَّا يَأۡتِيَنَّكُمۡ رُسُلٞ مِّنكُمۡ يَقُصُّونَ عَلَيۡكُمۡ ءَايَٰتِي فَمَنِ ٱتَّقَىٰ وَأَصۡلَحَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ",
        "phonetic": "7.35 Yā Banī 'Ādama 'Immā Ya'tiyannakum Rusulun Minkum Yaquşşūna `Alaykum 'Āyā Tī Famani Attaqá Wa 'Aşlaĥa Falā Khawfun `Alayhim Wa Lā Hum Yaĥzanūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "O children of Adam, if there come to you messengers from among you relating to you My verses [i.e., scriptures and laws], then whoever fears Allāh and reforms - there will be no fear concerning them, nor will they grieve.",
            "english_hilali_khan": "O Children of Adam! If there come to you Messengers from amongst you, reciting to you My Verses, then whosoever becomes pious and righteous, on them shall be no fear nor shall they grieve.",
            "english_rwwad": "O children of Adam, when there come to you messengers from among you, reciting My verses to you – then whoever fears Allah and mends his ways, they will have no fear, nor will they grieve."
        }
    },
    {
        "id": 989,
        "chapter": 7,
        "verse": 36,
        "arabic_text": "وَٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا وَٱسۡتَكۡبَرُواْ عَنۡهَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ",
        "phonetic": "7.36 Wa Al-Ladhīna Kadhabū Bi'āyātinā Wa Astakbarū `Anhā 'Ūlā'ika 'Aşĥābu An-Nāri Hum Fīhā Khālidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But the ones who deny Our verses and are arrogant toward them - those are the companions of the Fire; they will abide therein eternally.",
            "english_hilali_khan": "But those who reject Our Ayât (proofs, evidence, verses, lessons, signs, revelations) and treat them with arrogance, they are the dwellers of the (Hell) Fire, they will abide therein forever.",
            "english_rwwad": "But those who reject Our verses and show arrogance towards them, they are the people of the Fire, they will abide therein forever."
        }
    },
    {
        "id": 990,
        "chapter": 7,
        "verse": 37,
        "arabic_text": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔايَٰتِهِۦٓۚ أُوْلَٰٓئِكَ يَنَالُهُمۡ نَصِيبُهُم مِّنَ ٱلۡكِتَٰبِۖ حَتَّىٰٓ إِذَا جَآءَتۡهُمۡ رُسُلُنَا يَتَوَفَّوۡنَهُمۡ قَالُوٓاْ أَيۡنَ مَا كُنتُمۡ تَدۡعُونَ مِن دُونِ ٱللَّهِۖ قَالُواْ ضَلُّواْ عَنَّا وَشَهِدُواْ عَلَىٰٓ أَنفُسِهِمۡ أَنَّهُمۡ كَانُواْ كَٰفِرِينَ",
        "phonetic": "7.37 Faman 'Ažlamu Mimmani Aftará `Alá Allāhi Kadhibāan 'Aw Kadhaba Bi'āyātihi 'Ūlā'ika Yanāluhum Naşībuhum Mina Al-Kitābi Ĥattá 'Idhā Jā'at/hum Rusulunā Yatawaffawnahum Qālū 'Ayna Mā Kuntum Tad`ūna Min Dūni Allāhi Qālū Đallū `Annā Wa Shahidū `Alá 'Anfusihim 'Annahum Kānū Kāfirīna",
        "footnotes": {
            "english_saheeh": "[368]- What is decreed for them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And who is more unjust than one who invents about Allāh a lie or denies His verses? Those will attain their portion of the decree[368] until, when Our messengers [i.e., angels] come to them to take them in death, they will say, \"Where are those you used to invoke besides Allāh?\" They will say, \"They have departed from us,\" and will bear witness against themselves that they were disbelievers.",
            "english_hilali_khan": "Who is more unjust than one who invents a lie against Allâh or rejects His Ayât (proofs, evidence, verses, lessons, signs, revelations)? For such their appointed portion (good things of this worldly life and their period of stay therein) will reach them from the Book (of Decrees) until when Our Messengers (the angel of death and his assistants) come to them to take their souls, they (the angels) will say: \"Where are those whom you used to invoke and worship besides Allâh,\" they will reply, \"They have vanished and deserted us.\" And they will bear witness against themselves, that they were disbelievers.",
            "english_rwwad": "Who does greater wrong than the one who fabricates lies against Allah or rejects His verses? They will receive the share that is destined for them, until when Our angel-messengers come to take their souls, saying, “Where are those whom you used to invoke besides Allah?” They will say, “They are lost from us,” and they will testify against themselves that they were disbelievers."
        }
    },
    {
        "id": 991,
        "chapter": 7,
        "verse": 38,
        "arabic_text": "قَالَ ٱدۡخُلُواْ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِكُم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِ فِي ٱلنَّارِۖ كُلَّمَا دَخَلَتۡ أُمَّةٞ لَّعَنَتۡ أُخۡتَهَاۖ حَتَّىٰٓ إِذَا ٱدَّارَكُواْ فِيهَا جَمِيعٗا قَالَتۡ أُخۡرَىٰهُمۡ لِأُولَىٰهُمۡ رَبَّنَا هَٰٓؤُلَآءِ أَضَلُّونَا فَـَٔاتِهِمۡ عَذَابٗا ضِعۡفٗا مِّنَ ٱلنَّارِۖ قَالَ لِكُلّٖ ضِعۡفٞ وَلَٰكِن لَّا تَعۡلَمُونَ",
        "phonetic": "7.38 Qāla Adkhulū Fī 'Umamin Qad Khalat Min Qablikum Mina Al-Jinni Wa Al-'Insi Fī An-Nāri Kullamā Dakhalat 'Ummatun La`anat 'Ukhtahā Ĥattá 'Idhā Addārakū Fīhā Jamī`āan Qālat 'Ukhrāhum Li'wlāhum Rabbanā Hā'uulā' 'Ađallūnā Fa'ātihim `Adhābāan Đi`fāan Mina An-Nāri Qāla Likullin Đi`fun Wa Lakin Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[369]- The nation preceding it.\n[370]- The followers of evil leaders.\n[371]- Their leaders.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] will say, \"Enter among nations which had passed on before you of jinn and mankind into the Fire.\" Every time a nation enters, it will curse its sister[369] until, when they have all overtaken one another therein, the last of them[370] will say about the first of them,[371] \"Our Lord, these had misled us, so give them a double punishment of the Fire.\" He will say, \"For each is double, but you do not know.\"",
            "english_hilali_khan": "(Allâh) will say: \"Enter you in the company of nations who passed away before you, of men and jinn, into the Fire.\" Every time a new nation enters, it curses its sister nation (that went before) until they will be gathered all together in the Fire. The last of them will say to the first of them: \"Our Lord! These misled us, so give them a double torment of the Fire.\" He will say: \"For each one there is double (torment), but you know not.\"",
            "english_rwwad": "Allah will say, “Enter the Fire along with nations of jinn and humans who have passed on before you.” Every time a nation enters, it will curse the preceding one until they are all gathered inside, the followers will say about their leaders, “Our Lord, they have led us astray, so give them a double punishment of the Fire.” He will say, “Each will have a double punishment, but you do not know.”"
        }
    },
    {
        "id": 992,
        "chapter": 7,
        "verse": 39,
        "arabic_text": "وَقَالَتۡ أُولَىٰهُمۡ لِأُخۡرَىٰهُمۡ فَمَا كَانَ لَكُمۡ عَلَيۡنَا مِن فَضۡلٖ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡسِبُونَ",
        "phonetic": "7.39 Wa Qālat 'Ūlāhum Li'khrāhum Famā Kāna Lakum `Alaynā Min Fađlin Fadhūqū Al-`Adhāba Bimā Kuntum Taksibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the first of them will say to the last of them, \"Then you had not any favor over us, so taste the punishment for what you used to earn.\"",
            "english_hilali_khan": "The first of them will say to the last of them: \"You were not better than us, so taste the torment for what you used to earn.\"",
            "english_rwwad": "The leaders will say to their followers, “You were no better than us, so taste the punishment for what you used to do.”"
        }
    },
    {
        "id": 993,
        "chapter": 7,
        "verse": 40,
        "arabic_text": "إِنَّ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا وَٱسۡتَكۡبَرُواْ عَنۡهَا لَا تُفَتَّحُ لَهُمۡ أَبۡوَٰبُ ٱلسَّمَآءِ وَلَا يَدۡخُلُونَ ٱلۡجَنَّةَ حَتَّىٰ يَلِجَ ٱلۡجَمَلُ فِي سَمِّ ٱلۡخِيَاطِۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُجۡرِمِينَ",
        "phonetic": "7.40 'Inna Al-Ladhīna Kadhabū Bi'āyātinā Wa Astakbarū `Anhā Lā Tufattaĥu Lahum 'Abwābu As-Samā'i Wa Lā Yadkhulūna Al-Jannata Ĥattá Yalija Al-Jamalu Fī Sammi Al-Khiyāţi Wa Kadhalika Najzī Al-Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who deny Our verses and are arrogant toward them - the gates of Heaven will not be opened for them, nor will they enter Paradise until a camel enters into the eye of a needle [i.e., never]. And thus do We recompense the criminals.",
            "english_hilali_khan": "Verily, those who belie Our Ayât (proofs, evidence, verses, lessons, signs, revelations) and treat them with arrogance, for them the gates of heaven will not be opened, and they will not enter Paradise until the camel goes through the eye of the needle (which is impossible). Thus do We recompense the Mujrimûn (criminals, polytheists and sinners).",
            "english_rwwad": "Those who reject Our verses and show arrogance towards them, the gates of heaven will not be opened for them, nor will they enter Paradise until a camel can pass through the eye of a needle. This is how We recompense the wicked."
        }
    },
    {
        "id": 994,
        "chapter": 7,
        "verse": 41,
        "arabic_text": "لَهُم مِّن جَهَنَّمَ مِهَادٞ وَمِن فَوۡقِهِمۡ غَوَاشٖۚ وَكَذَٰلِكَ نَجۡزِي ٱلظَّٰلِمِينَ",
        "phonetic": "7.41 Lahum Min Jahannama Mihādun Wa Min Fawqihim Ghawāshin Wa Kadhalika Najzī Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They will have from Hell a bed and over them coverings [of fire]. And thus do We recompense the wrongdoers.",
            "english_hilali_khan": "Theirs will be a bed of Hell (Fire), and over them coverings (of Hell-fire). Thus do We recompense the Zâlimûn (polytheists and wrong-doers).",
            "english_rwwad": "Hell will be their resting place and above them will be coverings [of fire]. This is how We recompense the wrongdoers."
        }
    },
    {
        "id": 995,
        "chapter": 7,
        "verse": 42,
        "arabic_text": "وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَا نُكَلِّفُ نَفۡسًا إِلَّا وُسۡعَهَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِۖ هُمۡ فِيهَا خَٰلِدُونَ",
        "phonetic": "7.42 Wa Al-Ladhīna 'Āmanū Wa `Amilū Aş-Şāliĥāti Lā Nukallifu Nafsāan 'Illā Wus`ahā 'Ūlā'ika 'Aşĥābu Al-Jannati Hum Fīhā Khālidūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who believed and did righteous deeds - We charge no soul except [within] its capacity. Those are the companions of Paradise; they will abide therein eternally.",
            "english_hilali_khan": "But those who believed (in the Oneness of Allâh - Islâmic Monotheism), and worked righteousness - We tax not any person beyond his scope - such are the dwellers of Paradise. They will abide therein.",
            "english_rwwad": "As for those who believe and do righteous deeds – We do not burden a soul more than what it can bear – they are the people of Paradise, they will abide therein forever."
        }
    },
    {
        "id": 996,
        "chapter": 7,
        "verse": 43,
        "arabic_text": "وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلّٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُۖ وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي هَدَىٰنَا لِهَٰذَا وَمَا كُنَّا لِنَهۡتَدِيَ لَوۡلَآ أَنۡ هَدَىٰنَا ٱللَّهُۖ لَقَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِٱلۡحَقِّۖ وَنُودُوٓاْ أَن تِلۡكُمُ ٱلۡجَنَّةُ أُورِثۡتُمُوهَا بِمَا كُنتُمۡ تَعۡمَلُونَ",
        "phonetic": "7.43 Wa Naza`nā Mā Fī Şudūrihim Min Ghillin Tajrī Min Taĥtihimu Al-'Anhāru Wa Qālū Al-Ĥamdu Lillāhi Al-Ladhī Hadānā Lihadhā Wa Mā Kunnā Linahtadiya Lawlā 'An Hadānā Allāhu Laqad Jā'at Rusulu Rabbinā Bil-Ĥaqqi Wa Nūdū 'An Tilkumu Al-Jannatu 'Ūrithtumūhā Bimā Kuntum Ta`malūna",
        "footnotes": {
            "english_saheeh": "[372]- i.e., ill will or sense of injury for what was inflicted upon them during worldly life.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We will have removed whatever is within their breasts of resentment,[372] [while] flowing beneath them are rivers. And they will say, \"Praise to Allāh, who has guided us to this; and we would never have been guided if Allāh had not guided us. Certainly the messengers of our Lord had come with the truth.\" And they will be called, \"This is Paradise, which you have been made to inherit for what you used to do.\"",
            "english_hilali_khan": "And We shall remove from their breasts any (mutual) hatred or sense of injury (which they had, if at all, in the life of this world); rivers flowing under them, and they will say: \"All the praises and thanks be to Allâh, Who has guided us to this, and never could we have found guidance, were it not that Allâh had guided us! Indeed, the Messengers of our Lord did come with the truth.\" And it will be cried out to them: \"This is the Paradise which you have inherited for what you used to do.\"",
            "english_rwwad": "We will remove all ill feelings from their hearts and rivers will flow beneath them. They will say, “All praise be to Allah Who has guided us to this, for We would not have been guided to this if Allah had not guided us. The messengers of our Lord came with the truth.” They will be called, “This is Paradise that you are made to inherit for what you used to do.”"
        }
    },
    {
        "id": 997,
        "chapter": 7,
        "verse": 44,
        "arabic_text": "وَنَادَىٰٓ أَصۡحَٰبُ ٱلۡجَنَّةِ أَصۡحَٰبَ ٱلنَّارِ أَن قَدۡ وَجَدۡنَا مَا وَعَدَنَا رَبُّنَا حَقّٗا فَهَلۡ وَجَدتُّم مَّا وَعَدَ رَبُّكُمۡ حَقّٗاۖ قَالُواْ نَعَمۡۚ فَأَذَّنَ مُؤَذِّنُۢ بَيۡنَهُمۡ أَن لَّعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ",
        "phonetic": "7.44 Wa Nādá 'Aşĥābu Al-Jannati 'Aşĥāba An-Nāri 'An Qad Wajadnā Mā Wa`adanā Rabbunā Ĥaqqāan Fahal Wajadtum Mā Wa`ada Rabbukum Ĥaqqāan Qālū Na`am Fa'adhana Mu'uadhinun Baynahum 'An La`natu Allāhi `Alá Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the companions of Paradise will call out to the companions of the Fire, \"We have already found what our Lord promised us to be true. Have you found what your Lord promised to be true?\" They will say, \"Yes.\" Then an announcer will announce among them, \"The curse of Allāh shall be upon the wrongdoers",
            "english_hilali_khan": "And the dwellers of Paradise will call out to the dwellers of the Fire (saying): \"We have indeed found true what our Lord had promised us; have you also found true, what your Lord promised (warnings)?\" They shall say: \"Yes.\" Then a crier will proclaim between them: \"The Curse of Allâh is on the Zâlimûn (polytheists and wrong-doers).\"",
            "english_rwwad": "The people of Paradise will call out to the people of Hell, “We have surely found our Lord’s promise to be true. Have you also found your Lord’s promise to be true?” They will say, “Yes.” Then a caller will announce among them, “May Allah’s curse be upon the wrongdoers,"
        }
    },
    {
        "id": 998,
        "chapter": 7,
        "verse": 45,
        "arabic_text": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ كَٰفِرُونَ",
        "phonetic": "7.45 Al-Ladhīna Yaşuddūna `An Sabīli Allāhi Wa Yabghūnahā `Iwajāan Wa Hum Bil-'Ākhirati Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who averted [people] from the way of Allāh and sought to make it [seem] deviant while they were, concerning the Hereafter, disbelievers.\"",
            "english_hilali_khan": "Those who hindered (men) from the Path of Allâh, and would seek to make it crooked, and they were disbelievers in the Hereafter.",
            "english_rwwad": "those who prevent [people] from the way of Allah, seeking to make it crooked, and who disbelieve in the Hereafter.”"
        }
    },
    {
        "id": 999,
        "chapter": 7,
        "verse": 46,
        "arabic_text": "وَبَيۡنَهُمَا حِجَابٞۚ وَعَلَى ٱلۡأَعۡرَافِ رِجَالٞ يَعۡرِفُونَ كُلَّۢا بِسِيمَىٰهُمۡۚ وَنَادَوۡاْ أَصۡحَٰبَ ٱلۡجَنَّةِ أَن سَلَٰمٌ عَلَيۡكُمۡۚ لَمۡ يَدۡخُلُوهَا وَهُمۡ يَطۡمَعُونَ",
        "phonetic": "7.46 Wa Baynahumā Ĥijābun Wa `Alá Al-'A`rāfi Rijālun Ya`rifūna Kullāan Bisīmāhum Wa Nādaw 'Aşĥāba Al-Jannati 'An Salāmun `Alaykum Lam Yadkhulūhā Wa Hum Yaţma`ūna",
        "footnotes": {
            "english_saheeh": "[373]- Those whose scales are balanced between good and evil deeds.\n[374]- Both the inhabitants of Paradise and those of Hell.",
            "english_hilali_khan": "(V.7:46)\nAl-A‘râf It is said that it is a wall between Paradise and Hell and it has on it elevated places. [Please see Tafsir Al-Qurtubi].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And between them will be a partition [i.e., wall], and on [its] elevations are men[373] who recognize all[374] by their mark. And they call out to the companions of Paradise, \"Peace be upon you.\" They have not [yet] entered it, but they long intensely.",
            "english_hilali_khan": "And between them will be a (barrier) screen and on Al-A‘râf [1] (a wall with elevated places) will be men (whose good and evil deeds would be equal in scale), who would recognise all (of the Paradise and Hell people), by their marks (the dwellers of Paradise by their white faces and the dwellers of Hell by their black faces), they will call out to the dwellers of Paradise, \"Salâmun ‘Alaikum\" (Peace be on you), and at that time they (men on Al-A‘râf) will not yet have entered it (Paradise), but they will hope to enter (it) with certainty.",
            "english_rwwad": "Between them there will be a barrier, and on its Heights there will be men who will recognize each group by their marks. They will call out to the people of Paradise, “Peace be on you.” They will not have entered it, yet they will eagerly hope [to enter]."
        }
    },
    {
        "id": 1000,
        "chapter": 7,
        "verse": 47,
        "arabic_text": "۞ وَإِذَا صُرِفَتۡ أَبۡصَٰرُهُمۡ تِلۡقَآءَ أَصۡحَٰبِ ٱلنَّارِ قَالُواْ رَبَّنَا لَا تَجۡعَلۡنَا مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
        "phonetic": "7.47 Wa 'Idhā Şurifat 'Abşāruhum Tilqā'a 'Aşĥābi An-Nāri Qālū Rabbanā Lā Taj`alnā Ma`a Al-Qawmi Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when their eyes are turned toward the companions of the Fire, they say, \"Our Lord, do not place us with the wrongdoing people.\"",
            "english_hilali_khan": "And when their eyes will be turned towards the dwellers of the Fire, they will say: \"Our Lord! Place us not with the people who are Zâlimûn (polytheists and wrong-doers).\"",
            "english_rwwad": "And when their eyes are turned towards the people of Hell, they will say, “Our Lord, do not join us with the wrongdoing people.”"
        }
    },
    {
        "id": 1001,
        "chapter": 7,
        "verse": 48,
        "arabic_text": "وَنَادَىٰٓ أَصۡحَٰبُ ٱلۡأَعۡرَافِ رِجَالٗا يَعۡرِفُونَهُم بِسِيمَىٰهُمۡ قَالُواْ مَآ أَغۡنَىٰ عَنكُمۡ جَمۡعُكُمۡ وَمَا كُنتُمۡ تَسۡتَكۡبِرُونَ",
        "phonetic": "7.48 Wa Nādá 'Aşĥābu Al-'A`rāfi Rijālāan Ya`rifūnahum Bisīmāhum Qālū Mā 'Aghná `Ankum Jam`ukum Wa Mā Kuntum Tastakbirūna",
        "footnotes": {
            "english_saheeh": "[375]- i.e., great numbers or gathering of wealth.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the companions of the Elevations will call to men [within Hell] whom they recognize by their mark, saying, \"Of no avail to you was your gathering[375] and [the fact] that you were arrogant.\"",
            "english_hilali_khan": "And the men on Al-A‘râf (the wall) will call unto the men whom they would recognise by their marks, saying: \"Of what benefit to you were your great numbers (and hoards of wealth), and your arrogance (against Faith)?\"",
            "english_rwwad": "The people of the Heights will call out to some men whom they recognize by their marks, saying, “Neither your great numbers, nor your arrogance were of any avail to you.”"
        }
    },
    {
        "id": 1002,
        "chapter": 7,
        "verse": 49,
        "arabic_text": "أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمۡتُمۡ لَا يَنَالُهُمُ ٱللَّهُ بِرَحۡمَةٍۚ ٱدۡخُلُواْ ٱلۡجَنَّةَ لَا خَوۡفٌ عَلَيۡكُمۡ وَلَآ أَنتُمۡ تَحۡزَنُونَ",
        "phonetic": "7.49 'Ahā'uulā' Al-Ladhīna 'Aqsamtum Lā Yanāluhumu Allāhu Biraĥmatin Adkhulū Al-Jannata Lā Khawfun `Alaykum Wa Lā 'Antum Taĥzanūna",
        "footnotes": {
            "english_saheeh": "[376]- The humble believers who are now in Paradise.  Another interpretation regards them as the people on the elevated partition.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh will say], \"Are these[376] the ones whom you [inhabitants of Hell] swore that Allāh would never offer them mercy? Enter Paradise, [O people of the Elevations]. No fear will there be concerning you, nor will you grieve.\"",
            "english_hilali_khan": "Are they those, of whom you swore that Allâh would never show them mercy. (Behold! It has been said to them): \"Enter Paradise, no fear shall be on you, nor shall you grieve.\"",
            "english_rwwad": "“Are these the ones whom you swore that Allah would never grant mercy?” “Enter Paradise; you will have no fear, nor will you grieve.”"
        }
    },
    {
        "id": 1003,
        "chapter": 7,
        "verse": 50,
        "arabic_text": "وَنَادَىٰٓ أَصۡحَٰبُ ٱلنَّارِ أَصۡحَٰبَ ٱلۡجَنَّةِ أَنۡ أَفِيضُواْ عَلَيۡنَا مِنَ ٱلۡمَآءِ أَوۡ مِمَّا رَزَقَكُمُ ٱللَّهُۚ قَالُوٓاْ إِنَّ ٱللَّهَ حَرَّمَهُمَا عَلَى ٱلۡكَٰفِرِينَ",
        "phonetic": "7.50 Wa Nādá 'Aşĥābu An-Nāri 'Aşĥāba Al-Jannati 'An 'Afīđū `Alaynā Mina Al-Mā'i 'Aw Mimmā Razaqakumu Allāhu Qālū 'Inna Allāha Ĥarramahumā `Alá Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the companions of the Fire will call to the companions of Paradise, \"Pour upon us some water or from whatever Allāh has provided you.\" They will say, \"Indeed, Allāh has forbidden them both to the disbelievers",
            "english_hilali_khan": "And the dwellers of the Fire will call to the dwellers of Paradise: \"Pour on us some water or anything that Allâh has provided you with.\" They will say: \"Both (water and provision) Allâh has forbidden to the disbelievers.\"",
            "english_rwwad": "The people of the Fire will call out to the people of Paradise, “Send down to us some water or any provision that Allah has given you.” They will say, “Allah has forbidden both to the disbelievers,"
        }
    },
    {
        "id": 1004,
        "chapter": 7,
        "verse": 51,
        "arabic_text": "ٱلَّذِينَ ٱتَّخَذُواْ دِينَهُمۡ لَهۡوٗا وَلَعِبٗا وَغَرَّتۡهُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ فَٱلۡيَوۡمَ نَنسَىٰهُمۡ كَمَا نَسُواْ لِقَآءَ يَوۡمِهِمۡ هَٰذَا وَمَا كَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ",
        "phonetic": "7.51 Al-Ladhīna Attakhadhū Dīnahum Lahwan Wa La`ibāan Wa Gharrat/humu Al-Ĥayāatu Ad-Dunyā Fālyawma Nansāhum Kamā Nasū Liqā'a Yawmihim Hādhā Wa Mā Kānū Bi'āyātinā Yajĥadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who took their religion as distraction and amusement and whom the worldly life deluded.\" So today We will forget them just as they forgot the meeting of this Day of theirs and for having rejected Our verses.",
            "english_hilali_khan": "\"Who took their religion as an amusement and play, and the life of the world deceived them.\" So this Day We shall forget them as they forgot their meeting of this Day, and as they used to reject Our Ayât (proofs, evidence, verses, lessons, signs, revelations).",
            "english_rwwad": "those who took their religion as amusement and play, and were deceived by the life of this world. Today We will ignore them just as they ignored their meeting of this Day and because they used to reject Our verses.”"
        }
    },
    {
        "id": 1005,
        "chapter": 7,
        "verse": 52,
        "arabic_text": "وَلَقَدۡ جِئۡنَٰهُم بِكِتَٰبٖ فَصَّلۡنَٰهُ عَلَىٰ عِلۡمٍ هُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "7.52 Wa Laqad Ji'nāhum Bikitābin Faşşalnāhu `Alá `Ilmin Hudáan Wa Raĥmatan Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We had certainly brought them a Book which We detailed by knowledge - as guidance and mercy to a people who believe.",
            "english_hilali_khan": "Certainly, We have brought them a Book (the Qur’ân) which We have explained in detail with knowledge, - a guidance and a mercy to a people who believe.",
            "english_rwwad": "We have brought them a Book which We have explained in detail on the basis of knowledge, as guidance and mercy for people who believe."
        }
    },
    {
        "id": 1006,
        "chapter": 7,
        "verse": 53,
        "arabic_text": "هَلۡ يَنظُرُونَ إِلَّا تَأۡوِيلَهُۥۚ يَوۡمَ يَأۡتِي تَأۡوِيلُهُۥ يَقُولُ ٱلَّذِينَ نَسُوهُ مِن قَبۡلُ قَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِٱلۡحَقِّ فَهَل لَّنَا مِن شُفَعَآءَ فَيَشۡفَعُواْ لَنَآ أَوۡ نُرَدُّ فَنَعۡمَلَ غَيۡرَ ٱلَّذِي كُنَّا نَعۡمَلُۚ قَدۡ خَسِرُوٓاْ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ",
        "phonetic": "7.53 Hal Yanžurūna 'Illā Ta'wīlahu Yawma Ya'tī Ta'wīluhu Yaqūlu Al-Ladhīna Nasūhu Min Qablu Qad Jā'at Rusulu Rabbinā Bil-Ĥaqqi Fahal Lanā Min Shufa`ā'a Fayashfa`ū Lanā 'Aw Nuraddu Fana`mala Ghayra Al-Ladhī Kunnā Na`malu Qad Khasirū 'Anfusahum Wa Đalla `Anhum Mā Kānū Yaftarūna",
        "footnotes": {
            "english_saheeh": "[377]- The fulfillment of what is promised in the Qur’ān.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they await except its result?[377] The Day its result comes, those who had ignored it before will say, \"The messengers of our Lord had come with the truth, so are there [now] any intercessors to intercede for us or could we be sent back to do other than what we used to do?\" They will have lost themselves, and lost from them is what they used to invent.",
            "english_hilali_khan": "Await they just for the final fullfilment of the event? On the Day the event is finally fulfilled (i.e. the Day of Resurrection), those who neglected it before will say: \"Verily, the Messengers of our Lord did come with the truth, now are there any intercessors for us that they might intercede on our behalf? Or could we be sent back (to the first life of the world) so that we might do (good) deeds other than those (evil) deeds which we used to do?\" Verily, they have lost their ownselves (i.e. destroyed themselves) and that which they used to fabricate (invoking and worshipping others besides Allâh) has gone away from them.",
            "english_rwwad": "Are they waiting except for the fulfillment [of its warning]? On the Day when it is fulfilled, those who ignored it before will say, “The messengers of our Lord surely came with the truth. Are there any intercessors who can intercede on our behalf? Or can we be sent back so that we may do other than what we used to do?” In fact, they will have ruined themselves and all that they used to fabricate will be lost from them."
        }
    },
    {
        "id": 1007,
        "chapter": 7,
        "verse": 54,
        "arabic_text": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَ يَطۡلُبُهُۥ حَثِيثٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ وَٱلنُّجُومَ مُسَخَّرَٰتِۭ بِأَمۡرِهِۦٓۗ أَلَا لَهُ ٱلۡخَلۡقُ وَٱلۡأَمۡرُۗ تَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ",
        "phonetic": "7.54 'Inna Rabbakumu Allāhu Al-Ladhī Khalaqa As-Samāwāti Wa Al-'Arđa Fī Sittati 'Ayyāmin Thumma Astawá `Alá Al-`Arshi Yughshī Al-Layla An-Nahāra Yaţlubuhu Ĥathīthāan Wa Ash-Shamsa Wa Al-Qamara Wa An-Nujūma Musakhkharātin Bi'amrihi 'Alā Lahu Al-Khalqu Wa Al-'Amru Tabāraka Allāhu Rabbu Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[378]- There are several linguistic meanings of the words \"istawā ʿalā,\" among them:  to settle upon, to assume ascendancy above, and to assert authority over.  However, it is known that all the attributes of Allāh are eternal, i.e., they have always existed and were present before He created.  Thus, it cannot be said that He \"rose\" above the Throne, as Allāh has always been ascendant.  Because the Creator may not be compared to His creation, the Prophet's companions and early scholars refused speculation as to how His actions could be interpreted, considering any such attempt unlawful.  Similarly, the true nature of the Throne is known only to Allāh, the Exalted.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, your Lord is Allāh, who created the heavens and earth in six days and then established Himself above the Throne.[378] He covers the night with the day, [another night] chasing it rapidly; and [He created] the sun, the moon, and the stars, subjected by His command. Unquestionably, His is the creation and the command; blessed is Allāh, Lord of the worlds.",
            "english_hilali_khan": "Indeed your Lord is Allâh, Who created the heavens and the earth in Six Days, and then He rose over (Istawâ) the Throne (really in a manner that suits His Majesty). He brings the night as a cover over the day, seeking it rapidly, and (He created) the sun, the moon, the stars subjected to His Command. Surely, His is the Creation and Commandment. Blessed is Allâh, the Lord of the ‘Âlamîn (mankind, jinn and all that exists)!",
            "english_rwwad": "Your Lord is Allah, Who created the heavens and earth in six days, and then rose over [istawa] the Throne. He makes the night and day overlap in rapid succession. He made the sun, the moon, and the stars – all subservient to His command. Behold, His is the creation and the command. Blessed is Allah, Lord of the worlds."
        }
    },
    {
        "id": 1008,
        "chapter": 7,
        "verse": 55,
        "arabic_text": "ٱدۡعُواْ رَبَّكُمۡ تَضَرُّعٗا وَخُفۡيَةًۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُعۡتَدِينَ",
        "phonetic": "7.55 Ad`ū Rabbakum Tađarru`āan Wa Khufyatan 'Innahu Lā Yuĥibbu Al-Mu`tadīna",
        "footnotes": {
            "english_saheeh": "[379]- In supplication or otherwise.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Call upon your Lord in humility and privately; indeed, He does not like transgressors.[379]",
            "english_hilali_khan": "Invoke your Lord with humility and in secret. He likes not the aggressors.",
            "english_rwwad": "Call upon your Lord with humility and in private, for He does not like the transgressors."
        }
    },
    {
        "id": 1009,
        "chapter": 7,
        "verse": 56,
        "arabic_text": "وَلَا تُفۡسِدُواْ فِي ٱلۡأَرۡضِ بَعۡدَ إِصۡلَٰحِهَا وَٱدۡعُوهُ خَوۡفٗا وَطَمَعًاۚ إِنَّ رَحۡمَتَ ٱللَّهِ قَرِيبٞ مِّنَ ٱلۡمُحۡسِنِينَ",
        "phonetic": "7.56 Wa Lā Tufsidū Fī Al-'Arđi Ba`da 'Işlāĥihā Wa Ad`ūhu Khawfāan Wa Ţama`āan 'Inna Raĥmata Allāhi Qarībun Mina Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And cause not corruption upon the earth after its reformation. And invoke Him in fear and aspiration. Indeed, the mercy of Allāh is near to the doers of good.",
            "english_hilali_khan": "And do not do mischief on the earth, after it has been set in order, and invoke Him with fear and hope. Surely, Allâh’s Mercy is (ever) near unto the good-doers.",
            "english_rwwad": "Do not spread corruption on earth after it has been set aright, but call upon Him with fear and hope. Indeed, the mercy of Allah is close to those who do good."
        }
    },
    {
        "id": 1010,
        "chapter": 7,
        "verse": 57,
        "arabic_text": "وَهُوَ ٱلَّذِي يُرۡسِلُ ٱلرِّيَٰحَ بُشۡرَۢا بَيۡنَ يَدَيۡ رَحۡمَتِهِۦۖ حَتَّىٰٓ إِذَآ أَقَلَّتۡ سَحَابٗا ثِقَالٗا سُقۡنَٰهُ لِبَلَدٖ مَّيِّتٖ فَأَنزَلۡنَا بِهِ ٱلۡمَآءَ فَأَخۡرَجۡنَا بِهِۦ مِن كُلِّ ٱلثَّمَرَٰتِۚ كَذَٰلِكَ نُخۡرِجُ ٱلۡمَوۡتَىٰ لَعَلَّكُمۡ تَذَكَّرُونَ",
        "phonetic": "7.57 Wa Huwa Al-Ladhī Yursilu Ar-Riyāĥa Bushrāan Bayna Yaday Raĥmatihi Ĥattá 'Idhā 'Aqallat Saĥābāan Thiqālāan Suqnāhu Libaladin Mayyitin Fa'anzalnā Bihi Al-Mā'a Fa'akhrajnā Bihi Min Kulli Ath-Thamarāti Kadhālika Nukhriju Al-Mawtá La`allakum Tadhakkarūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And it is He who sends the winds as good tidings before His mercy [i.e., rainfall] until, when they have carried heavy rainclouds, We drive them to a dead land and We send down rain therein and bring forth thereby [some] of all the fruits. Thus will We bring forth the dead; perhaps you may be reminded.",
            "english_hilali_khan": "And it is He Who sends the winds as heralds of glad tidings, going before His Mercy (rain). Till when they have carried a heavy-laden cloud, We drive it to a land that is dead, then We cause water (rain) to descend thereon. Then We produce every kind of fruit therewith. Similarly, We shall raise up the dead, so that you may remember or take heed.",
            "english_rwwad": "It is He Who sends the winds as glad tidings ahead of His Mercy, until when they bear heavy clouds, We drive them to a lifeless land then We send down rain from it, producing thereby every kind of fruit. This is how We raise the dead, so that you may take heed."
        }
    },
    {
        "id": 1011,
        "chapter": 7,
        "verse": 58,
        "arabic_text": "وَٱلۡبَلَدُ ٱلطَّيِّبُ يَخۡرُجُ نَبَاتُهُۥ بِإِذۡنِ رَبِّهِۦۖ وَٱلَّذِي خَبُثَ لَا يَخۡرُجُ إِلَّا نَكِدٗاۚ كَذَٰلِكَ نُصَرِّفُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَشۡكُرُونَ",
        "phonetic": "7.58 Wa Al-Baladu Aţ-Ţayyibu Yakhruju Nabātuhu Bi'idhni Rabbihi Wa Al-Ladhī Khabutha Lā Yakhruju 'Illā Nakidāan Kadhālika Nuşarrifu Al-'Āyāti Liqawmin Yashkurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the good land - its vegetation emerges by permission of its Lord; but that which is bad - nothing emerges except sparsely, with difficulty. Thus do We diversify the signs for a people who are grateful.",
            "english_hilali_khan": "The vegetation of a good land comes forth (easily) by the Permission of its Lord; and that which is bad, brings forth nothing but (a little) with difficulty. Thus do We explain variously the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) for a people who give thanks.",
            "english_rwwad": "The good land produces its vegetation by the Will of its Lord, but the bad land only produces poor and scanty vegetation. This is how We diversify the signs for people who give thanks."
        }
    },
    {
        "id": 1012,
        "chapter": 7,
        "verse": 59,
        "arabic_text": "لَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦ فَقَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ",
        "phonetic": "7.59 Laqad 'Arsalnā Nūĥāan 'Ilá Qawmihi Faqāla Yā Qawmi A`budū Allāha Mā Lakum Min 'Ilahin Ghayruhu 'Innī 'Akhāfu `Alaykum `Adhāba Yawmin `Ažīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We had certainly sent Noah to his people, and he said, \"O my people, worship Allāh; you have no deity other than Him. Indeed, I fear for you the punishment of a tremendous Day.\"",
            "english_hilali_khan": "Indeed, We sent Nûh (Noah) to his people and he said: \"O my people! Worship Allâh! You have no other Ilâh (God) but Him. (Lâ ilâha illallâh: none has the right to be worshipped but Allâh). Certainly, I fear for you the torment of a Great Day!\"",
            "english_rwwad": "Indeed, We sent Noah to his people. He said, “O my people, worship Allah; you have no god other than Him. I fear for you the punishment of a momentous Day.”"
        }
    },
    {
        "id": 1013,
        "chapter": 7,
        "verse": 60,
        "arabic_text": "قَالَ ٱلۡمَلَأُ مِن قَوۡمِهِۦٓ إِنَّا لَنَرَىٰكَ فِي ضَلَٰلٖ مُّبِينٖ",
        "phonetic": "7.60 Qāla Al-Mala'u Min Qawmihi 'Innā Lanarāka Fī Đalālin Mubīnin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said the eminent among his people, \"Indeed, we see you in clear error.\"",
            "english_hilali_khan": "The leaders of his people said: \"Verily, we see you in plain error.\"",
            "english_rwwad": "The chiefs of his people said, “We certainly see that you are clearly misguided.”"
        }
    },
    {
        "id": 1014,
        "chapter": 7,
        "verse": 61,
        "arabic_text": "قَالَ يَٰقَوۡمِ لَيۡسَ بِي ضَلَٰلَةٞ وَلَٰكِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "7.61 Qāla Yā Qawmi Laysa Bī Đalālatun Wa Lakinnī Rasūlun Min Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Noah] said, \"O my people, there is not error in me, but I am a messenger from the Lord of the worlds.",
            "english_hilali_khan": "[Nûh (Noah)] said: \"O my people! There is no error in me, but I am a Messenger from the Lord of the ‘Âlamîn (mankind, jinn and all that exists)!",
            "english_rwwad": "He said, “O my people, I am not misguided, but I am a messenger from the Lord of the worlds."
        }
    },
    {
        "id": 1015,
        "chapter": 7,
        "verse": 62,
        "arabic_text": "أُبَلِّغُكُمۡ رِسَٰلَٰتِ رَبِّي وَأَنصَحُ لَكُمۡ وَأَعۡلَمُ مِنَ ٱللَّهِ مَا لَا تَعۡلَمُونَ",
        "phonetic": "7.62 'Uballighukum Risālāti Rabbī Wa 'Anşaĥu Lakum Wa 'A`lamu Mina Allāhi Mā Lā Ta`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I convey to you the messages of my Lord and advise you; and I know from Allāh what you do not know.",
            "english_hilali_khan": "\"I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allâh what you know not.",
            "english_rwwad": "I convey to you the messages of my Lord and give you sincere advice, and I know from Allah what you do not know."
        }
    },
    {
        "id": 1016,
        "chapter": 7,
        "verse": 63,
        "arabic_text": "أَوَعَجِبۡتُمۡ أَن جَآءَكُمۡ ذِكۡرٞ مِّن رَّبِّكُمۡ عَلَىٰ رَجُلٖ مِّنكُمۡ لِيُنذِرَكُمۡ وَلِتَتَّقُواْ وَلَعَلَّكُمۡ تُرۡحَمُونَ",
        "phonetic": "7.63 'Awa`ajibtum 'An Jā'akum Dhikrun Min Rabbikum `Alá Rajulin Minkum Liyundhirakum Wa Litattaqū Wa La`allakum Turĥamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then do you wonder that there has come to you a reminder from your Lord through a man from among you, that he may warn you and that you may fear Allāh so you might receive mercy?\"",
            "english_hilali_khan": "\"Do you wonder that there has come to you a Reminder from your Lord through a man from amongst you, that he may warn you, so that you may fear Allâh and that you may receive (His) Mercy?\"",
            "english_rwwad": "Are you surprised that a reminder should come to you from your Lord through a man from among yourselves, so that he may warn you and you may fear Allah, and so that you may be shown mercy?”"
        }
    },
    {
        "id": 1017,
        "chapter": 7,
        "verse": 64,
        "arabic_text": "فَكَذَّبُوهُ فَأَنجَيۡنَٰهُ وَٱلَّذِينَ مَعَهُۥ فِي ٱلۡفُلۡكِ وَأَغۡرَقۡنَا ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَآۚ إِنَّهُمۡ كَانُواْ قَوۡمًا عَمِينَ",
        "phonetic": "7.64 Fakadhabūhu Fa'anjaynāhu Wa Al-Ladhīna Ma`ahu Fī Al-Fulki Wa 'Aghraqnā Al-Ladhīna Kadhabū Bi'āyātinā 'Innahum Kānū Qawmāan `Amīna",
        "footnotes": {
            "english_saheeh": "[380]- For a more detailed account, see 11:25-48.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But they denied him, so We saved him and those who were with him in the ship. And We drowned those who denied Our signs. Indeed, they were a blind people.[380]",
            "english_hilali_khan": "But they belied him, so We saved him and those along with him in the ship, and We drowned those who belied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.). They were indeed a blind people.",
            "english_rwwad": "But they rejected him, so We delivered him and those who were with him in the Ark, and We drowned those who rejected Our signs. They were indeed people who were blind [to the truth]."
        }
    },
    {
        "id": 1018,
        "chapter": 7,
        "verse": 65,
        "arabic_text": "۞ وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ",
        "phonetic": "7.65 Wa 'Ilá `Ādin 'Akhāhum Hūdāan Qāla Yā Qawmi A`budū Allāha Mā Lakum Min 'Ilahin Ghayruhu 'Afalā Tattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to the ʿAad [We sent] their brother Hūd. He said, \"O my people, worship Allāh; you have no deity other than Him. Then will you not fear Him?\"",
            "english_hilali_khan": "And to ‘Âd (people, We sent) their brother Hûd. He said: \"O my people! Worship Allâh! You have no other Ilâh (God) but Him. (Lâ ilâha illallâh: none has the right to be worshipped but Allâh). Will you not fear (Allâh)?\"",
            "english_rwwad": "To the people of ‘Ād We sent their brother Hūd. He said, “O my people, worship Allah; you have no god other than Him. Will you not then fear Him?”"
        }
    },
    {
        "id": 1019,
        "chapter": 7,
        "verse": 66,
        "arabic_text": "قَالَ ٱلۡمَلَأُ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦٓ إِنَّا لَنَرَىٰكَ فِي سَفَاهَةٖ وَإِنَّا لَنَظُنُّكَ مِنَ ٱلۡكَٰذِبِينَ",
        "phonetic": "7.66 Qāla Al-Mala'u Al-Ladhīna Kafarū Min Qawmihi 'Innā Lanarāka Fī Safāhatin Wa 'Innā Lanažunnuka Mina Al-Kādhibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said the eminent ones who disbelieved among his people, \"Indeed, we see you in foolishness, and indeed, we think you are of the liars.\"",
            "english_hilali_khan": "The leaders of those who disbelieved among his people said: \"Verily, we see you in foolishness, and verily, we think you are one of the liars.\"",
            "english_rwwad": "The disbelieving chiefs of his people said, “Indeed, we see you as foolish, and we think that you are one of the liars.”"
        }
    },
    {
        "id": 1020,
        "chapter": 7,
        "verse": 67,
        "arabic_text": "قَالَ يَٰقَوۡمِ لَيۡسَ بِي سَفَاهَةٞ وَلَٰكِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "7.67 Qāla Yā Qawmi Laysa Bī Safāhatun Wa Lakinnī Rasūlun Min Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Hūd] said, \"O my people, there is not foolishness in me, but I am a messenger from the Lord of the worlds.",
            "english_hilali_khan": "(Hûd) said: \"O my people! There is no foolishness in me, but (I am) a Messenger from the Lord of the ‘Âlamîn (mankind, jinn and all that exists)!",
            "english_rwwad": "He said, “O my people, there is no foolishness in me, but I am a messenger from the Lord of the worlds,"
        }
    },
    {
        "id": 1021,
        "chapter": 7,
        "verse": 68,
        "arabic_text": "أُبَلِّغُكُمۡ رِسَٰلَٰتِ رَبِّي وَأَنَا۠ لَكُمۡ نَاصِحٌ أَمِينٌ",
        "phonetic": "7.68 'Uballighukum Risālāti Rabbī Wa 'Anā Lakum Nāşiĥun 'Amīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I convey to you the messages of my Lord, and I am to you a trustworthy adviser.",
            "english_hilali_khan": "\"I convey unto you the Messages of my Lord, and I am a trustworthy adviser (or well-wisher) for you.",
            "english_rwwad": "I convey to you the messages of my Lord, and I am your sincere adviser."
        }
    },
    {
        "id": 1022,
        "chapter": 7,
        "verse": 69,
        "arabic_text": "أَوَعَجِبۡتُمۡ أَن جَآءَكُمۡ ذِكۡرٞ مِّن رَّبِّكُمۡ عَلَىٰ رَجُلٖ مِّنكُمۡ لِيُنذِرَكُمۡۚ وَٱذۡكُرُوٓاْ إِذۡ جَعَلَكُمۡ خُلَفَآءَ مِنۢ بَعۡدِ قَوۡمِ نُوحٖ وَزَادَكُمۡ فِي ٱلۡخَلۡقِ بَصۜۡطَةٗۖ فَٱذۡكُرُوٓاْ ءَالَآءَ ٱللَّهِ لَعَلَّكُمۡ تُفۡلِحُونَ",
        "phonetic": "7.69 'Awa`ajibtum 'An Jā'akum Dhikrun Min Rabbikum `Alá Rajulin Minkum Liyundhirakum Wa Adhkurū 'Idh Ja`alakum Khulafā'a Min Ba`di Qawmi Nūĥin Wa Zādakum Fī Al-Khalqi Basţatan Fādhkurū 'Ālā'a Allāhi La`allakum Tufliĥūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then do you wonder that there has come to you a reminder from your Lord through a man from among you, that he may warn you? And remember when He made you successors after the people of Noah and increased you in stature extensively. So remember the favors of Allāh that you might succeed.\"",
            "english_hilali_khan": "\"Do you wonder that there has come to you a Reminder (and an advice) from your Lord through a man from amongst you to warn you? And remember that He made you successors after the people of Nûh (Noah) and increased you amply in stature. So remember the graces (bestowed upon you) from Allâh so that you may be successful.\"",
            "english_rwwad": "Are you surprised that a reminder should come to you from your Lord through a man from among yourselves? Remember when He made you successors after the people of Noah and increased you amply in stature. Remember Allah’s favors, so that you may be successful.”"
        }
    },
    {
        "id": 1023,
        "chapter": 7,
        "verse": 70,
        "arabic_text": "قَالُوٓاْ أَجِئۡتَنَا لِنَعۡبُدَ ٱللَّهَ وَحۡدَهُۥ وَنَذَرَ مَا كَانَ يَعۡبُدُ ءَابَآؤُنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
        "phonetic": "7.70 Qālū 'Aji'tanā Lina`buda Allāha Waĥdahu Wa Nadhara Mā Kāna Ya`budu 'Ābā'uunā Fa'tinā Bimā Ta`idunā 'In Kunta Mina Aş-Şādiqīna",
        "footnotes": {
            "english_saheeh": "[381]- i.e., Allāh's punishment.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"Have you come to us that we should worship Allāh alone and leave what our fathers have worshipped? Then bring us what you promise us,[381] if you should be of the truthful.\"",
            "english_hilali_khan": "They said: \"You have come to us that we should worship Allâh Alone and forsake that which our fathers used to worship. So bring us that wherewith you have threatened us if you are of the truthful.\"",
            "english_rwwad": "They said, “Have you come to tell us that we should worship Allah alone and abandon what our forefathers used to worship? Bring upon us what you are threatening us with, if you are truthful.”"
        }
    },
    {
        "id": 1024,
        "chapter": 7,
        "verse": 71,
        "arabic_text": "قَالَ قَدۡ وَقَعَ عَلَيۡكُم مِّن رَّبِّكُمۡ رِجۡسٞ وَغَضَبٌۖ أَتُجَٰدِلُونَنِي فِيٓ أَسۡمَآءٖ سَمَّيۡتُمُوهَآ أَنتُمۡ وَءَابَآؤُكُم مَّا نَزَّلَ ٱللَّهُ بِهَا مِن سُلۡطَٰنٖۚ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ",
        "phonetic": "7.71 Qāla Qad Waqa`a `Alaykum Min Rabbikum Rijsun Wa Ghađabun 'Atujādilūnanī Fī 'Asmā'in Sammaytumūhā 'Antum Wa 'Ābā'uukum Mā Nazzala Allāhu Bihā Min Sulţānin Fāntažirū 'Innī Ma`akum Mina Al-Muntažirīna",
        "footnotes": {
            "english_saheeh": "[382]- The false objects of worship which you have called \"gods.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Hūd] said, \"Already have defilement and anger fallen upon you from your Lord. Do you dispute with me concerning [mere] names you have named them,[382] you and your fathers, for which Allāh has not sent down any authority? Then wait; indeed, I am with you among those who wait.\"",
            "english_hilali_khan": "(Hûd) said: \"Torment and wrath have already fallen on you from your Lord. Dispute you with me over names which you have named - you and your fathers - with no authority from Allâh? Then wait, I am with you among those who wait.\"",
            "english_rwwad": "He said, “You are definitely going to be subjected to the punishment and wrath of your Lord. Do you dispute with me concerning mere names that you and your forefathers have made up which Allah has never authorized? Then wait. I am too waiting with you.”"
        }
    },
    {
        "id": 1025,
        "chapter": 7,
        "verse": 72,
        "arabic_text": "فَأَنجَيۡنَٰهُ وَٱلَّذِينَ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا وَقَطَعۡنَا دَابِرَ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَاۖ وَمَا كَانُواْ مُؤۡمِنِينَ",
        "phonetic": "7.72 Fa'anjaynāhu Wa Al-Ladhīna Ma`ahu Biraĥmatin Minnā Wa Qaţa`nā Dābira Al-Ladhīna Kadhabū Bi'āyātinā Wa Mā Kānū Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We saved him and those with him by mercy from Us. And We eliminated those who denied Our signs, and they were not [at all] believers.",
            "english_hilali_khan": "So We saved him and those who were with him by a mercy from Us, and We cut the roots of those who belied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.); and they were not believers.",
            "english_rwwad": "Then We saved him and those who were with him by Our mercy, and exterminated all those who rejected Our signs, for they would not believe."
        }
    },
    {
        "id": 1026,
        "chapter": 7,
        "verse": 73,
        "arabic_text": "وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ قَدۡ جَآءَتۡكُم بَيِّنَةٞ مِّن رَّبِّكُمۡۖ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوٓءٖ فَيَأۡخُذَكُمۡ عَذَابٌ أَلِيمٞ",
        "phonetic": "7.73 Wa 'Ilá Thamūda 'Akhāhum Şāliĥāan Qāla Yā Qawmi A`budū Allāha Mā Lakum Min 'Ilahin Ghayruhu Qad Jā'atkum Bayyinatun Min Rabbikum Hadhihi Nāqatu Allāhi Lakum 'Āyatan Fadharūhā Ta'kul Fī 'Arđi Allāhi Wa Lā Tamassūhā Bisū'in Faya'khudhakum `Adhābun 'Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to the Thamūd [We sent] their brother Ṣāliḥ. He said, \"O my people, worship Allāh; you have no deity other than Him. There has come to you clear evidence from your Lord. This is the she-camel of Allāh [sent] to you as a sign. So leave her to eat within Allāh's land and do not touch her with harm, lest there seize you a painful punishment.",
            "english_hilali_khan": "And to Thamûd (people, We sent) their brother Sâlih. He said: \"O my people! Worship Allâh! You have no other Ilâh (God) but Him. (Lâ ilâha illallâh: none has the right to be worshipped but Allâh). Indeed there has come to you a clear sign (the miracle of the coming out of a huge she-camel from the midst of a rock) from your Lord. This she-camel of Allâh is a sign unto you; so you leave her to graze in Allâh’s earth, and touch her not with harm, lest a painful torment should seize you.",
            "english_rwwad": "And to the people of Thamūd [We sent] their brother, Sālih. He said, “O my people, worship Allah; you have no god other than Him. There has come to you a clear proof from your Lord: this is a she-camel of Allah, as a sign to you. So leave her to graze in Allah’s land, and do not harm her in any way, or else a painful punishment will seize you."
        }
    },
    {
        "id": 1027,
        "chapter": 7,
        "verse": 74,
        "arabic_text": "وَٱذۡكُرُوٓاْ إِذۡ جَعَلَكُمۡ خُلَفَآءَ مِنۢ بَعۡدِ عَادٖ وَبَوَّأَكُمۡ فِي ٱلۡأَرۡضِ تَتَّخِذُونَ مِن سُهُولِهَا قُصُورٗا وَتَنۡحِتُونَ ٱلۡجِبَالَ بُيُوتٗاۖ فَٱذۡكُرُوٓاْ ءَالَآءَ ٱللَّهِ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ",
        "phonetic": "7.74 Wa Adhkurū 'Idh Ja`alakum Khulafā'a Min Ba`di `Ādin Wa Bawwa'akum Fī Al-'Arđi Tattakhidhūna Min Suhūlihā Quşūrāan Wa Tanĥitūna Al-Jibāla Buyūtāan Fādhkurū 'Ālā'a Allāhi Wa Lā Ta`thaw Fī Al-'Arđi Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And remember when He made you successors after the ʿAad and settled you in the land, [and] you take for yourselves palaces from its plains and carve from the mountains, homes. Then remember the favors of Allāh and do not commit abuse on the earth, spreading corruption.\"",
            "english_hilali_khan": "And remember when He made you successors after ‘Âd (people) and gave you habitations in the land, you build for yourselves palaces in plains, and carve out homes in the mountains. So remember the graces (bestowed upon you) from Allâh, and do not go about making mischief on the earth.\"",
            "english_rwwad": "Remember when He made you successors after ‘Ād and settled you in the land; you make palaces on its plains and carve homes in the mountains. So remember the bounties of Allah, and do not spread corruption in the land.”"
        }
    },
    {
        "id": 1028,
        "chapter": 7,
        "verse": 75,
        "arabic_text": "قَالَ ٱلۡمَلَأُ ٱلَّذِينَ ٱسۡتَكۡبَرُواْ مِن قَوۡمِهِۦ لِلَّذِينَ ٱسۡتُضۡعِفُواْ لِمَنۡ ءَامَنَ مِنۡهُمۡ أَتَعۡلَمُونَ أَنَّ صَٰلِحٗا مُّرۡسَلٞ مِّن رَّبِّهِۦۚ قَالُوٓاْ إِنَّا بِمَآ أُرۡسِلَ بِهِۦ مُؤۡمِنُونَ",
        "phonetic": "7.75 Qāla Al-Mala'u Al-Ladhīna Astakbarū Min Qawmihi Lilladhīna Astuđ`ifū Liman 'Āmana Minhum 'Ata`lamūna 'Anna Şāliĥāan Mursalun Min Rabbihi Qālū 'Innā Bimā 'Ursila Bihi Mu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said the eminent ones who were arrogant among his people to those who were oppressed - to those who believed among them, \"Do you [actually] know that Ṣāliḥ is sent from his Lord?\" They said, \"Indeed we, in that with which he was sent, are believers.\"",
            "english_hilali_khan": "The leaders of those who were arrogant among his people said to those who were counted weak - to such of them as believed: \"Know you that Sâlih is one sent from his Lord.\" They said: \"We indeed believe in that with which he has been sent.\"",
            "english_rwwad": "The arrogant chiefs of his people said to those believers who were oppressed, “Do you really know that Sālih has been sent by his Lord?” They said, “We surely believe in what he has been sent with.”"
        }
    },
    {
        "id": 1029,
        "chapter": 7,
        "verse": 76,
        "arabic_text": "قَالَ ٱلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا بِٱلَّذِيٓ ءَامَنتُم بِهِۦ كَٰفِرُونَ",
        "phonetic": "7.76 Qāla Al-Ladhīna Astakbarū 'Innā Bial-Ladhī 'Āmantum Bihi Kāfirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said those who were arrogant, \"Indeed we, in that which you have believed, are disbelievers.\"",
            "english_hilali_khan": "Those who were arrogant said: \"Verily, we disbelieve in that which you believe in.\"",
            "english_rwwad": "Those who were arrogant said, “As for us, we surely disbelieve in what you believe.”"
        }
    },
    {
        "id": 1030,
        "chapter": 7,
        "verse": 77,
        "arabic_text": "فَعَقَرُواْ ٱلنَّاقَةَ وَعَتَوۡاْ عَنۡ أَمۡرِ رَبِّهِمۡ وَقَالُواْ يَٰصَٰلِحُ ٱئۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلۡمُرۡسَلِينَ",
        "phonetic": "7.77 Fa`aqarū An-Nāqata Wa `Ataw `An 'Amri Rabbihim Wa Qālū Yā Şāliĥu A'tinā Bimā Ta`idunā 'In Kunta Mina Al-Mursalīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So they hamstrung the she-camel and were insolent toward the command of their Lord and said, \"O Ṣāliḥ, bring us what you promise us, if you should be of the messengers.\"",
            "english_hilali_khan": "So they killed the she-camel and insolently defied the Commandment of their Lord, and said: \"O Sâlih! Bring about your threats if you are indeed one of the Messengers (of Allâh).\"",
            "english_rwwad": "Then they killed the she-camel and defied their Lord’s command, and said, “Bring us what you threaten us, if you are indeed one of the messengers.”"
        }
    },
    {
        "id": 1031,
        "chapter": 7,
        "verse": 78,
        "arabic_text": "فَأَخَذَتۡهُمُ ٱلرَّجۡفَةُ فَأَصۡبَحُواْ فِي دَارِهِمۡ جَٰثِمِينَ",
        "phonetic": "7.78 Fa'akhadhat/humu Ar-Rajfatu Fa'aşbaĥū Fī Dārihim Jāthimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So the earthquake seized them, and they became within their home [corpses] fallen prone.",
            "english_hilali_khan": "So the earthquake seized them, and they lay (dead), prostrate in their homes.",
            "english_rwwad": "Then an earthquake seized them, and they fell lifeless in their homes."
        }
    },
    {
        "id": 1032,
        "chapter": 7,
        "verse": 79,
        "arabic_text": "فَتَوَلَّىٰ عَنۡهُمۡ وَقَالَ يَٰقَوۡمِ لَقَدۡ أَبۡلَغۡتُكُمۡ رِسَالَةَ رَبِّي وَنَصَحۡتُ لَكُمۡ وَلَٰكِن لَّا تُحِبُّونَ ٱلنَّٰصِحِينَ",
        "phonetic": "7.79 Fatawallá `Anhum Wa Qāla Yā Qawmi Laqad 'Ablaghtukum Risālata Rabbī Wa Naşaĥtu Lakum Wa Lakin Lā Tuĥibbūna An-Nāşiĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he [i.e., Ṣāliḥ] turned away from them and said, \"O my people, I had certainly conveyed to you the message of my Lord and advised you, but you do not like advisors.\"",
            "english_hilali_khan": "Then he [Sâlih] turned from them, and said: \"O my people! I have indeed conveyed to you the Message of my Lord, and have given you good advice but you like not good advisers.\"",
            "english_rwwad": "So he turned away from them, saying, “O my people, I did convey my Lord’s message to you and gave you sincere advice, but you do not like sincere advisers.”"
        }
    },
    {
        "id": 1033,
        "chapter": 7,
        "verse": 80,
        "arabic_text": "وَلُوطًا إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ مَا سَبَقَكُم بِهَا مِنۡ أَحَدٖ مِّنَ ٱلۡعَٰلَمِينَ",
        "phonetic": "7.80 Wa Lūţāan 'Idh Qāla Liqawmihi 'Ata'tūna Al-Fāĥishata Mā Sabaqakum Bihā Min 'Aĥadin Mina Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [We had sent] Lot when he said to his people, \"Do you commit such immorality as no one has preceded you with from among the worlds [i.e., peoples]?",
            "english_hilali_khan": "And (remember) Lût (Lot), when he said to his people: \"Do you commit the worst sin such as none preceding you has committed in the ‘Âlamîn (mankind and jinn)?",
            "english_rwwad": "And [We sent] Lot, when he said to his people, “Do you commit such a shameful act that nobody has ever done before you?"
        }
    },
    {
        "id": 1034,
        "chapter": 7,
        "verse": 81,
        "arabic_text": "إِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ",
        "phonetic": "7.81 'Innakum Lata'tūna Ar-Rijāla Shahwatan Min Dūni An-Nisā' Bal 'Antum Qawmun Musrifūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, you approach men with desire, instead of women. Rather, you are a transgressing people.\"",
            "english_hilali_khan": "\"Verily, you practise your lusts on men instead of women. Nay, but you are a people transgressing beyond bounds (by committing great sins).\"",
            "english_rwwad": "For you approach men lustfully instead of women; you are but a transgressing people.”"
        }
    },
    {
        "id": 1035,
        "chapter": 7,
        "verse": 82,
        "arabic_text": "وَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوهُم مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ يَتَطَهَّرُونَ",
        "phonetic": "7.82 Wa Mā Kāna Jawāba Qawmihi 'Illā 'An Qālū 'Akhrijūhum Min Qaryatikum 'Innahum 'Unāsun Yataţahharūn",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But the answer of his people was only that they said, \"Evict them from your city! Indeed, they are men who keep themselves pure.\"",
            "english_hilali_khan": "And the answer of his people was only that they said: \"Drive them out of your town, these are indeed men who want to be pure (from sins)!\"",
            "english_rwwad": "The only reply his people gave was to say, “Drive them out of your town, for they are people who keep themselves pure!”"
        }
    },
    {
        "id": 1036,
        "chapter": 7,
        "verse": 83,
        "arabic_text": "فَأَنجَيۡنَٰهُ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ",
        "phonetic": "7.83 Fa'anjaynāhu Wa 'Ahlahu 'Illā Amra'atahu Kānat Mina Al-Ghābirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We saved him and his family, except for his wife; she was of those who remained [with the evildoers].",
            "english_hilali_khan": "Then We saved him and his family, except his wife; she was of those who remained behind (in the torment).",
            "english_rwwad": "So We saved him and his family except his wife; she was one of those who remained behind."
        }
    },
    {
        "id": 1037,
        "chapter": 7,
        "verse": 84,
        "arabic_text": "وَأَمۡطَرۡنَا عَلَيۡهِم مَّطَرٗاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُجۡرِمِينَ",
        "phonetic": "7.84 Wa 'Amţarnā `Alayhim Maţarāan Fānžur Kayfa Kāna `Āqibatu Al-Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We rained upon them a rain [of stones]. Then see how was the end of the criminals.",
            "english_hilali_khan": "And We rained down on them a rain (of stones). Then see what was the end of the Mujrimûn (criminals, polytheists and sinners).",
            "english_rwwad": "And We rained down upon them a rain [of brimstone]. So see how was the end of the evildoers."
        }
    },
    {
        "id": 1038,
        "chapter": 7,
        "verse": 85,
        "arabic_text": "وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ قَدۡ جَآءَتۡكُم بَيِّنَةٞ مِّن رَّبِّكُمۡۖ فَأَوۡفُواْ ٱلۡكَيۡلَ وَٱلۡمِيزَانَ وَلَا تَبۡخَسُواْ ٱلنَّاسَ أَشۡيَآءَهُمۡ وَلَا تُفۡسِدُواْ فِي ٱلۡأَرۡضِ بَعۡدَ إِصۡلَٰحِهَاۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ",
        "phonetic": "7.85 Wa 'Ilá Madyana 'Akhāhum Shu`aybāan Qāla Yā Qawmi A`budū Allāha Mā Lakum Min 'Ilahin Ghayruhu Qad Jā'atkum Bayyinatun Min Rabbikum Fa'awfū Al-Kayla Wa Al-Mīzāna Wa Lā Tabkhasū An-Nāsa 'Ashyā 'Ahum Wa Lā Tufsidū Fī Al-'Arđi Ba`da 'Işlāĥihā Dhālikum Khayrun Lakum 'In Kuntum Mu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to [the people of] Madyan [We sent] their brother Shuʿayb. He said, \"O my people, worship Allāh; you have no deity other than Him. There has come to you clear evidence from your Lord. So fulfill the measure and weight and do not deprive people of their due and cause not corruption upon the earth after its reformation. That is better for you, if you should be believers.",
            "english_hilali_khan": "And to (the people of) Madyan (Midian), (We sent) their brother Shu‘aib. He said: \"O my people! Worship Allâh! You have no other Ilâh (God) but Him. [Lâ ilâha illallâh (none has the right to be worshipped but Allâh)].\" Verily, a clear proof (sign) from your Lord has come unto you; so give full measure and full weight and wrong not men in their things, and do not do mischief on the earth after it has been set in order, that will be better for you, if you are believers.",
            "english_rwwad": "And to the people of Midian [We sent] their brother Shu‘ayb. He said, “O my people, worship Allah; you have no god other than Him. There has come to you a clear proof from your Lord. Give full measure and weight, and do not defraud people of their property, and do not spread corruption in the land after it has been set aright. That is best for you, if you are [truly] believers."
        }
    },
    {
        "id": 1039,
        "chapter": 7,
        "verse": 86,
        "arabic_text": "وَلَا تَقۡعُدُواْ بِكُلِّ صِرَٰطٖ تُوعِدُونَ وَتَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنۡ ءَامَنَ بِهِۦ وَتَبۡغُونَهَا عِوَجٗاۚ وَٱذۡكُرُوٓاْ إِذۡ كُنتُمۡ قَلِيلٗا فَكَثَّرَكُمۡۖ وَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ",
        "phonetic": "7.86 Wa Lā Taq`udū Bikulli Şirāţin Tū`idūna Wa Taşuddūna `An Sabīli Allāhi Man 'Āmana Bihi Wa Tabghūnahā `Iwajāan Wa Adhkurū 'Idh Kuntum Qalīlāan Fakaththarakum Wa Anžurū Kayfa Kāna `Āqibatu Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And do not sit on every path, threatening and averting from the way of Allāh those who believe in Him, seeking to make it [seem] deviant. And remember when you were few and He increased you. And see how was the end of the corrupters.",
            "english_hilali_khan": "\"And sit not on every road, threatening, and hindering from the Path of Allâh those who believe in Him, and seeking to make it crooked. And remember when you were but few, and He multiplied you. And see what was the end of the Mufsidûn (mischief-makers, corrupters, liars).",
            "english_rwwad": "Do not lie in wait on every path, threatening and preventing from Allah’s path those who believe in Him, and seeking to make it crooked. Remember when you were few, then He increased you in number. See how was the end of those who spread corruption."
        }
    },
    {
        "id": 1040,
        "chapter": 7,
        "verse": 87,
        "arabic_text": "وَإِن كَانَ طَآئِفَةٞ مِّنكُمۡ ءَامَنُواْ بِٱلَّذِيٓ أُرۡسِلۡتُ بِهِۦ وَطَآئِفَةٞ لَّمۡ يُؤۡمِنُواْ فَٱصۡبِرُواْ حَتَّىٰ يَحۡكُمَ ٱللَّهُ بَيۡنَنَاۚ وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَ",
        "phonetic": "7.87 Wa 'In Kāna Ţā'ifatun Minkum 'Āmanū Bial-Ladhī 'Ursiltu Bihi Wa Ţā'ifatun Lam Yu'uminū Fāşbirū Ĥattá Yaĥkuma Allāhu Baynanā Wa Huwa Khayru Al-Ĥākimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:87):\nA). Narrated ‘Abdullâh bin ‘Umar رضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Surely! Everyone of you is a guardian and is responsible for his charges: The Imâm (ruler) of the people is a guardian and is responsible for his subjects: a man is the guardian of his family (household) and is responsible for his subjects: a woman is the guardian of her husband’s home and of his children and is responsible for them; and the slave of a man is a guardian of his master’s property and is responsible for it. Surely, everyone of you is a guardian and responsible for his charges.\" (Sahih Al-Bukhâri, Vol.9, hadîth No.252).\nB). Narrated Tarîf Abî Tamîmah: I saw Safwân and Jundub and Safwân’s companions when Jundub was advising. They said, \"Did you hear something from Allâh’s Messenger صلى الله عليه وسلم?\" Jundub said, \"I heard him saying, ‘Whoever does a good deed in order to show-off, Allâh will expose his intentions on the Day of Resurrection (before the people), and whoever puts the people into difficulties, Allâh will put him into difficulties on the Day of Resurrection.’ \" The people said (to Jundub), \"Advise us.\" He said, \"The first thing of the human body to purify is the abdomen, so he who can eat nothing but good food (Halâl and earned lawfully) should do so, and he who does as much as he can that nothing intervene between him and Paradise by not shedding even a handful of blood, (i.e. murdering) should do so.\" [Sahih Al-Bukhâri, Vol.9, hadîth No.266].\nC) Narrated Anas bin Mâlik رضي الله عنه: While the Prophetصلى الله عليه وسلم and I were coming out of the mosque, a man met us outside the gate. The man said, \"O Allâh’s Messenger! When will be the Hour?\" The Prophetصلى الله عليه وسلم asked him, \"What have you prepared for it?\" The man became afraid and ashamed and then said, \"O Allâh’s Messenger! I haven’t prepared for it much of Saum (fasts), Salât (prayers) or charitable gifts but I love Allâh and His Messenger.\" The Prophetصلى الله عليه وسلم said, \"You will be with the one whom you love.\" [Sahih Al-Bukhâri, Vol.9, hadîth No. 267].\nD). Narrated Abu Dharr رضي الله عنه : Once I went to him (the Prophetصلى الله عليه وسلم) and he said, \"By Allâh in Whose Hand my life is (Or probably said, \"By Allâh, except whom none has the right to be worshipped)\" whoever had camels or cows or sheep and did not pay their Zakât, those animals will be brought on the Day of Resurrection far bigger and fatter than before and they will tread him under their hooves, and will butt him with their horns, and (those animals will come in circle): When the last does its turn, the first will start again, and this punishment will go on till Allâh has finished the judgements amongst the people.\"\n[Sahih Al-Bukhâri, Vol.2. hadîth No.539].",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if there should be a group among you who has believed in that with which I have been sent and a group that has not believed, then be patient until Allāh judges between us. And He is the best of judges.\"",
            "english_hilali_khan": "\"And if there is a party of you who believe in that with which I have been sent and a party who do not believe, so be patient until Allâh judges between us, and He is the Best of judges.\"[1]",
            "english_rwwad": "If there are some among you who believe in what I have been sent with, while others do not believe, then be patient until Allah judges between us, and He is the Best of Judges.”"
        }
    },
    {
        "id": 1041,
        "chapter": 7,
        "verse": 88,
        "arabic_text": "۞ قَالَ ٱلۡمَلَأُ ٱلَّذِينَ ٱسۡتَكۡبَرُواْ مِن قَوۡمِهِۦ لَنُخۡرِجَنَّكَ يَٰشُعَيۡبُ وَٱلَّذِينَ ءَامَنُواْ مَعَكَ مِن قَرۡيَتِنَآ أَوۡ لَتَعُودُنَّ فِي مِلَّتِنَاۚ قَالَ أَوَلَوۡ كُنَّا كَٰرِهِينَ",
        "phonetic": "7.88 Qāla Al-Mala'u Al-Ladhīna Astakbarū Min Qawmihi Lanukhrijannaka Yā Shu`aybu Wa Al-Ladhīna 'Āmanū Ma`aka Min Qaryatinā 'Aw Lata`ūdunna Fī Millatinā Qāla 'Awalaw Kunnā Kārihīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said the eminent ones who were arrogant among his people, \"We will surely evict you, O Shuʿayb, and those who have believed with you from our city, or you must return to our religion.\" He said, \"Even if we were unwilling?",
            "english_hilali_khan": "The chiefs of those who were arrogant among his people said: \"We shall certainly drive you out, O Shu‘aib, and those who have believed with you from our town, or else you (all) shall return to our religion.\" He said: \"Even though we hate it!?\"",
            "english_rwwad": "The arrogant chiefs of his people said, “O Shu‘ayb, we will surely drive you and those who believe with you out of our town unless you return to our faith.” He said, “Even if we detest it?"
        }
    },
    {
        "id": 1042,
        "chapter": 7,
        "verse": 89,
        "arabic_text": "قَدِ ٱفۡتَرَيۡنَا عَلَى ٱللَّهِ كَذِبًا إِنۡ عُدۡنَا فِي مِلَّتِكُم بَعۡدَ إِذۡ نَجَّىٰنَا ٱللَّهُ مِنۡهَاۚ وَمَا يَكُونُ لَنَآ أَن نَّعُودَ فِيهَآ إِلَّآ أَن يَشَآءَ ٱللَّهُ رَبُّنَاۚ وَسِعَ رَبُّنَا كُلَّ شَيۡءٍ عِلۡمًاۚ عَلَى ٱللَّهِ تَوَكَّلۡنَاۚ رَبَّنَا ٱفۡتَحۡ بَيۡنَنَا وَبَيۡنَ قَوۡمِنَا بِٱلۡحَقِّ وَأَنتَ خَيۡرُ ٱلۡفَٰتِحِينَ",
        "phonetic": "7.89 Qadi Aftaraynā `Alá Allāhi Kadhibāan 'In `Udnā Fī Millatikum Ba`da 'Idh Najjānā Allāhu Minhā Wa Mā Yakūnu Lanā 'An Na`ūda Fīhā 'Illā 'An Yashā'a Allāhu Rabbunā Wasi`a Rabbunā Kulla Shay'in `Ilmāan `Alá Allāhi Tawakkalnā Rabbanā Aftaĥ Baynanā Wa Bayna Qawminā Bil-Ĥaqqi Wa 'Anta Khayru Al-Fātiĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "We would have invented against Allāh a lie if we returned to your religion after Allāh had saved us from it. And it is not for us to return to it except that Allāh, our Lord, should will. Our Lord has encompassed all things in knowledge. Upon Allāh we have relied. Our Lord, decide between us and our people in truth, and You are the best of those who give decision.\"",
            "english_hilali_khan": "\"We should have invented a lie against Allâh if we returned to your religion, after Allâh has rescued us from it. And it is not for us to return to it unless Allâh, our Lord, should will. Our Lord comprehends all things in His Knowledge. In Allâh (Alone) we put our trust. Our Lord! Judge between us and our people in truth, for You are the Best of those who give judgment.\"",
            "english_rwwad": "We would be fabricating lies against Allah if we were to return to your faith after Allah has saved us from it. We will not return to it unless Our Lord Allah so wills. Our Lord has full knowledge of everything. In Allah we put our trust. Our Lord, judge between us and our people with truth, for You are the Best of the Judges.”"
        }
    },
    {
        "id": 1043,
        "chapter": 7,
        "verse": 90,
        "arabic_text": "وَقَالَ ٱلۡمَلَأُ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦ لَئِنِ ٱتَّبَعۡتُمۡ شُعَيۡبًا إِنَّكُمۡ إِذٗا لَّخَٰسِرُونَ",
        "phonetic": "7.90 Wa Qāla Al-Mala'u Al-Ladhīna Kafarū Min Qawmihi La'ini Attaba`tum Shu`aybāan 'Innakum 'Idhāan Lakhāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said the eminent ones who disbelieved among his people, \"If you should follow Shuʿayb, indeed, you would then be losers.\"",
            "english_hilali_khan": "The chiefs of those who disbelieved among his people said (to their people): \"If you follow Shu‘aib, be sure then you will be the losers!\"",
            "english_rwwad": "The disbelieving chiefs of his people said, “If you follow Shu‘ayb, you will certainly be losers.”"
        }
    },
    {
        "id": 1044,
        "chapter": 7,
        "verse": 91,
        "arabic_text": "فَأَخَذَتۡهُمُ ٱلرَّجۡفَةُ فَأَصۡبَحُواْ فِي دَارِهِمۡ جَٰثِمِينَ",
        "phonetic": "7.91 Fa'akhadhat/humu Ar-Rajfatu Fa'aşbaĥū Fī Dārihim Jāthimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So the earthquake seized them, and they became within their home [corpses] fallen prone.",
            "english_hilali_khan": "So the earthquake seized them and they lay (dead), prostrate in their homes.",
            "english_rwwad": "Then they were seized by the earthquake and they fell lifeless in their homes."
        }
    },
    {
        "id": 1045,
        "chapter": 7,
        "verse": 92,
        "arabic_text": "ٱلَّذِينَ كَذَّبُواْ شُعَيۡبٗا كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَاۚ ٱلَّذِينَ كَذَّبُواْ شُعَيۡبٗا كَانُواْ هُمُ ٱلۡخَٰسِرِينَ",
        "phonetic": "7.92 Al-Ladhīna Kadhabū Shu`aybāan Ka'an Lam Yaghnaw Fīhā Al-Ladhīna Kadhabū Shu`aybāan Kānū Humu Al-Khāsirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who denied Shuʿayb - it was as though they had never resided there. Those who denied Shuʿayb - it was they who were the losers.",
            "english_hilali_khan": "Those who belied Shu‘aib, became as if they had never dwelt there (in their homes). Those who belied Shu‘aib, they were the losers.",
            "english_rwwad": "Those who rejected Shu‘ayb became as if they had never lived there. Those who rejected Shu‘ayb were themselves the losers."
        }
    },
    {
        "id": 1046,
        "chapter": 7,
        "verse": 93,
        "arabic_text": "فَتَوَلَّىٰ عَنۡهُمۡ وَقَالَ يَٰقَوۡمِ لَقَدۡ أَبۡلَغۡتُكُمۡ رِسَٰلَٰتِ رَبِّي وَنَصَحۡتُ لَكُمۡۖ فَكَيۡفَ ءَاسَىٰ عَلَىٰ قَوۡمٖ كَٰفِرِينَ",
        "phonetic": "7.93 Fatawallá `Anhum Wa Qāla Yā Qawmi Laqad 'Ablaghtukum Risālāti Rabbī Wa Naşaĥtu Lakum Fakayfa 'Āsá `Alá Qawmin Kāfirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he [i.e., Shuʿayb] turned away from them and said, \"O my people, I had certainly conveyed to you the messages of my Lord and advised you, so how could I grieve for a disbelieving people?\"",
            "english_hilali_khan": "Then he (Shu‘aib) turned from them and said: \"O my people! I have indeed conveyed my Lord’s Messages unto you and I have given you good advice. Then how can I sorrow for the disbelieving people’s (destruction).\"",
            "english_rwwad": "So he turned away from them and said, “O my people, I did convey to you the messages of my Lord, and gave you sincere advice. Why should I grieve for a disbelieving people?”"
        }
    },
    {
        "id": 1047,
        "chapter": 7,
        "verse": 94,
        "arabic_text": "وَمَآ أَرۡسَلۡنَا فِي قَرۡيَةٖ مِّن نَّبِيٍّ إِلَّآ أَخَذۡنَآ أَهۡلَهَا بِٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمۡ يَضَّرَّعُونَ",
        "phonetic": "7.94 Wa Mā 'Arsalnā Fī Qaryatin Min Nabīyin 'Illā 'Akhadhnā 'Ahlahā Bil-Ba'sā'i Wa Ađ-Đarrā'i La`allahum Yađđarra`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We sent to no city a prophet [who was denied] except that We seized its people with poverty and hardship that they might humble themselves [to Allāh].",
            "english_hilali_khan": "And We sent no Prophet unto any town (and they denied him), but We seized its people with suffering from extreme poverty (or loss in wealth) and loss of health (and calamities), so that they might humiliate themselves (and repent to Allâh).",
            "english_rwwad": "We have not sent any prophet to a town, but We seized its people with poverty and adversity, so that they may humble themselves."
        }
    },
    {
        "id": 1048,
        "chapter": 7,
        "verse": 95,
        "arabic_text": "ثُمَّ بَدَّلۡنَا مَكَانَ ٱلسَّيِّئَةِ ٱلۡحَسَنَةَ حَتَّىٰ عَفَواْ وَّقَالُواْ قَدۡ مَسَّ ءَابَآءَنَا ٱلضَّرَّآءُ وَٱلسَّرَّآءُ فَأَخَذۡنَٰهُم بَغۡتَةٗ وَهُمۡ لَا يَشۡعُرُونَ",
        "phonetic": "7.95 Thumma Baddalnā Makāna As-Sayyi'ati Al-Ĥasanata Ĥattá `Afaw Wa Qālū Qad Massa 'Ābā'anā Ađ-Đarrā'u Wa As-Sarrā'u Fa'akhadhnāhum Baghtatan Wa Hum Lā Yash`urūna",
        "footnotes": {
            "english_saheeh": "[383]- Instead of being grateful to Allāh for His blessings, they merely attributed them to the changing fortunes of time.\n[384]- That they had been tried and tested.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We exchanged in place of the bad [condition], good, until they increased [and prospered] and said, \"Our fathers [also] were touched with hardship and ease.\"[383] So We seized them suddenly while they did not perceive.[384]",
            "english_hilali_khan": "Then We changed the evil for the good, until they increased in number and in wealth, and said: \"Our fathers were touched with evil (loss of health and calamities) and with good (prosperity).\" So We seized them all of a sudden while they were unaware.",
            "english_rwwad": "Then We changed their adversity into prosperity until they flourished and said, “Our forefathers were also afflicted with hardship and ease.” Then We seized them by surprise while they were unaware."
        }
    },
    {
        "id": 1049,
        "chapter": 7,
        "verse": 96,
        "arabic_text": "وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰٓ ءَامَنُواْ وَٱتَّقَوۡاْ لَفَتَحۡنَا عَلَيۡهِم بَرَكَٰتٖ مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ وَلَٰكِن كَذَّبُواْ فَأَخَذۡنَٰهُم بِمَا كَانُواْ يَكۡسِبُونَ",
        "phonetic": "7.96 Wa Law 'Anna 'Ahla Al-Qurá 'Āmanū Wa Attaqaw Lafataĥnā `Alayhim Barakātin Mina As-Samā'i Wa Al-'Arđi Wa Lakin Kadhabū Fa'akhadhnāhum Bimā Kānū Yaksibūna",
        "footnotes": {
            "english_saheeh": "[385]- Of blame for their sin.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if only the people of the cities had believed and feared Allāh, We would have opened [i.e., bestowed] upon them blessings from the heaven and the earth; but they denied [the messengers], so We seized them for what they were earning.[385]",
            "english_hilali_khan": "And if the people of the towns had believed and had the Taqwâ (piety), certainly, We should have opened for them blessings from the heaven and the earth, but they belied (the Messengers). So We took them (with punishment) for what they used to earn (polytheism and crimes).",
            "english_rwwad": "If only the people of the towns had believed and feared Allah, We would have certainly opened for them blessings from the heaven and earth. But they disbelieved, so We seized them for what they earned."
        }
    },
    {
        "id": 1050,
        "chapter": 7,
        "verse": 97,
        "arabic_text": "أَفَأَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا بَيَٰتٗا وَهُمۡ نَآئِمُونَ",
        "phonetic": "7.97 'Afa'amina 'Ahlu Al-Qurá 'An Ya'tiyahum Ba'sunā Bayātāan Wa Hum Nā'imūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, did the people of the cities feel secure from Our punishment coming to them at night while they were asleep?",
            "english_hilali_khan": "Did the people of the towns then feel secure against the coming of Our punishment by night while they were asleep?",
            "english_rwwad": "Do the people of the towns feel secure that Our punishment will not befall them by night while they are asleep?"
        }
    },
    {
        "id": 1051,
        "chapter": 7,
        "verse": 98,
        "arabic_text": "أَوَأَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا ضُحٗى وَهُمۡ يَلۡعَبُونَ",
        "phonetic": "7.98 'Awa 'Amina 'Ahlu Al-Qurá 'An Ya'tiyahum Ba'sunā Đuĥáan Wa Hum Yal`abūna",
        "footnotes": {
            "english_saheeh": "[386]- i.e., occupied with such activities that have no benefit.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or did the people of the cities feel secure from Our punishment coming to them in the morning while they were at play?[386]",
            "english_hilali_khan": "Or, did the people of the towns then feel secure against the coming of Our punishment in the forenoon while they were playing?",
            "english_rwwad": "Or do the people of the towns feel secure that Our punishment will not befall them by day while they are at play?"
        }
    },
    {
        "id": 1052,
        "chapter": 7,
        "verse": 99,
        "arabic_text": "أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "7.99 'Afa'aminū Makra Allāhi Falā Ya'manu Makra Allāhi 'Illā Al-Qawmu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then, did they feel secure from the plan of Allāh? But no one feels secure from the plan of Allāh except the losing people.",
            "english_hilali_khan": "Did they then feel secure against the Plan of Allâh? None feels secure from the Plan of Allâh except the people who are the losers.",
            "english_rwwad": "Do they feel secure from the plan of Allah? None can feel secure from the plan of Allah except the people who are losers."
        }
    },
    {
        "id": 1053,
        "chapter": 7,
        "verse": 100,
        "arabic_text": "أَوَلَمۡ يَهۡدِ لِلَّذِينَ يَرِثُونَ ٱلۡأَرۡضَ مِنۢ بَعۡدِ أَهۡلِهَآ أَن لَّوۡ نَشَآءُ أَصَبۡنَٰهُم بِذُنُوبِهِمۡۚ وَنَطۡبَعُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَسۡمَعُونَ",
        "phonetic": "7.100 'Awalam Yahdi Lilladhīna Yarithūna Al-'Arđa Min Ba`di 'Ahlihā 'An Law Nashā'u 'Aşabnāhum Bidhunūbihim Wa Naţba`u `Alá Qulūbihim Fahum Lā Yasma`ūna",
        "footnotes": {
            "english_saheeh": "[387]- They do not benefit from what they hear.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Has it not become clear to those who inherited the earth after its [previous] people that if We willed, We could afflict them for their sins? But We seal over their hearts so they do not hear.[387]",
            "english_hilali_khan": "Is it not clear to those who inherit the earth in succession from its (previous) possessors, that had We willed, We would have punished them for their sins. And We seal up their hearts so that they hear not?",
            "english_rwwad": "Is it not clear to those who inherit the land after its former people that, if We so willed, We could punish them for their sins and seal up their hearts so that they do not hear?"
        }
    },
    {
        "id": 1054,
        "chapter": 7,
        "verse": 101,
        "arabic_text": "تِلۡكَ ٱلۡقُرَىٰ نَقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآئِهَاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ مِن قَبۡلُۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلۡكَٰفِرِينَ",
        "phonetic": "7.101 Tilka Al-Qurá Naquşşu `Alayka Min 'Anbā'ihā Wa Laqad Jā'at/hum Rusuluhum Bil-Bayyināti Famā Kānū Liyu'uminū Bimā Kadhabū Min Qablu Kadhālika Yaţba`u Allāhu `Alá Qulūbi Al-Kāfirīna",
        "footnotes": {
            "english_saheeh": "[388]- i.e., they persistently denied every warning given them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those cities - We relate to you, [O Muḥammad], some of their news. And certainly did their messengers come to them with clear proofs, but they were not to believe in that which they had denied before.[388] Thus does Allāh seal over the hearts of the disbelievers.",
            "english_hilali_khan": "Those were the towns whose story We relate unto you (O Muhammad صلى الله عليه وسلم). And there came indeed to them their Messengers with clear proofs, but they were not such as to believe in that which they had rejected before. Thus Allâh does seal up the hearts of the disbelievers (from every kind of religious guidance).",
            "english_rwwad": "These are the towns, some of whose stories We relate to you. Their messengers came to them with clear proofs, but they were not about to believe in what they had already rejected. This is how Allah seals up the hearts of the disbelievers."
        }
    },
    {
        "id": 1055,
        "chapter": 7,
        "verse": 102,
        "arabic_text": "وَمَا وَجَدۡنَا لِأَكۡثَرِهِم مِّنۡ عَهۡدٖۖ وَإِن وَجَدۡنَآ أَكۡثَرَهُمۡ لَفَٰسِقِينَ",
        "phonetic": "7.102 Wa Mā Wajadnā Li'ktharihim Min `Ahdin Wa 'In Wajadnā 'Aktharahum Lafāsiqīna",
        "footnotes": {
            "english_saheeh": "[389]- i.e., they were found to be unfaithful and negligent of Allāh's covenant.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We did not find for most of them any covenant;[389] but indeed, We found most of them defiantly disobedient.",
            "english_hilali_khan": "And most of them We found not true to their covenant, but most of them We found indeed Fâsiqûn (rebellious, disobedient to Allâh).",
            "english_rwwad": "We did not find most of them committed to their covenant; rather We found most of them rebellious."
        }
    },
    {
        "id": 1056,
        "chapter": 7,
        "verse": 103,
        "arabic_text": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ بِـَٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَظَلَمُواْ بِهَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ",
        "phonetic": "7.103 Thumma Ba`athnā Min Ba`dihim Mūsá Bi'āyātinā 'Ilá Fir`awna Wa Mala'ihi Fažalamū Bihā Fānžur Kayfa Kāna `Āqibatu Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "[390]- i.e., they rejected and opposed the signs.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then We sent after them Moses with Our signs to Pharaoh and his establishment, but they were unjust toward them.[390] So see how was the end of the corrupters.",
            "english_hilali_khan": "Then after them We sent Mûsâ (Moses) with Our Signs to Fir‘aun (Pharaoh) and his chiefs, but they wrongfully rejected them. So see how was the end of the Mufsidûn (mischief-makers, corrupters).",
            "english_rwwad": "Then We sent after them Moses with Our signs to Pharaoh and his chiefs, but they wrongfully rejected them. See how was the end of those who spread corruption."
        }
    },
    {
        "id": 1057,
        "chapter": 7,
        "verse": 104,
        "arabic_text": "وَقَالَ مُوسَىٰ يَٰفِرۡعَوۡنُ إِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "7.104 Wa Qāla Mūsá Yā Fir`awnu 'Innī Rasūlun Min Rabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Moses said, \"O Pharaoh, I am a messenger from the Lord of the worlds",
            "english_hilali_khan": "And Mûsâ (Moses) said: \"O Fir‘aun (Pharaoh)! Verily, I am a Messenger from the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "Moses said, “O Pharaoh, I am a messenger from the Lord of the worlds."
        }
    },
    {
        "id": 1058,
        "chapter": 7,
        "verse": 105,
        "arabic_text": "حَقِيقٌ عَلَىٰٓ أَن لَّآ أَقُولَ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ قَدۡ جِئۡتُكُم بِبَيِّنَةٖ مِّن رَّبِّكُمۡ فَأَرۡسِلۡ مَعِيَ بَنِيٓ إِسۡرَٰٓءِيلَ",
        "phonetic": "7.105 Ĥaqīqun `Alá 'An Lā 'Aqūla `Alá Allāhi 'Illā Al-Ĥaqqa Qad Ji'tukum Bibayyinatin Min Rabbikum Fa'arsil Ma`ī Banī 'Isrā'īla",
        "footnotes": {
            "english_saheeh": "[391]- i.e., free them from oppression and allow them to emigrate.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Who is] obligated not to say about Allāh except the truth. I have come to you with clear evidence from your Lord, so send with me the Children of Israel.\"[391]",
            "english_hilali_khan": "\"Proper it is for me that I say nothing concerning Allâh but the truth. Indeed I have come unto you from your Lord with a clear proof. So let the Children of Israel depart along with me.\"",
            "english_rwwad": "I am obliged to say nothing concerning Allah except the truth. I have come to you with a clear proof from your Lord, so let the Children of Israel go with me.”"
        }
    },
    {
        "id": 1059,
        "chapter": 7,
        "verse": 106,
        "arabic_text": "قَالَ إِن كُنتَ جِئۡتَ بِـَٔايَةٖ فَأۡتِ بِهَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ",
        "phonetic": "7.106 Qāla 'In Kunta Ji'ta Bi'āyatin Fa'ti Bihā 'In Kunta Mina Aş-Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Pharaoh] said, \"If you have come with a sign, then bring it forth, if you should be of the truthful.\"",
            "english_hilali_khan": "[Fir‘aun (Pharaoh)] said: \"If you have come with a sign, show it forth, if you are one of those who tell the truth.\"",
            "english_rwwad": "Pharaoh said, “If you have brought a sign, then bring it forth if you are truthful.”"
        }
    },
    {
        "id": 1060,
        "chapter": 7,
        "verse": 107,
        "arabic_text": "فَأَلۡقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعۡبَانٞ مُّبِينٞ",
        "phonetic": "7.107 Fa'alqá `Aşāhu Fa'idhā Hiya Thu`bānun Mubīnun",
        "footnotes": {
            "english_saheeh": "[392]- i.e., genuine and not imagined, as a miracle from Allāh.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So he [i.e., Moses] threw his staff, and suddenly it was a serpent, manifest.[392]",
            "english_hilali_khan": "Then [Mûsâ (Moses)] threw his stick and behold! it was a serpent, manifest!",
            "english_rwwad": "So he threw his staff, and it suddenly became a real serpent."
        }
    },
    {
        "id": 1061,
        "chapter": 7,
        "verse": 108,
        "arabic_text": "وَنَزَعَ يَدَهُۥ فَإِذَا هِيَ بَيۡضَآءُ لِلنَّٰظِرِينَ",
        "phonetic": "7.108 Wa Naza`a Yadahu Fa'idhā Hiya Bayđā'u Lilnnāžirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And he drew out his hand; thereupon it was white [with radiance] for the observers.",
            "english_hilali_khan": "And he drew out his hand, and behold! it was white (with radiance) for the beholders.",
            "english_rwwad": "And he drew out his hand, and it was shining white to the beholders."
        }
    },
    {
        "id": 1062,
        "chapter": 7,
        "verse": 109,
        "arabic_text": "قَالَ ٱلۡمَلَأُ مِن قَوۡمِ فِرۡعَوۡنَ إِنَّ هَٰذَا لَسَٰحِرٌ عَلِيمٞ",
        "phonetic": "7.109 Qāla Al-Mala'u Min Qawmi Fir`awna 'Inna Hādhā Lasāĥirun `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said the eminent among the people of Pharaoh, \"Indeed, this is a learned magician",
            "english_hilali_khan": "The chiefs of the people of Fir‘aun (Pharaoh) said: \"This is indeed a well-versed sorcerer;",
            "english_rwwad": "The chiefs among Pharaoh’s people said, “This is indeed a learned magician!"
        }
    },
    {
        "id": 1063,
        "chapter": 7,
        "verse": 110,
        "arabic_text": "يُرِيدُ أَن يُخۡرِجَكُم مِّنۡ أَرۡضِكُمۡۖ فَمَاذَا تَأۡمُرُونَ",
        "phonetic": "7.110 Yurīdu 'An Yukhrijakum Min 'Arđikum Famādhā Ta'murūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who wants to expel you from your land [through magic], so what do you instruct?\"",
            "english_hilali_khan": "\"He wants to get you out of your land, so what do you advise?\"",
            "english_rwwad": "He seeks to drive you out of your land. [Pharaoh said], “So what do you advise?”"
        }
    },
    {
        "id": 1064,
        "chapter": 7,
        "verse": 111,
        "arabic_text": "قَالُوٓاْ أَرۡجِهۡ وَأَخَاهُ وَأَرۡسِلۡ فِي ٱلۡمَدَآئِنِ حَٰشِرِينَ",
        "phonetic": "7.111 Qālū 'Arjihi Wa 'Akhāhu Wa 'Arsil Fī Al-Madā'ini Ĥāshirīna",
        "footnotes": {
            "english_saheeh": "[393]- After mutual consultation and agreement.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said,[393] \"Postpone [the matter of] him and his brother and send among the cities gatherers",
            "english_hilali_khan": "They said: \"Put him and his brother off (for a time), and send callers to the cities to collect -",
            "english_rwwad": "They said, “let him and his brother wait for a while, and send heralds to the cities"
        }
    },
    {
        "id": 1065,
        "chapter": 7,
        "verse": 112,
        "arabic_text": "يَأۡتُوكَ بِكُلِّ سَٰحِرٍ عَلِيمٖ",
        "phonetic": "7.112 Ya'tūka Bikulli Sāĥirin `Alīmin",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Who will bring you every learned magician.\"",
            "english_hilali_khan": "\"That they bring up to you all well-versed sorcerers.\"",
            "english_rwwad": "to bring you every learned magician.”"
        }
    },
    {
        "id": 1066,
        "chapter": 7,
        "verse": 113,
        "arabic_text": "وَجَآءَ ٱلسَّحَرَةُ فِرۡعَوۡنَ قَالُوٓاْ إِنَّ لَنَا لَأَجۡرًا إِن كُنَّا نَحۡنُ ٱلۡغَٰلِبِينَ",
        "phonetic": "7.113 Wa Jā'a As-Saĥaratu Fir`awna Qālū 'Inna Lanā La'ajrāan 'In Kunnā Naĥnu Al-Ghālibīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the magicians came to Pharaoh. They said, \"Indeed for us is a reward if we are the predominant.\"",
            "english_hilali_khan": "And so the sorcerers came to Fir‘aun (Pharaoh). They said: \"Indeed there will be a (good) reward for us if we are the victors.\"",
            "english_rwwad": "The magicians came to Pharaoh and said, “Will we have a reward if we prevail?”"
        }
    },
    {
        "id": 1067,
        "chapter": 7,
        "verse": 114,
        "arabic_text": "قَالَ نَعَمۡ وَإِنَّكُمۡ لَمِنَ ٱلۡمُقَرَّبِينَ",
        "phonetic": "7.114 Qāla Na`am Wa 'Innakum Lamina Al-Muqarrabīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Yes, and, [moreover], you will be among those made near [to me].\"",
            "english_hilali_khan": "He said: \"Yes, and moreover you will (in that case) be of the nearest (to me).\"",
            "english_rwwad": "He said, “Yes, and you will surely be of those who are close to me.”"
        }
    },
    {
        "id": 1068,
        "chapter": 7,
        "verse": 115,
        "arabic_text": "قَالُواْ يَٰمُوسَىٰٓ إِمَّآ أَن تُلۡقِيَ وَإِمَّآ أَن نَّكُونَ نَحۡنُ ٱلۡمُلۡقِينَ",
        "phonetic": "7.115 Qālū Yā Mūsá 'Immā 'An Tulqiya Wa 'Immā 'An Nakūna Naĥnu Al-Mulqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"O Moses, either you throw [your staff], or we will be the ones to throw [first].\"",
            "english_hilali_khan": "They said: \"O Mûsâ (Moses)! Either you throw (first), or shall we have the (first) throw?\"",
            "english_rwwad": "They said, “O Moses, will you throw first or will we be the first to throw?”"
        }
    },
    {
        "id": 1069,
        "chapter": 7,
        "verse": 116,
        "arabic_text": "قَالَ أَلۡقُواْۖ فَلَمَّآ أَلۡقَوۡاْ سَحَرُوٓاْ أَعۡيُنَ ٱلنَّاسِ وَٱسۡتَرۡهَبُوهُمۡ وَجَآءُو بِسِحۡرٍ عَظِيمٖ",
        "phonetic": "7.116 Qāla 'Alqū Falammā 'Alqaw Saĥarū 'A`yuna An-Nāsi Wa Astarhabūhum Wa Jā'ū Bisiĥrin `Ažīmin",
        "footnotes": {
            "english_saheeh": "[394]- Their staffs and ropes appeared as writhing snakes.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Throw,\" and when they threw, they bewitched the eyes of the people and struck terror into them, and they presented a great [feat of] magic.[394]",
            "english_hilali_khan": "He [Mûsâ (Moses)] said: \"Throw you (first).\" So when they threw, they bewitched the eyes of the people, and struck terror into them, and they displayed a great magic.",
            "english_rwwad": "He said, “You throw first.” So when they threw, they enchanted the eyes of the people and struck terror into them, and produced a powerful magic."
        }
    },
    {
        "id": 1070,
        "chapter": 7,
        "verse": 117,
        "arabic_text": "۞ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ أَنۡ أَلۡقِ عَصَاكَۖ فَإِذَا هِيَ تَلۡقَفُ مَا يَأۡفِكُونَ",
        "phonetic": "7.117 Wa 'Awĥaynā 'Ilá Mūsá 'An 'Alqi `Aşāka Fa'idhā Hiya Talqafu Mā Ya'fikūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We inspired to Moses, \"Throw your staff,\" and at once it devoured what they were falsifying.",
            "english_hilali_khan": "And We revealed to Mûsâ (Moses) (saying): \"Throw your stick,\" and behold! It swallowed up straight away all the falsehoods which they showed.",
            "english_rwwad": "We inspired Moses, “Throw your staff,” and it suddenly swallowed up all their illusionary devices."
        }
    },
    {
        "id": 1071,
        "chapter": 7,
        "verse": 118,
        "arabic_text": "فَوَقَعَ ٱلۡحَقُّ وَبَطَلَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "7.118 Fawaqa`a Al-Ĥaqqu Wa Baţala Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So the truth was established, and abolished was what they were doing.",
            "english_hilali_khan": "Thus truth was confirmed, and all that they did was made of no effect.",
            "english_rwwad": "Thus the truth prevailed, and all what they did was proven to be false."
        }
    },
    {
        "id": 1072,
        "chapter": 7,
        "verse": 119,
        "arabic_text": "فَغُلِبُواْ هُنَالِكَ وَٱنقَلَبُواْ صَٰغِرِينَ",
        "phonetic": "7.119 Faghulibū Hunālika Wa Anqalabū Şāghirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they [i.e., Pharaoh and his people] were overcome right there and became debased.",
            "english_hilali_khan": "So they were defeated there and returned disgraced.",
            "english_rwwad": "They were defeated right there and were utterly humiliated."
        }
    },
    {
        "id": 1073,
        "chapter": 7,
        "verse": 120,
        "arabic_text": "وَأُلۡقِيَ ٱلسَّحَرَةُ سَٰجِدِينَ",
        "phonetic": "7.120 Wa 'Ulqiya As-Saĥaratu Sājidīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the magicians fell down in prostration [to Allāh].",
            "english_hilali_khan": "And the sorcerers fell down prostrate.",
            "english_rwwad": "The magicians fell down in prostration,"
        }
    },
    {
        "id": 1074,
        "chapter": 7,
        "verse": 121,
        "arabic_text": "قَالُوٓاْ ءَامَنَّا بِرَبِّ ٱلۡعَٰلَمِينَ",
        "phonetic": "7.121 Qālū 'Āmannā Birabbi Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"We have believed in the Lord of the worlds,",
            "english_hilali_khan": "They said: \"We believe in the Lord of the ‘Âlamîn (mankind, jinn and all that exists).",
            "english_rwwad": "and said, “We believe in the Lord of the worlds,"
        }
    },
    {
        "id": 1075,
        "chapter": 7,
        "verse": 122,
        "arabic_text": "رَبِّ مُوسَىٰ وَهَٰرُونَ",
        "phonetic": "7.122 Rabbi Mūsá Wa Hārūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "The Lord of Moses and Aaron.\"",
            "english_hilali_khan": "\"The Lord of Mûsâ (Moses) and Hârûn (Aaron).\"",
            "english_rwwad": "the Lord of Moses and Aaron.”"
        }
    },
    {
        "id": 1076,
        "chapter": 7,
        "verse": 123,
        "arabic_text": "قَالَ فِرۡعَوۡنُ ءَامَنتُم بِهِۦ قَبۡلَ أَنۡ ءَاذَنَ لَكُمۡۖ إِنَّ هَٰذَا لَمَكۡرٞ مَّكَرۡتُمُوهُ فِي ٱلۡمَدِينَةِ لِتُخۡرِجُواْ مِنۡهَآ أَهۡلَهَاۖ فَسَوۡفَ تَعۡلَمُونَ",
        "phonetic": "7.123 Qāla Fir`awnu 'Āmantum Bihi Qabla 'An 'Ādhana Lakum 'Inna Hādhā Lamakrun Makartumūhu Fī Al-Madīnati Litukhrijū Minhā 'Ahlahā Fasawfa Ta`lamūna",
        "footnotes": {
            "english_saheeh": "[395]- i.e., in Moses, avoiding the mention of Allāh (subḥānahu wa taʿālā).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said Pharaoh, \"You believed in him[395] before I gave you permission. Indeed, this is a conspiracy which you conspired in the city to expel therefrom its people. But you are going to know.",
            "english_hilali_khan": "Fir‘aun (Pharaoh) said: \"You have believed in him [Mûsâ (Moses)] before I give you permission. Surely, this is a plot which you have plotted in the city to drive out its people, but you shall come to know.",
            "english_rwwad": "Pharaoh said, “How dare you believe in him before I give you permission! This is indeed a plot that you devised in the city to drive out its people, but you will soon come to know."
        }
    },
    {
        "id": 1077,
        "chapter": 7,
        "verse": 124,
        "arabic_text": "لَأُقَطِّعَنَّ أَيۡدِيَكُمۡ وَأَرۡجُلَكُم مِّنۡ خِلَٰفٖ ثُمَّ لَأُصَلِّبَنَّكُمۡ أَجۡمَعِينَ",
        "phonetic": "7.124 La'uqaţţi`anna 'Aydiyakum Wa 'Arjulakum Min Khilāfin Thumma La'uşallibannakum 'Ajma`īna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I will surely cut off your hands and your feet on opposite sides; then I will surely crucify you all.\"",
            "english_hilali_khan": "\"Surely, I will cut off your hands and your feet from opposite sides, then I will crucify you all.\"",
            "english_rwwad": "I will surely cut off your hands and feet on opposite sides, then I will crucify you all together.”"
        }
    },
    {
        "id": 1078,
        "chapter": 7,
        "verse": 125,
        "arabic_text": "قَالُوٓاْ إِنَّآ إِلَىٰ رَبِّنَا مُنقَلِبُونَ",
        "phonetic": "7.125 Qālū 'Innā 'Ilá Rabbinā Munqalibūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"Indeed, to our Lord we will return.",
            "english_hilali_khan": "They said: \"Verily, we are returning to our Lord.",
            "english_rwwad": "They said, “We are surely returning to our Lord."
        }
    },
    {
        "id": 1079,
        "chapter": 7,
        "verse": 126,
        "arabic_text": "وَمَا تَنقِمُ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِـَٔايَٰتِ رَبِّنَا لَمَّا جَآءَتۡنَاۚ رَبَّنَآ أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا وَتَوَفَّنَا مُسۡلِمِينَ",
        "phonetic": "7.126 Wa Mā Tanqimu Minnā 'Illā 'An 'Āmannā Bi'āyāti Rabbinā Lammā Jā'atnā Rabbanā 'Afrigh `Alaynā Şabrāan Wa Tawaffanā Muslimīna",
        "footnotes": {
            "english_saheeh": "[396]- To endure the torture to which we will be subjected.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And you do not resent us except because we believed in the signs of our Lord when they came to us. Our Lord, pour upon us patience[396] and let us die as Muslims [in submission to You].\"",
            "english_hilali_khan": "\"And you take vengeance on us only because we believed in the Ayât (proofs, evidence, lessons, signs, etc.) of our Lord when they reached us! Our Lord! pour out on us patience, and cause us to die as Muslims.\"",
            "english_rwwad": "Your only vengeance against us is because we believed in the signs of our Lord when they came to us. Our Lord, shower upon us patience and let us die as Muslims, submitting to You.”"
        }
    },
    {
        "id": 1080,
        "chapter": 7,
        "verse": 127,
        "arabic_text": "وَقَالَ ٱلۡمَلَأُ مِن قَوۡمِ فِرۡعَوۡنَ أَتَذَرُ مُوسَىٰ وَقَوۡمَهُۥ لِيُفۡسِدُواْ فِي ٱلۡأَرۡضِ وَيَذَرَكَ وَءَالِهَتَكَۚ قَالَ سَنُقَتِّلُ أَبۡنَآءَهُمۡ وَنَسۡتَحۡيِۦ نِسَآءَهُمۡ وَإِنَّا فَوۡقَهُمۡ قَٰهِرُونَ",
        "phonetic": "7.127 Wa Qāla Al-Mala'u Min Qawmi Fir`awna 'Atadharu Mūsá Wa Qawmahu Liyufsidū Fī Al-'Arđi Wa Yadharaka Wa 'Ālihataka Qāla Sanuqattilu 'Abnā'ahum Wa Nastaĥyī Nisā'ahum Wa 'Innā Fawqahum Qāhirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the eminent among the people of Pharaoh said, \"Will you leave Moses and his people to cause corruption in the land and abandon you and your gods?\" [Pharaoh] said, \"We will kill their sons and keep their women alive; and indeed, we are subjugators over them.\"",
            "english_hilali_khan": "The chiefs of Fir‘aun’s (Pharaoh) people said: \"Will you leave Mûsâ (Moses) and his people to spread mischief in the land, and to abandon you and your gods?\" He said: \"We will kill their sons, and let live their women, and we have indeed irresistible power over them.\"",
            "english_rwwad": "The chiefs among Pharaoh’s people said, “Will you leave Moses and his people to spread corruption in the land, and abandon you and your gods?” He said, “We will kill their sons and spare their women, for we have full dominance over them.”"
        }
    },
    {
        "id": 1081,
        "chapter": 7,
        "verse": 128,
        "arabic_text": "قَالَ مُوسَىٰ لِقَوۡمِهِ ٱسۡتَعِينُواْ بِٱللَّهِ وَٱصۡبِرُوٓاْۖ إِنَّ ٱلۡأَرۡضَ لِلَّهِ يُورِثُهَا مَن يَشَآءُ مِنۡ عِبَادِهِۦۖ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ",
        "phonetic": "7.128 Qāla Mūsá Liqawmihi Asta`īnū Billāhi Wa Aşbirū 'Inna Al-'Arđa Lillāhi Yūrithuhā Man Yashā'u Min `Ibādihi Wa Al-`Āqibatu Lilmuttaqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Said Moses to his people, \"Seek help through Allāh and be patient. Indeed, the earth belongs to Allāh. He causes to inherit it whom He wills of His servants. And the [best] outcome is for the righteous.\"",
            "english_hilali_khan": "Mûsâ (Moses) said to his people: \"Seek help in Allâh and be patient. Verily, the earth is Allâh’s. He gives it as a heritage to whom He wills of His slaves; and the (blessed) end is for the Muttaqûn (the pious - see V.2:2).\"",
            "english_rwwad": "Moses said to his people, “Seek help from Allah and be patient. The earth belongs to Allah; He gives it as an inheritance to whom He wills of His slaves, but the outcome is for those who fear Allah.”"
        }
    },
    {
        "id": 1082,
        "chapter": 7,
        "verse": 129,
        "arabic_text": "قَالُوٓاْ أُوذِينَا مِن قَبۡلِ أَن تَأۡتِيَنَا وَمِنۢ بَعۡدِ مَا جِئۡتَنَاۚ قَالَ عَسَىٰ رَبُّكُمۡ أَن يُهۡلِكَ عَدُوَّكُمۡ وَيَسۡتَخۡلِفَكُمۡ فِي ٱلۡأَرۡضِ فَيَنظُرَ كَيۡفَ تَعۡمَلُونَ",
        "phonetic": "7.129 Qālū 'Ūdhīnā Min Qabli 'An Ta'tiyanā Wa Min Ba`di Mā Ji'tanā Qāla `Asá Rabbukum 'An Yuhlika `Adūwakum Wa Yastakhlifakum Fī Al-'Arđi Fayanžura Kayfa Ta`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They said, \"We have been harmed before you came to us and after you have come to us.\" He said, \"Perhaps your Lord will destroy your enemy and grant you succession in the land and see how you will do.\"",
            "english_hilali_khan": "They said: \"We (Children of Israel) had suffered troubles before you came to us, and since you have come to us.\" He said: \"It may be that your Lord will destroy your enemy and make you successors on the earth, so that He may see how you act?\"",
            "english_rwwad": "They said, “We were oppressed before you came to us and after you came.” He said, “It may be that your Lord will destroy your enemy and make you successors in the land to see how you will do.”"
        }
    },
    {
        "id": 1083,
        "chapter": 7,
        "verse": 130,
        "arabic_text": "وَلَقَدۡ أَخَذۡنَآ ءَالَ فِرۡعَوۡنَ بِٱلسِّنِينَ وَنَقۡصٖ مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَذَّكَّرُونَ",
        "phonetic": "7.130 Wa Laqad 'Akhadhnā 'Āla Fir`awna Bis-Sinīna Wa Naqşin Mina Ath-Thamarāti La`allahum Yadhakkarūna",
        "footnotes": {
            "english_saheeh": "[397]- Imposed on them by way of trial and warning.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We certainly seized[397] the people of Pharaoh with years of famine and a deficiency in fruits that perhaps they would be reminded.",
            "english_hilali_khan": "And indeed We punished the people of Fir‘aun (Pharaoh) with years of drought and shortness of fruits (crops), that they might remember (take heed).",
            "english_rwwad": "We afflicted the people of Pharaoh with famine and poor harvest, so that they may take heed."
        }
    },
    {
        "id": 1084,
        "chapter": 7,
        "verse": 131,
        "arabic_text": "فَإِذَا جَآءَتۡهُمُ ٱلۡحَسَنَةُ قَالُواْ لَنَا هَٰذِهِۦۖ وَإِن تُصِبۡهُمۡ سَيِّئَةٞ يَطَّيَّرُواْ بِمُوسَىٰ وَمَن مَّعَهُۥٓۗ أَلَآ إِنَّمَا طَٰٓئِرُهُمۡ عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ",
        "phonetic": "7.131 Fa'idhā Jā'at/humu Al-Ĥasanatu Qālū Lanā Hadhihi Wa 'In Tuşibhum Sayyi'atun Yaţţayyarū Bimūsá Wa Man Ma`ahu 'Alā 'Innamā Ţā'iruhum `Inda Allāhi Wa Lakinna 'Aktharahum Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when good [i.e., provision] came to them, they said, \"This is ours [by right].\" And if a bad [condition] struck them, they saw an evil omen in Moses and those with him. Unquestionably, their fortune is with Allāh, but most of them do not know.",
            "english_hilali_khan": "But whenever good came to them, they said: \"Ours is this.\" And if evil afflicted them, they ascribed it to evil omens connected with Mûsâ (Moses) and those with him. Be informed! Verily, their evil omens are with Allâh but most of them know not.",
            "english_rwwad": "When prosperity came their way, they said, “This is what we deserve,” but when adversity befell them, they ascribed it to the misfortune of Moses and those who were with him. Indeed, their misfortune is decreed by Allah, but most of them do not know."
        }
    },
    {
        "id": 1085,
        "chapter": 7,
        "verse": 132,
        "arabic_text": "وَقَالُواْ مَهۡمَا تَأۡتِنَا بِهِۦ مِنۡ ءَايَةٖ لِّتَسۡحَرَنَا بِهَا فَمَا نَحۡنُ لَكَ بِمُؤۡمِنِينَ",
        "phonetic": "7.132 Wa Qālū Mahmā Ta'tinā Bihi Min 'Āyatin Litasĥaranā Bihā Famā Naĥnu Laka Bimu'uminīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they said, \"No matter what sign you bring us with which to bewitch us, we will not be believers in you.\"",
            "english_hilali_khan": "They said [to Mûsâ (Moses)]: \"Whatever Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) you may bring to us, to work therewith your sorcery on us, we shall never believe in you.\"",
            "english_rwwad": "They said, “No matter what sign you may bring to enchant us, we are not going to believe in you.”"
        }
    },
    {
        "id": 1086,
        "chapter": 7,
        "verse": 133,
        "arabic_text": "فَأَرۡسَلۡنَا عَلَيۡهِمُ ٱلطُّوفَانَ وَٱلۡجَرَادَ وَٱلۡقُمَّلَ وَٱلضَّفَادِعَ وَٱلدَّمَ ءَايَٰتٖ مُّفَصَّلَٰتٖ فَٱسۡتَكۡبَرُواْ وَكَانُواْ قَوۡمٗا مُّجۡرِمِينَ",
        "phonetic": "7.133 Fa'arsalnā `Alayhimu Aţ-Ţūfāna Wa Al-Jarāda Wa Al-Qummala Wa Ađ-Đafādi`a Wa Ad-Dama 'Āyātin Mufaşşalātin Fāstakbarū Wa Kānū Qawmāan Mujrimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We sent upon them the flood and locusts and lice and frogs and blood as distinct signs, but they were arrogant and were a criminal people.",
            "english_hilali_khan": "So We sent on them: the flood, the locusts, the lice, the frogs, and the blood (as a succession of) manifest signs, yet they remained arrogant, and they were of those people who were Mujrimûn (criminals, polytheists, sinners).",
            "english_rwwad": "So We sent upon them flood, locusts, lice, frogs and blood – as clear signs, yet they persisted in arrogance and were a wicked people."
        }
    },
    {
        "id": 1087,
        "chapter": 7,
        "verse": 134,
        "arabic_text": "وَلَمَّا وَقَعَ عَلَيۡهِمُ ٱلرِّجۡزُ قَالُواْ يَٰمُوسَى ٱدۡعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَۖ لَئِن كَشَفۡتَ عَنَّا ٱلرِّجۡزَ لَنُؤۡمِنَنَّ لَكَ وَلَنُرۡسِلَنَّ مَعَكَ بَنِيٓ إِسۡرَٰٓءِيلَ",
        "phonetic": "7.134 Wa Lammā Waqa`a `Alayhimu Ar-Rijzu Qālū Yā Mūsá Ad`u Lanā Rabbaka Bimā `Ahida `Indaka La'in Kashafta `Annā Ar-Rijza Lanu'uminanna Laka Wa Lanursilanna Ma`aka Banī 'Isrā'īla",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when the punishment descended upon them, they said, \"O Moses, invoke for us your Lord by what He has promised you. If you [can] remove the punishment from us, we will surely believe you, and we will send with you the Children of Israel.\"",
            "english_hilali_khan": "And when the punishment fell on them they said: \"O Mûsâ (Moses)! Invoke your Lord for us because of His Promise to you. If you remove the punishment from us, we indeed shall believe in you, and we shall let the Children of Israel go with you.\"",
            "english_rwwad": "When a scourge befell them, they said, “O Moses, call upon your Lord for us by virtue of the covenant He has made to you; if you remove the scourge from us, we will surely believe in you and will let the Children of Israel go with you.”"
        }
    },
    {
        "id": 1088,
        "chapter": 7,
        "verse": 135,
        "arabic_text": "فَلَمَّا كَشَفۡنَا عَنۡهُمُ ٱلرِّجۡزَ إِلَىٰٓ أَجَلٍ هُم بَٰلِغُوهُ إِذَا هُمۡ يَنكُثُونَ",
        "phonetic": "7.135 Falammā Kashafnā `Anhumu Ar-Rijza 'Ilá 'Ajalin Hum Bālighūhu 'Idhā Hum Yankuthūna",
        "footnotes": {
            "english_saheeh": "[398]- i.e., a specified term which would end with their reversion to disobedience and disbelief.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when We removed the punishment from them until a term which they were to reach,[398] then at once they broke their word.",
            "english_hilali_khan": "But when We removed the punishment from them to a fixed term, which they had to reach, behold! they broke their word!",
            "english_rwwad": "But when We removed the scourge from them until an appointed term that they were bound to reach, they broke their promise."
        }
    },
    {
        "id": 1089,
        "chapter": 7,
        "verse": 136,
        "arabic_text": "فَٱنتَقَمۡنَا مِنۡهُمۡ فَأَغۡرَقۡنَٰهُمۡ فِي ٱلۡيَمِّ بِأَنَّهُمۡ كَذَّبُواْ بِـَٔايَٰتِنَا وَكَانُواْ عَنۡهَا غَٰفِلِينَ",
        "phonetic": "7.136 Fāntaqamnā Minhum Fa'aghraqnāhum Fī Al-Yammi Bi'annahum Kadhabū Bi'āyātinā Wa Kānū `Anhā Ghāfilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We took retribution from them, and We drowned them in the sea because they denied Our signs and were heedless of them.",
            "english_hilali_khan": "So We took retribution from them. We drowned them in the sea, because they belied Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and were heedless about them.",
            "english_rwwad": "So We subjected them to retribution, and drowned them in the sea because they rejected Our signs and were heedless of them."
        }
    },
    {
        "id": 1090,
        "chapter": 7,
        "verse": 137,
        "arabic_text": "وَأَوۡرَثۡنَا ٱلۡقَوۡمَ ٱلَّذِينَ كَانُواْ يُسۡتَضۡعَفُونَ مَشَٰرِقَ ٱلۡأَرۡضِ وَمَغَٰرِبَهَا ٱلَّتِي بَٰرَكۡنَا فِيهَاۖ وَتَمَّتۡ كَلِمَتُ رَبِّكَ ٱلۡحُسۡنَىٰ عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ بِمَا صَبَرُواْۖ وَدَمَّرۡنَا مَا كَانَ يَصۡنَعُ فِرۡعَوۡنُ وَقَوۡمُهُۥ وَمَا كَانُواْ يَعۡرِشُونَ",
        "phonetic": "7.137 Wa 'Awrathnā Al-Qawma Al-Ladhīna Kānū Yustađ`afūna Mashāriqa Al-'Arđi Wa Maghāribahā Allatī Bāraknā Fīhā Wa Tammat Kalimatu Rabbika Al-Ĥusná `Alá Banī 'Isrā'īla Bimā Şabarū Wa Dammarnā Mā Kāna Yaşna`u Fir`awnu Wa Qawmuhu Wa Mā Kānū Ya`rishūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We caused the people who had been oppressed to inherit the eastern regions of the land and the western ones, which We had blessed. And the good word [i.e., decree] of your Lord was fulfilled for the Children of Israel because of what they had patiently endured. And We destroyed [all] that Pharaoh and his people were producing and what they had been building.",
            "english_hilali_khan": "And We made the people who were considered weak to inherit the eastern parts of the land and the western parts thereof which We have blessed. And the fair Word of your Lord was fulfilled for the Children of Israel, because of their endurance. And We destroyed completely all the great works and buildings which Fir‘aun (Pharaoh) and his people erected.",
            "english_rwwad": "And We made the people who had been oppressed to inherit the lands of the east and west that We had blessed. The good word of your Lord was fulfilled for the Children of Israel because of what they endured patiently, and We destroyed what Pharaoh and his people used to make and what they used to construct."
        }
    },
    {
        "id": 1091,
        "chapter": 7,
        "verse": 138,
        "arabic_text": "وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتَوۡاْ عَلَىٰ قَوۡمٖ يَعۡكُفُونَ عَلَىٰٓ أَصۡنَامٖ لَّهُمۡۚ قَالُواْ يَٰمُوسَى ٱجۡعَل لَّنَآ إِلَٰهٗا كَمَا لَهُمۡ ءَالِهَةٞۚ قَالَ إِنَّكُمۡ قَوۡمٞ تَجۡهَلُونَ",
        "phonetic": "7.138 Wa Jāwaznā Bibanī 'Isrā'īla Al-Baĥra Fa'ataw `Alá Qawmin Ya`kufūna `Alá 'Aşnāmin Lahum Qālū Yā Mūsá Aj`al Lanā 'Ilahāan Kamā Lahum 'Ālihatun Qāla 'Innakum Qawmun Tajhalūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:138) Ilâh: Who has all the right to be worshipped.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We took the Children of Israel across the sea; then they came upon a people intent in devotion to [some] idols of theirs. They [the Children of Israel] said, \"O Moses, make for us a god just as they have gods.\" He said, \"Indeed, you are a people behaving ignorantly.",
            "english_hilali_khan": "And We brought the Children of Israel (with safety) across the sea, and they came upon a people devoted to some of their idols (in worship). They said: \"O Mûsâ (Moses)! Make for us an ilâh[1] (a god) as they have âlihah (gods).\" He said: \"Verily, you are a people who know not (the Majesty and Greatness of Allâh and what is obligatory upon you, i.e. to worship none but Allâh Alone, the One and the Only God of all that exists).\"",
            "english_rwwad": "We led the Children of Israel across the sea, then they came upon a people who were devoted to their idols. They said, “O Moses, make for us a god just as they have gods.” He said, “You are indeed an ignorant people."
        }
    },
    {
        "id": 1092,
        "chapter": 7,
        "verse": 139,
        "arabic_text": "إِنَّ هَٰٓؤُلَآءِ مُتَبَّرٞ مَّا هُمۡ فِيهِ وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "7.139 'Inna Hā'uulā' Mutabbarun Mā Hum Fīhi Wa Bāţilun Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those [worshippers] - destroyed is that in which they are [engaged], and worthless is whatever they were doing.\"",
            "english_hilali_khan": "[Mûsâ (Moses) added:] \"Verily, these people will be destroyed for that which they are engaged in (idols-worship). And all that they are doing is in vain.\"",
            "english_rwwad": "Indeed, what they follow is doomed to destruction and what they do is worthless.”"
        }
    },
    {
        "id": 1093,
        "chapter": 7,
        "verse": 140,
        "arabic_text": "قَالَ أَغَيۡرَ ٱللَّهِ أَبۡغِيكُمۡ إِلَٰهٗا وَهُوَ فَضَّلَكُمۡ عَلَى ٱلۡعَٰلَمِينَ",
        "phonetic": "7.140 Qāla 'Aghayra Allāhi 'Abghīkum 'Ilahāan Wa Huwa Fađđalakum `Alá Al-`Ālamīna",
        "footnotes": {
            "english_saheeh": "[399]- An object of worship.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "He said, \"Is it other than Allāh I should desire for you as a god[399] while He has preferred you over the worlds?\"",
            "english_hilali_khan": "He said: \"Shall I seek for you an Ilâh (a god) other than Allâh, while He has given you superiority over the ‘Âlamîn (mankind and jinn of your time).\"",
            "english_rwwad": "He said, “Shall I seek for you a god other than Allah, when He has favored you above the worlds?”"
        }
    },
    {
        "id": 1094,
        "chapter": 7,
        "verse": 141,
        "arabic_text": "وَإِذۡ أَنجَيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُقَتِّلُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ",
        "phonetic": "7.141 Wa 'Idh 'Anjaynākum Min 'Āli Fir`awna Yasūmūnakum Sū'a Al-`Adhābi Yuqattilūna 'Abnā'akum Wa Yastaĥyūna Nisā'akum Wa Fī Dhālikum Balā'un Min Rabbikum `Ažīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [recall, O Children of Israel], when We saved you from the people of Pharaoh, [who were] afflicting you with the worst torment - killing your sons and keeping your women alive. And in that was a great trial from your Lord.",
            "english_hilali_khan": "And (remember) when We rescued you from Fir‘aun’s (Pharaoh) people, who were afflicting you with the worst torment, killing your sons and letting your women live. And in that was a great trial from your Lord.",
            "english_rwwad": "And [remember] when We saved you from the people of Pharaoh, who were afflicting you with the worst punishment – killing your sons and sparing your women. That was a great trail from your Lord."
        }
    },
    {
        "id": 1095,
        "chapter": 7,
        "verse": 142,
        "arabic_text": "۞ وَوَٰعَدۡنَا مُوسَىٰ ثَلَٰثِينَ لَيۡلَةٗ وَأَتۡمَمۡنَٰهَا بِعَشۡرٖ فَتَمَّ مِيقَٰتُ رَبِّهِۦٓ أَرۡبَعِينَ لَيۡلَةٗۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَٰرُونَ ٱخۡلُفۡنِي فِي قَوۡمِي وَأَصۡلِحۡ وَلَا تَتَّبِعۡ سَبِيلَ ٱلۡمُفۡسِدِينَ",
        "phonetic": "7.142 Wa Wā`adnā Mūsá Thalāthīna Laylatan Wa 'Atmamnāhā Bi`ashrin Fatamma Mīqātu Rabbihi 'Arba`īna Laylatan Wa Qāla Mūsá Li'khīhi Hārūna Akhlufnī Fī Qawmī Wa 'Aşliĥ Wa Lā Tattabi` Sabīla Al-Mufsidīna",
        "footnotes": {
            "english_saheeh": "[400]- i.e., keep their affairs in order.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We made an appointment with Moses for thirty nights and perfected them by [the addition of] ten; so the term of his Lord was completed as forty nights. And Moses said to his brother Aaron, \"Take my place among my people, do right [by them],[400] and do not follow the way of the corrupters.\"",
            "english_hilali_khan": "And We appointed for Mûsâ (Moses) thirty nights and added (to the period) ten (more), and he completed the term, appointed by his Lord, of forty nights. And Mûsâ (Moses) said to his brother Hârûn (Aaron): \"Replace me among my people, act in the Right Way (by ordering the people to obey Allâh and to worship Him Alone) and follow not the way of the Mufsidûn (mischief-makers).\"",
            "english_rwwad": "We appointed for Moses thirty nights, and completed it with ten more, whereby the term of forty nights set by Allah was fulfilled. Moses said to his brother Aaron, “Take my place among my people in my absence, keep things right, and do not follow the way of those who spread corruption.”"
        }
    },
    {
        "id": 1096,
        "chapter": 7,
        "verse": 143,
        "arabic_text": "وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ٱلۡجَبَلِ فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلۡجَبَلِ جَعَلَهُۥ دَكّٗا وَخَرَّ مُوسَىٰ صَعِقٗاۚ فَلَمَّآ أَفَاقَ قَالَ سُبۡحَٰنَكَ تُبۡتُ إِلَيۡكَ وَأَنَا۠ أَوَّلُ ٱلۡمُؤۡمِنِينَ",
        "phonetic": "7.143 Wa Lammā Jā'a Mūsá Limīqātinā Wa Kallamahu Rabbuhu Qāla Rabbi 'Arinī 'Anžur 'Ilayka Qāla Lan Tarānī Wa Lakini Anžur 'Ilá Al-Jabali Fa'ini Astaqarra Makānahu Fasawfa Tarānī Falammā Tajallá Rabbuhu Liljabali Ja`alahu Dakkāan Wa Kharra Mūsá Şa`iqāan Falammā 'Afāqa Qāla Subĥānaka Tubtu 'Ilayka Wa 'Anā 'Awwalu Al-Mu'uminīna",
        "footnotes": {
            "english_saheeh": "[401]- That no one can see Allāh in this life.\n[402]- It crumbled to dust.\n[403]- This is a severe warning from Allāh against rebellion.",
            "english_hilali_khan": "(V.7:143) The appearance of Allâh جل جلاله to the mountain was very little of Him. It was approximately equal to the tip of one’s little finger as explained by the Prophet صلى الله عليه وسلم when he recited this Verse. (This hadîth is quoted by Tirmidhi).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Moses arrived at Our appointed time and his Lord spoke to him, he said, \"My Lord, show me [Yourself] that I may look at You.\" [Allāh] said, \"You will not see Me,[401] but look at the mountain; if it should remain in place, then you will see Me.\" But when his Lord appeared to the mountain, He rendered it level,[402] and Moses fell unconscious. And when he awoke, he said, \"Exalted are You! I have repented to You, and I am the first [among my people] of the believers.\"[403]",
            "english_hilali_khan": "And when Mûsâ (Moses) came at the time and place appointed by Us, and his Lord (Allah) spoke to him; he said: \"O my Lord! Show me (Yourself), that I may look upon You.\" Allâh said: \"You cannot see Me, but look upon the mountain; if it stands still in its place then you shall see Me.\" So when his Lord appeared to the mountain[2], He made it collapse to dust, and Mûsâ (Moses) fell down unconscious. Then when he recovered his senses he said: \"Glory be to You, I turn to You in repentance and I am the first of the believers.\"",
            "english_rwwad": "When Moses came at Our appointed time and his Lord spoke to him, he said, “My Lord, reveal Yourself to me so that I may look at You.” Allah said, “You will not be able to see Me. But look at the mountain; if it stays firm in its place, only then will you see Me.” When his Lord appeared to the mountain, it was leveled to dust and Moses fell unconscious. When he recovered, he said, “Glory be to You! I repent to You and I am the first of the believers.”"
        }
    },
    {
        "id": 1097,
        "chapter": 7,
        "verse": 144,
        "arabic_text": "قَالَ يَٰمُوسَىٰٓ إِنِّي ٱصۡطَفَيۡتُكَ عَلَى ٱلنَّاسِ بِرِسَٰلَٰتِي وَبِكَلَٰمِي فَخُذۡ مَآ ءَاتَيۡتُكَ وَكُن مِّنَ ٱلشَّٰكِرِينَ",
        "phonetic": "7.144 Qāla Yā Mūsá 'Innī Aşţafaytuka `Alá An-Nāsi Birisālātī Wa Bikalāmī Fakhudh Mā 'Ātaytuka Wa Kun Mina Ash-Shākirīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Allāh] said, \"O Moses, I have chosen you over the people with My messages and My words [to you]. So take what I have given you and be among the grateful.\"",
            "english_hilali_khan": "(Allâh) said: \"O Mûsâ (Moses) I have chosen you above men by My Messages, and by My speaking (to you). So hold that which I have given you and be of the grateful.\"",
            "english_rwwad": "He said, “O Moses, I have chosen you above other people, by giving you My messages and speaking to you. So hold fast to what I have given you, and be of those who are grateful.”"
        }
    },
    {
        "id": 1098,
        "chapter": 7,
        "verse": 145,
        "arabic_text": "وَكَتَبۡنَا لَهُۥ فِي ٱلۡأَلۡوَاحِ مِن كُلِّ شَيۡءٖ مَّوۡعِظَةٗ وَتَفۡصِيلٗا لِّكُلِّ شَيۡءٖ فَخُذۡهَا بِقُوَّةٖ وَأۡمُرۡ قَوۡمَكَ يَأۡخُذُواْ بِأَحۡسَنِهَاۚ سَأُوْرِيكُمۡ دَارَ ٱلۡفَٰسِقِينَ",
        "phonetic": "7.145 Wa Katabnā Lahu Fī Al-'Alwāĥi Min Kulli Shay'in Maw`ižatan Wa Tafşīlāan Likulli Shay'in Fakhudh/hā Biqūwatin Wa 'Mur Qawmaka Ya'khudhū Bi'aĥsanihā Sa'urīkum Dāra Al-Fāsiqīna",
        "footnotes": {
            "english_saheeh": "[404]- This is a severe warning from Allāh against rebellion.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We wrote for him on the tablets [something] of all things - instruction and explanation for all things, [saying], \"Take them with determination and order your people to take the best of it. I will show you the home of the defiantly disobedient.\"[404]",
            "english_hilali_khan": "And We wrote for him on the Tablets the lesson to be drawn from all things and the explanation for all things (and said): Hold unto these with firmness, and enjoin your people to take the better therein. I shall show you the home of Al-Fâsiqûn (the rebellious, disobedient to Allâh).",
            "english_rwwad": "We inscribed for him in the Tablets admonition of all things and explanation of everything. “Hold fast to them and ask your people to follow the best of it. I will show you the home of the rebellious."
        }
    },
    {
        "id": 1099,
        "chapter": 7,
        "verse": 146,
        "arabic_text": "سَأَصۡرِفُ عَنۡ ءَايَٰتِيَ ٱلَّذِينَ يَتَكَبَّرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَإِن يَرَوۡاْ كُلَّ ءَايَةٖ لَّا يُؤۡمِنُواْ بِهَا وَإِن يَرَوۡاْ سَبِيلَ ٱلرُّشۡدِ لَا يَتَّخِذُوهُ سَبِيلٗا وَإِن يَرَوۡاْ سَبِيلَ ٱلۡغَيِّ يَتَّخِذُوهُ سَبِيلٗاۚ ذَٰلِكَ بِأَنَّهُمۡ كَذَّبُواْ بِـَٔايَٰتِنَا وَكَانُواْ عَنۡهَا غَٰفِلِينَ",
        "phonetic": "7.146 Sa'aşrifu `An 'Āyātiya Al-Ladhīna Yatakabbarūna Fī Al-'Arđi Bighayri Al-Ĥaqqi Wa 'In Yaraw Kulla 'Āyatin Lā Yu'uminū Bihā Wa 'In Yaraw Sabīla Ar-Rushdi Lā Yattakhidhūhu Sabīlāan Wa 'In Yaraw Sabīla Al-Ghayyi Yattakhidhūhu Sabīlāan Dhālika Bi'annahum Kadhabū Bi'āyātinā Wa Kānū `Anhā Ghāfilīna",
        "footnotes": {
            "english_saheeh": "[405]- i.e., reason and integrity.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "I will turn away from My signs those who are arrogant upon the earth without right; and if they should see every sign, they will not believe in it. And if they see the way of consciousness,[405] they will not adopt it as a way; but if they see the way of error, they will adopt it as a way. That is because they have denied Our signs and they were heedless of them.",
            "english_hilali_khan": "I shall turn away from My Ayât (verses of the Qur’ân) those who behave arrogantly on the earth, without a right, and (even) if they see all the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), they will not believe in them. And if they see the way of righteousness (monotheism, piety, and good deeds), they will not adopt it as the Way, but if they see the way of error (polytheism, crimes and evil deeds), they will adopt that way, that is because they have rejected Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and were heedless (to learn a lesson) from them.",
            "english_rwwad": "I will turn away from My signs those who are arrogant in the land without any right. Even if they see every sign, they will still not believe in it; if they see the way of guidance, they will not follow it, but if they see the way of misguidance, they will follow it as their way. That is because they have rejected Our signs and were heedless of them."
        }
    },
    {
        "id": 1100,
        "chapter": 7,
        "verse": 147,
        "arabic_text": "وَٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا وَلِقَآءِ ٱلۡأٓخِرَةِ حَبِطَتۡ أَعۡمَٰلُهُمۡۚ هَلۡ يُجۡزَوۡنَ إِلَّا مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "7.147 Wa Al-Ladhīna Kadhabū Bi'āyātinā Wa Liqā'i Al-'Ākhirati Ĥabiţat 'A`māluhum Hal Yujzawna 'Illā Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who denied Our signs and the meeting of the Hereafter - their deeds have become worthless. Are they recompensed except for what they used to do?",
            "english_hilali_khan": "Those who deny Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) and the Meeting in the Hereafter (Day of Resurrection,), vain are their deeds. Are they requited with anything except what they used to do?",
            "english_rwwad": "Those who reject Our signs and the meeting of the Hereafter, their deeds will become worthless. Will they not be recompensed except for what they used to do?"
        }
    },
    {
        "id": 1101,
        "chapter": 7,
        "verse": 148,
        "arabic_text": "وَٱتَّخَذَ قَوۡمُ مُوسَىٰ مِنۢ بَعۡدِهِۦ مِنۡ حُلِيِّهِمۡ عِجۡلٗا جَسَدٗا لَّهُۥ خُوَارٌۚ أَلَمۡ يَرَوۡاْ أَنَّهُۥ لَا يُكَلِّمُهُمۡ وَلَا يَهۡدِيهِمۡ سَبِيلًاۘ ٱتَّخَذُوهُ وَكَانُواْ ظَٰلِمِينَ",
        "phonetic": "7.148 Wa Attakhadha Qawmu Mūsá Min Ba`dihi Min Ĥulīyihim `Ijlāan Jasadāan Lahu Khuwārun 'Alam Yaraw 'Annahu Lā Yukallimuhum Wa Lā Yahdīhim Sabīlāan Attakhadhūhu Wa Kānū Žālimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And the people of Moses made, after [his departure], from their ornaments a calf - an image having a lowing sound. Did they not see that it could neither speak to them nor guide them to a way? They took it [for worship], and they were wrongdoers.",
            "english_hilali_khan": "And the people of Mûsâ (Moses) made in his absence, out of their ornaments, the image of a calf (for worship). It had a sound (as if it was mooing). Did they not see that it could neither speak to them nor guide them to the way? They took it (for worship) and they were Zâlimûn (wrong-doers).",
            "english_rwwad": "In his absence, the people of Moses took for worship an image of calf made from their jewelry that made a lowing sound. Did they not see that it could neither speak to them nor could it guide them to any [straight] way? Yet they took it for worship and they were wrongdoers."
        }
    },
    {
        "id": 1102,
        "chapter": 7,
        "verse": 149,
        "arabic_text": "وَلَمَّا سُقِطَ فِيٓ أَيۡدِيهِمۡ وَرَأَوۡاْ أَنَّهُمۡ قَدۡ ضَلُّواْ قَالُواْ لَئِن لَّمۡ يَرۡحَمۡنَا رَبُّنَا وَيَغۡفِرۡ لَنَا لَنَكُونَنَّ مِنَ ٱلۡخَٰسِرِينَ",
        "phonetic": "7.149 Wa Lammā Suqiţa Fī 'Aydīhim Wa Ra'aw 'Annahum Qad Đallū Qālū La'in Lam Yarĥamnā Rabbunā Wa Yaghfir Lanā Lanakūnanna Mina Al-Khāsirīna",
        "footnotes": {
            "english_saheeh": "[406]- Literally, \"When their hands had been descended upon,\" i.e., bitten by them out of severe regret.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when regret overcame them[406] and they saw that they had gone astray, they said, \"If our Lord does not have mercy upon us and forgive us, we will surely be among the losers.\"",
            "english_hilali_khan": "And when they regretted and saw that they had gone astray, they (repented and) said: \"If our Lord have not mercy upon us and forgive us, we shall certainly be of the losers.\"",
            "english_rwwad": "When they became remorseful and realized that they had gone astray, they said, “If our Lord does not have mercy upon us and forgive us, we will certainly be among the losers.”"
        }
    },
    {
        "id": 1103,
        "chapter": 7,
        "verse": 150,
        "arabic_text": "وَلَمَّا رَجَعَ مُوسَىٰٓ إِلَىٰ قَوۡمِهِۦ غَضۡبَٰنَ أَسِفٗا قَالَ بِئۡسَمَا خَلَفۡتُمُونِي مِنۢ بَعۡدِيٓۖ أَعَجِلۡتُمۡ أَمۡرَ رَبِّكُمۡۖ وَأَلۡقَى ٱلۡأَلۡوَاحَ وَأَخَذَ بِرَأۡسِ أَخِيهِ يَجُرُّهُۥٓ إِلَيۡهِۚ قَالَ ٱبۡنَ أُمَّ إِنَّ ٱلۡقَوۡمَ ٱسۡتَضۡعَفُونِي وَكَادُواْ يَقۡتُلُونَنِي فَلَا تُشۡمِتۡ بِيَ ٱلۡأَعۡدَآءَ وَلَا تَجۡعَلۡنِي مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
        "phonetic": "7.150 Wa Lammā Raja`a Mūsá 'Ilá Qawmihi Ghađbāna 'Asifāan Qāla Bi'samā Khalaftumūnī Min Ba`dī 'A`ajiltum 'Amra Rabbikum Wa 'Alqá Al-'Alwāĥa Wa 'Akhadha Bira'si 'Akhīhi Yajurruhu 'Ilayhi Qāla Abna 'Umma 'Inna Al-Qawma Astađ`afūnī Wa Kādū Yaqtulūnanī Falā Tushmit Biya Al-'A`dā'a Wa Lā Taj`alnī Ma`a Al-Qawmi Až-Žālimīna",
        "footnotes": {
            "english_saheeh": "[407]- i.e., over your humiliation of me.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when Moses returned to his people, angry and grieved, he said, \"How wretched is that by which you have replaced me after [my departure]. Were you impatient over the matter of your Lord?\" And he threw down the tablets and seized his brother by [the hair of] his head, pulling him toward him. [Aaron] said, \"O son of my mother, indeed the people overpowered me and were about to kill me, so let not the enemies rejoice over me[407] and do not place me among the wrongdoing people.\"",
            "english_hilali_khan": "And when Mûsâ (Moses) returned to his people, angry and grieved, he said: \"What an evil thing is that which you have done (i.e. worshipping the calf) during my absence. Did you hasten and go ahead as regards the matter of your Lord (you left His worship)?\" And he threw down the Tablets and seized his brother by (the hair of) his head and dragged him towards him. Hârûn (Aaron) said: \"O son of my mother! Indeed the people judged me weak and were about to kill me, so make not the enemies rejoice over me, nor put me amongst the people who are Zâlimûn (wrong-doers).\"",
            "english_rwwad": "When Moses returned to his people, furious and grieved, he said, “What an evil thing you did in my absence! Did you seek to hasten the command of your Lord?” He threw the Tablets and grabbed his brother by the hair, dragging him towards himself. Aaron said, “O son of my mother, the people overpowered me and were about to kill me. Do not make my enemies rejoice over me, nor count me among the people of wrongdoing.”"
        }
    },
    {
        "id": 1104,
        "chapter": 7,
        "verse": 151,
        "arabic_text": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَلِأَخِي وَأَدۡخِلۡنَا فِي رَحۡمَتِكَۖ وَأَنتَ أَرۡحَمُ ٱلرَّٰحِمِينَ",
        "phonetic": "7.151 Qāla Rabbi Aghfir Lī Wa Li'akhī Wa 'Adkhilnā Fī Raĥmatika Wa 'Anta 'Arĥamu Ar-Rāĥimīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[Moses] said, \"My Lord, forgive me and my brother and admit us into Your mercy, for You are the most merciful of the merciful.\"",
            "english_hilali_khan": "Mûsâ (Moses) said: \"O my Lord! Forgive me and my brother, and admit us into Your Mercy, for you are the Most Merciful of those who show mercy.\"",
            "english_rwwad": "Moses said, “My Lord, forgive me and my brother, and admit us into Your mercy, for You are the Most Merciful of those who show mercy.”"
        }
    },
    {
        "id": 1105,
        "chapter": 7,
        "verse": 152,
        "arabic_text": "إِنَّ ٱلَّذِينَ ٱتَّخَذُواْ ٱلۡعِجۡلَ سَيَنَالُهُمۡ غَضَبٞ مِّن رَّبِّهِمۡ وَذِلَّةٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُفۡتَرِينَ",
        "phonetic": "7.152 'Inna Al-Ladhīna Attakhadhū Al-`Ijla Sayanāluhum Ghađabun Min Rabbihim Wa Dhillatun Fī Al-Ĥayāati Ad-Dunyā Wa Kadhalika Najzī Al-Muftarīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who took the calf [for worship] will obtain anger from their Lord and humiliation in the life of this world, and thus do We recompense the inventors [of falsehood].",
            "english_hilali_khan": "Certainly, those who took the calf (for worship), wrath from their Lord and humiliation will come upon them in the life of this world. Thus do We recompense those who invent lies.",
            "english_rwwad": "As for those who took the calf for worship, they will certainly be afflicted with wrath from their Lord and disgrace in the life of this world. This is how We recompense those who invent falsehood."
        }
    },
    {
        "id": 1106,
        "chapter": 7,
        "verse": 153,
        "arabic_text": "وَٱلَّذِينَ عَمِلُواْ ٱلسَّيِّـَٔاتِ ثُمَّ تَابُواْ مِنۢ بَعۡدِهَا وَءَامَنُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ",
        "phonetic": "7.153 Wa Al-Ladhīna `Amilū As-Sayyi'āti Thumma Tābū Min Ba`dihā Wa 'Āmanū 'Inna Rabbaka Min Ba`dihā Laghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who committed misdeeds and then repented after them and believed - indeed your Lord, thereafter, is Forgiving and Merciful.",
            "english_hilali_khan": "But those who committed evil deeds and then repented afterwards and believed, verily, your Lord after (all) that is indeed Oft-Forgiving, Most Merciful.",
            "english_rwwad": "But those who commit evil deeds, then repent thereafter and [truly] believe, then your Lord is indeed All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1107,
        "chapter": 7,
        "verse": 154,
        "arabic_text": "وَلَمَّا سَكَتَ عَن مُّوسَى ٱلۡغَضَبُ أَخَذَ ٱلۡأَلۡوَاحَۖ وَفِي نُسۡخَتِهَا هُدٗى وَرَحۡمَةٞ لِّلَّذِينَ هُمۡ لِرَبِّهِمۡ يَرۡهَبُونَ",
        "phonetic": "7.154 Wa Lammā Sakata `An Mūsá Al-Ghađabu 'Akhadha Al-'Alwāĥa Wa Fī Nuskhatihā Hudáan Wa Raĥmatun Lilladhīna Hum Lirabbihim Yarhabūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when the anger subsided in Moses, he took up the tablets; and in their inscription was guidance and mercy for those who are fearful of their Lord.",
            "english_hilali_khan": "And when the anger of Mûsâ (Moses) was calmed down, he took up the Tablets; and in their inscription was guidance and mercy for those who fear their Lord.",
            "english_rwwad": "When Moses’ fury calmed down, he picked up the Tablets; in their inscription there was guidance and mercy for those who fear their Lord."
        }
    },
    {
        "id": 1108,
        "chapter": 7,
        "verse": 155,
        "arabic_text": "وَٱخۡتَارَ مُوسَىٰ قَوۡمَهُۥ سَبۡعِينَ رَجُلٗا لِّمِيقَٰتِنَاۖ فَلَمَّآ أَخَذَتۡهُمُ ٱلرَّجۡفَةُ قَالَ رَبِّ لَوۡ شِئۡتَ أَهۡلَكۡتَهُم مِّن قَبۡلُ وَإِيَّٰيَۖ أَتُهۡلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآۖ إِنۡ هِيَ إِلَّا فِتۡنَتُكَ تُضِلُّ بِهَا مَن تَشَآءُ وَتَهۡدِي مَن تَشَآءُۖ أَنتَ وَلِيُّنَا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۖ وَأَنتَ خَيۡرُ ٱلۡغَٰفِرِينَ",
        "phonetic": "7.155 Wa Akhtāra Mūsá Qawmahu Sab`īna Rajulāan Limīqātinā Falammā 'Akhadhat/humu Ar-Rajfatu Qāla Rabbi Law Shi'ta 'Ahlaktahum Min Qablu Wa 'Īyāya 'Atuhlikunā Bimā Fa`ala As-Sufahā'u Minnā 'In Hiya 'Illā Fitnatuka Tuđillu Bihā Man Tashā'u Wa Tahdī Man Tashā'u 'Anta Walīyunā Fāghfir Lanā Wa Arĥamnā Wa 'Anta Khayru Al-Ghāfirīna",
        "footnotes": {
            "english_saheeh": "[408]- Whereupon they were to apologize to Allāh for having worshipped the calf.\n[409]- Upon reaching the appointed place, they said to Moses, \"We will not believe until we see Allāh outright.\"  So the mountain convulsed, killing them.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And Moses chose from his people seventy men for Our appointment.[408] And when the earthquake seized them,[409] he said, \"My Lord, if You had willed, You could have destroyed them before and me [as well]. Would You destroy us for what the foolish among us have done? This is not but Your trial by which You send astray whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us; and You are the best of forgivers.",
            "english_hilali_khan": "And Mûsâ (Moses) chose out of his people seventy (of the best) men for Our appointed time and place of meeting, and when they were seized with a violent earthquake, he said: \"O my Lord, if it had been Your Will, You could have destroyed them and me before; would You destroy us for the deeds of the foolish ones among us? It is only Your Trial by which You lead astray whom You will, and keep guided whom You will. You are our Walî (Protector), so forgive us and have Mercy on us: for You are the Best of those who forgive.",
            "english_rwwad": "Moses chose seventy men from among his people for Our appointment. When the earthquake seized them, he said, “My Lord, had it been Your will, You could have destroyed them earlier, and me too; will You destroy us for what the fools among us have done? This is not but a trial from You, by which You cause to stray whom you will and guide whom You will. You are our Guardian, so forgive us and have mercy upon us, for You are the Best of Forgivers."
        }
    },
    {
        "id": 1109,
        "chapter": 7,
        "verse": 156,
        "arabic_text": "۞ وَٱكۡتُبۡ لَنَا فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٗ وَفِي ٱلۡأٓخِرَةِ إِنَّا هُدۡنَآ إِلَيۡكَۚ قَالَ عَذَابِيٓ أُصِيبُ بِهِۦ مَنۡ أَشَآءُۖ وَرَحۡمَتِي وَسِعَتۡ كُلَّ شَيۡءٖۚ فَسَأَكۡتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَٱلَّذِينَ هُم بِـَٔايَٰتِنَا يُؤۡمِنُونَ",
        "phonetic": "7.156 Wa Aktub Lanā Fī Hadhihi Ad-Dunyā Ĥasanatan Wa Fī Al-'Ākhirati 'Innā Hudnā 'Ilayka Qāla `Adhābī 'Uşību Bihi Man 'Ashā'u Wa Raĥmatī Wasi`at Kulla Shay'in Fasa'aktubuhā Lilladhīna Yattaqūna Wa Yu'utūna Az-Zakāata Wa Al-Ladhīna Hum Bi'āyātinā Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And decree for us in this world [that which is] good and [also] in the Hereafter; indeed, we have turned back to You.\" [Allāh] said, \"My punishment - I afflict with it whom I will, but My mercy encompasses all things.\" So I will decree it [especially] for those who fear Me and give zakāh and those who believe in Our verses-",
            "english_hilali_khan": "\"And ordain for us good in this world, and in the Hereafter. Certainly we have turned unto You.\" He said: (As to) My punishment I afflict therewith whom I will and My Mercy embraces all things. That (Mercy) I shall ordain for those who are the Muttaqûn (the pious - See V.2:2), and give Zakât; and those who believe in Our Ayât (proofs, evidence, verses, lessons, signs and revelations, etc.);",
            "english_rwwad": "Ordain for us good in this life and in the Hereafter, for We have turned to You in repentance.” Allah said, “As for my punishment, I will afflict with it whom I will, but My mercy encompasses everything; I will ordain it for those who fear Me, and give zakah, and those who believe in Our verses,"
        }
    },
    {
        "id": 1110,
        "chapter": 7,
        "verse": 157,
        "arabic_text": "ٱلَّذِينَ يَتَّبِعُونَ ٱلرَّسُولَ ٱلنَّبِيَّ ٱلۡأُمِّيَّ ٱلَّذِي يَجِدُونَهُۥ مَكۡتُوبًا عِندَهُمۡ فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ يَأۡمُرُهُم بِٱلۡمَعۡرُوفِ وَيَنۡهَىٰهُمۡ عَنِ ٱلۡمُنكَرِ وَيُحِلُّ لَهُمُ ٱلطَّيِّبَٰتِ وَيُحَرِّمُ عَلَيۡهِمُ ٱلۡخَبَٰٓئِثَ وَيَضَعُ عَنۡهُمۡ إِصۡرَهُمۡ وَٱلۡأَغۡلَٰلَ ٱلَّتِي كَانَتۡ عَلَيۡهِمۡۚ فَٱلَّذِينَ ءَامَنُواْ بِهِۦ وَعَزَّرُوهُ وَنَصَرُوهُ وَٱتَّبَعُواْ ٱلنُّورَ ٱلَّذِيٓ أُنزِلَ مَعَهُۥٓ أُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
        "phonetic": "7.157 Al-Ladhīna Yattabi`ūna Ar-Rasūla An-Nabīya Al-'Ummīya Al-Ladhī Yajidūnahu Maktūbāan `Indahum Fī At-Tawrāati Wa Al-'Injīli Ya'muruhum Bil-Ma`rūfi Wa Yanhāhum `Ani Al-Munkari Wa Yuĥillu Lahumu Aţ-Ţayyibāti Wa Yuĥarrimu `Alayhimu Al-Khabā'itha Wa Yađa`u `Anhum 'Işrahum Wa Al-'Aghlāla Allatī Kānat `Alayhim Fa-Al-Ladhīna 'Āmanū Bihi Wa `Azzarūhu Wa Naşarūhu Wa Attaba`ū An-Nūra Al-Ladhī 'Unzila Ma`ahu 'Ūlā'ika Humu Al-Mufliĥūna",
        "footnotes": {
            "english_saheeh": "[410]- Difficulties in religious practice.\n[411]- i.e., extreme measures previously required for repentance, and retribution without recourse to compensation.",
            "english_hilali_khan": "[1] (V.7:157) There exists in the Taurât (Torah) and the Injeel (Gospel), even after the original text has been distorted, clear prophecies indicating the coming of Prophet Muhammad صلى الله عليه وسلم , e.g. Deut. 18: 18,21:21; Psl. 118:22-23; Isa. 42: 1-13; Hab.3:3-4; Matt. 21:42-43; Jn.14: 12-17, 26-28, 16: 7-14.\n[2] (V.7:157):\nA) \"O you who have been given the Scripture (Jews and Christians)! Believe in what We have revealed (to Muhammadصلى الله عليه وسلم) confirming what is (already) with you, before We efface faces [by making them (faces) like the backs of the necks; without nose, mouth and eyes], and turn them hindwards, or curse them as We cursed the Sabbath -breakers. And the Commandment of Allâh is always executed.\" (V.4:47).\nB) See (V.57:28), and its footnote.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Those who follow the Messenger, the unlettered prophet, whom they find written [i.e., described] in what they have of the Torah and the Gospel, who enjoins upon them what is right and prohibits them from what is wrong and makes lawful for them what is good and forbids them from what is evil and relieves them of their burden[410] and the shackles which were upon them.[411] So they who have believed in him, honored him, supported him and followed the light which was sent down with him - it is those who will be the successful.",
            "english_hilali_khan": "and the Injeel (Gospel) (John xiv, 16)[1], - he commands them for Al-Ma‘rûf (i.e. Islâmic Monotheism and all that Islâm has ordained); and forbids them from Al-Munkar (i.e. disbelief, polytheism of all kinds, and all that Islâm has forbidden); he allows them as lawful At-Tayyibât (i.e. all good and lawful as regards things, deeds, beliefs, persons, foods), and prohibits them as unlawful Al-Khabâ’ith (i.e. all evil and unlawful as regards things, deeds, beliefs, persons and foods), he releases them from their heavy burdens (of Allâh’s Covenant with the children of Israel), and from the fetters (bindings) that were upon them. So those who believe in him (Muhammad صلى الله عليه وسلم), honour him, help him, and follow the light (the Qur’ân) which has been sent down with him, it is they who will be successful[2].",
            "english_rwwad": "those who follow the Messenger – the unlettered Prophet – whose description they find in their Torah and the Gospel. He enjoins them to do what is good and forbids them from what is evil; he makes lawful for them what is pure and makes unlawful for them what is impure; he relieves them of their burden and the shackles that were on them. So those who believe in him, they honor and support him, and follow the light which is sent down with him – it is they who will be successful.”"
        }
    },
    {
        "id": 1111,
        "chapter": 7,
        "verse": 158,
        "arabic_text": "قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ إِنِّي رَسُولُ ٱللَّهِ إِلَيۡكُمۡ جَمِيعًا ٱلَّذِي لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ لَآ إِلَٰهَ إِلَّا هُوَ يُحۡيِۦ وَيُمِيتُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرَسُولِهِ ٱلنَّبِيِّ ٱلۡأُمِّيِّ ٱلَّذِي يُؤۡمِنُ بِٱللَّهِ وَكَلِمَٰتِهِۦ وَٱتَّبِعُوهُ لَعَلَّكُمۡ تَهۡتَدُونَ",
        "phonetic": "7.158 Qul Yā 'Ayyuhā An-Nāsu 'Innī Rasūlu Allāhi 'Ilaykum Jamī`āan Al-Ladhī Lahu Mulku As-Samāwāti Wa Al-'Arđi Lā 'Ilāha 'Illā Huwa Yuĥyī Wa Yumītu Fa'āminū Billāhi Wa Rasūlihi An-Nabīyi Al-'Ummīyi Al-Ladhī Yu'uminu Billāhi Wa Kalimātihi Wa Attabi`ūhu La`allakum Tahtadūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:158) See the footnote (A) of the (V.2:252).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"O mankind, indeed I am the Messenger of Allāh to you all, [from Him] to whom belongs the dominion of the heavens and the earth. There is no deity except Him; He gives life and causes death.\" So believe in Allāh and His Messenger, the unlettered prophet, who believes in Allāh and His words, and follow him that you may be guided.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"O mankind! Verily, I am sent to you all as the Messenger of Allâh - to Whom belongs the dominion of the heavens and the earth. Lâ ilâha illa Huwa (none has the right to be worshipped but He). It is He Who gives life and causes death. So believe in Allâh and His Messenger (Muhammad صلى الله عليه وسلم), the Prophet who can neither read nor write (i.e. Muhammad صلى الله عليه وسلم), who believes in Allâh and His Words [(this Qur’ân), the Taurât (Torah) and the Injeel (Gospel) and also Allâh’s Word: \"Be!\" - and he was, i.e. ‘Îsâ (Jesus) son of Maryam (Mary), عليهما السلام], and follow him so that you may be guided.[3]\"",
            "english_rwwad": "Say [O Prophet], “O people, I am the Messenger of Allah to you all. To Him belongs the dominion of the heavens and earth; none has the right to be worshiped except Him; He gives life and causes death.” So believe in Allah and His Messenger, the unlettered Prophet, who believes in Allah and His words, and follow him, so that you may be guided."
        }
    },
    {
        "id": 1112,
        "chapter": 7,
        "verse": 159,
        "arabic_text": "وَمِن قَوۡمِ مُوسَىٰٓ أُمَّةٞ يَهۡدُونَ بِٱلۡحَقِّ وَبِهِۦ يَعۡدِلُونَ",
        "phonetic": "7.159 Wa Min Qawmi Mūsá 'Ummatun Yahdūna Bil-Ĥaqqi Wa Bihi Ya`dilūna",
        "footnotes": {
            "english_saheeh": "[412]- Those of them who accepted and followed the final prophet, Muḥammad (ﷺ).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among the people of Moses is a community[412] which guides by truth and by it establishes justice.",
            "english_hilali_khan": "And of the people of Mûsâ (Moses) there is a community who lead (the men) with truth and establish justice therewith (i.e. judge among men with truth and justice).",
            "english_rwwad": "Among the people of Moses there is a community which guides others with truth and establish justice therewith."
        }
    },
    {
        "id": 1113,
        "chapter": 7,
        "verse": 160,
        "arabic_text": "وَقَطَّعۡنَٰهُمُ ٱثۡنَتَيۡ عَشۡرَةَ أَسۡبَاطًا أُمَمٗاۚ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسۡتَسۡقَىٰهُ قَوۡمُهُۥٓ أَنِ ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنۢبَجَسَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۚ وَظَلَّلۡنَا عَلَيۡهِمُ ٱلۡغَمَٰمَ وَأَنزَلۡنَا عَلَيۡهِمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ",
        "phonetic": "7.160 Wa Qaţţa`nāhumu Athnatay `Ashrata 'Asbāţāan 'Umamāan Wa 'Awĥaynā 'Ilá Mūsá 'Idh Astasqāhu Qawmuhu 'Ani Ađrib Bi`aşāka Al-Ĥajara Fānbajasat Minhu Athnatā `Ashrata `Aynāan Qad `Alima Kullu 'Unāsin Mashrabahum Wa Žallalnā `Alayhimu Al-Ghamāma Wa 'Anzalnā `Alayhimu Al-Manna Wa As-Salwá Kulū Min Ţayyibāti Mā Razaqnākum Wa Mā Žalamūnā Wa Lakin Kānū 'Anfusahum Yažlimūna",
        "footnotes": {
            "english_saheeh": "[413]- From the twelve sons of Jacob.",
            "english_hilali_khan": "(V.7:160) See the footnote of (V.2:57)",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We divided them into twelve descendant tribes[413] [as distinct] nations. And We inspired to Moses when his people implored him for water, \"Strike with your staff the stone,\" and there gushed forth from it twelve springs. Every people [i.e., tribe] knew its watering place. And We shaded them with clouds and sent down upon them manna and quails, [saying], \"Eat from the good things with which We have provided you.\" And they wronged Us not, but they were [only] wronging themselves.",
            "english_hilali_khan": "And We divided them into twelve tribes (as distinct) nations. We revealed to Mûsâ (Moses) when his people asked him for water (saying): \"Strike the stone with your stick\", and there gushed forth out of it twelve springs, each group knew its own place for water. We shaded them with the clouds and sent down upon them Al-Manna [1] and the quails (saying): \"Eat of the good things with which We have provided you.\" They harmed Us not but they used to harm themselves.",
            "english_rwwad": "We divided them into twelve tribes, each as a community, and We inspired Moses when his people asked him for water, “Strike the rock with your staff.” There gushed forth from it twelve springs; each tribe knew the place of its drinking. We shaded them with clouds and sent down to them manna and quails, “Eat of the good things We have provided for you.” They did not wrong Us, but it was themselves that they wronged."
        }
    },
    {
        "id": 1114,
        "chapter": 7,
        "verse": 161,
        "arabic_text": "وَإِذۡ قِيلَ لَهُمُ ٱسۡكُنُواْ هَٰذِهِ ٱلۡقَرۡيَةَ وَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ وَقُولُواْ حِطَّةٞ وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا نَّغۡفِرۡ لَكُمۡ خَطِيٓـَٰٔتِكُمۡۚ سَنَزِيدُ ٱلۡمُحۡسِنِينَ",
        "phonetic": "7.161 Wa 'Idh Qīla Lahumu Askunū Hadhihi Al-Qaryata Wa Kulū Minhā Ĥaythu Shi'tum Wa Qūlū Ĥiţţatun Wa Adkhulū Al-Bāba Sujjadāan Naghfir Lakum Khaţī'ātikum Sanazīdu Al-Muĥsinīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention, O Muḥammad], when it was said to them, \"Dwell in this city [i.e., Jerusalem] and eat from it wherever you will and say, 'Relieve us of our burdens [i.e., sins],' and enter the gate bowing humbly; We will [then] forgive you your sins. We will increase the doers of good [in goodness and reward].\"",
            "english_hilali_khan": "And (remember) when it was said to them: \"Dwell in this town (Jerusalem) and eat therefrom wherever you wish, and say, ‘(O Allâh) forgive our sins’; and enter the gate prostrate (bowing with humility). We shall forgive you your wrong-doings. We shall increase (the reward) for the good-doers.\"",
            "english_rwwad": "When it was said to them, “Live in this city [of Jerusalem], and eat from wherever you please, and say, ‘Absolve us,’ and enter the gate bowing with humility; We will forgive you your sins, and increase the reward of those who do good.”"
        }
    },
    {
        "id": 1115,
        "chapter": 7,
        "verse": 162,
        "arabic_text": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَظۡلِمُونَ",
        "phonetic": "7.162 Fabaddala Al-Ladhīna Žalamū Minhum Qawlāan Ghayra Al-Ladhī Qīla Lahum Fa'arsalnā `Alayhim Rijzāan Mina As-Samā'i Bimā Kānū Yažlimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:162): See (V.2:59) and its footnote.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who wronged among them changed [the words] to a statement other than that which had been said to them. So We sent upon them a punishment from the sky for the wrong that they were doing.",
            "english_hilali_khan": "But those among them who did wrong changed the word that had been told to them. So We sent on them a torment from the heaven in return for their wrong-doings.[2]",
            "english_rwwad": "But the wrongdoers among them altered the words to something other than what they were told; so We sent down upon them a scourge from the heaven for their wrongdoing."
        }
    },
    {
        "id": 1116,
        "chapter": 7,
        "verse": 163,
        "arabic_text": "وَسۡـَٔلۡهُمۡ عَنِ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَتۡ حَاضِرَةَ ٱلۡبَحۡرِ إِذۡ يَعۡدُونَ فِي ٱلسَّبۡتِ إِذۡ تَأۡتِيهِمۡ حِيتَانُهُمۡ يَوۡمَ سَبۡتِهِمۡ شُرَّعٗا وَيَوۡمَ لَا يَسۡبِتُونَ لَا تَأۡتِيهِمۡۚ كَذَٰلِكَ نَبۡلُوهُم بِمَا كَانُواْ يَفۡسُقُونَ",
        "phonetic": "7.163 Wa As'alhum `Ani Al-Qaryati Allatī Kānat Ĥāđirata Al-Baĥri 'Idh Ya`dūna Fī As-Sabti 'Idh Ta'tīhim Ĥītānuhum Yawma Sabtihim Shurra`āan Wa Yawma Lā Yasbitūna Lā Ta'tīhim Kadhālika Nablūhum Bimā Kānū Yafsuqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And ask them about the town that was by the sea - when they transgressed in [the matter of] the sabbath - when their fish came to them openly on their sabbath day, and the day they had no sabbath they did not come to them. Thus did We give them trial because they were defiantly disobedient.",
            "english_hilali_khan": "and its footnote].",
            "english_rwwad": "Ask them [O Prophet] about the town which was by the sea and how they broke the Sabbath. The fish would come to them appearing on the surface of the water on Sabbath days, but when it was not Sabbath, they would not come. This is how We tested them for their rebelliousness."
        }
    },
    {
        "id": 1117,
        "chapter": 7,
        "verse": 164,
        "arabic_text": "وَإِذۡ قَالَتۡ أُمَّةٞ مِّنۡهُمۡ لِمَ تَعِظُونَ قَوۡمًا ٱللَّهُ مُهۡلِكُهُمۡ أَوۡ مُعَذِّبُهُمۡ عَذَابٗا شَدِيدٗاۖ قَالُواْ مَعۡذِرَةً إِلَىٰ رَبِّكُمۡ وَلَعَلَّهُمۡ يَتَّقُونَ",
        "phonetic": "7.164 Wa 'Idh Qālat 'Ummatun Minhum Lima Ta`ižūna Qawmāan Allāhu Muhlikuhum 'Aw Mu`adhibuhum `Adhābāan Shadīdāan Qālū Ma`dhiratan 'Ilá Rabbikum Wa La`allahum Yattaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when a community among them said, \"Why do you advise [or warn] a people whom Allāh is [about] to destroy or to punish with a severe punishment?\" they [the advisors] said, \"To be absolved before your Lord and perhaps they may fear Him.\"",
            "english_hilali_khan": "And when a community among them said: \"Why do you preach to a people whom Allâh is about to destroy or to punish with a severe torment?\" (The preachers) said: \"In order to be free from guilt before your Lord (Allâh), and perhaps they may fear Allâh.\"",
            "english_rwwad": "When a group of them said, “Why are you admonishing a people whom Allah will destroy or punish severely?” They said, “To excuse ourselves before your Lord, and perhaps they may fear Allah.”"
        }
    },
    {
        "id": 1118,
        "chapter": 7,
        "verse": 165,
        "arabic_text": "فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦٓ أَنجَيۡنَا ٱلَّذِينَ يَنۡهَوۡنَ عَنِ ٱلسُّوٓءِ وَأَخَذۡنَا ٱلَّذِينَ ظَلَمُواْ بِعَذَابِۭ بَـِٔيسِۭ بِمَا كَانُواْ يَفۡسُقُونَ",
        "phonetic": "7.165 Falammā Nasū Mā Dhukkirū Bihi 'Anjaynā Al-Ladhīna Yanhawna `Ani As-Sū'i Wa 'Akhadhnā Al-Ladhīna Žalamū Bi`adhābin Ba'īsin Bimā Kānū Yafsuqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when they [i.e., those advised] forgot that by which they had been reminded, We saved those who had forbidden evil and seized those who wronged, with a wretched punishment, because they were defiantly disobeying.",
            "english_hilali_khan": "So when they forgot the remindings that had been given to them, We rescued those who forbade evil, but We seized those who did wrong with a severe torment because they used to rebel against Allâh’s Command (disobey Allâh).",
            "english_rwwad": "When they ignored the admonition they were given, We saved those who forbade evil and seized the wrongdoers with a grievous punishment for their defiant disobedience."
        }
    },
    {
        "id": 1119,
        "chapter": 7,
        "verse": 166,
        "arabic_text": "فَلَمَّا عَتَوۡاْ عَن مَّا نُهُواْ عَنۡهُ قُلۡنَا لَهُمۡ كُونُواْ قِرَدَةً خَٰسِـِٔينَ",
        "phonetic": "7.166 Falammā `Ataw `An Mā Nuhū `Anhu Qulnā Lahum Kūnū Qiradatan Khāsi'īna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:166) It is a severe warning to the mankind that they should not disobey what Allâh commands them to do, and keep far away from what He prohibits them.*\n* See the footnote of (V.9: 112).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when they were insolent about that which they had been forbidden, We said to them, \"Be apes, despised.\"",
            "english_hilali_khan": "So when they exceeded the limits of what they were prohibited, We said to them: \"Be you monkeys, despised and rejected.\"[1]",
            "english_rwwad": "When they persistently violated what they were forbidden to do, We said to them, “Be despised apes.”"
        }
    },
    {
        "id": 1120,
        "chapter": 7,
        "verse": 167,
        "arabic_text": "وَإِذۡ تَأَذَّنَ رَبُّكَ لَيَبۡعَثَنَّ عَلَيۡهِمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَن يَسُومُهُمۡ سُوٓءَ ٱلۡعَذَابِۗ إِنَّ رَبَّكَ لَسَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمٞ",
        "phonetic": "7.167 Wa 'Idh Ta'adhana Rabbuka Layab`athanna `Alayhim 'Ilá Yawmi Al-Qiyāmati Man Yasūmuhum Sū'a Al-`Adhābi 'Inna Rabbaka Lasarī`u Al-`Iqābi Wa 'Innahu Laghafūrun Raĥīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when your Lord declared that He would surely [continue to] send upon them until the Day of Resurrection those who would afflict them with the worst torment. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful.",
            "english_hilali_khan": "And (remember) when your Lord declared that He would certainly keep on sending against them (i.e. the Jews), till the Day of Resurrection, those who would afflict them with a humiliating torment. Verily, your Lord is Quick in Retribution (for the disobedient, wicked) and certainly He is Oft-Forgiving, Most Merciful (for the obedient and those who beg Allâh’s Forgiveness).",
            "english_rwwad": "And [remember] when your Lord declared that He would send against them those who would afflict them with a terrible punishment until the Day of Resurrection. Your Lord is Swift in Punishment, but He also is All-Forgiving, Most Merciful."
        }
    },
    {
        "id": 1121,
        "chapter": 7,
        "verse": 168,
        "arabic_text": "وَقَطَّعۡنَٰهُمۡ فِي ٱلۡأَرۡضِ أُمَمٗاۖ مِّنۡهُمُ ٱلصَّٰلِحُونَ وَمِنۡهُمۡ دُونَ ذَٰلِكَۖ وَبَلَوۡنَٰهُم بِٱلۡحَسَنَٰتِ وَٱلسَّيِّـَٔاتِ لَعَلَّهُمۡ يَرۡجِعُونَ",
        "phonetic": "7.168 Wa Qaţţa`nāhum Fī Al-'Arđi 'Umamāan Minhumu Aş-Şāliĥūna Wa Minhum Dūna Dhālika Wa Balawnāhum Bil-Ĥasanāti Wa As-Sayyi'āti La`allahum Yarji`ūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We divided them throughout the earth into nations. Of them some were righteous, and of them some were otherwise. And We tested them with good [times] and bad that perhaps they would return [to obedience].",
            "english_hilali_khan": "And We have broken them (i.e. the Jews) up into various separate groups on the earth: some of them are righteous and some are away from that. And We tried them with good (blessings) and evil (calamities) in order that they might turn (to Allâh’s Obedience).",
            "english_rwwad": "We scattered them through the land in communities – some of them were righteous and others were less so. We tested them with both prosperity and adversity, so that they would return."
        }
    },
    {
        "id": 1122,
        "chapter": 7,
        "verse": 169,
        "arabic_text": "فَخَلَفَ مِنۢ بَعۡدِهِمۡ خَلۡفٞ وَرِثُواْ ٱلۡكِتَٰبَ يَأۡخُذُونَ عَرَضَ هَٰذَا ٱلۡأَدۡنَىٰ وَيَقُولُونَ سَيُغۡفَرُ لَنَا وَإِن يَأۡتِهِمۡ عَرَضٞ مِّثۡلُهُۥ يَأۡخُذُوهُۚ أَلَمۡ يُؤۡخَذۡ عَلَيۡهِم مِّيثَٰقُ ٱلۡكِتَٰبِ أَن لَّا يَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّ وَدَرَسُواْ مَا فِيهِۗ وَٱلدَّارُ ٱلۡأٓخِرَةُ خَيۡرٞ لِّلَّذِينَ يَتَّقُونَۚ أَفَلَا تَعۡقِلُونَ",
        "phonetic": "7.169 Fakhalafa Min Ba`dihim Khalfun Warithū Al-Kitāba Ya'khudhūna `Arađa Hādhā Al-'Adná Wa Yaqūlūna Sayughfaru Lanā Wa 'In Ya'tihim `Arađun Mithluhu Ya'khudhūhu 'Alam Yu'ukhadh `Alayhim Mīthāqu Al-Kitābi 'An Lā Yaqūlū `Alá Allāhi 'Illā Al-Ĥaqqa Wa Darasū Mā Fīhi Wa Ad-Dāru Al-'Ākhiratu Khayrun Lilladhīna Yattaqūna 'Afalā Ta`qilūna",
        "footnotes": {
            "english_saheeh": "[414]- i.e., unlawful gains and pleasures.\n[415]- i.e., a similar temptation.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there followed them successors who inherited the Scripture [while] taking the commodities[414] of this lower life and saying, \"It will be forgiven for us.\" And if an offer like it[415] comes to them, they will [again] take it. Was not the covenant of the Scripture [i.e., the Torah] taken from them that they would not say about Allāh except the truth, and they studied what was in it? And the home of the Hereafter is better for those who fear Allāh, so will you not use reason?",
            "english_hilali_khan": "Then after them succeeded an (evil) generation, which inherited the Book, but they chose (for themselves) the goods of this low life (evil pleasures of this world) saying (as an excuse): \"(Everything) will be forgiven to us.\" And if (again) the offer of the like (evil pleasures of this world) came their way, they would (again) seize them (would commit those sins). Was not the covenant of the Book taken from them that they would not say about Allâh anything but the truth? And they have studied what is in it (the Book). And the home of the Hereafter is better for those who are Al-Muttaqûn (the pious - See V.2:2). Do not you then understand?",
            "english_rwwad": "They were then succeeded by other generations who inherited the Scripture, opting for the lowly gains, and saying, “We will be forgiven.” Yet if a similar gain comes their way, they will seize it. Was not a covenant of the Scripture taken from them that they should not say about Allah except the truth, and they had studied its teachings? But the Home of the Hereafter is better for those who fear Allah. Do you not understand?"
        }
    },
    {
        "id": 1123,
        "chapter": 7,
        "verse": 170,
        "arabic_text": "وَٱلَّذِينَ يُمَسِّكُونَ بِٱلۡكِتَٰبِ وَأَقَامُواْ ٱلصَّلَوٰةَ إِنَّا لَا نُضِيعُ أَجۡرَ ٱلۡمُصۡلِحِينَ",
        "phonetic": "7.170 Wa Al-Ladhīna Yumassikūna Bil-Kitābi Wa 'Aqāmū Aş-Şalāata 'Innā Lā Nuđī`u 'Ajra Al-Muşliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who hold fast to the Book [i.e., the Qur’ān] and establish prayer - indeed, We will not allow to be lost the reward of the reformers.",
            "english_hilali_khan": "And as to those who hold fast to the Book (i.e. act on its teachings) and perform As-Salât (Iqâmat-as-Salât ), certainly We shall never waste the reward of those who do righteous deeds.",
            "english_rwwad": "As for those who hold fast to the Scripture and establish prayer, We will not let the reward of those who seek righteousness to be lost."
        }
    },
    {
        "id": 1124,
        "chapter": 7,
        "verse": 171,
        "arabic_text": "۞ وَإِذۡ نَتَقۡنَا ٱلۡجَبَلَ فَوۡقَهُمۡ كَأَنَّهُۥ ظُلَّةٞ وَظَنُّوٓاْ أَنَّهُۥ وَاقِعُۢ بِهِمۡ خُذُواْ مَآ ءَاتَيۡنَٰكُم بِقُوَّةٖ وَٱذۡكُرُواْ مَا فِيهِ لَعَلَّكُمۡ تَتَّقُونَ",
        "phonetic": "7.171 Wa 'Idh Nataqnā Al-Jabala Fawqahum Ka'annahu Žullatun Wa Žannū 'Annahu Wāqi`un Bihim Khudhū Mā 'Ātaynākum Biqūwatin Wa Adhkurū Mā Fīhi La`allakum Tattaqūna",
        "footnotes": {
            "english_saheeh": "[416]- For their rebellion and disobedience.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when We raised the mountain above them as if it was a dark cloud and they were certain that it would fall upon them,[416] [and Allāh said], \"Take what We have given you with determination and remember what is in it that you might fear Allāh.\"",
            "english_hilali_khan": "And (remember) when We raised the mountain over them as if it had been a canopy, and they thought that it was going to fall on them. (We said): \"Hold firmly to what We have given you [i.e. the Taurât (Torah)], and remember that which is therein (act on its commandments), so that you may fear Allâh and obey Him.\"",
            "english_rwwad": "And [remember] when We raised the mountain over them as if it were a dark cloud, and they thought that it would fall upon them, “Hold fast to what We have given you and observe its teachings, so that you may fear Allah.”"
        }
    },
    {
        "id": 1125,
        "chapter": 7,
        "verse": 172,
        "arabic_text": "وَإِذۡ أَخَذَ رَبُّكَ مِنۢ بَنِيٓ ءَادَمَ مِن ظُهُورِهِمۡ ذُرِّيَّتَهُمۡ وَأَشۡهَدَهُمۡ عَلَىٰٓ أَنفُسِهِمۡ أَلَسۡتُ بِرَبِّكُمۡۖ قَالُواْ بَلَىٰ شَهِدۡنَآۚ أَن تَقُولُواْ يَوۡمَ ٱلۡقِيَٰمَةِ إِنَّا كُنَّا عَنۡ هَٰذَا غَٰفِلِينَ",
        "phonetic": "7.172 Wa 'Idh 'Akhadha Rabbuka Min Banī 'Ādama Min Žuhūrihim Dhurrīyatahum Wa 'Ash/hadahum `Alá 'Anfusihim 'Alastu Birabbikum Qālū Balá Shahidnā 'An Taqūlū Yawma Al-Qiyāmati 'Innā Kunnā `An Hādhā Ghāfilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [mention] when your Lord took from the children of Adam - from their loins - their descendants and made them testify of themselves, [saying to them], \"Am I not your Lord?\" They said, \"Yes, we have testified.\" [This] - lest you should say on the Day of Resurrection, \"Indeed, we were of this unaware.\"",
            "english_hilali_khan": "And (remember) when your Lord brought forth from the Children of Adam, from their loins, their seed (or from Adam’s loin his offspring) and made them testify as to themselves (saying): \"Am I not your Lord?\" They said: \"Yes! We testify,\" lest you should say on the Day of Resurrection: \"Verily, we have been unaware of this.\"",
            "english_rwwad": "And [remember] when your Lord brought forth from the loins of the children of Adam their offspring and made them testify about themselves [asking], “Am I not your Lord?” They said, “Yes indeed; We testify.” [We did so] lest you should say on the Day of Resurrection, “We were unaware of this,”"
        }
    },
    {
        "id": 1126,
        "chapter": 7,
        "verse": 173,
        "arabic_text": "أَوۡ تَقُولُوٓاْ إِنَّمَآ أَشۡرَكَ ءَابَآؤُنَا مِن قَبۡلُ وَكُنَّا ذُرِّيَّةٗ مِّنۢ بَعۡدِهِمۡۖ أَفَتُهۡلِكُنَا بِمَا فَعَلَ ٱلۡمُبۡطِلُونَ",
        "phonetic": "7.173 'Aw Taqūlū 'Innamā 'Ashraka 'Ābā'uunā Min Qablu Wa Kunnā Dhurrīyatan Min Ba`dihim 'Afatuhlikunā Bimā Fa`ala Al-Mubţilūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Or [lest] you say, \"It was only that our fathers associated [others in worship] with Allāh before, and we were but descendants after them. Then would You destroy us for what the falsifiers have done?\"",
            "english_hilali_khan": "Or lest you should say: \"It was only our fathers afortime who took others as partners in worship along with Allâh, and we were (merely their) descendants after them; will You then destroy us because of the deeds of men who practised Al-Bâtil (i.e. polytheism and committing crimes and sins, invoking and worshipping others besides Allâh)?\" (Tafsir At-Tabarî).",
            "english_rwwad": "Or that you say, “It was our forefathers before us who associated partners with Allah, and we are their offspring who came after them. Will you then destroy us for the falsehood that they invented?”"
        }
    },
    {
        "id": 1127,
        "chapter": 7,
        "verse": 174,
        "arabic_text": "وَكَذَٰلِكَ نُفَصِّلُ ٱلۡأٓيَٰتِ وَلَعَلَّهُمۡ يَرۡجِعُونَ",
        "phonetic": "7.174 Wa Kadhalika Nufaşşilu Al-'Āyāti Wa La`allahum Yarji`ūna",
        "footnotes": {
            "english_saheeh": "[417]- To the way of Allāh (subḥānahu wa taʿālā), from their diversions and deviations.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And thus do We [explain in] detail the verses, and perhaps they will return.[417]",
            "english_hilali_khan": "Thus do We explain the Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail, so that they may turn (unto the truth).",
            "english_rwwad": "This is how We make the verses clear, so that they may return."
        }
    },
    {
        "id": 1128,
        "chapter": 7,
        "verse": 175,
        "arabic_text": "وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱلَّذِيٓ ءَاتَيۡنَٰهُ ءَايَٰتِنَا فَٱنسَلَخَ مِنۡهَا فَأَتۡبَعَهُ ٱلشَّيۡطَٰنُ فَكَانَ مِنَ ٱلۡغَاوِينَ",
        "phonetic": "7.175 Wa Atlu `Alayhim Naba'a Al-Ladhī 'Ātaynāhu 'Āyātinā Fānsalakha Minhā Fa'atba`ahu Ash-Shayţānu Fakāna Mina Al-Ghāwīna",
        "footnotes": {
            "english_saheeh": "[418]- A man from the Children of Israel at the time of Moses.\n[419]- Those who deliberately persist in error to the point of destruction.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And recite to them, [O Muḥammad], the news of him[418] to whom We gave [knowledge of] Our signs, but he detached himself from them; so Satan pursued him, and he became of the deviators.[419]",
            "english_hilali_khan": "And recite (O Muhammad صلى الله عليه وسلم) to them the story of him to whom We gave Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), but he threw them away; so Shaitân (Satan) followed him up, and he became of those who went astray.",
            "english_rwwad": "And relate to them [O Prophet] the story of the one whom We gave knowledge of Our revelations, but he abandoned it, so Satan took hold of him and he became one of the deviants."
        }
    },
    {
        "id": 1129,
        "chapter": 7,
        "verse": 176,
        "arabic_text": "وَلَوۡ شِئۡنَا لَرَفَعۡنَٰهُ بِهَا وَلَٰكِنَّهُۥٓ أَخۡلَدَ إِلَى ٱلۡأَرۡضِ وَٱتَّبَعَ هَوَىٰهُۚ فَمَثَلُهُۥ كَمَثَلِ ٱلۡكَلۡبِ إِن تَحۡمِلۡ عَلَيۡهِ يَلۡهَثۡ أَوۡ تَتۡرُكۡهُ يَلۡهَثۚ ذَّٰلِكَ مَثَلُ ٱلۡقَوۡمِ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَاۚ فَٱقۡصُصِ ٱلۡقَصَصَ لَعَلَّهُمۡ يَتَفَكَّرُونَ",
        "phonetic": "7.176 Wa Law Shi'nā Larafa`nāhu Bihā Wa Lakinnahu 'Akhlada 'Ilá Al-'Arđi Wa Attaba`a Hawāhu Famathaluhu Kamathali Al-Kalbi 'In Taĥmil `Alayhi Yalhath 'Aw Tatruk/hu Yalhath Dhālika Mathalu Al-Qawmi Al-Ladhīna Kadhabū Bi'āyātinā Fāqşuşi Al-Qaşaşa La`allahum Yatafakkarūna",
        "footnotes": {
            "english_saheeh": "[420]- i.e., through the revelations, signs or evidences of which he had been given knowledge.\n[421]- i.e., its worldly pleasures.\n[422]- Whether or not they have been exposed to Allāh's signs or warnings, it is all the same:  they will not believe.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if We had willed, We could have elevated him thereby,[420] but he adhered [instead] to the earth[421] and followed his own desire. So his example is like that of the dog: if you chase him, he pants, or if you leave him, he [still] pants. That is the example of the people who denied Our signs.[422] So relate the stories that perhaps they will give thought.",
            "english_hilali_khan": "And had We willed, We would surely have elevated him therewith but he clung to the earth and followed his own vain desire. So his parable is the parable of a dog: if you drive him away, he lolls his tongue out, or if you leave him alone, he (still) lolls his tongue out. Such is the parable of the people who reject Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.). So relate the stories, perhaps they may reflect.",
            "english_rwwad": "If We had willed, We could have elevated him thereby, but he clung to the [life of the] earth and followed his desires. His likeness is that of a dog: if you attack it, it pants with its tongue lolling, and if you leave it, it still pants. Such is the example of the people who reject Our revelations. Therefore relate the stories, so that they may reflect."
        }
    },
    {
        "id": 1130,
        "chapter": 7,
        "verse": 177,
        "arabic_text": "سَآءَ مَثَلًا ٱلۡقَوۡمُ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا وَأَنفُسَهُمۡ كَانُواْ يَظۡلِمُونَ",
        "phonetic": "7.177 Sā'a Mathalāan Al-Qawmu Al-Ladhīna Kadhabū Bi'āyātinā Wa 'Anfusahum Kānū Yažlimūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "How evil an example [is that of] the people who denied Our signs and used to wrong themselves.",
            "english_hilali_khan": "Evil is the parable of the people who rejected Our Ayât (proofs, evidence, verses and signs, etc.), and used to wrong their ownselves.",
            "english_rwwad": "How evil is the likeness of people who rejected Our verses, and it is themselves that they have wronged."
        }
    },
    {
        "id": 1131,
        "chapter": 7,
        "verse": 178,
        "arabic_text": "مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِيۖ وَمَن يُضۡلِلۡ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
        "phonetic": "7.178 Man Yahdi Allāhu Fahuwa Al-Muhtadī Wa Man Yuđlil Fa'ūlā'ika Humu Al-Khāsirūna",
        "footnotes": {
            "english_saheeh": "[423]- As a result of persistence in evil and rejection of truth.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever Allāh guides - he is the [rightly] guided; and whoever He sends astray[423] - it is those who are the losers.",
            "english_hilali_khan": "Whomsoever Allâh guides, he is the guided one, and whomsoever He sends astray,- then those! they are the losers.",
            "english_rwwad": "Whoever Allah guides is rightly guided; and whoever He causes to stray, it is they who are the losers."
        }
    },
    {
        "id": 1132,
        "chapter": 7,
        "verse": 179,
        "arabic_text": "وَلَقَدۡ ذَرَأۡنَا لِجَهَنَّمَ كَثِيرٗا مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ لَهُمۡ قُلُوبٞ لَّا يَفۡقَهُونَ بِهَا وَلَهُمۡ أَعۡيُنٞ لَّا يُبۡصِرُونَ بِهَا وَلَهُمۡ ءَاذَانٞ لَّا يَسۡمَعُونَ بِهَآۚ أُوْلَٰٓئِكَ كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّۚ أُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ",
        "phonetic": "7.179 Wa Laqad Dhara'nā Lijahannama Kathīrāan Mina Al-Jinni Wa Al-'Insi Lahum Qulūbun Lā Yafqahūna Bihā Wa Lahum 'A`yunun Lā Yubşirūna Bihā Wa Lahum 'Ādhānun Lā Yasma`ūna Bihā 'Ūlā'ika Kāl'an`āmi Bal Hum 'Ađallu 'Ūlā'ika Humu Al-Ghāfilūna",
        "footnotes": {
            "english_saheeh": "[424]- The reference is to their inability (i.e., refusal) to think and reason, while blindly following (as they are accustomed).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And We have certainly created for Hell many of the jinn and mankind. They have hearts with which they do not understand, they have eyes with which they do not see, and they have ears with which they do not hear. Those are like livestock; rather, they are more astray.[424] It is they who are the heedless.",
            "english_hilali_khan": "And surely, We have created many of the jinn and mankind for Hell. They have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hear not (the truth). They are like cattle, nay even more astray; those! They are the heedless ones.",
            "english_rwwad": "We have surely created for Hell many jinn and humans. They have hearts with which they do not understand, eyes with which they do not see, and ears with which they do not hear. They are like cattle, rather, they are more astray. It is they who are the heedless."
        }
    },
    {
        "id": 1133,
        "chapter": 7,
        "verse": 180,
        "arabic_text": "وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ وَذَرُواْ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ أَسۡمَٰٓئِهِۦۚ سَيُجۡزَوۡنَ مَا كَانُواْ يَعۡمَلُونَ",
        "phonetic": "7.180 Wa Lillahi Al-'Asmā'u Al-Ĥusná Fād`ūhu Bihā Wa Dharū Al-Ladhīna Yulĥidūna Fī 'Asmā'ihi Sayujzawna Mā Kānū Ya`malūna",
        "footnotes": {
            "english_saheeh": "[425]- i.e., use them improperly or deny them.",
            "english_hilali_khan": "(V.7:180) Allâh has one hundred minus one Names. (i.e. 99).\nNarrated Abu Hurairah رضي الله عنه : Allâh has ninety-nine Names, i.e. one-hundred minus one; and whoever believes in their meanings and acts accordingly, will enter Paradise; and Allâh is Witr (One) and loves the ‘witr’. (Sahih Al-Bukhâri, Vol. 8, hadîth No.419).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And to Allāh belong the best names, so invoke Him by them. And leave [the company of] those who practice deviation concerning His names.[425] They will be recompensed for what they have been doing.",
            "english_hilali_khan": "And (all) the Most Beautiful Names belong to Allâh[1], so call on Him by them, and leave the company of those who belie or deny (or utter impious speech against) His Names. They will be requited for what they used to do.",
            "english_rwwad": "Allah has the Most Beautiful Names, so call upon Him by them, and leave those who profane His Names. They will be recompensed for what they used to do."
        }
    },
    {
        "id": 1134,
        "chapter": 7,
        "verse": 181,
        "arabic_text": "وَمِمَّنۡ خَلَقۡنَآ أُمَّةٞ يَهۡدُونَ بِٱلۡحَقِّ وَبِهِۦ يَعۡدِلُونَ",
        "phonetic": "7.181 Wa Mimman Khalaqnā 'Ummatun Yahdūna Bil-Ĥaqqi Wa Bihi Ya`dilūna",
        "footnotes": {
            "english_saheeh": "[426]- The followers of Prophet Muḥammad (ﷺ).",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among those We created is a community[426] which guides by truth and thereby establishes justice.",
            "english_hilali_khan": "And of those whom We have created, there is a community who guides (others) with the truth, and establishes justice therewith.",
            "english_rwwad": "And among those whom We created is a group that guides others with the truth and establishes justice therewith."
        }
    },
    {
        "id": 1135,
        "chapter": 7,
        "verse": 182,
        "arabic_text": "وَٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا سَنَسۡتَدۡرِجُهُم مِّنۡ حَيۡثُ لَا يَعۡلَمُونَ",
        "phonetic": "7.182 Wa Al-Ladhīna Kadhabū Bi'āyātinā Sanastadrijuhum Min Ĥaythu Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[427]- Allāh will test them with one favor after another in spite of their disobedience, which only increases them in arrogance and sin.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But those who deny Our signs - We will progressively lead them [to destruction][427] from where they do not know.",
            "english_hilali_khan": "Those who reject Our Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), We shall gradually seize them with punishment in ways they perceive not.",
            "english_rwwad": "As for those who reject Our signs, We will gradually lead them to destruction without them realizing it."
        }
    },
    {
        "id": 1136,
        "chapter": 7,
        "verse": 183,
        "arabic_text": "وَأُمۡلِي لَهُمۡۚ إِنَّ كَيۡدِي مَتِينٌ",
        "phonetic": "7.183 Wa 'Umlī Lahum 'Inna Kaydī Matīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And I will give them time. Indeed, My plan is firm.",
            "english_hilali_khan": "And I respite them; certainly My Plan is strong.",
            "english_rwwad": "I will give them respite, but My plan is firm."
        }
    },
    {
        "id": 1137,
        "chapter": 7,
        "verse": 184,
        "arabic_text": "أَوَلَمۡ يَتَفَكَّرُواْۗ مَا بِصَاحِبِهِم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِيرٞ مُّبِينٌ",
        "phonetic": "7.184 'Awalam Yatafakkarū Mā Bişāĥibihim Min Jinnatin 'In Huwa 'Illā Nadhīrun Mubīnun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Then do they not give thought? There is in their companion [i.e., Muḥammad (ﷺ)] no madness. He is not but a clear warner.",
            "english_hilali_khan": "Do they not reflect? There is no madness in their companion (Muhammad صلى الله عليه وسلم). He is but a plain warner.",
            "english_rwwad": "Have they not reflected that their fellow [Prophet] is not insane? He is none but a clear warner."
        }
    },
    {
        "id": 1138,
        "chapter": 7,
        "verse": 185,
        "arabic_text": "أَوَلَمۡ يَنظُرُواْ فِي مَلَكُوتِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ وَأَنۡ عَسَىٰٓ أَن يَكُونَ قَدِ ٱقۡتَرَبَ أَجَلُهُمۡۖ فَبِأَيِّ حَدِيثِۭ بَعۡدَهُۥ يُؤۡمِنُونَ",
        "phonetic": "7.185 'Awalam Yanžurū Fī Malakūti As-Samāwāti Wa Al-'Arđi Wa Mā Khalaqa Allāhu Min Shay'in Wa 'An `Asá 'An Yakūna Qadi Aqtaraba 'Ajaluhum Fabi'ayyi Ĥadīthin Ba`dahu Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they not look into the realm of the heavens and the earth and everything that Allāh has created and [think] that perhaps their appointed time has come near? So in what statement [i.e., message] hereafter will they believe?",
            "english_hilali_khan": "Do they not look in the dominion of the heavens and the earth and all things that Allâh has created; and that it may be that the end of their lives is near. In what message after this will they then believe?",
            "english_rwwad": "Have they not observed the dominions of the heavens and earth and all that Allah has created, and that the end of their term might be near? In what message after this [Qur’an] will they then believe?"
        }
    },
    {
        "id": 1139,
        "chapter": 7,
        "verse": 186,
        "arabic_text": "مَن يُضۡلِلِ ٱللَّهُ فَلَا هَادِيَ لَهُۥۚ وَيَذَرُهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ",
        "phonetic": "7.186 Man Yuđlili Allāhu Falā Hādiya Lahu Wa Yadharuhum Fī Ţughyānihim Ya`mahūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Whoever Allāh sends astray - there is no guide for him. And He leaves them in their transgression, wandering blindly.",
            "english_hilali_khan": "Whomsoever Allâh sends astray, none can guide him; and He lets them wander blindly in their transgressions.",
            "english_rwwad": "Whoever Allah causes to stray, there is none to guide him; He will leave them to wander blindly in their transgression."
        }
    },
    {
        "id": 1140,
        "chapter": 7,
        "verse": 187,
        "arabic_text": "يَسۡـَٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ رَبِّيۖ لَا يُجَلِّيهَا لِوَقۡتِهَآ إِلَّا هُوَۚ ثَقُلَتۡ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا تَأۡتِيكُمۡ إِلَّا بَغۡتَةٗۗ يَسۡـَٔلُونَكَ كَأَنَّكَ حَفِيٌّ عَنۡهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
        "phonetic": "7.187 Yas'alūnaka `Ani As-Sā`ati 'Ayyāna Mursāhā Qul 'Innamā `Ilmuhā `Inda Rabbī Lā Yujallīhā Liwaqtihā 'Illā Huwa Thaqulat Fī As-Samāwāti Wa Al-'Arđi Lā Ta'tīkum 'Illā Baghtatan Yas'alūnaka Ka'annaka Ĥafīyun `Anhā Qul 'Innamā `Ilmuhā `Inda Allāhi Wa Lakinna 'Akthara An-Nāsi Lā Ya`lamūna",
        "footnotes": {
            "english_saheeh": "[428]- Literally, \"resting\" or \"establishment.\"\n[429]- i.e., it is a source of concern, worry or fear.",
            "english_hilali_khan": "(V.7:187): Narrated ‘Abdullâh رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"The keys of the unseen are five: Verily Allâh! With Him (Alone) is the knowledge of the Hour, He sends down the rain, and knows that which is in the wombs. No person knows what he will earn tomorrow, and no person knows in what land he will die. Verily, Allâh is All-Knower, All-Aware.\" (V.31:34). (Sahih Al-Bukhâri, Vol. 6, hadîth No. 151).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "They ask you, [O Muḥammad], about the Hour: when is its arrival?[428] Say, \"Its knowledge is only with my Lord. None will reveal its time except Him. It lays heavily[429] upon the heavens and the earth. It will not come upon you except unexpectedly.\" They ask you as if you are familiar with it. Say, \"Its knowledge is only with Allāh, but most of the people do not know.\"",
            "english_hilali_khan": "They ask you about the Hour (Day of Resurrection): \"When will be its appointed time?\" Say: \"The knowledge thereof is with my Lord (Alone). None can reveal its time but He. Heavy is its burden through the heavens and the earth. It shall not come upon you except all of a sudden.\" They ask you as if you have a good knowledge of it. Say: \"The knowledge thereof is with Allâh (Alone), but most of mankind know not.\"[2]",
            "english_rwwad": "They ask you [O Prophet] about the Hour, “When will it come to pass?” Say, “Its knowledge is only with my Lord. None can reveal its due time except Him. It will be heavy on the heavens and earth; it will only come to you by surprise.” They ask you as if you are well-aware of it. Say, “Its knowledge is only with Allah, but most people do not know.”"
        }
    },
    {
        "id": 1141,
        "chapter": 7,
        "verse": 188,
        "arabic_text": "قُل لَّآ أَمۡلِكُ لِنَفۡسِي نَفۡعٗا وَلَا ضَرًّا إِلَّا مَا شَآءَ ٱللَّهُۚ وَلَوۡ كُنتُ أَعۡلَمُ ٱلۡغَيۡبَ لَٱسۡتَكۡثَرۡتُ مِنَ ٱلۡخَيۡرِ وَمَا مَسَّنِيَ ٱلسُّوٓءُۚ إِنۡ أَنَا۠ إِلَّا نَذِيرٞ وَبَشِيرٞ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "7.188 Qul Lā 'Amliku Linafsī Naf`āan Wa Lā Đarrāan 'Illā Mā Shā'a Allāhu Wa Law Kuntu 'A`lamu Al-Ghayba Lāstakthartu Mina Al-Khayri Wa Mā Massaniya As-Sū'u 'In 'Anā 'Illā Nadhīrun Wa Bashīrun Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"I hold not for myself [the power of] benefit or harm, except what Allāh has willed. And if I knew the unseen, I could have acquired much wealth, and no harm would have touched me. I am not except a warner and a bringer of good tidings to a people who believe.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I possess no power over benefit or harm to myself except as Allâh wills. If I had the knowledge of the Ghaib (Unseen), I should have secured for myself an abundance of wealth, and no evil should have touched me. I am but a warner, and a bringer of glad tidings unto people who believe.\"",
            "english_rwwad": "Say, “I have no power to benefit or harm myself, except what Allah wills. If I had knowledge of the unseen, I would have acquired much good, and no evil would have touched me. I am only a warner and bearer of glad tidings for people who believe.”"
        }
    },
    {
        "id": 1142,
        "chapter": 7,
        "verse": 189,
        "arabic_text": "۞ هُوَ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَجَعَلَ مِنۡهَا زَوۡجَهَا لِيَسۡكُنَ إِلَيۡهَاۖ فَلَمَّا تَغَشَّىٰهَا حَمَلَتۡ حَمۡلًا خَفِيفٗا فَمَرَّتۡ بِهِۦۖ فَلَمَّآ أَثۡقَلَت دَّعَوَا ٱللَّهَ رَبَّهُمَا لَئِنۡ ءَاتَيۡتَنَا صَٰلِحٗا لَّنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ",
        "phonetic": "7.189 Huwa Al-Ladhī Khalaqakum Min Nafsin Wāĥidatin Wa Ja`ala Minhā Zawjahā Liyaskuna 'Ilayhā Falammā Taghashāhā Ĥamalat Ĥamlāan Khafīfāan Famarrat Bihi Falammā 'Athqalat Da`awā Allāha Rabbahumā La'in 'Ātaytanā Şāliĥāan Lanakūnanna Mina Ash-Shākirīna",
        "footnotes": {
            "english_saheeh": "[430]- i.e., man or every descendent of Adam.\n[431]- An allusion to sexual intercourse.\n[432]- Physically sound or righteous.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It is He who created you from one soul and created from it its mate that he[430] might dwell in security with her. And when he [i.e., man] covers her,[431] she carries a light burden [i.e., a pregnancy] and continues therein. And when it becomes heavy, they both invoke Allāh, their Lord, \"If You should give us a good[432] [child], we will surely be among the grateful.\"",
            "english_hilali_khan": "It is He Who has created you from a single person (Adam), and (then) He has created from him his wife [Hawwâ’ (Eve)], in order that he might enjoy the pleasure of living with her. When he (a polytheist from Adam’s offspring - as stated by Ibn Kathir in his Tafsir) had sexual relation with her (the polytheist’s wife), she became pregnant and she carried it about lightly. Then when it became heavy, they both invoked Allâh, their Lord (saying): \"If You give us a Sâlih (good in every aspect) child, we shall indeed be among the grateful.\"",
            "english_rwwad": "It is He Who created you from a single soul, and from it He made its spouse, so that he may find comfort in her. When he covered her, she conceived a light burden carrying it with ease. Then when she grew heavy, they called upon Allah, their Lord, “If you give us a healthy child, we will certainly be grateful.”"
        }
    },
    {
        "id": 1143,
        "chapter": 7,
        "verse": 190,
        "arabic_text": "فَلَمَّآ ءَاتَىٰهُمَا صَٰلِحٗا جَعَلَا لَهُۥ شُرَكَآءَ فِيمَآ ءَاتَىٰهُمَاۚ فَتَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ",
        "phonetic": "7.190 Falammā 'Ātāhumā Şāliĥāan Ja`alā Lahu Shurakā'a Fīmā 'Ātāhumā Fata`ālá Allāhu `Ammā Yushrikūna",
        "footnotes": {
            "english_saheeh": "[433]- The ungrateful man and woman or the polytheistic man and woman.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But when He gives them a good [child], they[433] ascribe partners to Him concerning that which He has given them. Exalted is Allāh above what they associate with Him.",
            "english_hilali_khan": "But when He gave them (the polytheist and his wife) a Sâlih (good in every aspect) child, they ascribed partners to Him (Allâh) in that which He has given to them. High be Allâh, Exalted above all that they ascribe as partners to Him. (Tafsir Ibn Kathir).",
            "english_rwwad": "But when He gave them a healthy child, they ascribed partners to Him in that which He had given them. Exalted is Allah far above what they ascribe to Him."
        }
    },
    {
        "id": 1144,
        "chapter": 7,
        "verse": 191,
        "arabic_text": "أَيُشۡرِكُونَ مَا لَا يَخۡلُقُ شَيۡـٔٗا وَهُمۡ يُخۡلَقُونَ",
        "phonetic": "7.191 'Ayushrikūna Mā Lā Yakhluqu Shay'āan Wa Hum Yukhlaqūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they associate with Him those who create nothing and they are [themselves] created?",
            "english_hilali_khan": "Do they attribute as partners to Allâh those who created nothing but they themselves are created?",
            "english_rwwad": "Do they ascribe to Him partners those who cannot create anything, but are themselves created?"
        }
    },
    {
        "id": 1145,
        "chapter": 7,
        "verse": 192,
        "arabic_text": "وَلَا يَسۡتَطِيعُونَ لَهُمۡ نَصۡرٗا وَلَآ أَنفُسَهُمۡ يَنصُرُونَ",
        "phonetic": "7.192 Wa Lā Yastaţī`ūna Lahum Naşrāan Wa Lā 'Anfusahum Yanşurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they [i.e., the false deities] are unable to [give] them help, nor can they help themselves.",
            "english_hilali_khan": "No help can they give them, nor can they help themselves.",
            "english_rwwad": "They cannot help them, nor can they help themselves."
        }
    },
    {
        "id": 1146,
        "chapter": 7,
        "verse": 193,
        "arabic_text": "وَإِن تَدۡعُوهُمۡ إِلَى ٱلۡهُدَىٰ لَا يَتَّبِعُوكُمۡۚ سَوَآءٌ عَلَيۡكُمۡ أَدَعَوۡتُمُوهُمۡ أَمۡ أَنتُمۡ صَٰمِتُونَ",
        "phonetic": "7.193 Wa 'In Tad`ūhum 'Ilá Al-Hudá Lā Yattabi`ūkum Sawā'un `Alaykum 'Ada`awtumūhum 'Am 'Antum Şāmitūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you [believers] invite them to guidance, they will not follow you. It is all the same for you whether you invite them or you are silent.",
            "english_hilali_khan": "And if you call them to guidance, they follow you not. It is the same for you whether you call them or you keep silent.",
            "english_rwwad": "If you call them to guidance, they will not follow you; it is the same whether you call them or remain silent."
        }
    },
    {
        "id": 1147,
        "chapter": 7,
        "verse": 194,
        "arabic_text": "إِنَّ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ عِبَادٌ أَمۡثَالُكُمۡۖ فَٱدۡعُوهُمۡ فَلۡيَسۡتَجِيبُواْ لَكُمۡ إِن كُنتُمۡ صَٰدِقِينَ",
        "phonetic": "7.194 'Inna Al-Ladhīna Tad`ūna Min Dūni Allāhi `Ibādun 'Amthālukum Fād`ūhum Falyastajībū Lakum 'In Kuntum Şādiqīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those you [polytheists] call upon besides Allāh are servants [i.e., creations] like you. So call upon them and let them respond to you, if you should be truthful.",
            "english_hilali_khan": "Verily, those whom you call upon besides Allâh are slaves like you. So call upon them and let them answer you if you are truthful.",
            "english_rwwad": "Those whom you supplicate besides Allah are slaves like you; supplicate them and let them respond to you if you are truthful."
        }
    },
    {
        "id": 1148,
        "chapter": 7,
        "verse": 195,
        "arabic_text": "أَلَهُمۡ أَرۡجُلٞ يَمۡشُونَ بِهَآۖ أَمۡ لَهُمۡ أَيۡدٖ يَبۡطِشُونَ بِهَآۖ أَمۡ لَهُمۡ أَعۡيُنٞ يُبۡصِرُونَ بِهَآۖ أَمۡ لَهُمۡ ءَاذَانٞ يَسۡمَعُونَ بِهَاۗ قُلِ ٱدۡعُواْ شُرَكَآءَكُمۡ ثُمَّ كِيدُونِ فَلَا تُنظِرُونِ",
        "phonetic": "7.195 'Alahum 'Arjulun Yamshūna Bihā 'Am Lahum 'Aydin Yabţishūna Bihā 'Am Lahum 'A`yunun Yubşirūna Bihā 'Am Lahum 'Ādhānun Yasma`ūna Bihā Quli Ad`ū Shurakā'akum Thumma Kīdūni Falā Tunžirūni",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Do they have feet by which they walk? Or do they have hands by which they strike? Or do they have eyes by which they see? Or do they have ears by which they hear? Say, [O Muḥammad], \"Call your 'partners' and then conspire against me and give me no respite.",
            "english_hilali_khan": "Have they feet wherewith they walk? Or have they hands wherewith they hold? Or have they eyes wherewith they see? Or have they ears wherewith they hear? Say (O Muhammad صلى الله عليه وسلم): \"Call your (so-called) partners (of Allâh) and then plot against me, and give me no respite!",
            "english_rwwad": "Do they have feet to walk with? Or hands to grasp with? Or eyes to see with? Or ears to hear with? Say [O Prophet], “Call your idols then conspire against me and give me no respite!"
        }
    },
    {
        "id": 1149,
        "chapter": 7,
        "verse": 196,
        "arabic_text": "إِنَّ وَلِـِّۧيَ ٱللَّهُ ٱلَّذِي نَزَّلَ ٱلۡكِتَٰبَۖ وَهُوَ يَتَوَلَّى ٱلصَّٰلِحِينَ",
        "phonetic": "7.196 'Inna Walīyiya Allāhu Al-Ladhī Nazzala Al-Kitāba Wa Huwa Yatawallá Aş-Şāliĥīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, my protector is Allāh, who has sent down the Book; and He is an ally to the righteous.",
            "english_hilali_khan": "Verily, my Walî (Protector, Supporter, and Helper) is Allâh Who has revealed the Book (the Qur’ân), and He protects (supports and helps) the righteous.",
            "english_rwwad": "My Protector is Allah Who has sent down the Book, for it is He Who protects the righteous."
        }
    },
    {
        "id": 1150,
        "chapter": 7,
        "verse": 197,
        "arabic_text": "وَٱلَّذِينَ تَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَطِيعُونَ نَصۡرَكُمۡ وَلَآ أَنفُسَهُمۡ يَنصُرُونَ",
        "phonetic": "7.197 Wa Al-Ladhīna Tad`ūna Min Dūnihi Lā Yastaţī`ūna Naşrakum Wa Lā 'Anfusahum Yanşurūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And those you call upon besides Him are unable to help you, nor can they help themselves.\"",
            "english_hilali_khan": "And those whom you call upon besides Him (Allâh) cannot help you nor can they help themselves.",
            "english_rwwad": "But those whom you supplicate besides Him cannot help you, nor can they help themselves.”"
        }
    },
    {
        "id": 1151,
        "chapter": 7,
        "verse": 198,
        "arabic_text": "وَإِن تَدۡعُوهُمۡ إِلَى ٱلۡهُدَىٰ لَا يَسۡمَعُواْۖ وَتَرَىٰهُمۡ يَنظُرُونَ إِلَيۡكَ وَهُمۡ لَا يُبۡصِرُونَ",
        "phonetic": "7.198 Wa 'In Tad`ūhum 'Ilá Al-Hudá Lā Yasma`ū Wa Tarāhum Yanžurūna 'Ilayka Wa Hum Lā Yubşirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if you invite them to guidance, they do not hear; and you see them looking at you while they do not see.",
            "english_hilali_khan": "And if you call them to guidance, they hear not and you will see them looking at you, yet they see not.",
            "english_rwwad": "If you call them to guidance, they do not hear, and you see them looking at you, but they do not see."
        }
    },
    {
        "id": 1152,
        "chapter": 7,
        "verse": 199,
        "arabic_text": "خُذِ ٱلۡعَفۡوَ وَأۡمُرۡ بِٱلۡعُرۡفِ وَأَعۡرِضۡ عَنِ ٱلۡجَٰهِلِينَ",
        "phonetic": "7.199 Khudhi Al-`Afwa Wa 'Mur Bil-`Urfi Wa 'A`riđ `Ani Al-Jāhilīna",
        "footnotes": {
            "english_saheeh": "[434]- From the dispositions of men or from their wealth.  In other words, be easy in dealing with them and avoid causing them difficulty.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Take what is given freely,[434] enjoin what is good, and turn away from the ignorant.",
            "english_hilali_khan": "Show forgiveness, enjoin what is good, and turn away from the foolish (i.e. don’t punish them).",
            "english_rwwad": "Be gracious, enjoin what is right and turn away from those who are ignorant."
        }
    },
    {
        "id": 1153,
        "chapter": 7,
        "verse": 200,
        "arabic_text": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۚ إِنَّهُۥ سَمِيعٌ عَلِيمٌ",
        "phonetic": "7.200 Wa 'Immā Yanzaghannaka Mina Ash-Shayţāni Nazghun Fāsta`idh Billāhi 'Innahu Samī`un `Alīmun",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And if an evil suggestion comes to you from Satan, then seek refuge in Allāh. Indeed, He is Hearing and Knowing.",
            "english_hilali_khan": "And if an evil whisper comes to you from Shaitân (Satan), then seek refuge with Allâh. Verily, He is All-Hearer, All-Knower.",
            "english_rwwad": "If you are tempted by Satan, seek refuge with Allah, for He is All-Hearing, All-Knowing."
        }
    },
    {
        "id": 1154,
        "chapter": 7,
        "verse": 201,
        "arabic_text": "إِنَّ ٱلَّذِينَ ٱتَّقَوۡاْ إِذَا مَسَّهُمۡ طَٰٓئِفٞ مِّنَ ٱلشَّيۡطَٰنِ تَذَكَّرُواْ فَإِذَا هُم مُّبۡصِرُونَ",
        "phonetic": "7.201 'Inna Al-Ladhīna Attaqaw 'Idhā Massahum Ţā'ifun Mina Ash-Shayţāni Tadhakkarū Fa'idhā Hum Mubşirūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who fear Allāh - when an impulse touches them from Satan, they remember [Him] and at once they have insight.",
            "english_hilali_khan": "Verily, those who are Al-Muttaqûn (the pious - see V.2:2), when an evil thought comes to them from Shaitân (Satan), they remember (Allâh), and (indeed) they then see (aright).",
            "english_rwwad": "Those who fear Allah, when an evil whisper comes to them from Satan, they remember Him and immediately come back to their senses."
        }
    },
    {
        "id": 1155,
        "chapter": 7,
        "verse": 202,
        "arabic_text": "وَإِخۡوَٰنُهُمۡ يَمُدُّونَهُمۡ فِي ٱلۡغَيِّ ثُمَّ لَا يُقۡصِرُونَ",
        "phonetic": "7.202 Wa 'Ikhwānuhum Yamuddūnahum Fī Al-Ghayyi Thumma Lā Yuqşirūna",
        "footnotes": {
            "english_saheeh": "[435]- Those among mankind who listen to the devils and obey their orders.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But their brothers[435] - they [i.e., the devils] increase them in error; then they do not stop short.",
            "english_hilali_khan": "But (as for) their brothers (the devils) they (i.e. the devils) plunge them deeper into error, and they never stop short.",
            "english_rwwad": "But the devils plunge their [human] brothers deeper into sin, sparing no effort."
        }
    },
    {
        "id": 1156,
        "chapter": 7,
        "verse": 203,
        "arabic_text": "وَإِذَا لَمۡ تَأۡتِهِم بِـَٔايَةٖ قَالُواْ لَوۡلَا ٱجۡتَبَيۡتَهَاۚ قُلۡ إِنَّمَآ أَتَّبِعُ مَا يُوحَىٰٓ إِلَيَّ مِن رَّبِّيۚ هَٰذَا بَصَآئِرُ مِن رَّبِّكُمۡ وَهُدٗى وَرَحۡمَةٞ لِّقَوۡمٖ يُؤۡمِنُونَ",
        "phonetic": "7.203 Wa 'Idhā Lam Ta'tihim Bi'āyatin Qālū Lawlā Ajtabaytahā Qul 'Innamā 'Attabi`u Mā Yūĥá 'Ilayya Min Rabbī Hādhā Başā'iru Min Rabbikum Wa Hudáan Wa Raĥmatun Liqawmin Yu'uminūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:203): Narrated Anas رضي الله عنه that the Makkan people (Quraish-pagans) requested Allâh’s Messenger صلى الله عليه وسلم to show them a miracle, and so he showed them the splitting of the moon. (Sahih Al-Bukhâri, Vol.4. hadîth No.831).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when you, [O Muḥammad], do not bring them a sign [i.e., miracle], they say, \"Why have you not contrived it?\" Say, \"I only follow what is revealed to me from my Lord. This [Qur’ān] is enlightenment from your Lord and guidance and mercy for a people who believe.\"",
            "english_hilali_khan": "And if you do not bring them a miracle [according to their (i.e. Quraish-pagans’) proposal], they say: \"Why have you not brought it?\"[1] Say: \"I but follow what is revealed to me from my Lord. This (the Qur’ân) is nothing but evidence from your Lord, and a guidance and a mercy for a people who believe.\"",
            "english_rwwad": "When you do not bring them a sign, they say, “Why do you not improvise one?” Say, “I only follow what is revealed to me from my Lord. This [Qur’an] is an insight from your Lord, and a guidance and mercy for people who believe.”"
        }
    },
    {
        "id": 1157,
        "chapter": 7,
        "verse": 204,
        "arabic_text": "وَإِذَا قُرِئَ ٱلۡقُرۡءَانُ فَٱسۡتَمِعُواْ لَهُۥ وَأَنصِتُواْ لَعَلَّكُمۡ تُرۡحَمُونَ",
        "phonetic": "7.204 Wa 'Idhā Quri'a Al-Qur'ānu Fāstami`ū Lahu Wa 'Anşitū La`allakum Turĥamūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So when the Qur’ān is recited, then listen to it and pay attention that you may receive mercy.",
            "english_hilali_khan": "So, when the Qur’ân is recited, listen to it, and be silent that you may receive mercy. [i.e. during the compulsory congregational prayers when the Imâm (of a mosque) is leading the prayer (except Sûrat Al-Fâtihah), and also when he is delivering the Friday-prayer Khutbah]. (Tafsir At-Tabari).",
            "english_rwwad": "When the Qur’an is recited, listen to it attentively and maintain silence, so that you may receive mercy."
        }
    },
    {
        "id": 1158,
        "chapter": 7,
        "verse": 205,
        "arabic_text": "وَٱذۡكُر رَّبَّكَ فِي نَفۡسِكَ تَضَرُّعٗا وَخِيفَةٗ وَدُونَ ٱلۡجَهۡرِ مِنَ ٱلۡقَوۡلِ بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ وَلَا تَكُن مِّنَ ٱلۡغَٰفِلِينَ",
        "phonetic": "7.205 Wa Adhkur Rabbaka Fī Nafsika Tađarru`āan Wa Khīfatan Wa Dūna Al-Jahri Mina Al-Qawli Bil-Ghudūwi Wa Al-'Āşāli Wa Lā Takun Mina Al-Ghāfilīna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.7:205): See the footnote of (V.13:28).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And remember your Lord within yourself in humility and in fear without being apparent in speech - in the mornings and the evenings. And do not be among the heedless.",
            "english_hilali_khan": "And remember your Lord within yourself, humbly and with fear and without loudness in words in the mornings, and in the afternoons and be not of those who are neglectful.[2]",
            "english_rwwad": "And remember your Lord within yourself with humility and fear, without raising your voice, in the morning and evening, and do not be of those who are heedless."
        }
    },
    {
        "id": 1159,
        "chapter": 7,
        "verse": 206,
        "arabic_text": "إِنَّ ٱلَّذِينَ عِندَ رَبِّكَ لَا يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِهِۦ وَيُسَبِّحُونَهُۥ وَلَهُۥ يَسۡجُدُونَۤ۩",
        "phonetic": "7.206 'Inna Al-Ladhīna `Inda Rabbika Lā Yastakbirūna `An `Ibādatihi Wa Yusabbiĥūnahu Wa Lahu Yasjudūna",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Indeed, those who are near your Lord [i.e., the angels] are not prevented by arrogance from His worship, and they exalt Him, and to Him they prostrate.",
            "english_hilali_khan": "Surely, those who are with your Lord (angels) are never too proud to perform acts of worship to Him, but they glorify His Praise and prostrate themselves before Him.",
            "english_rwwad": "Indeed, those [angels] who are near to your Lord do not disdain to worship Him; they glorify Him, and to Him they prostrate."
        }
    }
]