[
    {
        "id": 5447,
        "chapter": 72,
        "verse": 1,
        "arabic_text": "قُلۡ أُوحِيَ إِلَيَّ أَنَّهُ ٱسۡتَمَعَ نَفَرٞ مِّنَ ٱلۡجِنِّ فَقَالُوٓاْ إِنَّا سَمِعۡنَا قُرۡءَانًا عَجَبٗا",
        "phonetic": "72.1 Qul 'Ūĥiya 'Ilayya 'Annahu Astama`a Nafarun Mina Al-Jinni Faqālū 'Innā Sami`nā Qur'ānāan `Ajabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.72:1) Jinn: A creation, created by Allâh from fire like human beings from mud, and angels from light.",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur’ān [i.e., recitation].",
            "english_hilali_khan": "1. Say (O Muhammad صلى الله عليه وسلم): \"It has been revealed to me that a group (from three to ten in number) of jinn[1] listened (to this Qur’ân). They said: ‘Verily, we have heard a wonderful Recitation (this Qur’ân)!",
            "english_rwwad": "Say, “It has been revealed to me that a group of jinn listened [to the Qur’an,] and they said, ‘Indeed, we have heard a wondrous recitation"
        }
    },
    {
        "id": 5448,
        "chapter": 72,
        "verse": 2,
        "arabic_text": "يَهۡدِيٓ إِلَى ٱلرُّشۡدِ فَـَٔامَنَّا بِهِۦۖ وَلَن نُّشۡرِكَ بِرَبِّنَآ أَحَدٗا",
        "phonetic": "72.2 Yahdī 'Ilá Ar-Rushdi Fa'āmannā Bihi Wa Lan Nushrika Birabbinā 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone.",
            "english_hilali_khan": "‘It guides to the Right Path, and we have believed therein, and we shall never join (in worship) anything with our Lord (Allâh).",
            "english_rwwad": "that guides to the right way, so we have believed in it, and we will never associate anyone with our Lord."
        }
    },
    {
        "id": 5449,
        "chapter": 72,
        "verse": 3,
        "arabic_text": "وَأَنَّهُۥ تَعَٰلَىٰ جَدُّ رَبِّنَا مَا ٱتَّخَذَ صَٰحِبَةٗ وَلَا وَلَدٗا",
        "phonetic": "72.3 Wa 'Annahu Ta`ālá Jaddu Rabbinā Mā Attakhadha Şāĥibatan Wa Lā Waladāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.72:3)\nA) See the footnote of (V.2:116) and (V.6:101).\nB) See the footnote (C) of (V.68:42).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son",
            "english_hilali_khan": "‘And He, exalted be the Majesty of our Lord, has taken neither a wife nor a son (or offspring or children).[2]",
            "english_rwwad": "And that He – our exalted and glorified Lord – has neither taken a wife nor a child;"
        }
    },
    {
        "id": 5450,
        "chapter": 72,
        "verse": 4,
        "arabic_text": "وَأَنَّهُۥ كَانَ يَقُولُ سَفِيهُنَا عَلَى ٱللَّهِ شَطَطٗا",
        "phonetic": "72.4 Wa 'Annahu Kāna Yaqūlu Safīhunā `Alá Allāhi Shaţaţāan",
        "footnotes": {
            "english_saheeh": "[1766]- A plural form may also be understood, i.e., \"the foolish ones among us.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And that our foolish one [i.e., Iblees][1766] has been saying about Allāh an excessive transgression.",
            "english_hilali_khan": "‘And that the foolish among us [i.e. Iblîs (Satan) or the polytheists amongst the jinn] used to utter against Allâh that which was an enormity in falsehood.",
            "english_rwwad": "and that the fool among us [Satan] used to say outrageous things about Allah,"
        }
    },
    {
        "id": 5451,
        "chapter": 72,
        "verse": 5,
        "arabic_text": "وَأَنَّا ظَنَنَّآ أَن لَّن تَقُولَ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَى ٱللَّهِ كَذِبٗا",
        "phonetic": "72.5 Wa 'Annā Žanannā 'An Lan Taqūla Al-'Insu Wa Al-Jinnu `Alá Allāhi Kadhibāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And we had thought that mankind and the jinn would never speak about Allāh a lie.",
            "english_hilali_khan": "‘And verily, we thought that men and jinn would not utter a lie against Allâh.",
            "english_rwwad": "although we thought that humans and jinn would never tell lies about Allah."
        }
    },
    {
        "id": 5452,
        "chapter": 72,
        "verse": 6,
        "arabic_text": "وَأَنَّهُۥ كَانَ رِجَالٞ مِّنَ ٱلۡإِنسِ يَعُوذُونَ بِرِجَالٖ مِّنَ ٱلۡجِنِّ فَزَادُوهُمۡ رَهَقٗا",
        "phonetic": "72.6 Wa 'Annahu Kāna Rijālun Mina Al-'Insi Ya`ūdhūna Birijālin Mina Al-Jinni Fazādūhum Rahaqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden [i.e., sin].",
            "english_hilali_khan": "‘And verily, there were men among mankind who took shelter with the males among the jinn, but they (jinn) increased them (mankind) in sin and transgression.",
            "english_rwwad": "And there were some men who used to seek refuge with some jinn, but they only increased them in burden."
        }
    },
    {
        "id": 5453,
        "chapter": 72,
        "verse": 7,
        "arabic_text": "وَأَنَّهُمۡ ظَنُّواْ كَمَا ظَنَنتُمۡ أَن لَّن يَبۡعَثَ ٱللَّهُ أَحَدٗا",
        "phonetic": "72.7 Wa 'Annahum Žannū Kamā Žanantum 'An Lan Yab`atha Allāhu 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And they had thought, as you thought, that Allāh would never send anyone [as a messenger].",
            "english_hilali_khan": "‘And they thought as you thought, that Allâh will not send any Messenger (to mankind or jinn).",
            "english_rwwad": "They thought, just like you [jinn] thought that Allah would never send any messenger."
        }
    },
    {
        "id": 5454,
        "chapter": 72,
        "verse": 8,
        "arabic_text": "وَأَنَّا لَمَسۡنَا ٱلسَّمَآءَ فَوَجَدۡنَٰهَا مُلِئَتۡ حَرَسٗا شَدِيدٗا وَشُهُبٗا",
        "phonetic": "72.8 Wa 'Annā Lamasnā As-Samā'a Fawajadnāhā Muli'at Ĥarasāan Shadīdāan Wa Shuhubāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames.",
            "english_hilali_khan": "‘And we have sought to reach the heaven; but found it filled with stern guards and flaming fires.",
            "english_rwwad": "We have sought to reach the heaven but found it filled with stern guards and flaming fire."
        }
    },
    {
        "id": 5455,
        "chapter": 72,
        "verse": 9,
        "arabic_text": "وَأَنَّا كُنَّا نَقۡعُدُ مِنۡهَا مَقَٰعِدَ لِلسَّمۡعِۖ فَمَن يَسۡتَمِعِ ٱلۡأٓنَ يَجِدۡ لَهُۥ شِهَابٗا رَّصَدٗا",
        "phonetic": "72.9 Wa 'Annā Kunnā Naq`udu Minhā Maqā`ida Lilssam`i Faman Yastami`i Al-'Āna Yajid Lahu Shihābāan Raşadāan",
        "footnotes": {
            "english_saheeh": "[1767]- Before the prophethood of Muḥammad (ﷺ) the jinn used to collect information by eavesdropping on the angels and then pass it on to fortunetellers and soothsayers.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And we used to sit therein in positions for hearing,[1767] but whoever listens now will find a burning flame lying in wait for him.",
            "english_hilali_khan": "‘And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.",
            "english_rwwad": "We used to take up positions there for eavesdropping, but now anyone who eavesdrops will find a flaming fire waiting for him."
        }
    },
    {
        "id": 5456,
        "chapter": 72,
        "verse": 10,
        "arabic_text": "وَأَنَّا لَا نَدۡرِيٓ أَشَرٌّ أُرِيدَ بِمَن فِي ٱلۡأَرۡضِ أَمۡ أَرَادَ بِهِمۡ رَبُّهُمۡ رَشَدٗا",
        "phonetic": "72.10 Wa 'Annā Lā Nadrī 'Asharrun 'Urīda Biman Fī Al-'Arđi 'Am 'Arāda Bihim Rabbuhum Rashadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.",
            "english_hilali_khan": "‘And we know not whether evil is intended for those on earth, or whether their Lord intends for them a Right Path.",
            "english_rwwad": "We do not know whether evil is intended for those on earth, or their Lord intends good for them."
        }
    },
    {
        "id": 5457,
        "chapter": 72,
        "verse": 11,
        "arabic_text": "وَأَنَّا مِنَّا ٱلصَّٰلِحُونَ وَمِنَّا دُونَ ذَٰلِكَۖ كُنَّا طَرَآئِقَ قِدَدٗا",
        "phonetic": "72.11 Wa 'Annā Minnā Aş-Şāliĥūna Wa Minnā Dūna Dhālika Kunnā Ţarā'iqa Qidadāan",
        "footnotes": {
            "english_saheeh": "[1768]- In opinion, belief and religious practice.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among us are the righteous, and among us are [others] not so; we were [of] divided ways.[1768]",
            "english_hilali_khan": "‘There are among us some that are righteous, and some the contrary; we are groups having different ways (religious sects).",
            "english_rwwad": "Among us are some who are righteous and some who are otherwise, for we follow divergent ways."
        }
    },
    {
        "id": 5458,
        "chapter": 72,
        "verse": 12,
        "arabic_text": "وَأَنَّا ظَنَنَّآ أَن لَّن نُّعۡجِزَ ٱللَّهَ فِي ٱلۡأَرۡضِ وَلَن نُّعۡجِزَهُۥ هَرَبٗا",
        "phonetic": "72.12 Wa 'Annā Žanannā 'An Lan Nu`jiza Allāha Fī Al-'Arđi Wa Lan Nu`jizahu Harabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And we have become certain that we will never cause failure to Allāh upon earth, nor can we escape Him by flight.",
            "english_hilali_khan": "‘And we think that we cannot escape (the punishment of) Allâh in the earth, nor can we escape Him by flight.",
            "english_rwwad": "We have realized that we can never escape Allah on earth, nor can we ever escape Him by fleeing."
        }
    },
    {
        "id": 5459,
        "chapter": 72,
        "verse": 13,
        "arabic_text": "وَأَنَّا لَمَّا سَمِعۡنَا ٱلۡهُدَىٰٓ ءَامَنَّا بِهِۦۖ فَمَن يُؤۡمِنۢ بِرَبِّهِۦ فَلَا يَخَافُ بَخۡسٗا وَلَا رَهَقٗا",
        "phonetic": "72.13 Wa 'Annā Lammā Sami`nā Al-Hudá 'Āmannā Bihi Faman Yu'umin Birabbihi Falā Yakhāfu Bakhsāan Wa Lā Rahaqāan",
        "footnotes": {
            "english_saheeh": "[1769]- In regard to his account in the Hereafter.  Nothing of his good will be diminished, nor will the evil of another be placed upon him.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And when we heard the guidance [i.e., the Qur’ān], we believed in it. And whoever believes in his Lord will not fear deprivation or burden.[1769]",
            "english_hilali_khan": "‘And indeed when we heard the Guidance (this Qur’ân), we believed therein (Islâmic Monotheism), and whosoever believes in his Lord shall have no fear, either of a decrease in the reward of his good deeds or an increase in the punishment for his sins.",
            "english_rwwad": "When we heard the guidance [of the Qur’an], we believed in it. Whoever believes in his Lord will have no fear of curtailment [from his reward] or injustice."
        }
    },
    {
        "id": 5460,
        "chapter": 72,
        "verse": 14,
        "arabic_text": "وَأَنَّا مِنَّا ٱلۡمُسۡلِمُونَ وَمِنَّا ٱلۡقَٰسِطُونَۖ فَمَنۡ أَسۡلَمَ فَأُوْلَٰٓئِكَ تَحَرَّوۡاْ رَشَدٗا",
        "phonetic": "72.14 Wa 'Annā Minnā Al-Muslimūna Wa Minnā Al-Qāsiţūna Faman 'Aslama Fa'ūlā'ika Taĥarraw Rashadāan",
        "footnotes": {
            "english_saheeh": "[1770]- i.e., those who deviate from the truth and act tyrannically.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And among us are Muslims [in submission to Allāh], and among us are the unjust.[1770] And whoever has become Muslim - those have sought out the right course.",
            "english_hilali_khan": "‘And of us some are Muslims (who have submitted to Allâh, after listening to this Qur’ân), and of us some are Al-Qâsitûn (disbelievers - those who have deviated from the Right Path)’. And whosoever has embraced Islâm (i.e. has become a Muslim by submitting to Allâh), then such have sought the Right Path.\"",
            "english_rwwad": "Among us are some who are Muslims and some who are deviant. Those who accepted Islam have sought the true guidance,"
        }
    },
    {
        "id": 5461,
        "chapter": 72,
        "verse": 15,
        "arabic_text": "وَأَمَّا ٱلۡقَٰسِطُونَ فَكَانُواْ لِجَهَنَّمَ حَطَبٗا",
        "phonetic": "72.15 Wa 'Ammā Al-Qāsiţūna Fakānū Lijahannama Ĥaţabāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But as for the unjust, they will be, for Hell, firewood.'",
            "english_hilali_khan": "And as for the Qâsitûn (disbelievers who deviated from the Right Path), they shall be firewood for Hell,",
            "english_rwwad": "but those who are deviant, they will be fuel for Hell.’”"
        }
    },
    {
        "id": 5462,
        "chapter": 72,
        "verse": 16,
        "arabic_text": "وَأَلَّوِ ٱسۡتَقَٰمُواْ عَلَى ٱلطَّرِيقَةِ لَأَسۡقَيۡنَٰهُم مَّآءً غَدَقٗا",
        "phonetic": "72.16 Wa 'Allawi Astaqāmū `Alá Aţ-Ţarīqati L'asqaynāhum Mā'an Ghadaqāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [Allāh revealed] that if they had remained straight on the way, We would have given them abundant rain [i.e., provision].",
            "english_hilali_khan": "If they (non-Muslims) had believed in Allâh, and went on the Right Way (i.e. Islâm) We would surely have bestowed on them water (rain) in abundance.",
            "english_rwwad": "“If they had remained steadfast on the right way, We would have given them abundant rain,"
        }
    },
    {
        "id": 5463,
        "chapter": 72,
        "verse": 17,
        "arabic_text": "لِّنَفۡتِنَهُمۡ فِيهِۚ وَمَن يُعۡرِضۡ عَن ذِكۡرِ رَبِّهِۦ يَسۡلُكۡهُ عَذَابٗا صَعَدٗا",
        "phonetic": "72.17 Linaftinahum Fīhi Wa Man Yu`riđ `An Dhikri Rabbihi Yasluk/hu `Adhābāan Şa`adāan",
        "footnotes": {
            "english_saheeh": "[1771]- i.e., refuses obedience to Him.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "So We might test them therein. And whoever turns away from the remembrance of his Lord[1771] He will put into arduous punishment.",
            "english_hilali_khan": "That We might try them thereby. And whosoever turns away from the Reminder of his Lord (i.e. this Qur’ân, - and practise not its laws and orders), He will cause him to enter in a severe torment (i.e. Hell).",
            "english_rwwad": "as a test for them. But whoever turns away from the remembrance of his Lord, He will make him suffer an arduous punishment."
        }
    },
    {
        "id": 5464,
        "chapter": 72,
        "verse": 18,
        "arabic_text": "وَأَنَّ ٱلۡمَسَٰجِدَ لِلَّهِ فَلَا تَدۡعُواْ مَعَ ٱللَّهِ أَحَدٗا",
        "phonetic": "72.18 Wa 'Anna Al-Masājida Lillāhi Falā Tad`ū Ma`a Allāhi 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "[1772]- The term \"masjid\" here includes every place of worship or the earth in general.\n[1773]- Or \"worship.\"",
            "english_hilali_khan": "(V.72:18) See the footnote of (V.2:165).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And [He revealed] that the masjids[1772] are for Allāh, so do not invoke[1773] with Allāh anyone.",
            "english_hilali_khan": "And the mosques are for Allâh (Alone): so invoke not anyone along with Allâh.[1]",
            "english_rwwad": "The mosques are for Allah alone, so do not supplicate anyone along with Allah."
        }
    },
    {
        "id": 5465,
        "chapter": 72,
        "verse": 19,
        "arabic_text": "وَأَنَّهُۥ لَمَّا قَامَ عَبۡدُ ٱللَّهِ يَدۡعُوهُ كَادُواْ يَكُونُونَ عَلَيۡهِ لِبَدٗا",
        "phonetic": "72.19 Wa 'Annahu Lammā Qāma `Abdu Allāhi Yad`ūhu Kādū Yakūnūna `Alayhi Libadāan",
        "footnotes": {
            "english_saheeh": "[1774]- Crowding on top of each other in the manner of locusts in order to hear him (ﷺ).  \"They\" may refer to the jinn or to the disbelievers among the Arabs.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "And that when the Servant [i.e., Prophet] of Allāh stood up supplicating Him, they almost became about him a compacted mass.\"[1774]",
            "english_hilali_khan": "And when the slave of Allâh (Muhammad صلى الله عليه وسلم) stood up invoking Him (his Lord - Allâh) in prayer they (the jinn) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet’s recitation).",
            "english_rwwad": "Yet when the slave of Allah stood up supplicating Him, they swarmed around him.”"
        }
    },
    {
        "id": 5466,
        "chapter": 72,
        "verse": 20,
        "arabic_text": "قُلۡ إِنَّمَآ أَدۡعُواْ رَبِّي وَلَآ أُشۡرِكُ بِهِۦٓ أَحَدٗا",
        "phonetic": "72.20 Qul 'Innamā 'Ad`ū Rabbī Wa Lā 'Ushriku Bihi 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, [O Muḥammad], \"I only invoke my Lord and do not associate with Him anyone.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I invoke only my Lord (Allâh Alone), and I associate none as partners along with Him.\"",
            "english_rwwad": "Say [O Prophet], “I only supplicate my Lord and I do not associate anyone with Him.”"
        }
    },
    {
        "id": 5467,
        "chapter": 72,
        "verse": 21,
        "arabic_text": "قُلۡ إِنِّي لَآ أَمۡلِكُ لَكُمۡ ضَرّٗا وَلَا رَشَدٗا",
        "phonetic": "72.21 Qul 'Innī Lā 'Amliku Lakum Đarrāan Wa Lā Rashadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, I do not possess for you [the power of] harm or right direction.\"",
            "english_hilali_khan": "Say: \"It is not in my power to cause you harm, or to bring you to the Right Path.\"",
            "english_rwwad": "Say, “I have no power to harm or benefit you.”"
        }
    },
    {
        "id": 5468,
        "chapter": 72,
        "verse": 22,
        "arabic_text": "قُلۡ إِنِّي لَن يُجِيرَنِي مِنَ ٱللَّهِ أَحَدٞ وَلَنۡ أَجِدَ مِن دُونِهِۦ مُلۡتَحَدًا",
        "phonetic": "72.22 Qul 'Innī Lan Yujīranī Mina Allāhi 'Aĥadun Wa Lan 'Ajida Min Dūnihi Multaĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"Indeed, there will never protect me from Allāh anyone [if I should disobey], nor will I find in other than Him a refuge.",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"None can protect me from Allâh’s punishment (if I were to disobey Him), nor can I find refuge except in Him.",
            "english_rwwad": "Say, “None can ever protect me from Allah [if I should disobey Him], nor can I ever find a refuge other than Him."
        }
    },
    {
        "id": 5469,
        "chapter": 72,
        "verse": 23,
        "arabic_text": "إِلَّا بَلَٰغٗا مِّنَ ٱللَّهِ وَرِسَٰلَٰتِهِۦۚ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَإِنَّ لَهُۥ نَارَ جَهَنَّمَ خَٰلِدِينَ فِيهَآ أَبَدًا",
        "phonetic": "72.23 'Illā Balāghāan Mina Allāhi Wa Risālātihi Wa Man Ya`şi Allāha Wa Rasūlahu Fa'inna Lahu Nāra Jahannama Khālidīna Fīhā 'Abadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "(V.72:23) See the footnote of (V.3:85).",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "But [I have for you] only notification from Allāh, and His messages.\" And whoever disobeys Allāh and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever.",
            "english_hilali_khan": "\"(Mine is) but conveyance (of the truth) from Allâh and His Messages (of Islâmic Monotheism), and whosoever disobeys Allâh and His Messenger, then Verily, for him is the Fire of Hell, he shall dwell therein forever.\"[2]",
            "english_rwwad": "I only convey what I receive from Allah and His messages.” And whoever disobeys Allah and His Messenger will certainly be in the Fire of Hell, abiding therein forever."
        }
    },
    {
        "id": 5470,
        "chapter": 72,
        "verse": 24,
        "arabic_text": "حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ فَسَيَعۡلَمُونَ مَنۡ أَضۡعَفُ نَاصِرٗا وَأَقَلُّ عَدَدٗا",
        "phonetic": "72.24 Ĥattá 'Idhā Ra'aw Mā Yū`adūna Fasaya`lamūna Man 'Ađ`afu Nāşirāan Wa 'Aqallu `Adadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[The disbelievers continue] until, when they see that which they are promised, then they will know who is weaker in helpers and less in number.",
            "english_hilali_khan": "Till, when they see that which they are promised, then they will know who it is that is weaker concerning helpers and less important concerning numbers.",
            "english_rwwad": "Until when they see what they were promised, they will realize who is weaker in helpers and fewer in number."
        }
    },
    {
        "id": 5471,
        "chapter": 72,
        "verse": 25,
        "arabic_text": "قُلۡ إِنۡ أَدۡرِيٓ أَقَرِيبٞ مَّا تُوعَدُونَ أَمۡ يَجۡعَلُ لَهُۥ رَبِّيٓ أَمَدًا",
        "phonetic": "72.25 Qul 'In 'Adrī 'Aqarībun Mā Tū`adūna 'Am Yaj`alu Lahu Rabbī 'Amadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Say, \"I do not know if what you are promised is near or if my Lord will grant for it a [long] period.\"",
            "english_hilali_khan": "Say (O Muhammad صلى الله عليه وسلم): \"I know not whether (the punishment) which you are promised is near or whether my Lord will appoint for it a distant term.",
            "english_rwwad": "Say, “I do not know if what you are promised is near or my Lord has appointed a distant time for it."
        }
    },
    {
        "id": 5472,
        "chapter": 72,
        "verse": 26,
        "arabic_text": "عَٰلِمُ ٱلۡغَيۡبِ فَلَا يُظۡهِرُ عَلَىٰ غَيۡبِهِۦٓ أَحَدًا",
        "phonetic": "72.26 `Ālimu Al-Ghaybi Falā Yužhiru `Alá Ghaybihi 'Aĥadāan",
        "footnotes": {
            "english_saheeh": "",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone",
            "english_hilali_khan": "\"(He Alone is) the All-Knower of the Ghaib (Unseen), and He reveals to none His Ghaib (Unseen).\"",
            "english_rwwad": "[He is] Knower of the unseen, He does not reveal His unseen to anyone,"
        }
    },
    {
        "id": 5473,
        "chapter": 72,
        "verse": 27,
        "arabic_text": "إِلَّا مَنِ ٱرۡتَضَىٰ مِن رَّسُولٖ فَإِنَّهُۥ يَسۡلُكُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ رَصَدٗا",
        "phonetic": "72.27 'Illā Mani Artađá Min Rasūlin Fa'innahu Yasluku Min Bayni Yadayhi Wa Min Khalfihi Raşadāan",
        "footnotes": {
            "english_saheeh": "[1775]- Guardian angels to protect the messenger and the message.",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "Except whom He has approved of messengers, and indeed, He sends before him [i.e., each messenger] and behind him observers[1775]",
            "english_hilali_khan": "Except to a Messenger (from mankind) whom He has chosen (He informs him of unseen as much as He likes), and then He makes a band of watching guards (angels) to march before him and behind him.",
            "english_rwwad": "except the messenger whom He chooses, then He appoints angel-guards before him and behind him"
        }
    },
    {
        "id": 5474,
        "chapter": 72,
        "verse": 28,
        "arabic_text": "لِّيَعۡلَمَ أَن قَدۡ أَبۡلَغُواْ رِسَٰلَٰتِ رَبِّهِمۡ وَأَحَاطَ بِمَا لَدَيۡهِمۡ وَأَحۡصَىٰ كُلَّ شَيۡءٍ عَدَدَۢا",
        "phonetic": "72.28 Liya`lama 'An Qad 'Ablaghū Risālāti Rabbihim Wa 'Aĥāţa Bimā Ladayhim Wa 'Aĥşá Kulla Shay'in `Adadāan",
        "footnotes": {
            "english_saheeh": "[1776]- This phrase may also be read:  \"So He [i.e., Allāh] may make evident.\"",
            "english_hilali_khan": "",
            "english_rwwad": ""
        },
        "translations": {
            "english_saheeh": "That he [i.e., Muḥammad (ﷺ)] may know[1776] that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number.",
            "english_hilali_khan": "[He (Allâh) protects them (the Messengers)], till He sees that they (the Messengers) have conveyed the Messages of their Lord (Allâh). And He (Allâh) surrounds all that which is with them, and He (Allâh) keeps count of all things (i.e. He knows the exact number of everything).",
            "english_rwwad": "to ensure that the messengers fully conveyed the messages of their Lord. He encompasses in His knowledge all about them, and keeps count of all things.”"
        }
    }
]